{
    "Autor": "ALINE DE BRITTOS VALDATI",
    "Título": "USO DA PLATAFORMA MOODLE, AMBIENTE VIRTUAL DE APRENDIZAGEM, PARA FOMENTAR A EDUCAÇÃO FINANCEIRA NO ENSINO FUNDAMENTAL DA REDE PÚBLICA",
    "Ano de publicação": 2013,
    "Local de publicação": "ARARANGUÁ - SC",
    "Orientador(a)": "Professora Simone Miester Sommer Biléssimo",
    "Coorientador(a)": "",
    "Resumo": "Atualmente, o avanço da tecnologia tem proporcionado mudanças sociais e econômicas, que influenciam diretamente na vida das pessoas. O mercado financeiro também mudou e está cada vez mais sofisticado e complexo, dessa forma faz-se necessário um entendimento maior a cerca desse assunto. Portanto, o objetivo desse trabalho foi o utilizar a plataforma Moodle, para fomentar a Educação Financeira no Ensino Fundamental da rede pública da microrregião de Araranguá. Para tanto, realizou-se uma pesquisa aplicada, a qual utilizou como procedimentos técnicos a pesquisa bibliográfica e entrevista com os envolvidos. Na pesquisa bibliográfica foram pesquisados temas referentes a Educação Financeira, Tecnologia da Informação e Comunicação, Ambientes Virtuais de Aprendizagem, Moodle, Gestão e Compartilhamento do Conhecimento. Como projeto piloto, foram selecionadas duas turmas do 5º ano do ensino fundamental em escolas distintas da rede pública no sul de Santa Catarina. Dessa maneira, o projeto abrangeu no total de 45 discentes e 2 docentes. Foram realizados 3 encontros com duração de 1 hora e 30 minutos cada, em ambas as escolas, no final de novembro e início de dezembro de 2012. Para esses encontros utilizou-se o curso elaborado dentro da plataforma Moodle para apoio às aulas. Como principais resultados obteve-se a efetiva participação dos envolvidos, avaliação qualitativa realizada pelos usuários positiva, além de constatar-se que é possível a aplicação do projeto nas escolas públicas tomando-se como base a estrutura por elas apresentadas.",
    "Palavras-chave": "Educação Financeira. Tecnologia da Informação e Comunicação. Moodle.",
    "Introdução": "No mundo globalizado, os avanços tecnológicos têm proporcionado mudanças sociais e econômicas, que influenciam diretamente a vida das pessoas. A cada dia que passa novos produtos são criados e inseridos no mercado, que, com a ajuda das mídias, fazem o apelo imediatista ao consumo. Dentro dessa perspectiva, o mercado financeiro também está cada vez mais sofisticado e com inúmeras facilidades, de crédito, de compra online, de financiamentos, dentre outros. Tem-se assim o aumento do consumo e, por consequência, a falta de uma cultura de educação financeira, crescendo assim o número de pessoas endividadas e com dificuldades em controlar suas finanças. Preocupada com essa situação, a Organização para a Cooperação e Desenvolvimento Econômico (OCDE) tem desenvolvido pesquisas e ferramentas para ajudar a concepção e implantação de estratégias internacionais para a Educação Financeira. A OCDE é um órgão internacional e intergovernamental, engajada em desenvolver políticas que melhorem o desenvolvimento econômico e bem estar das pessoas em todo o mundo (OCDE, 2012). O Brasil participa do programa de enhanced engagement (engajamento aplicado), pois não é membro efetivo, mas tem autorização para participar de Comitês de Organização. Apoiado e incentivado pela OCDE, o governo federal começou um plano de ação para instituir uma politica pública para a “Educação Financeira” da população do país. Ela vem sendo trabalhada desde 2007, uma das ações foi a realização de uma pesquisa nacional sobre Educação Financeira e um inventário nacional de ações públicas e privadas sobre o tema. Em vinte dois (22) de dezembro de dois mil e dez (2010), através do decreto Nº 7.397, foi enfim instituída a Estratégia Nacional de Educação Financeira (ENEF). A estratégia tem como finalidade promover a educação financeira e previdenciária, além de contribuir para o fortalecimento da cidadania, a eficiência e solidez do sistema financeiro nacional e a tomada de decisões conscientes por parte dos consumidores (BRASIL, 2010). A ENEF possui duas propostas de atuação, educação financeira nas escolas e educação financeira para adultos. Em relação à atuação no contexto escolar, foi executado um projeto piloto em escolas públicas entre agosto de 2010 e dezembro de 2011. A estratégia pretende atingir todas as escolas públicas do Brasil e incluir a Educação Financeira na grade curricular das escolas de maneira multidisciplinar. Desta forma, o governo apoiará e incentivará iniciativas que promovam a Educação Financeira, que condizem com as orientações definidas na ENEF (CONEF, 2012).",
    "Conclusão": "O objetivo deste trabalho foi fomentar a Educação Financeira nas escolas públicas no ensino fundamental com o apoio da plataforma Moodle. A análise da revisão bibliográfica para dar fundamentação ao trabalho proporcionou o conhecimento sobre a Educação Financeira. Com isso pode ser observado a crescente importância dada a ela nos últimos anos. Destaca-se o incentivo do governo para iniciativas com fins não lucrativos e a Criação da Estratégia Nacional de Educação Financeira – ENEF. Tal conhecimento foi necessário para entender a sua importância e nortear a busca de material para a preparação do curso dentro do Moodle. Na revisão bibliográfica também se buscou entender a inserção das TIC’s no ensino de um modo geral. Identificou-se que quanto mais inicial é a série, há menos indicadores de que a tecnologia é utilizada. Pode ser verificada também com a revisão teórica, a relevância do compartilhamento do conhecimento entre as instituições de ensino, pois são locais onde se gera muito conhecimento, que poderia estar sendo compartilhado e aumentado entre as instituições. Outro ponto importante que se buscou na revisão bibliográfica foi o conhecimento do Ambiente Virtual de Aprendizagem Moodle. Os conhecimentos adquiridos através dessa fundamentação teórica foram importantes para ampliar o entendimento da ferramenta que foi utilizada para fomentar a Educação Financeira e, dessa maneira, possibilitar a construção do curso sobre o tema na plataforma Moodle. A fim de conhecer o perfil dos usuários do curso, que é formado de docentes e discentes, foi aplicada uma pesquisa. Com base na análise desta, constatou-se que os alunos das duas instituições, apesar de realidades diferentes, possuem perfis parecidos. Os alunos da Escola Municipal de Educação Básica Albino Zanatta de Jacinto Machado são principalmente da zona rural do município. A maioria possui computador em casa, mas a metade não possui internet. O que demonstra que para cidades onde grande parte da sua população não se encontra na zona urbana, o acesso à internet é ainda mais difícil. Na Escola Estadual de Educação Básica Professora Maria Garcia Pessi, situada em Araranguá, os discentes que formam a turma são todos da zona urbana, vindo das proximidades das escolas e de bairros próximos. A maioria possui computador e cerca de 65% destes que responderam à pesquisa disseram possuir computador com internet em casa. Com a análise das atividades que os alunos mais desempenham no computador ficou claro que sua utilização de modo geral é mais voltada ao entretenimento. Analisando-se, separadamente, nota-se que os alunos da Escola Profª Maria Garcia Pessi usam o computador de maneira mais nivelada. Em uma escala que vai de 1 a 5, atividades com Jogos ficou com média 3,9, enquanto atividades referentes à pesquisa ficaram com 3,4 e estudos 3,0 e o uso de redes sociais 3,3. Os alunos da outra instituição mostraram uma maior tendência a usar o computador somente para fins de entretenimento, pois atividades relacionadas a jogos e redes sociais atingiram respectivamente 4.9 e 4 de média. Enquanto as atividades referentes a estudos atingiram somente 1.6 e pesquisas 2.6. Os perfis das docentes analisados eram diferentes, mas isso não interferiu na aplicação do projeto. Enquanto a docente da Escola Albino Zanatta possui 4 anos de docência, a da Escola Profª Maria Garcia Pessi possui 20 anos. A primeira afirma que utiliza o laboratório de informática e já trabalhou assuntos que se incluem na temática de Educação Financeira. Enquanto a outra não realizou atividades no laboratório de informática e nem relacionado à Educação Financeira. Um fato para isso é que a professora da escola Albino Zanatta é efetiva, enquanto a da escola Profª Maria Garcia Pessi é contratada o que impede que os docentes realizem atividades que envolvam conteúdos e/ou práticas que não estejam inclusos no cronograma curricular, principalmente pela alta rotatividade dos profissionais não efetivos. O projeto piloto foi aplicado nos dias 23, 29 de novembro e 03 de dezembro na Escola Albino Zanatta. E na Escola Profª Maria Garcia Pessi nos dias 23, 26 e 30 de novembro. O contato com as escolas foi um pouco dificultado pelo fato de ambas estarem no final do ano letivo. O que também dificultou encontrar professores que estivessem disponíveis a participar do projeto, inicialmente houve recusa de alguns. Uma vez agendados os horários com as professoras e escolas, e acertado o conteúdo a ser trabalhado, as aulas ocorreram de forma prática e tranquila de um modo geral. Os estudantes e os docentes mostraram grande interesse pelas atividades e o assunto tratado. Não houve nenhuma grande dificuldade em utilizar a ferramenta por parte dos alunos. Todos tiveram boa participação no horário das atividades ao levar em consideração que o número de computadores era inferior ao de alunos. Considerando o número de alunos que possuem internet em casa, houve uma quantia considerável de acessos ao ambiente fora dos dias e períodos de aula, porém a quantia de alunos que acessaram para resolver alguma atividade (exemplo: questionário), foi pequena, apenas 4 alunos responderam. O que demonstra que eles se interessaram mais em outras atividades mais lúdicas e se dedicaram ao conhecimento do próprio ambiente em sí. Todas as atividades no Moodle em sala de aula, de um modo geral foram executadas sem dificuldades, tanto referente ao conteúdo quanto aos aspectos técnicos de utilização do ambiente. Constatou-se que os alunos têm facilidade de assimilar conteúdo em um meio que lhes interessam e o tema despertou grande interesse nos educandos e permitiu a assimilação dos conteúdos com seu dia-a-dia e com os conteúdos das disciplinas. As dificuldades encontradas referentes à tecnologia foram em um primeiro momento na escola Albino Zanatta ao ter um encontro suspenso por falta de internet e pela má condição de algumas máquinas. Apesar de em menor quantidade, a má qualidade das máquinas na Escola Profª Maria Garcia Pessi também esteve presente. O projeto atingiu seu objetivo a partir do momento em que todas as avaliações feitas pelos usuários foram positivas e que a maioria gostaria que o projeto tivesse continuidade. Também pelo fato de utilizar o Moodle para tratar o tema de Educação Financeira de uma maneira interdisciplinar e não isolada, uma vez que houve a integração e o compartilhamento do conhecimento entre ambas as escolas, o que além de ter sido um fator a mais de motivação para os alunos, é o que está proposto pela ENEF. Portanto, apesar de alguns contratempos técnicos em ambas as escolas, e da constatação de que os laboratórios, ainda não atendem a demanda como deveriam tanto em nível de máquinas quanto a qualidade de internet, sua estrutura permitiu a realização do projeto, fazendo com que os alunos trabalhassem um assunto tão relevante atualmente. Utilizando os computadores, não somente como forma de entretenimento, mas como objeto de ensino-aprendizagem, proporcionando para ambos uma experiência nova, através da integração com outros alunos, promovendo o compartilhamento de conhecimento e trabalhar o tema Educação Financeira interdisciplinarmente."
}