{
    "Autor": [
        "Alisson de Villa Geronimo",
        "Matheus Medeiros Anacleto"
    ],
    "Título": "UM SISTEMA DE RECOMENDAÇÃO DE CONTEÚDO SUPORTADO PELA COMPUTAÇÃO DISTRIBUÍDA",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": "",
    "Resumo": "Desde a sua criação, a Internet e mais especificamente a Web, vem passando por grandes modificações. Atualmente, usuários possuem um papel fundamental, não somente consumindo informações, mas também provendo novos conteúdos. Este cenário e os avanços da Tecnologia da Informação tem promovido um aumento vertiginoso no volume de informações disponíveis. A partir disto surgem desafios, entre eles, como permitir que o usuário realize escolhas mais adequadas. Neste contexto, encontram-se os Sistemas de Recomendação com o intuito de auxiliar usuários na tomada de decisão, bem como, a Computação Distribuída como infraestrutura de base para lidar com grandes volumes de informação. A partir disto, o presente trabalho propõe um sistema voltado à recomendação de conteúdo textual através das abordagens de filtragem colaborativa e baseada em conteúdo. Visando permitir a avaliação da proposição deste trabalho foi elaborado um modelo de dados e desenvolvido um protótipo. O protótipo possibilita a geração de informações nas duas principais abordagens de recomendação. Possui ainda a capacidade de realizar o processamento de maneira distribuída. As informações processadas e geradas através da aplicação do protótipo permitem a sugestão de itens, em que no presente trabalho se referem a documentos. Pode-se afirmar que os resultados no que tange a sugestão de conteúdo são consistentes e compatíveis com a literatura da área de Sistemas de Recomendação. Ressalta-se ainda que o desenvolvimento de sistemas distribuídos contribui para área em questão visto que o desempenho frente a grande volumes de informação é fundamental para que se possa produzir insumos que auxiliem usuários em suas escolhas.",
    "Palavras-chave": [
        "Sistemas de Recomendação",
        "Computação Distribuída",
        "Filtragem Colaborativa",
        "Recomendação Baseada em Conteúdo"
    ],
    "Introdução": "Atualmente a Internet faz parte da sociedade e é vista como uma ferramenta utilizada por todas as classes sociais para as mais variadas finalidades. Em 2006, um bilhão de pessoas em todo o mundo já possuíam acesso à Internet e os dispositivos móveis superavam os computadores de mesa em uma proporção de dois para um (MUSSER; O’REILLY, 2007). Atrelado a Internet está o termo Web, criado por Tim Berners-Lee. A World Wide Web, ou apenas Web, como é popularmente conhecida, surgiu no CERN (Conseil Européen pour la Recherche Nucléaire). Em 1989, Tim Berners-Lee deparou-se com o problema de perda de informações que era ocasionado pela intensa rotatividade de integrantes do CERN. As informações não eram registradas em documentos e perdiam-se com a saída dos membros que as possuíam. Para melhorar a busca por informações, Tim Berners-Lee criou um sistema distribuído aplicando os conceitos de nodos e hipertexto e posteriormente em 1990, criou um servidor para seu computador com um navegador de interface gráfica marcando o início da World Wide Web. Inicialmente, a Web era composta apenas por páginas com imagens e textos estáticos. Esta primeira geração da Web ficou conhecida como Web 1.0. (BERNERS-LEE, 1989). Com o passar do tempo, a Web foi evoluindo e deixando de ser apenas um conjunto de páginas de textos estáticos. Em 2005, durante uma reunião em uma conferência, Tim O’Reilly apresentou o termo Web 2.0 que marcaria uma revolução na Internet (O’REILLY, 2005). Para Krotzfleisch et al. (2008) o termo Web 2.0 sugere um salto tecnológico, na medida em que é, de fato, usado para caracterizar uma nova configuração de tecnologias voltada à Internet. Em contraste com a Web 1.0, que se preocupava basicamente em como definir e criar destinos para os usuários da Internet, a Web 2.0 é sobre pessoas e conteúdo. Para Jannach et al. (2011), na Web 2.0 os usuários da Internet assumem gradativamente o papel de provedores de conteúdo. Esta característica pode ser observada através das ações dos usuários da Web de hoje, que de maneira ativa e voluntária publicam conteúdos em portais populares. Krotzfleisch et al. (2008) afirmam que a Web 2.0 capacitou o usuário a produzir conteúdo e a compartilhá-lo com qualquer habitante do mundo, tornando conhecidos mundialmente portais de informação que possuem esta finalidade como MySpace®, Wikipedia®, Youtube®, Facebook®. Em 1980 Alvin Toffler, identificou esta característica e criou um termo para classificar este tipo de usuário. Nascia então o conceito denominado prosumers, usuários que agregam características de produtores e consumidores de informação (TOFFLER, 1980). Conforme Voigt e Ernst (2010), a Web 2.0 também é uma realidade no cotidiano de muitas empresas dentre os mais variados tipos de negócios. De acordo com Musser e O’Reilly (2007), no primeiro trimestre de 2006, 280 mil novos usuários se inscreveram no MySpace® por dia, e o site obteve o segundo maior tráfego de dados na Internet. No segundo trimestre de 2006, foram criados 50 milhões de novos blogs adicionados a uma taxa de dois por segundo. Em 2005, o eBay® realizou cerca de 8 bilhões de transações. Segundo Hilbert e López (2011), em 1986 a capacidade tecnológica de comunicação mundial era de 432 exabytes. Esta capacidade sofreu um significativo aumento, chegando à marca de 1.15 zettabytes em 2007. A capacidade de armazenamento também sofreu um crescimento. Em 1986 a capacidade de armazenamento era de 2,6 exabytes, chegando a 309 exabytes em 2007. De acordo com IBM (2014), todos os dias 2,5 quintilhões de bytes de dados são criados e deste total, 90 por cento dos dados atualmente no mundo foram produzidos nos últimos dois anos. Segundo Wu et al. (2014), desde o advento da tecnologia da informação a capacidade humana de gerar dados expandiu vertiginosamente. Como outro exemplo, os autores citam que em 4 de outubro de 2012, o primeiro debate presidencial entre o Presidente Barack Obama e o Governador Mitt Romney produziu mais de 10 milhões de tweets em 2 horas. Diante deste cenário, encontrar as informações de interesse tem se tornado uma tarefa árdua para os usuários da Internet. Para Ferreira e Oliveira (2012), a sobrecarga de informação é um fenômeno que não veio para auxiliar o usuário no processo de escolha e tomada de decisão. Inicialmente auxiliados por motores de busca, as informações encontradas na maioria das vezes não vinham de encontro ao seu interesse, surgindo a necessidade da filtragem das informações. Com o imenso volume de informações, muitas opções eram oferecidas aos usuários. As dificuldades de realizar uma escolha eram comuns até mesmo para o usuário mais experiente. Fazia-se necessário o auxílio de um sistema computacional que executasse o papel de um facilitador nas escolhas e tomadas de decisão. Tal situação tornou-se uma importante fonte de pesquisa e originou o surgimento da área de Sistemas de Recomendação (RESNICK et al., 1994, SHARDANAND; MAES, 1995). Em meados da década de 90 surgiram os primeiros sistemas de filtragem colaborativa, que posteriormente se tornaram a base para os Sistemas de Recomendação (GOLDBERG et al., 1992, RESNICK; VARIAN, 1997). Os primeiros a propor um sistema de recomendação foram Goldberg et al. (1992) com o Tapestry. Este sistema foi desenvolvido com a finalidade de auxiliar seus usuários a encontrarem documentos que lhe interessassem, diante de uma enxurrada de conteúdo causada pelo aumento do uso dos correios eletrônicos. Um princípio básico do trabalho do Tapestry é que uma filtragem mais eficaz pode ser feita através do envolvimento humano no processo. Pouco tempo depois Resnick e Varian (1997) apresentaram um segundo trabalho denominado GroupLens. Um sistema que classificava notícias de acordo com a avaliação feita por outros usuários. Os sistemas de recomendação realizam uma coleta de dados de um grupo de usuários. Com base nestas informações, estes sistemas têm como objetivo principal gerar recomendações significativas de itens de maneira geral (livros, músicas, filmes, entre outros), que estejam de acordo com o interesse de um grupo de usuários (BOBADILLA et al. 2013, MELVILLE; SINDHWANI, 2010). Em meio a este cenário repleto de dados em larga escala a questão do processamento deve ser observada, pois o volume de informação tende a crescer exponencialmente. Como solução deste problema surge a questão dos sistemas distribuídos que, segundo Kshemkalyani e Singhal (2008), tratam-se de componentes independentes que se comunicam por meio de um canal que em conjunto possuem a tarefa de resolver um problema que não poderia ser solucionado individualmente. Muitos dos problemas resultantes do processamento de grandes volumes de dados requerem computadores fortemente acoplados contendo baixa latência e altas larguras de banda de comunicação (FOSTER; KESSELMAN; TUECKE, 2001). Ainda conforme os autores Kshemkalyani e Singhal (2008), sistemas distribuídos consistem em um conjunto de processadores que não compartilham uma memória global e que estão conectados por meio de uma rede, sendo que neste canal são realizadas as trocas de mensagens entre os mesmos. Afirmar que uma determinada aplicação está sendo executada em um sistema distribuído é expressar que um conjunto de processos está alocado a diferentes processadores interligados na rede.",
    "Conclusão": "O objetivo geral desse trabalho foi propor um sistema voltado à recomendação de conteúdo textual suportado pela computação distribuída. Buscando atingir este objetivo, realizou-se inicialmente o levantamento bibliográfico nas áreas de pesquisa envolvidas no trabalho, citam-se os Sistemas de Recomendação e a Computação Distribuída. Com os conhecimentos adquiridos nesta etapa, foi possível elaborar a base de dados e desenvolver um protótipo voltado à recomendação de conteúdos textuais. Para a aplicação da filtragem baseada em conteúdo foi utilizado uma base de dados composta por centenas de documentos conforme apresentado na seção 5.2 em que cada documento é composto por um conjunto de características (palavras-chave). De posse destas informações foi possível realizar as recomendações baseadas em conteúdo. Para as recomendações geradas pela filtragem colaborativa foi necessário verificar as interações (consulta de documentos e avaliação) dos usuários com os documentos de texto. As interações foram geradas de maneira aleatória conforme discutido na seção 5.2. As interações persistidas em uma base de dados serviram posteriormente como insumo para a execução dos cálculos que geraram as recomendações nesta abordagem. O desenvolvimento do protótipo teve como objetivo aplicar os conceitos de Recomendação baseada em Filtragem Colaborativa e Recomendação Baseada em Conteúdo pertencentes aos Sistemas de Recomendação e auxiliados pela Computação Distribuída. O protótipo foi executado em um ambiente onde existia uma base de dados com centenas de documentos e milhares de interações. O protótipo foi desenvolvido com o auxílio de um software middleware chamado GridGain® que propicia suporte ao processamento distribuído. Através dos resultados obtidos foi possível constatar o êxito na geração das recomendações originadas pela filtragem colaborativa através da avaliação de usuários e a filtragem baseada em conteúdo através da análise entre os termos contidos nos documentos. O sistema demonstrou resultados satisfatórios quanto ao auxílio da computação distribuída relacionado ao aumento no poder de processamento. No desenvolvimento do trabalho foram encontradas algumas limitações relacionadas a realização do mesmo. Destaca-se o volume do conteúdo da base de dados utilizada que foi restrita a um número específico de documentos, pois a formação de uma base de dados textual volumosa depende de processos de coleta, muitas vezes bastante especializado. Quanto ao protótipo, não foi possível testá-lo em uma estrutura de cluster mais robusta composta por vários computadores (nós). O desenvolvimento do trabalho levantou possibilidade para trabalhos futuros. Dentre estas opções, destaca-se o volume de dados relacionados à interação dos usuários com o protótipo, podendo ser desenvolvida uma aplicação que gere um grande volume de informações, permitindo assim, a realização de testes mais precisos envolvendo o conceito de computação distribuída. A evolução do protótipo poderia ter algumas características interessantes. Na versão atual o mesmo precisa ser executado manualmente. Em uma aplicação real deveria se pensar em um módulo executando como um serviço, onde em determinados períodos de tempo o mesmo pudesse avaliar as novas interações e documentos, visando a execução constante do processo de geração de recomendações. Por fim, o foco do trabalho esteve na recomendação de documentos textuais. Uma possibilidade seria a adaptação do mesmo para trabalhar genericamente com qualquer tipo de item, bem como, possibilitar a geração de perfis de usuários que subsidiem recomendações mais precisas."
}