{
    "Autor": "Anne Caroline Dias Bezerra",
    "Título": "Uma modelagem de segurança da informação baseada na ISO/IEC 27001 e gestão ITIL aplicada às micro e pequenas empresas",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Profª. Drª. Analúcia Schiaffino Morales",
    "Coorientador(a)": "",
    "Resumo": "A segurança da informação é um assunto que vem crescendo e tomando um âmbito de pesquisa muito amplo, a Internet e a domesticação dos ativos tecnológicos tornou-se parte essencial do cotidiano da sociedade. Devido a isso, as micros e pequenas empresas tem sofrido um atraso de estruturação no contexto da segurança de seus ativos, pois as normas internacionais não são direcionadas para este porte de organização. O presente trabalho, através da análise das normas de segurança e de infraestrutura internacional, propõe uma modelagem para empregar diretivas de segurança em empresas menores. Foram analisadas as diretivas de segurança da ISO/IEC 27001 e de infraestrutura do ITIL (Information Technology Infrastructure Library), que são referência nestas áreas. Avaliando os principais fatores que estão associados a este cenário, e através da realização de um levantamento de empresas de tecnologia do Vale do Araranguá, foi então proposta uma modelagem de forma a agregar segurança da informação e de infraestrutura a estes estabelecimentos.",
    "Palavras-chave": "Segurança da informação, Governança em TI, ITIL, ISO 27001, ISMS, Micro e pequenas empresas.",
    "Introdução": "Quando o assunto é segurança da informação nos atuais parâmetros da sociedade é impossível não associar as diversas notícias hoje vinculadas sobre vírus e ataques cibernéticos contra indivíduos ou organizações corporativas. Hoje com a expansão da Internet, das tecnologias, e do valor das informações que trafegam em dispositivos portáteis como celulares, tablets e computadores, torna-se inviável não possuir um método efetivo que proporcione a segurança a estes ativos. A tecnologia e as redes de computadores deixaram de ser vistas como acessórios e entraram na categoria de necessidade, principalmente dentro do contexto organizacional. Em uma pesquisa realizada pela revista Exame (2014) é demonstrado que o setor de micro e pequenas empresas (MPEs) é representado por aproximadamente 9 milhões de empresas que compõe cerca de 27% do PIB brasileiro. Através desses dados se pode observar a importância e o crescimento deste setor para a economia brasileira. Outra pesquisa realizada pelo IBGE em 2010 demonstra que o uso das TIC’s dentre as empresas pesquisadas, ou seja 2,2 milhões cerca de 80,8% delas utilizam computadores, e 2,1 milhões totalizando 76,9% delas fazem uso da Internet e por fim cerca de 2,3 milhões, aproximadamente 83,3% utilizam o telefone celular como ferramenta de trabalho. Esses dados apontam a abrangência das TIC’s dentro desse ambiente empresarial brasileiro, mas que, no entanto esses dados possuem uma curva de declínio quando é separado e tratado a proporção das empresas analisadas. Assim sendo, observa-se que entre micro empresa esse percentual de uso de computadores cai para 78% enquanto pequenas empresas, e a taxa de uso das TIC’s foi de 94,1% e a mesma proporção se manteve em relação ao uso de Internet e telefones móveis, que são respectivamente 73,7% e 94,1%. Esse comportamento é destacado pelo (IBGE, 2010) como o potencial de crescimento que seguirá nos próximos anos em relação à utilização desses ativos em empresas de pequeno-médio porte. A partir desses dados que apontam para uma clara curva de potencial de crescimento dentro do contexto de MPEs é possível expor a importância que a segurança pode adquirir conforme aconteça essa curva de crescimento do uso de tecnologias no setor MPEs, somado ao crescimento de sua representação no PIB na economia brasileira. Resultantes que se somadas provocam uma margem crescente da necessidade e importância que o setor segurança assume conforme o contínuo crescimento dessas variáveis no setor. Em sequência, pode-se argumentar que a partir desse crescente uso de ferramentas tecnológicas, é importante que sejam definidos políticas e boas práticas que assegurem a segurança dos dados e informações que trafegam na rede e nos dispositivos. Dentro desta questão, existe a problemática de que muitas MPEs se enxergam livres de quaisquer riscos e perigos existentes na rede. Porém um recente relatório revelado pela Symantec (2013) nos conduz a uma realidade diferente, no qual é descrito no relatório de ameaças à segurança na Internet e constatado um crescimento no roubo de informações valiosas e confidenciais no setor de manufatura e, principalmente nas pequenas empresas nas quais, foram alvos de 31% dos ataques em 2012. A pesquisa Symantec ainda acrescenta que as MPEs são alvos atraentes, por não darem a devida importância às ferramentas ou políticas que as protejam dessas ameaças.",
    "Conclusão": "O ambiente organizacional de micros pequena empresa é desafiador. Por ser pequena ela se torna dinâmica e livre de processos e estruturas definidas. Ao tratar de gestão de boas práticas e governança de TI torna-se uma problemática que é pouco vista e abordada, visto que através do levantamento regional realizado, demonstra-se que as MPEs não se atentam a uma estrutura de segurança da informação e muito menos de suporte a TI. Observa-se que a segurança da informação possui estereótipos a serem quebrados e barreiras a serem ultrapassadas, pois em muitas MPEs a mesma é tratada como estrutura para grandes empresas ou como um luxo caro e dispendioso. Quando as normas e padrões são tratados observa-se que ela possui um contexto muito além que a de se proteger de hackers e vírus de computadores, percebe-se que a estrutura de governança de TI ITIL é uma ferramenta extremamente útil para a gestão desses ativos que acarretam processos consistentes, melhoria na qualidade, redução de custos e aumento no alcance de metas. Apesar disso, partindo do levantamento realizado, considera-se que o investimento e a implementação de políticas e ferramentas de segurança está diretamente proporcional ao porte da empresa, ou seja, quanto maior a empresa maior a atenção e investimento em SGSI possui. O desafio atualmente é difundir a necessidade do modelo para uma MPE e implementar as boas práticas de governança em TI (ITIL, ISO/IEC 27001) para ajudar a satisfazer às necessidades de pequenas empresas, e ao mesmo tempo que se encaixe em seu contexto organizacional e minimize riscos de rejeição e grandes custos de implementação. Essas são as principais questões nas quais inúmeras universidades do mundo inteiro vêm desenvolvendo pesquisas na área, que estão começando a responder questionamentos sobre o porquê do descaso sobre o assunto de segurança da informação e da aplicação de requisitos de segurança em meios de tecnologia dentro dos ambientes de micro e pequenas empresas."
}