{
    "Autor": "Antônio Boeira Benthien",
    "Título": "ESTUDO SOBRE A INSERÇÃO DAS TIC NA EDUCAÇÃO BÁSICA NA REDE PÚBLICA DE ENSINO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Juarez Bento da Silva",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho foi desenvolvido com o intuito de apresentar estudo sobre a inserção da s TICs na Educação Básica na rede pública de ensino. Para tanto, procedeu -se de pesquisa bibliográfica para compreender conceitos e verificar histórico das TICs no processo de ensino das escolas públicas; e fetuou -se análise e tratamento dos dados da pesqui sa TIC Educação - Pesquisa sobre o Uso das Tecnologias da Informação e da Comunicação no Brasil realizada em 2012 pelo Centro de Estudos sobre as Tecnologias da Informação e da Comunicação (CETIC.br); analisou -se o censo de 2013 e a pesquisa local da AMESC (microrregião) para comparar dados, id entificou -se a inserção das TIC nas escolas de Educação Básica da rede pública de ensino, por meio de análise de pesquisa de campo anteriormente informada, v erificou -se a percepção dos professores com base nos dados d a pesquisas; e esclareceu -se a percepção dos alunos com base nos dados das pesquisas. Manteve -se foco no esclarecimento do tema selecionado, com uma abordagem exploratória, que permite a aproximação do pesquisador com as teorias já existentes, possibilitan do-lhe o aprimoramento em seus conhecimentos, sem que, no entanto, vá influenciar sobre os dados obtidos. Percebeu -se que a infraestrutura de computadores, internet e demais tecnologias de informação e comunicação ainda é falha nas escolas brasileiras, de modo acentuado nas escolas públicas, onde televisores e impressoras são encontradas em mais de 90% das instituições, porém, computadores não totalizam mais de 0,04 por aluno em cada instituição, apontando para uma deficiência de grande proporção.",
    "Palavras-chave": "TICs. Ensino. Aprendizagem.",
    "Introdução": "O processo de globalização e o permanente desenvolvimento e consequente evolução das tecnologias da informação e da comunicação (TICs) tem proporcionado um cenário muito dinâmico e de mudanças constantes que tem pressionado os modelos educacionais. A integração das TICs nas salas de aulas se impõe e toma corpo através de fatores externos aos sistemas educacionais. Como ocorreu na economia ou na política, a esfera da educação deixou de ter a autarquia que sempre teve em épocas anteriores (CASTELLS, 1996). Percebeu -se importantes avanços tecnológicos diariamente e não estamos isentos dos alcances que estes têm em nossa vida cotidiana. Estes avanços estão por todos os lados em menor ou maior medida, em nosso ambiente de trabalho, nas ruas das cidades, inclusiv e e com maior frequência intervinda nas relações de convivência que são modificadas em função da modernização dos meios de comunicação. As últimas décadas do século XX e as primeiras décadas do século XXI foram marcadas por uma intensificação de inovações tecnológicas e mudanças nas estruturas de organização das relações entre os sujeitos que há muito não se via. É neste momento que se observa um grande desenvolvimento tecnológico que provocou a compressão de tempo e espaço, acelerou os processos globais, de forma que o mundo se sente menor e as distâncias, mais curtas. (FARIAS; DIAS, 2013, p. 87). São avanços tecnológicos que estão no dia a dia das pessoas e que não podem ser deixados de lado quando se pensa metodologias de ensino e de aprendizagem, pois , é necessário integrar a tecnologia no ambiente educacional. Esta integração poderá conduzir a modelos educacionais mais dinâmicos onde os indivíduos possam manter uma relação direta com a revolução tecnológica que estão vivendo. Logo, a área educacional não pode permanecer paralisada em suas práticas e nem em seus recursos, é preciso que sejam incorporadas na educação os benefícios que as tecnologias podem aportar. Cientes desta necessidade os governos dos países tem tentado dar respostas relacionadas a políticas educacionais referentes ao estímulo tecnológico e a integração das tecnologias na educação. Estes estímulos podem ser motivados por interesses eleitorais por parte de políticos, por empresários do setor de tecnologia, ou por outros fatores, porém, percebe -se que na maioria dos casos é uma política mais reativa que planejada e com perfil diferente e de oferta de acordo com a estrutura política administrativa de cada país. (FARIAS; DIAS, 2013). Como exemplo, cita-se as iniciativas de integração de TIC nos sistemas educacionais da América Latina que tiveram seu início a partir do ano 2000 e tem desenvolvimentos e usos diversos. A tabela 01 apresenta algumas iniciativas no âmbito da América Latina. Tabela 01: Programas de Integração de TICs na Educação na América Latina País Nome do Programa Órgão Responsável Argentina ConectarIgualdad.com Ministério da Educação. Brasil ProInfo ProInfo, Ministério da Educação Chile Educar chile Ministério da Educação do Chile e da Fundação Chile Colômbia Computadores para Educar Ministério da Educação El Salvador Conéctate Vice-ministério da Tecnologia Educativa Guatemala Escuelas del Futuro Ministério da Educação Jamaica New Horizons Ministério dA educação México Apoyo de Tecnologias Educativas Secretaria de Educação Pública (SEP) Paraguai Una computadora por niño Ministério da Educação Peru Huascarán Ministério da Educação República Dominicana Centros TIC Ministério da Educação Trinidad Tobago Programa para la integración Ministério da Educação Uruguai Plan Ceibal Laboratório Tecnológico do Uruguay (LATU) Fonte: Desenvolvimento do acadêmico (2014). Nos últimos anos, os investimentos dos governos em experiências com TICs, relacionadas a educação, tem buscado desenvolver processos de mudanças e de melhora dos sistemas educacionais. E esta preocupação pode ser observada ao longo de toda a Ibero América, sendo traduzida fortemente em políticas de aquisição de equipamentos e também em programas e projetos de capacitação e apropriação das tecnologias.",
    "Conclusão": "O presente trabalho foi desenvolvido com o intuito de apresentar um estudo sobre a inserção das TICs na Educação Básica na rede pública de ensino. No geral, a pesquisa constatou que, apesar dos esforços feitos por parte do governo e das implementações de políticas, o cenário das TICs nas escolas públicas brasileiras ainda é bastante desafiador. O acesso a tecnologia é desigual e, enquanto algumas escolas apresentam uma infraestrutura adequada, a maioria ainda carece de recursos fundamentais. As TICs possuem um papel crucial no processo educativo e devem ser integradas de maneira eficaz à metodologia de ensino, por meio da capacitação contínua dos professores. Além disso, é necessário investimento significativo em infraestrutura e em formação de professores para garantir que todos os alunos possam se beneficiar das tecnologias disponíveis. Essa integração é vital para preparar os alunos para as demandas do mercado de trabalho e para a sociedade atual, que é cada vez mais digital. Portanto, conclui-se que, para a inserção efetiva das TICs na educação básica, é fundamental que haja um comprometimento das instituições e dos educadores."
}