{
    "Autor": "Vinicios Luneburger Anacleto",
    "Título": "Aplicação e Avaliação de Um Sistema de Controle Neuro-Fuzzy em Injeções Eletrônicas Automotivas",
    "Ano de publicação": "2018",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Anderson Luiz Fernandes Perez",
    "Coorientador(a)": null,
    "Resumo": "A injeção eletrônica de combustível foi uma das invenções marcantes da história automotiva, o seu uso permite um melhor gerenciamento do motor de combustão interna, provendo melhor economia, desempenho e redução de gases poluidores. O uso de inteligência artificial em diversos sistemas vem se tornando uma tendência no mercado, sua aplicação se torna muito eficaz em sistemas que necessitam se adaptar constantemente em resposta ao ambiente. Atualmente as injeções eletrônicas automotivas utilizam tabelas estáticas para controle de seus parâmetros internos. Por restringir-se aos dados contidos nas tabelas, o sistema possui algumas limitações, como por exemplo, trabalhar em faixas de valores pré-definidos, algo que pode não representar com precisão o ambiente em que o motor se encontra em determinado momento. A proposta desse trabalho é o desenvolvimento de um controle eletrônico para injeção de combustível baseado em sistemas Neuro-Fuzzy visando a possibilidade de adaptação a situações adversas.",
    "Palavras-chave": [
        "Injeção Eletrônica",
        "Inteligência Artificial",
        "Gerenciamento de Motor",
        "Lógica Fuzzy",
        "Redes Neurais Artificiais",
        "Sistemas Neuro-Fuzzy"
    ],
    "Introdução": "Desde o início, a indústria automotiva buscou se adequar a exigência por maior segurança e conforto por parte dos consumidores, fazendo com que a tecnologia automotiva se desenvolvesse rapidamente. O veículo moderno é produto de uma longa evolução, onde peças mecânicas deram lugar a avançados sistemas eletroeletrônicos, permitindo mais controle sobre o veículo, tornando-o mais confiável. Com o avançar da história a preocupação com o meio ambiente fez com que surgissem leis restritivas a cerca da poluição. O mon óxido e o dióxido de carbono, gases expelidos pela queima de combustíveis fósseis, são dois dos principais gases causadores do efeito estufa. Toneladas dos mesmos são despejados diariamente na atmosfera. Calcula-se que o setor de transporte é responsável por 22% da emissão de poluentes causadores do efeito estufa, visto que a maioria dos veículos utilizam combustíveis fósseis (DRUMM et al., 2014). Dentro do mesmo contexto histórico, as fabricantes de veículos buscavam uma forma melhor de gerir seus motores, propiciando um momento perfeito para a inserção de sistemas eletrônicos de controle nos veículos. A injeção eletrônica tornou-se importante para a indústria automotiva ao reduzir a emissão de poluentes, adequando os veículos às restrições das novas leis, aumentando a economia de combustível e a eficiência dos motores (TEIXEIRA; TOURNIER, 2015). Na Europa o caminho para o banimento definitivo de combustíveis fósseis já foi traçado, a capital espanhola Madrid, por exemplo, pretende banir completamente veículos movidos a diesel até o ano de 2025. Na Alemanha recentemente foram apresentados planos para retirada de antigos carros movidos a diesel das suas vias. A fabricante BMW se engajou na ação e atualmente oferece descontos e benefícios a clientes que desejam trocar seu carro movido a diesel por um híbrido ou elétrico (EDDY; EWING, 2017). O aperfeiçoamento da tecnologia automotiva vem permitindo a miniaturização dos motores (downsizing), reduzindo o número de cilindros e a capacidade cúbica do motor buscando a razão ideal entre potência e eficiência (FRASER et al., 2009). Uma das maneiras utilizadas para aumentar a eficiência é a tração híbrida, onde motores de combustão interna trabalham em conjunto com motores elétricos para maior autonomia e redução na emissão de CO2. Apesar de já existirem veículos completamente elétricos no mercado, a preferência dos consumidores continua sendo por motores de combustão interna devido às limitações dos veículos elétricos. Dessa forma, as fabricantes continuam investindo em alta tecnologia para melhoria dos motores de combustão interna (SASAKI, 1998). Atualmente algumas perguntas são feitas em relação a motores de combustão interna: até onde é possível miniaturizar o motor? Quanta potência é necessária para uma condução segura? De que forma é possível minimizar a poluição (atmosférica e sonora) produzida pelo motor? Quais são os limites da economia de combustível? A resposta dada pela indústria automotiva a essas perguntas é o refinamento do gerenciamento de motor, a diminuição no tamanho dos motores e a pesquisa de novos materiais para fabricação dos mesmos. No entanto essas respostas também dependem do combustível empregue e como as refinarias melhoram o mesmo. Tendo um norte para as pesquisas nessa área, a pergunta de maior relevância é, até onde pode-se chegar na melhoria dos motores de combustão interna?",
    "Conclusão": "A evolução dos motores de combustão interna é constante, mesmo que novas tecnologias de motores elétricos e híbridos estão sendo desenvolvidas, a maior parcela dos motores encontrados em veículos automotores continua sendo de combustão interna, portanto evoluir o gerenciamento dos mesmos buscando a melhor relação potência e eficiência ainda é uma das maiores preocupações da indústria automotiva. Neste trabalho foi proposto um sistema de controle que através de técnicas de inteligência artificial seja capaz de substituir o controle tradicional, baseado em tabelas de dados estáticos, por um controle dinâmico capaz de se adequar a qualquer tipo de ambiente com maior precisão. O desenvolvimento dos controladores para injeção eletrônica desenvolvidos foram baseados em duas técnicas de inteligência computacional combinadas. Em suma a proposta foi utilizar redes neurais artificiais como método para calibrar um sistema de inferência Fuzzy. O FIS então recebe os dados de sensores do motor e retorna valores utilizados no controle de atuadores. Para realização deste trabalho foram realizadas diversas pesquisas buscando o melhor entendimento do gerenciamento de um motor de combustão interna moderno, entendendo o funcionamento das injeções eletrônicas e de todo o conjunto mecânico envolvido. Para realizar os testes e a validação do sistema foi montado um ambiente de simulação onde, tanto o método de controle convencional, baseado em mapas estáticos, quanto o método de controle Neuro-Fuzzy foram testados com base em dados capturados de um motor real. A partir da comparação dos resultados obtidos pode-se constatar que o sistema de controle Neuro-Fuzzy se adequou muito bem ao gerenciamento de uma injeção eletrônica. Baseando-se nos valores de saída de cada tipo de controle observou-se que eles se mantiveram muito próximos na maior parte do tempo e que os valores mais discrepantes não trariam consequências severas ao desempenho. Com base nos dados apresentados neste trabalho foi possível comprovar a capacidade do sistema de controle Neuro-Fuzzy de se moldar ao ambiente e apresentar resultados satisfatórios, cumprindo assim, com o objetivo proposto."
}