{
    "Autor": "Armindo Sousa Nhanque",
    "Título": "Desenvolvimento de um protótipo de um sistema web para auxiliar os alunos no estágio supervisionado",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Vinicius Faria Culmant Ramos",
    "Coorientador(a)": null,
    "Resumo": "Os sistemas de compartilhamento de conhecimento surgiram para ajudar na melhoria das limitações impostas pela distância. Junto desses sistemas, podemos, ainda, relacionar com a quantidade de informações disponibilizadas na Web. Neste contexto, este trabalho de conclusão de curso tem por objetivo desenvolver um protótipo de um sistema para a Web como um repositório de planos de aula e ensino. O sistema Web funciona como um portal de apoio a alunos e professores das licenciaturas no desenvolvimento de suas atividades do estágio supervisionado. Para atingirmos esse objetivo, realizamos um estudo utilizando método experimental para revisão bibliográfica dos conceitos de sistemas colaborativos, internet, aplicação web e modelagem do protótipo de telas do sistema. Para a análise e projeto do sistema utilizou-se a UML. Também fizemos um levantamento dos processos de desenvolvimento de software para o protótipo frontend. Como tecnologias, utilizamos o BOOTSTRAP, CSS e HTML. A partir destas tecnologias, criamos um conjunto de telas do sistema, dentre elas: tela do aluno, com menus de cadastro do perfil, cadastro do plano de aula, página de contato com supervisor e página de pesquisa dos planos e, tela do professor, com página de cadastro do perfil, de gerenciamento dos planos enviados e do contato e, tela do administrador do sistema. No geral, pode-se concluir que os sistemas de compartilhamento de planos de aulas auxiliam os estudantes de cursos de licenciatura.",
    "Palavras-chave": [
        "Tecnologias de Informação",
        "Sistema colaborativo",
        "Telas",
        "Protótipo"
    ],
    "Introdução": "A evolução das tecnologias de informação e comunicação e da internet abriu novos horizontes de estudos e novas formas de aprendizagem vem surgindo na internet. O uso das tecnologias na educação aumentou ao longo dos últimos anos, facilitando que os profissionais de diferentes áreas produzissem conteúdos e disponibilizassem -nos nos ambientes virtuais de aprendizagem. Isto também permitiu que as pessoas pudessem acessar, consultar, comparar e usar de apoio para a criação de outros exemplos de documentos. Este novo espaço na internet, conhecido como web, caminha numa velocidade sem precedente. Assim a web tem como possibilidade ajudar as pessoas organizando o acesso às informações. Ainda, um dos grandes desafios da Web é o trabalho em grupo, em diferentes lugares, focando na alta produtividade. O trabalho em grupo sempre foi atrelado ao homem, ou seja, a sobrevivência do ser humano sempre foi marcada pela cooperação e troca de experiência (Carneiro (CORNEIRO apud FERREIRA E FILHO, 2010). A sociedade onde vivemos é das mais difícil no que tange a informação, colaboração. O trabalho em grupo sempre foi das melhores opções, como por exemplo, as equipes de esporte mesmo o tênis que parece ser individual. Como também ninguém constrói uma casa sozinha, mas com a colaboração de várias pessoas e diferentes profissionais de diversas áreas para deixar tudo melhor, assim também pode ser com os profissionais da educação. Para melhorar a sua capacidade e aumentar a experiência no trabalho de produção de planos de aulas precisa trabalhar com outras pessoas. A colaboração é um elemento essencial na produção e construção do conhecimento, sobretudo para os profissionais da educação. Os alunos dos cursos de licenciatura que no futuro serão professores, necessitam de um repositório online de compartilhamento de conhecimento que funciona como base de consulta de dados. Para isso, os sistemas colaborativos (groupware) são definidos como sistemas computacionais que permitem que dois ou mais usuários realizem uma tarefa comum, fornecendo uma interface para o ambiente compartilhado (CUNHA; GASPARINI; BERKENBROCK, 2013). No entender desses autores as ferramentas de suporte que facilitam a interação entre as equipes devem ser essenciais e necessários, para ajudar os possíveis usuários na interação. Facilitando o controle, a coordenação, a colaboração e a comunicação entre as partes envolvidas, que pode ser no mesmo local, como em locais diferentes, e em tempos diferentes. Com essa narração entende-se que o objetivo dos Sistemas Colaborativos é reduzir as barreiras impostas pelo espaço físico e o tempo. Atualmente, muitos alunos do estágio supervisionado apresentam dificuldades na elaboração do plano de aula durante o estágio, ou até depois de sair da faculdade. Isto, por que carecem de exemplos dos planos credenciados por outros professores e disponibilizados num repositório. Também falta de base de dados para comparação e assim melhorar a qualidade do seu plano. E o professor do outro lado sobrecarregado com mais de quatro ou cinco alunos para orientar, torna difícil acompanhar todos só com a orientação física. Por isso, seria necessário ter um repositório online onde os alunos vão conseguir pesquisar e comparar os planos já validados pelos professores ajudando -os a produzir conteúdo e promover o conhecimento. Dificuldade de produção de plano de aula é também problema que muitos alunos da Guiné-Bissau enfrentam. Um país com fraca qualidade de ensino e marca da de grandes ondas de greves em todos os níveis da educação, básica, fundamental, médio e superior. Às vezes o professor nem se quer acompanha a atividade do aluno numa escola por quantidade de alunos que uma sala de escola de formação de professores apresenta. Entretanto, este trabalho visa desenvolver um protótipo das telas de uma plataforma web de colaboração para auxiliar os estudantes do curso de licenciatura na criação de planos de ensino. Para tanto, este trabalho apresenta como metodologia a abordagem bibliográfica sobre internet, sistemas colaborativos, aplicações web, metodologias de processo de software e desenvolvimento do protótipo utilizando as ferramentas de criação das telas do sistema, BOOTSTRAP, CSS, e HTML.",
    "Conclusão": "O desenvolvimento do presente trabalho possibilitou uma análise de como os sistemas colaborativos podem melhorar a produção de planos de aulas de qualidade. Uma reflexão acerca dos benefícios do uso dos sistemas colaborativos na educação, e as dificuldades encontradas ao trabalhar esse assunto, além disso, também permitiu avaliar e utilizar diferentes recursos e ferramentas de desenvolvimento das telas e compreender como os sistemas colaborativos auxiliam na aprendizagem dos alunos. De modo geral, as telas do ambiente foram construídas e podem facilitar no desenvolvimento e implementação do sistema, e facilitar os alunos e professores na criação de planos de aulas de qualidade. De salientar que as telas foram criadas após a definição dos requisitos do sistema, mas ainda faltaram algumas especificações do sistema para tornar a descrição mais clara. Foram definidas requitos do sistema, descrição do cadastro do usuário aluno, professor e administrador e tabelas do banco de dados. As dificuldades dos professores e alunos são enormes e o falta de tempo suficiente para atendimento de todos são preocupações mencionadas no trabalho. Os professores do estágio supervisionado também demonstraram muito interesse na criação de um sistema de compartilhamento de planos, os alunos realçaram a importância de haver este sistema, e muitos estão ansiosos em ver o sistema funcionando, mas nessa primeira etapa foi somente criada a interface do sistema. E diante dessas afirmações, é evidente que os objetivos do trabalho foram alcançados. As telas foram criadas utilizando bootstrap, HTML e CSS para modelar toda interface do sistema, a página principal dos menus, a página do aluno e do professor e a página do administrador do sistema. A ideia é descrever todos os requisitos do sistema e funcionalidade de cada usuário do sistema, cadastro, edição, atualização e exclusão no sistema. As telas permitiram os alunos e outros usuários entenderem como o sistema será construída. Primeiro foram utilizadas UML para descrever diagramas de caso de uso do aluno, do professor e do supervisor, diagrama de sequência para mostrar o comportamento lógico dos respectivos usuários nos seus perfis. E para relacionamento das tabelas no banco de dados foi utilizada Workbench para demonstrar o relacionamento e as dependências das tabelas. Os sistemas colaborativos ou as telas forneceram um ambiente enriquecedor e motivador e passou a ser visto como um promotor de aprendizagem, permitindo que os alunos e professores entenderem melhor a elaboração de planos de aulas, que antes maioria eram feitos somente por acompanhamento físico, que agora com essa proposta num futuro próximo os alunos irão puder tirar suas dúvidas num repositório online, revisar e enviar seus planos. Dada à importância do trabalho, torna-se necessário o desenvolvimento de sistemas de compartilhamento de conhecimento entre alunos e professores, que possam despertar competências e habilidades para garantir e melhorar o ensino de qualidade, que atendam às necessidades de todos os alunos de licenciatura e, assim proporcionar práticas na elaboração de planos de aulas diferenciada. Nesse sentido, a utilização dos sistemas colaborativos nos cursos de licenciatura permite os professores mediarem e corrigirem as propostas dos alunos. O objetivo do trabalho era criar interface (telas) do sistema e, foi alcançado quando foi feito as telas. Quanto à validação dos requisitos e de interface só foram apresentados ao professor orientador e supervisor que avaliaram a interface criada. Com a criação de interface e definição dos requisitos do sistema, deixou-se para criar futuramente a implementação, acrescentadas de funções que possam permitir compartilhamento dos planos de aulas entre professor e o aluno. Eis algumas sugestões para os trabalhos futuros: Implementação dos requisitos do sistema, Melhorar a interface do protótipo seguindo as diretrizes do IHC, Criar páginas com links aos portais do ministério da educação."
}