{
    "Autor": [
        "Jadson de Stefani",
        "Victor Souza da Rosa"
    ],
    "Título": "Avaliação da Interface de Interação do Sistema de Controle Acadêmico da Graduação sob a Ótica de Diferentes Usuários",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Helio Aisenberg Ferenhof, Dr.",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho tem como objetivo verificar a existência de problemas de interação relacionados à usabilidade no Sistema de Controle Acadêmico da Graduação, que possui grande importância para a Universidade Federal de Santa Catarina já que o mesmo possui diversas funcionalidades importantes para a manutenção da graduação. Para isso, explorou-se a literatura relacionada ao tema, com o objetivo de fazer um levantamento de referencial para dar início aos estudos. Após a pesquisa houve uma breve apresentação do histórico da graduação no Brasil, assim como, dos sistemas de controle acadêmico para IES, e também é apresentado a IHC, os pontos importantes e seu surgimento. São listados alguns protótipos de enquetes de usabilidade de software para avaliar a satisfação dos usuários. O questionário de avaliação desenvolvido foi fundamentado nos fatores de usabilidade do Software Usability Measurement Inventory, conhecido como SUMI. São listados também os critérios ergonômicos e seus respectivos subníveis, fundamentados por Bastien e Scapin (1993), com o objetivo de compreender e apontar, com as respostas obtidas no questionário de satisfação, pontos de melhoria no Sistema de Controle Acadêmico de Graduação. Almejando o objetivo proposto, foram analisadas as respostas recebidas no questionário do Google Forms, chegando assim nas seguintes recomendações de melhoria para o Sistema: Desenvolver compatibilidade com dispositivos móveis, pois o Sistema tem a mesma interface de interação para smartphones, tablets, desktops e notebooks; interface limpa, os usuários consideraram o sistema complexo, trabalhoso e de interface confusa, dificultando certas atividades; recomenda-se que o sistema possua integração com outros sistemas da Universidade, evitando assim duplicidade de informações; melhor integração com o AVA, pois o usuário precisa visualizar anota em diferentes lugares; tutorial para usuário novo, certos usuários relataram dificuldade na aprendizagem do Sistema; mensagens de erro mais informativas, os usuários relataram dificuldade em identificar o erro e como prosseguir; entre outras recomendações.",
    "Palavras-chave": [
        "Sistema de Controle Acadêmico da Graduação",
        "Interface Humano-Computador",
        "Graduação",
        "Usabilidade"
    ],
    "Introdução": "Sabe-se que a web exerce as mais diversas funções na nossa vida. São inúmeras possibilidades para as mais diversas funções, tem-se acesso a páginas de lazer, trabalho e estudo em poucos cliques, mas ainda encontram-se sites que apresentam dificuldades na sua utilização.\n\nSegundo Nielsen (1993), os websites que obtêm grande sucesso na Internet são aqueles “politicamente corretos”. Ou seja, observam-se duas características fundamentais: usabilidade e simplicidade.\n\nA ABNT (2011) na norma NBR ISO 9241-11 define usabilidade e explica como identificar a informação necessária a ser considerada na especificação ou avaliação da usabilidade de um dispositivo de interação visual em termos de medidas de desempenho e satisfação do usuário.\n\nUma boa interface, além de facilitar a interação, deve possibilitar fácil aprendizagem, precisa ser eficaz em sua utilização e proporcionar aos seus usuários uma experiência agradável em seu acesso (PREECE et. al., 2013).\n\nO usuário não pode encontrar dificuldades na realização de tarefas, tampouco tomar uma grande quantidade de tempo para a realização das mesmas. Deve-se evitar percorrer grandes caminhos para realização de tarefas consideradas simples, o design da interface deve se preocupar em não deixar funcionalidades desnecessárias no sistema e grandes percursos que possam criar dificuldades para o usuário recordar-se do percurso que deve ser realizado para execução da tarefa desejada (MARCÊDO et.al., 2003). Problemas com a interface podem gerar dificuldades e até mesmo impedir que o usuário consiga executar atividades consideravelmente simples (OLIVEIRA et. al., 2016). Conforme exposto, tais problemas podem ocorrer em qualquer sistema computacional, o que inclui o Sistema de Controle Acadêmico da Graduação (CAGR), foco deste trabalho.",
    "Conclusão": "Chegando ao final da presente pesquisa, é notável a importância de estudar interface humano-computador no desenvolvimento de sistemas. Analisar a interação sob o ponto de vista do usuário, para entendê-lo, e consequentemente, fornecer meios para projetar interfaces adequadas ao contexto e às necessidades do usuário.\n\nPor meio do questionário de satisfação e seus resultados podemos finalmente chegar ao objetivo do trabalho e, ao estudar as respostas recebidas foi possível desenvolver uma lista de melhorias recomendadas para o sistema.\n\nAnalisando o sistema, é perceptível o pouco cuidado com a ergonomia em seu desenvolvimento, apesar de possuir todas as funcionalidades que promete, deixa a desejar na otimização dos recursos visuais, dificultando a interação dos mais diversos usuários.\n\nInicialmente sobre a linguagem do sistema em relação ao usuário, propõe-se que o sistema deixe mais claro o que cada sessão ou funcionalidade representa, facilitando assim a memorização das ações do sistema e a navegação pelo mesmo.\n\nO sistema não possui uma organização visual clara, como podemos observar na figura a seguir.\n\nAlterar as funcionalidades no que diz respeito ao manual de ajuda e documentação e expor de maneira mais eficaz as mensagens transmitidas pelo mesmo, para que assim os usuários consigam percorrer o sistema e desenvolver seus objetivos com clareza e melhor compreensão sobre o que cada parte do sistema faz.\n\nTem-se uma recomendação dos autores com base no método de avaliação da observação. Após fazer um levantamento de informações com algumas perguntas informais envolvendo diversos discentes, recomenda-se que quando os mesmos forem executar a atividade de rematrícula, o sistema disponibilize na interface somente as matérias que estão pendentes para o término da graduação e que as matérias já cursadas estejam devidamente separadas, para assim, evitar transtornos e agilizar todo o processo.\n\nAlém disso, integrar o CAGR com os demais sistemas da UFSC e o seu AVA. Com isso, almeja-se facilitar a busca por informações e evitar duplicidade de dados, para que o usuário não precise acessar outra página para encontrar aquilo que procura e não encontre informações diferentes.\n\nOutra recomendação é ter uma pesquisa em tempo real no sistema, para que enquanto o usuário estiver digitando uma informação que procura, automaticamente apareça opções relacionadas à pesquisa. Com isso, facilitando e agilizando a busca por informações.\n\nPor fim, de acordo com o depoimento recebido, outra melhoria recomendada é a unificação do sistema, deixando-o somente para uso na web e descontinuar a plataforma desktop, acelerando assim, todos os processos a serem desenvolvidos no mesmo e prevenindo a duplicidade de informações."
}