{
    "Autor": "BRUNA JOAQUIM",
    "Título": "LEIS MUNICIPAIS DE INOVAÇÃO COMO INSTRUMENTO DOS SISTEMAS REGIONAIS DE CIÊNCIA, TECNOLOGIA E INOVAÇÃO.",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Paulo Cesar Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "O objetivo do trabalho é identificar as características de semelhança e de diferenciais das leis municipais de inovação catarinenses como marcos legais do Sistema Regional de Inovação de Santa Catarina. Com o recente sancionamento da Lei de Inovação do município de Araranguá, surgiu o interesse em comparar essa lei de inovação com as outras em vigor do estado. O estudo levantou que seis municípios do estado de Santa Catarina possuem leis de inovação estabelecidas, e comparou através de uma tabela, suas semelhanças e diferenciais. Além disso, foi realizada a análise do conceito de inovação como elemento de competitividade; do marco regulatório de Ciência, Tecnologia e Inovação; da ação dos Sistemas Regionais de Inovação; do contexto histórico dos incentivos à inovação no país e, da lei de inovação de Araranguá. A construção do trabalho foi possível com uma pesquisa qualitativa, bibliográfica e documental. Com este estudo, conclui-se que com a criação de leis específicas de inovação, aliadas a integração entre Governo-Universidade-Empresa e a participação efetiva de todos os envolvidos, o resultado mais provável é a valorização e intensificação da inovação, além do desenvolvimento econômico e competitividade internacional.",
    "Palavras-chave": [
        "Inovação",
        "Tríplice-Hélice",
        "Leis Municipais de Inovação",
        "Tecnologia"
    ],
    "Introdução": "A importância da inovação como fator de desenvolvimento é de interesse mundial. Isso está longe de ser algo simples, já que as empresas que apostam em inovações estão em constante pressão, pois a inovação como elemento de competitividade exige investimentos sistemáticos para a geração de novos produtos e serviços adequados às demandas do mercado. É por isso que só se considera como inovação o que é consumido pelo mercado. Assim, faz-se necessário políticas para: “1) estimular a competitividade entre as empresas; 2) ampliar a colaboração entre os diversos atores envolvidos na inovação; 3) criar um ambiente institucional adequado a uma trajetória tecnológica de sucesso” (CALZOLAIO, 2011, p. 22). De acordo com Dudziak (2007), a partir da década de 90 é que surgiu a necessidade de reavaliar o papel da Ciência, Tecnologia e Inovação na sociedade, já que as internacionalizações de empresas e de atividades de pesquisa tornaram-se constantes. O fato é que as empresas centralizam o título de agentes inovadores, pois colocam na prática as inovações que serão compradas pelo mercado. Em contrapartida, as universidades possuem pesquisadores que, com grande produção de conhecimento e teorias, precisam de agentes financiadores e agentes inovadores para que a prática seja realizada. Dentre os instrumentos que podem ser utilizados para acelerar as atividades de inovação estão: política fiscal, financiamento, subvenções, compras governamentais, apoio vertical a uma empresa ou setor, programas específicos, parceria público-privada, Arranjos Produtivos Locais, disposição orçamentária para educação e auxílio para empresas de pequeno porte. Além disso, os agentes fomentados são diversificados: instituições de ensino, centro de Ciência e Tecnologia, Institutos de Pesquisa, pesquisadores independentes e, claro, as próprias empresas (CALZOLAIO, 2011, p. 12). A Estratégia Nacional de C,T&I (2012-2015), aponta que há uma grande diferença entre o Brasil e países como Estados Unidos, Alemanha, China, Coreia e Japão. Enquanto no país, 45,7% dos gastos com P&D são realizados por empresas, nos outros países citados esse percentual é de aproximadamente 70%. É visível que, com o decorrer da história, ocorreu uma ampliação da participação das empresas nos esforços tecnológicos do país, mas é de extrema importância aumentar a promoção da inovação nas empresas de todos os setores.",
    "Conclusão": "Este estudo ratificou a importância da Lei nº 10.973 no âmbito nacional. Afinal, a Lei Nacional de Inovação possibilitou a criação das Leis Estaduais e Municipais de Inovação. Sem dúvidas, o assunto precisa ser conduzido com afinco, tendo em vista que as leis formalizam os compromissos do governo com a sociedade. Neste caso, a partir da criação da Lei Nacional de Inovação, deu-se a maior importância para a inovação como instrumento de competitividade. A necessidade de leis específicas para cada região, se dá a partir da ideia de que cada município tem suas especificidades, suas carências e seus pontos fortes. Por isso, a pesquisa realizada encontrou uma série de diferenças entre as leis municipais do Estado de Santa Catarina. Se por um lado, alguns municípios possuem diferenciais em suas leis, outros municípios ficam em desvantagem por não apresentarem em suas leis variáveis importantes para a inovação."
}