{
    "Autor": "Cínthia Provesi Pissetti",
    "Título": "Jogos e Gênero: Pesquisa sobre uso, hábitos e práticas de mulheres jogadoras de videogames",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Luciana Bolan Frigo",
    "Coorientador(a)": "",
    "Resumo": "O presente trabalho aborda Jogos e Gênero, através de uma pesquisa bibliográfica qualitativa seguida de uma pesquisa sobre o uso, hábitos e práticas das mulheres jogadoras de videogames. Por meio desse estudo foi possível observar como os games se consolidaram como indústria, mostrando que os mesmos possuem em sua grande maioria como público alvo os homens. Desta forma, há uma forte influência na representatividade feminina nos jogos. Diante disso, serão apresentados também alguns games e personagens que evidenciam os estereótipos negativos presentes, bem como personagens que representam como é possível existir diversidade na representação da mulher. Conforme mencionado, o estudo foi realizado através de pesquisa bibliográfica qualitativa e aplicação de questionário nas comunidades de jogadores nas redes sociais virtuais. Conforme pode ser observado com a pesquisa de campo, onde participaram 90 mulheres, o interesse por jogos não é exclusivo deles, sendo semelhante às exigências e preferências de jogo para ambos os gêneros.",
    "Palavras-chave": [
        "Mulheres",
        "Hábitos",
        "Jogos"
    ],
    "Introdução": "Aumentou a presença dos jogos eletrônicos no cotidiano das pessoas nas últimas décadas. Este fato está associado ao avanço tecnológico e à massificação da tecnologia e da internet. Contudo, desde seu surgimento, sua tecnologia de hardware e software passam por evoluções constantes para possibilitar melhor imersão em contextos e estratégias variadas (LEITE, 2006). Sempre que estão em frente aos seus celulares ou a tela de um computador, os jogadores se sentem fascinados com as habilidades e performances dos personagens, e quando menos se dão conta, estão dentro da narrativa, a qual muitas vezes são construídas para atrair um perfil específico de público e causam a sensação de realidade. Por muito tempo, pôde-se observar a forte presença dos homens nos jogos eletrônicos, porém, esse cenário mudou, e atualmente a presença do público feminino faz parte dos índices de jogadores de todo mundo. Frente a isso, percebe-se que existe uma grande diversidade, seja em sentido cultural, econômico, etário ou mesmo de gênero no ambiente dos games (GOMES, 2009). Existem diversas opiniões divergentes sobre esse assunto polêmico. Moita (2007) destaca um estudo com depoimento de jogadores que dizem que os jogos são uma atividade tipicamente masculina, e não feminina. Nessa mesma pesquisa o autor identifica posicionamentos contrários, onde os gamers acham que devem ser desenvolvidos jogos focados para alcançar o público feminino, já outros defendem que os jogos eletrônicos deveriam ser livres de gênero.",
    "Conclusão": "O presente estudo teve como objetivo principal abordar através de pesquisa bibliográfica qualitativa e aplicação de um questionário para traçar um perfil sobre a participação, os hábitos e práticas de mulheres e gamers, diante disso, salienta-se que foi criada uma imagem de que a mulher não se interessa tanto assim por games. O foco das empresas desenvolvedoras de jogos sempre foi público masculino. No entanto, as mulheres passaram a adquirir espaço como consumidoras, atestando o interesse em diversos tipos de jogos e não somente naqueles que enfatizam as atividades tipicamente femininas. Conforme pode ser observado com a pesquisa de campo, onde participaram 90 mulheres, o interesse por jogos não é exclusivo deles, sendo semelhante às exigências e preferências de jogo para ambos os gêneros. O fato dos games ainda serem considerados culturalmente como atividade do público masculino, influencia no modo como a mulher é representada nesse meio, bem como ela é vista como jogadora. Essa maneira de retratar a mulher de forma estereotipada reforça ainda mais que existe um único modelo a ser seguido, não permitindo a representação da diversidade existente e, consequentemente, excluindo a mulher como consumidora de games. Devido a isso, se faz relevante haver mais personagens femininas como forma de mostrar que os jogos não são exclusivos para os homens e como uma maneira de acabar com os preconceitos existentes com a figura da mulher gamer. Para concluir, em razão do que foi apresentado no presente estudo, se torna evidente que os estereótipos podem manifestar-se de várias maneiras nos diferentes gêneros de games e personagens. O fato de existirem personagens que não apresentam estereótipos negativos, demonstra que há a possibilidade de construir personagens femininas de modos diferentes, sem que elas percam em desenvolvimento narrativo, podendo tornar-se reconhecida por suas habilidades, personalidade e pela aparência."
}