{
    "Autor": "Camila Farias Weschenfelder",
    "Título": "AVALIAÇÃO DA CAPACIDADE DE INOVAÇÃO DAS EMPRESAS DO SETOR DE SERVIÇOS DE TECNOLOGIA DA INFORMAÇÃO DO MUNICÍPIO DE ARARANGUÁ",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Solange Maria da Silva, Drª.",
    "Coorientador(a)": null,
    "Resumo": "No cenário atual de crescente competitividade e de rápidas mudanças, a inovação é de fundamental importância para elevar a capacidade de competitividade e conquistar novos mercados e consumidores. As empresas do setor de Tecnologia da informação (TI) são muito dinâmicas e, por este motivo, possuem grande necessidade de inovações contínuas para se manterem competitivas no mercado. O objetivo principal deste estudo foi avaliar a capacidade de inovação das empresas do setor de serviços de Tecnologia da Informação (TI) do município de Araranguá. Para alcançar esse objetivo foi aplicado em dez empresas um questionário composto por duas partes, a primeira parte identifica o perfil do setor pesquisado, as questões são baseadas nos seguintes indicadores do PINTEC 2011: Caracterização das empresas, Inovação Organizacional e de Marketing, e Problemas e Obstáculos à inovação. A segunda parte avalia o nível de capacidade de inovação e é composta por formulário desenvolvido por Silva (2006), que possui cinco grupos de indicadores: indicadores de entrada, indicadores de saída, formas de inovação, fontes de inovação e impactos da inovação. A metodologia de Silva (2006) classifica as empresas em “Pouco inovadoras”, “Mediamente inovadoras” e “Inovadoras”. Os resultados mostraram que a maioria das empresas (89%) pesquisadas foram classificadas como “Mediamente Inovadoras”. Como resultados secundários, a pesquisa apontou o perfil das empresas pesquisadas e os principais pontos fortes e fracos encontrados através da análise isolada de cada uma das questões. Por fim, o trabalho conclui que, apesar da maioria das empresas do setor de serviços de TI de Araranguá serem classificadas como mediamente inovadores, elas possuem muitos pontos fracos que precisam ser melhorados. Por meio dos resultados apresentados, as empresas podem ainda rever suas práticas de inovação e analisar a concorrência.",
    "Palavras-chave": "Inovação, Capacidade de Inovação, Serviços de Tecnologia da Informação, Micro e Pequenas Empresas.",
    "Introdução": "Em função da crescente competitividade e da capacidade de adaptação por parte das empresas nos últimos anos, não há dúvidas sobre a importância da inovação no contexto organizacional. Os avanços científicos e tecnológicos têm reduzido consideravelmente o ciclo de vida de produtos e serviços, o que requer das organizações uma capacidade de acompanhar e incorporar inovações em todos os seus níveis (FIATES, 2008). As empresas Brasileiras estão ampliando seu esforços em inovação, isso é comprovado através da última Pesquisa de Inovação Tecnológica (PINTEC) do IBGE (2008), que mostra que a taxa de inovação no período de 2006 à 2008 foi de 38,6%, representando um aumento de 5,2% em relação ao período de 2005, que foi de 33,4%. A inovação tecnológica é o principal motor do aumento da produtividade e da elevação da capacidade de competitividade global e da conquista de novos mercados e consumidores. (MOREIRO; RODRIGUES, 2002, APUD PEIXOTO; GOMES, 2006) A competitividade e lucratividade das organizações dependem de sua capacidade de inovação (PEREIRA, [20 --]). Esta capacidade é composta por um conjunto de recursos e fatores que associados criam um ambiente propício para geração de inovações, estes são recursos financeiros, humanos, tecnológicos, informacionais, estruturais, relacionais, entre outros (JARDÓN, 2012 apud HILLEN; MACHADO, 2013). É importante medir a capacidade inovativa das empresas para descobrir quais são os pontos fortes e fracos destas, para possibilitar aos gestores entendimento sobre quais mudanças precisam ser feitas para o aumento da vantagem competitiva. A medição da capacidade de inovação também promove um claro entendimento da dinâmica competitiva do mercado e pode contribuir para a criação de políticas públicas adequadas às necessidades das micro e pequenas empresas. O setor das Tecnologias da Informação (TI) é um dos mais dinâmicos mundialmente em termos de inovações tecnológicas (KUBOTA, 2009). Esse setor permeia todos os outros setores econômicos e está sempre contribuindo para a inovação dos mesmos, por isso, as oportunidades neste setor são imensas (GRIZENDI, 2012). As micro e pequenas empresas (MPE’s) desempenham um papel relevante na economia Brasileira, estas representam 99% do total de empresas privadas existentes no país (RAIS, 2011). O segmento possui uma enorme capacidade geradora de empregos, o mesmo foi responsável por 84,8% dos novos empregos criados entre janeiro e agosto de 2013 (SEBRAE). Apesar da importância que as MPE's representam na economia nacional, a taxa de mortalidade delas ainda é elevada. A inovação para as MPEs são de grande importância para reduzir a taxa de mortalidade e elevar a competitividade destas empresas.",
    "Conclusão": "O setor de Tecnologias da Informação é muito dinâmico em relação às inovações tecnológicas e, portanto, para as empresas se manterem competitivas neste mercado, é necessária a adoção de práticas de inovações contínuas. Este estudo foi realizado devido à inexistência de pesquisas sobre o setor de serviços de TI de Araranguá e a necessidade de inovação constante demandada por esse setor. O presente trabalho teve o objetivo geral de avaliar a capacidade de inovação das microempresas do setor de serviços de tecnologia da informação (TI) de Araranguá. Para alcançar o objetivo geral, os objetivos específicos também foram alcançados, os resultados destes estão descritos a seguir: O primeiro objetivo específico foi a caracterização do setor de serviços de TI de Araranguá, para atingir este objetivo foi utilizado perguntas baseadas em dois grupos de indicadores do PINTEC. O perfil das empresas do setor serviços de TI de Araranguá é o seguinte: São micro ou pequenas empresas; A maioria das empresas possui faturamento até 500 mil reais ao ano; Os principais clientes das empresas são empresas privadas de pequeno ou médio porte; Nenhuma empresa recebe apoio financeiro público para a realização de atividade de inovação; A maioria das empresas possui atividade econômica na classe de desenvolvimento e licenciamento de programas de computador não customizáveis; A maioria dos funcionários possui ensino superior completo, é do sexo masculino e possui idade entre 19 e 35 anos; A estratégia de negócios de desenvolvimento de produtos/serviços foi priorizada por todas as empresas nos últimos cinco anos; Estratégias não priorizadas por nenhuma das empresas: expansão do volume de produção, novos processos de produção e exportação de produtos/serviços; As inovações organizacionais e de marketing mais implementadas foram respectivamente: novos métodos de organização do trabalho e a implementação de novos conceitos/estratégias de marketing. A maioria das empresas (67%) encontrou algumas vezes dificuldades e/ou obstáculos que tornaram mais lenta a implementação de projetos ou que os inviabilizaram; Os fatores que mais prejudicaram as atividades inovativas das empresas foram: falta de pessoal qualificado, riscos econômicos excessivos e elevados custos da inovação. O segundo objetivo específico foi o diagnostico da capacidade de inovação do setor de serviços de TI de Araranguá. Este objetivo também foi alcançado, para atingi-lo foi utilizada a metodologia desenvolvida por Silva (2006) com cinco indicadores de inovação. O formulário para avaliação da capacidade de inovação foi respondido pelos sócios ou proprietários de nove empresas, o resultado da pesquisa demonstra que a maioria das empresas, 89% do total, é classificada como mediamente inovadora (MIN) e que não há nenhuma empresa considerada inovadora (IN) na cidade. As empresas mediamente inovadoras possuem uma parte não muito expressiva do seu faturamento proveniente de inovações e investem uma pequena parte desse faturamento em inovação tecnológica. Portanto, são necessárias mudanças nos processos de gestão para melhorar esse cenário (Silva, 2006). A seguir, são apresentadas as considerações sobre os resultados de cada um dos cinco indicadores da metodologia: As questões referentes aos indicadores de entrada mostram o quanto as empresas pesquisadas investem em inovação. É concluído neste item que as empresas fizeram pequenos investimentos nos últimos cinco anos para o desenvolvimento de inovações. Os melhores resultados desse indicador foram os percentuais de faturamento investido e de área física destinada às atividades de inovação. Na área de recursos humanos boa parte das empresas não fez nenhum investimento. Os indicadores de saída mostram os resultados quantitativos do processo de inovação, de forma geral o resultado obtido pelas empresas foi mediano. O principal aspecto positivo do setor neste indicador é o fato da maioria das empresas possuírem algum percentual de seu faturamento oriundo de inovações e os principais aspectos negativos são que a maioria das empresas não possui nenhuma patente registrada, tiveram baixo percentual do faturamento advindo da venda de royalties, investiram pouco em inovação de processos e obtiveram como consequência mínima redução de custos. No quesito das formas de inovação, percebe-se que a maior parte das inovações originadas pelas empresas pesquisadas é incremental, ou seja, é originada de forma gradual através de pequenas adaptações e mudanças nos produtos existentes. Com relação ao indicador de fontes de inovações (stakeholders), que analisa o relacionamento entre os vários atores que compõem o universo empresarial, foram encontrados alguns pontos fortes como o fato de boa parte das empresas treinarem seus funcionários, ouvirem seus clientes e criarem novos usos para serviços já existentes. Alguns resultados foram medianos como a quantidade de inovações provenientes de P&D e de adaptações de software. Em contrapartida, neste indicador também foram encontrados diversos pontos fracos nas empresas pesquisadas, os quais são ressaltados a seguir: Falta de alianças com outras empresas; Ausência de parcerias com universidade e institutos de pesquisas; Baixo nível de relacionamento com seus fornecedores; Baixa análise da concorrência; Falta de utilização de serviços de consultoria e de redes de informação informatizadas; Pequena participação em eventos científicos; Pequeno percentual de aquisições de licenças, patentes e know how. Por fim, os indicadores que medem os impactos das inovações mostram quais fatores que mudaram nas empresas com a implementação de inovações nos últimos cinco anos. A adoção de práticas de inovações nas empresas melhorou a qualidade dos produtos, aumentou a oferta, a participação de mercado e a capacidade produtiva. O único fator em que não houve melhorias foi em relação a redução de matéria-prima, isso acontece pelo fato das empresas serem do setor de serviços, e esse setor não é um transformador de matéria-prima. O terceiro objetivo específico foi a proposta de estratégias gerais para as empresas que apresentaram oportunidades de melhorias, as estratégias propostas foram medidas para corrigir e potencializar os aspectos que foram destacados como insuficientes nos cinco indicadores de inovação. Essas estratégias consistem em desenvolver uma maior divulgação dos recursos de incentivos à inovação para estimular e atrair essas empresas para a adoção dos programas de governo e criação de projetos de extensão nas universidades de apoio para micro e pequenas empresas. Além foram descritas estratégias empresariais de inovação, ligadas a incrementos dos recursos humanos, parcerias externas, novos processos, produção, análise de mercado, serviços de consultorias, registro de patentes, participação em eventos, uso de mídias, logística e design. Conclui-se que apesar da maioria das empresas do setor de serviços de TI de Araranguá serem classificadas como mediamente inovadores, elas possuem muitos pontos fracos que precisam ser melhorados. Através dos resultados, estas empresas podem rever suas práticas de inovação e analisar a concorrência. Sugere-se para trabalhos futuros a avaliação da capacidade de inovação do setor de serviços de TI de outros municípios com a utilização das mesmas metodologias e que sejam feitas comparação dos resultados. Outra sugestão é a avaliação destas mesmas empresas do município de Araranguá ao longo dos anos, para acompanhar as mudanças nos níveis de capacidades de inovação. Como a UFSC possui um Curso de Graduação de Tecnologia da Informação e Comunicação, em Araranguá, poderiam ser desenvolvidos, também, projetos de pesquisa por parte dos alunos e docentes para se avaliar o impacto desse curso específico, ao longo do tempo, junto a esse setor de Tecnologia da Informação na região, buscando verificar se o mesmo contribui para o incremento da capacidade de inovação dessas empresas. Por fim, uma última sugestão seria sensibilizar o Curso de Graduação de Tecnologia da Informação e Comunicação, da UFSC de Araranguá, para atuar de forma propositiva ao fomento de inovação na região, a partir do desenvolvimento de projetos de pesquisa e extensão nessa área. Isso poderia ser facilitado, ainda, pela aproximação desse curso de graduação com as empresas de TI da região, o que permitiria o cumprimento de um papel latente da universidade na promoção do desenvolvimento regional, pelo incremento da capacidade de inovação no setor de TI."
}