{
    "Autor": "Tiago Cesconeto Roque",
    "Título": "CAPACIDADE DE INOVAÇÃO DE EMPRESAS INCUBADAS EM UMA UNIVERSIDADE COMUNITÁRIA DA REGIÃO DO EXTREMO SUL DE SANTA CATARINA",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof ª Dra. Solange Maria da Silva",
    "Coorientador(a)": null,
    "Resumo": "No atual modelo mundial de mercado com os crescentes e rápidos avanços nas áreas tecnológicas, a inovação se torna um ponto chave e, partindo deste ponto, as incubadoras tecnológicas vêm agregando inúmeros benefícios para os diversos setores da economia mundial, uma vez que as novas empresas que estão se formando, muitas vezes, submetem seus projetos de fundação a esta importante forma de auxílio tecnológico. Assim, são abordados neste trabalho diversos pontos relacionados às inovações tecnológicas e incubadoras, com vistas ao objetivo de avaliar a capacidade de inovação das empresas incubadas na Itec.in. Para isso, utiliza-se como base para a análise o modelo desenvolvido por Silva (2006) de avaliação da capacidade de inovação de empresas, que, a partir de uma abordagem quali-quanti, permite classificar o nível de capacidade de inovação das empresas em inovadoras, medianamente inovadoras e pouco inovadoras, além de permitir identificar os desafios e benefícios advindos da relação empresa-incubadora-universidade. Com os resultados da pesquisa foi possível avaliar que 80% das empresas incubadas na Itec.in classificam-se como medianamente inovadoras, 20% como inovadoras e nenhum dos resultados apontaram alguma das empresas como pouco inovadora. As empresas com capacidade de inovação mais elevada apresentaram como principal característica o indicador de entrada, que diz respeito aos recursos exclusivos e investidos em Pesquisa e Desenvolvimento. Por outro lado, as empresas incubadas revelaram alguns obstáculos e dificuldades à inovação. Na pesquisa também foi apontado que a incubadora é uma fonte de desenvolvimento do negócio e de inovação para a região.",
    "Palavras-chave": "Incubadoras, Tecnologia, Capacidade de Inovação, Itec.in.",
    "Introdução": "Atualmente, com o crescimento gradativo das nações, a economia global conduz a níveis econômicos e de desenvolvimento mais elevados. Todavia, sabendo-se da fragilidade da situação financeira do país, fator que demanda que a capacidade de inovação seja constantemente atualizada, os projetos bem conduzidos não só apresentam um grande potencial de sucesso, mas são capazes de trazer um retorno dos investimentos perdidos. (VAREJÃO, 2013). Para isso surge o papel das incubadoras nos países que passam por diversos tipos de mudanças, bem como a grande deterioração econômica, como é o caso do Brasil, vem assumindo uma relevância extrema. (VAREJÃO, 2013). Pode-se afirmar que, no Brasil, apesar das experiências internacionais de sucesso, existe um desconhecimento com relação às formas de promover e apoiar esse tipo de empreendedorismo, que fica visível, especialmente, na fase mais crítica, que é a fase de planejamento inicial dos negócios. (ANPROTEC, 2003; PLONSKI, 1999 apud CHENG; DRUMMOND; MATTOS, 2005). As novas tecnologias são de grande auxílio para um crescimento no nível econômico-social das populações, proporcionado por uma dinâmica de empreendedorismo. Com o grande crescimento global e o aumento da importância da tecnologia na competição industrial, as novas tecnologias se colocam como sendo um fator decisivo, não apenas para o aumento da competitividade produtiva, mas como uma fonte de diferenciação da sua concorrente. (MARQUES, 2006 apud VAREJÃO, 2013). O empreendedorismo tecnológico envolve-se na geração de empresas de base tecnológica (EBT’s). São essas empresas que estão despontando como uma forte tendência para as próximas décadas em todo o mundo. Nas universidades, são criados os chamados spin-off’s acadêmicos ou EBT’s de origem acadêmica, um fenômeno que vem crescendo e tornando-se cada vez mais comum. (NDONZUAU et al, 2002; ROBERTS, 1991; ETZKOWITZ, 1998 apud CHENG; DRUMMOND; MATTOS, 2005). Neste sentido, o presente trabalho buscou responder a seguinte pergunta de pesquisa: qual o grau de inovação das empresas incubadas na UNESC? Para tanto, procedeu-se a uma pesquisa bibliográfica, de modo a encontrar os conceitos necessários para a construção de sua base teórica, bem como o desenvolvimento de uma pesquisa de campo voltada à compreensão de características das empresas participantes da incubadora da UNESC.",
    "Conclusão": "Este estudo foi realizado devido à falta de informações e conhecimentos acerca da capacidade de inovação tecnológica da incubadora Itec.in, situada na cidade de Criciúma – SC. Foi realizado, também, devido à dificuldade das empresas começarem um negócio e se manter competitivas no mercado, ao longo do tempo. Em particular, as empresas de base tecnológica, que precisam desenvolver uma grande capacidade de inovação para sobreviver. Nesse contexto, percebeu-se que as incubadoras de empresas apresentam um papel importante de suporte aos novos empreendedores, contribuindo com estruturas físicas e organizacionais e também com assessoria de gestão e capacitação dos empreendedores. Essa pesquisa, então, teve como objetivo principal avaliar o nível da capacidade de inovação das empresas incubadas na Itec.in, uma incubadora comunitária ligada à Universidade do Extremo Sul Catarinense (UNESC), bem como, a influência que a Itec.in exerce sobre o grau de inovação das empresas incubadas, na percepção de seus dirigentes. O objetivo geral foi cumprido com a contribuição dos atores envolvidos na pesquisa das empresas incubadas na Itec.in, ao caracterizar o perfil dos entrevistados, detalhar os critérios de seleção e de avaliação das empresas, e ao relatar os obstáculos à inovação que são deparados pelas empresas incubadas na Itec.in. A relação dos impactos socioeconômicos da incubadora, e por fim a concepção dos gestores da Unesc, da incubadora e dos empreendedores sobre a influência para o grau de inovação da empresa incubada. Para o primeiro objetivo específico, que aborda a caracterização do perfil das empresas residentes da incubadora Itec.in, adquiriu os seguintes resultados: são todas empresas da região, em sua maior parte os funcionários são homens, com idade mediana e com nível de escolaridade de ensino médio. Com relação aos principais clientes, consistem em empresas privadas, de médio porte. Quanto ao segundo objetivo específico, que consiste em analisar as características empresariais que contribuem para a capacidade de inovação, obtiveram-se os seguintes resultados: a grande maioria das empresas incubadas é classificada como empresa medianamente inovadora, apresentando em média trezentos e seis pontos entre essas empresas medianamente inovadoras e apenas uma empresa tendo como resultado a classificação de inovadora. Para o terceiro objetivo específico, que trata dos obstáculos para um elevado grau de inovação na empresa, concluiu-se que: as empresas encontram obstáculos ou dificuldades para as atividades de inovação, com destaque, segundo os respondentes, para os riscos econômicos excessivos, elevados custos da inovação e escassez de serviços técnicos externos adequados. Quanto ao quarto objetivo específico, que é o de analisar a influência da Universidade em relação ao grau de inovação das empresas, na percepção dos gestores das incubadoras, da Universidade e dos empreendedores, obtiveram-se as seguintes conclusões: na visão da gestora, a influência está no envolvimento de estudantes, pesquisadores, empreendedores, empresas em constituição que desejam desenvolver novos projetos, produtos e serviços; já para os dirigentes da universidade, apesar de entenderem que o projeto ainda estar em seu início, afirmam que a universidade oferece recursos, tais como especialistas em certas áreas do conhecimento e laboratórios de ponta. Por fim, na visão da grande maioria dos empreendedores, a sua empresa apresenta um nível alto em comparação com as demais empresas do mesmo setor. Além de afirmarem que a incubadora apresenta credibilidade, ambiente estruturado e adequado para novas tecnologias, como também as redes de contatos. Por fim, o último objetivo específico, que trata de analisar os benefícios para a Universidade de estar vinculada a uma incubadora de base tecnológica, conclui-se que: a incubadora vem com o propósito de cumprir o seu papel de ensino, pesquisa e extensão, o desenvolvimento do espírito empreendedor dos alunos, o apoio ao desenvolvimento regional, à geração de vagas de estágios para acadêmicos e a possibilidade de pesquisas acadêmicas. Resumindo, a incubadora é um meio facilitador para os empreendedores aplicarem suas ideias, tornando-as realidade. Para isso, a Unesc oferece por meio da Itec.in as estruturas físicas e organizacionais e também a assessoria de gestão e capacitação dos empreendedores."
}