{
    "Autor": "CLAUDIONI GONÇALVES JUNIOR",
    "Título": "PROTÓTIPO DE UM SISTEMA ESPECIALISTA PARA AUXILIAR NA IDENTIFICAÇÃO DO TRANSTORNO OBSESSIVO-COMPULSIVO NA PRÉ-ADOLESCÊNCIA",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Dra. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "O Transtorno Obsessivo-Compulsivo (TOC) é um distúrbio psiquiátrico de ansiedade que submete os portadores a lidarem constantemente com sérias obsessões e compulsões. As manifestações dos sintomas do distúrbio muitas vezes surgem logo na infância e geralmente muitas pessoas crescem sem ter conhecimento sobre seu real diagnóstico, o que causa várias adversidades e muitas dificuldades na vivência dos portadores. Este trabalho apresenta o estudo e a implementação de um protótipo de um sistema especialista voltado para a área da saúde, mais precisamente no contexto psiquiátrico/psicológico, onde seu principal objetivo é servir como auxílio na identificação e detecção de sinais do Transtorno Obsessivo-Compulsivo na pré-adolescência, para que assim, os envolvidos que apresentarem indícios relevantes aos sintomas característicos do TOC possam procurar auxílio de um especialista para um devido acompanhamento e realização de um tratamento adequado sobre as disfunções existentes. O Software é composto por fatos e regras que modelam o conhecimento de um profissional da área de saúde mental. Utiliza-se uma interface com ilustrações que facilitam a comunicação, e a associação do problema relatado, complementando os questionamentos e tornando-o mais agradável e atrativo. Para a validação do protótipo é aplicado o mesmo em um ambiente educacional.",
    "Palavras-chave": [
        "Transtorno Obsessivo-Compulsivo",
        "Sintomas Obsessivos-Compulsivos",
        "Sistemas Especialistas",
        "Inteligência Artificial"
    ],
    "Introdução": "A preocupação excessiva com limpeza ou sujeira, medo de contaminação, execução de processos repetitivos como lavar as mãos com grande frequência, fazer consecutivas checagens e verificações em portas, interruptores de energia, ter atos mentais como contagens, repetição de palavras em silêncio, ter a mente constantemente invadida por pensamentos indesejáveis, intrusivos, ou a prática de uma sequência de rituais com fins de prevenção ou redução de algum pensamento desagradável, indesejável ou inconveniente são algumas evidências preocupantes que necessitam de atenção (CORDIOLI, 2014). O Transtorno Obsessivo Compulsivo (TOC) é um distúrbio mental que pode surgir muito cedo, logo na infância e pré-adolescência, e que é caracterizada por fazer o paciente a conviver com sérias obsessões e compulsões que consomem um tempo considerável. Com isso, estes portadores tem a vida fortemente impactada por esta s indesejáveis manifestações, sujeitando-os a conviverem com diversas barreiras e limitações, o que consequentemente vem a interferir em sua qualidade de vida. Além destes aspectos, outro fator preocupante é o silêncio do portador, este não compartilha sobre seus sentimentos passando muitas vezes por despercebido aos olhos dos familiares, o que o submete a conviver por um longo período de sofrimento sem ter conhecimento que seus sintomas são indícios de uma doença, o que acaba retardando um devido acompanhamento profissional (CORDIOLI, 2014). Segundo os dados apresentados pela Revista Brasileira de Psiquiatria (Revista Brasileira de Psiquiatria. 2007) mostram que: Em 1998, em um levantamento feito pela Organização Mundial da Saúde (OMS), o TOC foi considerado o quarto transtorno psiquiátrico mais comum, sendo precedido somente pela depressão, pela fobia social e pelo abuso de substâncias. A doença está entre as 10 maiores causas de incapacitação, acarretando um impacto negativo na vida dos pacientes e em suas atividades. Afeta de 1,6 a 3,1% da população em algum momento da vida. Acometem igualmente homens e mulheres, sendo comuns os sintomas, geralmente inicia na infância e de forma gradual (Revista Brasileira de Psiquiatria. 2007). Com base nos conhecimentos presentes no Manual Diagnóstico e Estatístico de Transtornos Mentais (DSM-V), propostos pela American Psychiatric Association (APA), que propõe atualizadas listas para cada tipo de transtorno mental, material este que é muito utilizado por médicos, pesquisadores, entre outros distintos profissionais da área, principalmente nos Estados Unidos, e baseando-se também nos conceitos, estudos apresentados pela Classificação Internacional de Doenças (CID-10), uma revista periódica publicada pela Organização Mundial de Saúde (OMS), contando ainda com o auxílio de um profissional da área da saúde mental, foi desenvolvido e modelado um conjunto regras que analisam a classificação de transtornos mentais e alguns critérios para um possível diagnóstico. As Tecnologias da Informação e Comunicação (TICs) estão cada vez mais difundidas em nosso meio, vem crescendo gradativamente, impactando em todo o mundo. Estão presentes em diversas áreas incluindo a da saúde e medicina. Seus desafios incluem a evolução do conhecimento humano na busca pela melhoria de processos e resultados. Estudos tecnológicos voltados para saúde são cada vez mais frequentes, buscando fornecer orientações, informativos e também prestações de serviços. Entende-se, sistema como o “conjunto integrado de partes que se articulam para uma finalidade comum”. Para sistemas de informação existem diversas definições tais como: Conjunto de unidades de produção, análise e divulgação de dados que atuam integradas e articuladamente com o propósito de atender as demandas para o qual foi concebido. Reunião de pessoas e máquinas com vistas à obtenção e processamento de dados que atendam à necessidade de informação da instituição que o implementa. Conjuntos de estruturas administrativas e unidade de produção, perfeitamente articuladas, com vista à obtenção de dados mediante o seu registro, coleta, processamento, análise, transformação em informação e oportuna divulgação (Ministério da Saúde. 2005). Uma pesquisa realizada pelo Centro de Estudos Sobre as Tecnologias da Informação e Comunicação (CETIC) no ano de 2013, apontam um vasto crescimento da automatização de processos e implementação de novas tecnologias voltadas para a área da saúde. Tanto os setores públicos quanto os privados vem investindo fortemente em recursos tecnológicos, facilitando os procedimentos rotineiros. Além de softwares administrativos que auxiliam a gerência das unidades, utiliza-se também softwares capazes de fornecer suporte e uma maior segurança e precisão aos atendimentos. A partir destes aspectos, este projeto compreende no desenvolvimento de um protótipo de um sistema especialista, onde se utiliza de conceitos e conhecimentos psiquiátricos capazes de identificar indícios de uma possível perturbação mental, mais precisamente o Transtorno Obsessivo Compulsivo, para que assim, em casos em que a averiguação venha a ter sua confirmação, o entrevistado ou seu responsável possa vir a ser alertado sobre o possível diagnóstico. Esperando que com isso ocorra um encaminhamento a um profissional especialista com devida urgência, e caso confirmado à diagnose, poder iniciar um devido tratamento com acompanhamento profissional, evitando uma série de transtornos na rotina e na vida de um portador de TOC. Como estes sintomas na maioria das vezes são omitidos até onde possível pelos portadores, feito cometido tanto por crianças e até mesmo por adultos, mas levando em consideração que as crianças não conseguem distinguir se seus pensamentos são reais ou fantasiosos, a aplicação é projetada para ser aplicada também em ambiente educacional, permitindo e facilitando assim esta aproximação entre o adolescente com o conhecimento, com uma possível consulta, ou até mesmo a aproximação com um especialista.",
    "Conclusão": "A realização do presente estudo resultou em consideráveis contribuições tanto para a ampliação dos conhecimentos adquiridos no decorrer do curso, quanto para por em prática conhecimentos obtidos durante o exercício do mesmo. O objetivo deste trabalho foi desenvolver e aplicar um protótipo de um sistema especialista para auxiliar na identificação do Transtorno Obsessivo-Compulsivo na pré-adolescência, período este onde as manifestações do distúrbio já são evidentes. A falta de informação e de conhecimento sobre o transtorno que é incapacitante e de caráter crônico, submete aos portadores a conviverem por longos anos tendo sua vida totalmente impactada, interferindo em sua qualidade de vida e causando sofrimentos imensuráveis. O tratamento precoce do distúrbio mental auxilia os portadores a ter em maior controle sobre seus atos, e a terem uma qualidade de vida mais estável. Por estes motivos é de extrema importância a identificação deste transtorno o mais rápido possível. O levantamento do referencial teórico contribuiu para o entendimento das dificuldades na realização de diagnósticos de transtornos mentais, considerando que o cérebro é bastante complexo, e as disfunções mentais são ainda bastante desafiadoras para a medicina. Os avanços na tecnologia proporcionam cada vez mais sistemas robustos, autossuficientes, inteligentes, capazes de processar grande quantidade de informações em curtíssimos espaços de tempo, gerando análises, estatísticas, probabilidades entre diversos outros importantes recursos. Durante muito tempo, desde o surgimento da computação, as necessidades e complexidades da área da medicina atraem diversos pesquisadores que buscam poder contribuir de certa forma para a otimização de tarefas, e facilitar nos processos de diagnósticos de doenças em geral. Os sistemas especialistas contribuem na resolução de diversos problemas que antes eram resolvidos somente por especialistas, onde são munidos de uma base de conhecimento geralmente extraído de profissionais por meio de distintas técnicas, e de um conjunto de regras estruturadas de uma forma que simula o raciocínio humano. A construção de um sistema especialista é um processo árduo e bastante complexo tendo em vista que este sistema tem a necessidade de simular o conhecimento de um profissional especialista e gerar resultados com um determinado grau de certeza. Os SEs utilizam bases de conhecimentos, e são estruturados por um conjunto de regras que fazem a representação do conhecimento, e são utilizadas na forma SE-ENTÃO. Para criação deste trabalho foram adquiridos conhecimentos por meio de constantes questionamentos. Tendo também como referência os importantíssimos registros do Manual Diagnóstico e Estatístico de Transtornos Mentais (DSM-V) e a Classificação Internacional de doenças (CID-10). Como o público alvo do teste/avaliação imposta no protótipo são pré-adolescentes, houve a preocupação de trabalhar a linguagem de uma forma que esta pudesse se comunicar de um modo mais claro, acessível e compreensível, reduzindo a utilização de termos técnicos e exemplificando as situações para melhor entendimento. Junto a este trabalho foi realizado a técnica da comunicação visual, onde foi ilustrado de uma forma simples o conteúdo expresso nas perguntas, o que teve um resultado positivo constatado na validação pós-experimento da aplicação, onde os entrevistados apontaram que este recurso ajuda a compreender as perguntas e atuam como um facilitador. Ao aplicar o protótipo Expert OCD na Escola Básica Jardim das Avenidas CAIC, foi possível observar que a coordenadora da instituição teve preocupações iniciais em fazer uma seleção com alunos que já apresentavam algum tipo de dificuldade, como dificuldades no aprendizado, déficit de atenção, hiperatividade, ou crianças com problemas familiares. Algo que não seria necessário, uma vez que a aplicação é destinada para todos os perfis de pré-adolescentes, mas que também seria interessante por poder avaliar estes comportamentos relacionados às questões presentes no protótipo. Com isso pode-se reforçar a ideia de que este tipo de sistema pode trazer suas contribuições nos ambientes escolares. Onde o teste pode ser aplicado com os alunos, e para os que apresentarem indícios do transtorno , a instituição poder fazer a comunicação com familiares em forma de alerta, ou ainda realizar um encaminhamento para um psicólogo escolar para uma devida consulta. Com o aumento e com o grande volume já existente de informação que são manipuladas por profissionais da área da saúde em processos de diagnósticos e tratamentos diariamente, os sistemas especialistas vêm se tornando aliados e facilitadores para estas atividades atuando e auxiliando no apoio à tomada de decisões. Mesmo que os SEs tenham suas limitações, não atuando plenamente como um ser humano, pode oferecer diversos benefícios e contribuições. Podem ser observadas estas questões analisando desde o surgimento da computação o grande entusiasmo e interesse entre cientistas e profissionais da saúde em unir estas duas áreas, utilizando as tecnologias para solucionar problemas. Entretanto, durante o desenvolvimento deste projeto foram vislumbradas novas possibilidades para a continuidade deste trabalho. Para trabalhos futuros pode ser estudada e analisada a possibilidade da aplicação poder expandir o foco e abordar outros transtornos mentais. Assim como o Transtorno Obsessivo-Compulsivo, muitos outros transtornos causam impactos negativos na vida pessoal e social do portador, e o tratamento é fundamental. Outro aspecto seria validar a aplicação com profissionais da área saúde mental. Em questão de tecnologia, pensando em um meio de maior visibilidade e de melhor acesso, é recomendável estruturar a aplicação em uma tecnologia para web, possibilitando assim que a aplicação tenha um maior alcance, podendo ser utilizada por diferentes centros, ser facilmente localizada, e poder contribuir com mais pessoas."
}