{
    "Autor": "JOÃO CARLOS FREITAS DOS SANTOS",
    "Título": "COPAPE: COMPARTILHAMENTO ONLINE DE PLANO DE AULA E PLANO DE ENSINO",
    "Ano de publicação": 2019,
    "Local de publicação": "ARARANGUÁ",
    "Orientador(a)": "Prof. Dr. Vinicius Faria Cultmant Ramos",
    "Coorientador(a)": null,
    "Resumo": "A tecnologia hoje em dia está infiltrada na maioria das áreas da sociedade devido à facilidade que ela traz para solucionar problemas. Desta maneira a plataforma online tem o intuito de solucionar determinados problemas, sendo este, a carência de local para busca e alocação de planos de ensino e de aula , possibilitando o embasamento para produção de plano de ensino e de aula na disciplina estágio supervisionado das fases finais dos cursos de licenciatura. Esta plataforma permite compartilhar planos de ensino e de aula, disponibilizando o acesso dos mesmos para a comunidade online. Estes planos são desenvolvidos por alunos e validados por professores da Universidade Federal de Santa Catarina. Majoritariamente, estes professores estão envolvidos com as disciplinas de estágio supervisionado fornecendo consistência nas informações dos planos e materiais de apoio. Desta forma, não só os estudantes da universidade beneficianção desse sistema, mas tabém toda a comunidade de estudantes que queiram realizar busca por estes planos.",
    "Palavras-chave": "Plano de ensino; Plano de aula; Plataforma; Desenvolvimento Web.",
    "Introdução": "Com o avanço da tecnologia as informações estão há um click de distância, porém nem sempre são confiáveis, pois se o conteúdo não tiver referencial teórico ou correção especializada, ficará difícil basear -se nessas informações, especialmente se irá aplicá -las na área da educação, em forma de planos de ensino ou plano de aula para a fundamentação dos futuros professores. Devido ao grande número de informações encontradas na web, o usuário pode relatar dificuldades em certificar-se da qualidade do material, especialmente na parte de filtragem de dados, e o nível de confiabilidade dos planos. Diante disso, a coordenadora dos estágios supervisionados, sugeriu que fosse desenvolvido uma plataforma web para armazenar os planos de ensino e aula, feitos nas disciplinas de estágio obrigatório dos cursos de licenciatura da Universidade Federal de Santa Catarina. Dessa forma as informações contidas nos planos passariam pela avaliação crítica dos professores responsáveis, recebendo um feedback sobre os conteúdos, o que dará maior confabilidade ao programa. A postagem de planos na plataforma será restrita para alunos da universidade, porém a visualização dos planos irá ser aberto para toda a comunidade online, trazendo benefícios à todos os interessados nos conteúdos disponibilizados pelo sistema chamado COPAPE (compartilhamento online de plano de aula e plano de ensino). Outro ponto importante do sistema, é o enfoque em disponibilizar materiais de apoio como recurso educacional, esses materiais podem conter informações sobre os conteúdos que serão administrados ao longo da realização do plano. Esse material pode ser adicionado em vários formatos de arquivo, como vídeos, fotos, áudios, slides. Existem hoje, outros repositórios que disponibilizam materiais semelhantes ao desse projeto, como por exemplo o Portal do Professor, onde encontra-se uma variedade de materiais de apoio, entretanto, há um dificuldade na usabilidade, e na navegação, outro problema é a falta de relação entre os materiais extras específicos com os planos de aula e ensino. Diante de todos os pontos citados acima, a realização desse projeto visa atender às necessidades encontradas, tornando o sistema uma ferramenta de fácil manuseio.",
    "Conclusão": "Este projeto corresponde a uma fonte confiável de busca por materiais, sendo um meio facilitador na construção e alocação dos planos de aula e ensino para os alunos, que poderão contribuir com seus conhecimentos para todos que tiverem acesso. Sendo assim, ao longo do tempo e com o seu uso, o aplicativo disponibilizará de uma base de dados de tamanho exponencial, o qual irá possuir informações sobre os planos, como também materiais extras, que poderão auxiliar no desenvolvimento de futuros planos de aula e de ensino, por diferentes alunos de outras universidades, assegurando que suas fontes sejam válidas e coerentes, pois passaram por aprovações dos professores responsáveis. Para o aperfeiçoamento do sistema algumas melhorias devem ser realizadas, como por exemplo, uma interação com ID UFSC, aprimoramento do layout, realizar avaliações de interface, com objetivo de receber um feedback, e por fim realizar testes de escalabilidade."
}