{
    "Autor": [
        "Andrey Vieira Clemes",
        "Yuri de Freitas Santos"
    ],
    "Título": "DESENVOLVIMENTO DE UM JOGO EDUCATIVO SOBRE ALIMENTAÇÃO SAUDÁVEL E HIGIENE BUCAL",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profa. Dra. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Os jogos digitais, compreendidos como softwares de entretenimento audiovisual, estão cada vez mais conquistando espaço na sociedade, atraindo diversos olhares interessados nas possibilidades quanto a sua utilização nas demais áreas. Por sua vez, o desenvolvimento de EnzoChomp considera a viabilidade de agregar aos jogos conteúdo educacional, de tal modo que o conhecimento transmitido seja percebido naturalmente. Conceitualmente, o jogo aborda o tema de alimentação saudável e higiene bucal, assuntos que se complementam e são compreendidos como problemas sociais potenciais. A má alimentação, principalmente, afeta grande parcela da sociedade, eventualmente, inúmeros são os trabalhos de conscientização. Após a produção do jogo, uma pesquisa com alunos da Escola de Ensino Fundamental Rio dos Anjos, possibilitou, com o auxílio de um questionário, resultados muito satisfatórios quanto o uso de jogos como ferramentas transmissoras de conhecimento. Contudo, ainda há muitas outras possibilidades a serem exploradas e aperfeiçoadas afim de conseguir o sucesso desejado.",
    "Palavras-chave": "Jogos digitais. Alimentação saudável. Higiene Bucal. Aprendizagem.",
    "Introdução": "Com o passar dos anos, os jogos digitais foram adentrando cada vez mais no cotidiano das pessoas, na maioria das vezes como passatempos, hobbies e, até mesmo, como esportes eletrônicos. Assim como os jogos analógicos, estes também contam com a capacidade de entreter, criar desafios para os participantes, que terão de obedecer às regras propostas e, assim, obter resultados referentes ao esforço colocado (MELLO; ZENDRON, 2015). Entretanto, a principal característica que todo e qualquer jogo deve possuir é de ser divertido. Mello e Zendron (2015) ressaltam ainda que a indústria de desenvolvimento de jogos cresce exponencialmente, gerando receitas bilionárias, além de envolver diversos outros setores na concepção de aplicações inovadoras para atividades econômicas distintas. Um exemplo notório é a utilização de simuladores como instrumento de capacitação profissional, o que vem se tornando ainda mais dinâmico com a inserção da realidade virtual e aumentada. O setor de desenvolvimento de jogos digitais no Brasil tem se mostrado promissor. Segundo dados do BNDES (2017), uma pesquisa realizada com aproximadamente 150 empresas, mostrou que o faturamento no Brasil passou da casa de 1 bilhão de reais. A maior parte das empresas focam em jogos de entretenimento, procurando desenvolver para plataformas móveis (66%). Mesmo que os números se mostram positivos, ainda há desafios a serem superados, já que a maior fatia do mercado é de empresas que dependem de recursos próprios, além de possuírem dificuldades em encontrar investimentos. Os jogos digitais educativos são tentativas de desenvolver tecnologias que auxiliem de alguma forma no processo educacional de jovens e adolescentes, além de promoverem um novo nicho no mercado. Os jogos contemporâneos possuem características marcantes e que, talvez, sem elas, não fosse possível comover o grande público. Prensky (2012), compreende que a diversão é uma das principais características responsáveis por motivar a aprendizagem baseada em jogos digitais. Complementa, ressaltando a incrível versatilidade que os jogos possuem em se adaptar a diferentes temas, nos quais podem ser carregados de informações e, que se usados da maneira correta, acarretará numa aprendizagem muito eficaz. O potencial dos jogos em transmitir conhecimento possibilita a criação de um jogo educativo abordando o tema de alimentação saudável e higiene bucal. Dentro da área da saúde há diversas discussões sobre os problemas causados por uma má alimentação, consequência do excessivo consumo de alimentos com altos níveis de açucares, gorduras e sódio, levando o indivíduo a adquirir doenças como, por exemplo, diabetes e obesidade (TORAL; CONTI; SLATER, 2009). Com a higiene bucal não é diferente, os maus hábitos são os principais causadores das doenças bucais. Afim de evitar essa situação, é necessário que haja conscientização por parte da população. Segundo Santos, Rodrigues e Garcia (2003), a prevenção de doenças dentárias se dá com trabalhos educativos e a colaboração dos envolvidos. Ressa lta-se que as crianças são mais receptivas a esse tipo de conscientização, o que torna todo o trabalho desempenhado mais produtivo. Nesse contexto percebe-se, mais uma vez, o potencial dos jogos como um instrumento de aprendizagem.",
    "Conclusão": "O desenvolvimento e aplicação do jogo EnzoChomp foi satisfatório, ele consegue agregar valor educativo ao jogador e ao mesmo tempo ser divertido. A sua criação necessitou de muita criatividade para definir o funcionamento do jogo, desde suas primeiras concepções até a definição de regras e como o loop se comportaria de uma forma que fosse coesa. O conhecimento técnico dos desenvolvedores sobre jogos, em geral, contribuiu para que o design do EnzoChomp conseguisse agradar aos jogadores. Entretanto os pontos falhos discutidos no decorrer do capítulo anterior são reflexo da falta de experiência da equipe. As crianças que estavam presentes na aplicação, já possuíam uma base sobre o que era alimentação saudável e todos já estavam familiarizados com a escovação de dentes. Entretanto o conhecimento dos outros produtos para higienização bucal, não obteve um consenso de todos. A maioria desconhecia sobre o uso de enxaguante bucal e nem todos usavam fio dental. Infelizmente o questionário não possuía uma questão similar a 12º pergunta, com o enfoque no conhecimento sobre a higienização bucal para medir o aprendizado gerado nessa área. A efetividade do jogo foi comprovada pela aplicação tendo em sua maioria respostas positivas no questionário e um acontecimento inesperado durante a aplicação. Após um tempo de aplicação as crianças se ausentaram da sala para realizar um lanche, enquanto isso, o responsável pela aplicação preparava o questionário para o retorno das crianças. Para surpresa dele, no momento da volta das crianças para sala, elas rapidamente se aconchegaram para jogar o jogo novamente."
}