{
    "Autor": "Diogo Librelon",
    "Título": "Políticas públicas de fomento à ciência, tecnologia e inovação direcionadas para startups brasileiras de base tecnológica.",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo César Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "Nos últimos anos, o número das empresas chamadas Startups de base tecnológica no Brasil apresentou amplo crescimento. Os órgãos públicos, observando os resultados de crescimento deste setor, passaram a acreditar que, sem políticas incentivadoras, estas novas empresas perderiam a competitividade, consequentemente, a falta de representatividade diante dos outros países. Sobre esse contexto, acredita-se que o crescimento destas empresas origina-se de políticas para o fomento da inovação tecnológica em âmbito nacional. Essa pesquisa tem por objetivo identificar se as políticas públicas para o setor de CT&I causaram um impacto positivo sobre as o surgimento das empresas Startups. Para tanto, faz-se uma pesquisa bibliográfica dos marcos regulatórios que incentivaram o crescimento e o fortalecimento do setor de TI do Brasil. Além da análise qualitativa das recentes políticas públicas de incentivo às inovações descritas na Estratégia Nacional de Ciência, Tecnologia e Inovação 2012-2015 – ENCTI. Avalia-se também, os resultados do Programa Startup Brasil, previsto no Programa Estratégico de Software e Serviço de Tecnologia da Informação - TI MAIOR do Ministério da Ciência, Tecnologia e Inovação. A pesquisa alcançou resultados que mostram como a questão do incentivo pública continua sendo importante para fortalecer o cenário de competitividade no mercado das empresas Startups. Foi possível reunir informações sobre o movimento do empreendedorismo nacional, identificando o crescimento das empresas Startups brasileiras frente as últimas ações políticas direcionadas para CT&I.",
    "Palavras-chave": "Startups; CT&I; TI; Política; Públicas; Inovação.",
    "Introdução": "A prática do empreendedorismo ganhou destaque entre as ações comerciais mais importantes para o fortalecimento econômico de uma nação. Um exemplo a ser observado é o número de empresas instaladas e geradas no Vale no Silício. Uma região mundialmente conhecida por gerar empresas como a Google e Yahoo, resultados de sucesso, que mantêm suas raízes ligadas às ações empreendedoras de seus criadores (OLIVEIRA et al, 2013). Os órgãos públicos dedicados a contribuir com o crescimento econômico do Brasil viram-se com a missão de encontrar estratégias para alcançar o desenvolvimento de uma cultura empreendedora. No caso do Brasil, as principais políticas dedicadas a incentivar os empreendedores acontecem por meio do fomento da Ciência Tecnologia e Inovação. Ao longo dos últimos anos, o planejamento e a execução das políticas públicas direcionadas para o incentivo da CT&I mantiveram-se presente nas diferentes gestões governamentais do Brasil. Grande parte deste planejamento mantém como objetivo o financiamento de P&D no setor privado, fortalecimento da prática do empreendedorismo inovador e o desenvolvimento do setor de TI. Estas ações proporcionaram a aproximação do setor empresarial frente aos órgãos públicos e centros de pesquisa, criando um cenário científico e econômico favorável para a aparição de novas empresas de base tecnológica, especialmente as chamadas Startups. As empresas Startups surgem em ambientes que incentivam a prática do empreendedorismo, pois o modelo de negócio aplicado como estratégia para uma Startup almeja o desenvolvimento de produtos capazes de causar uma ruptura de inovação, impactando uma renovação ou reinvenção de serviços e processos das demais empresas no mercado. Tais características de funcionamento destas empresas, atraem os valores buscados por empreendedores que direcionam seus esforços para o desenvolvimento da inovação diante de padrões já estabelecidos. Suas ações causam um aumento sobre a competitividade entre as empresas já economicamente estáveis, levando à ocorrência de um ciclo de desenvolvimento de produtos e geração de inovação. Esse contexto modela um cenário novo e desafiador, que motiva para o desenvolvimento de novos conhecimentos sobre o tema, a partir de pesquisas científicas que analisem os esforços governamentais sobre o desdobramento das políticas aplicadas à CT&I, que causaram o fortalecimento do setor de TI no Brasil e o consequente crescimento das empresas chamadas Startups nacionais. Nesse sentido, esse estudo busca responder à seguinte questão: Qual a relação do movimento de crescimento das empresas chamadas Startups no país, com a existência de diversas estratégias, direcionadas para o setor de TI, formuladas pelas políticas públicas nacionais de incentivo à CT&I?",
    "Conclusão": "Em sua origem esse trabalho se propôs a responder à seguinte pergunta de pesquisa: Qual a relação do movimento de crescimento das empresas chamadas Startups no país, com a existência de diversas estratégias de políticas públicas para o incentivo da CT&I direcionadas para o setor de TI? Para traçar o paralelo de relação, entre as políticas públicas de CT&I direcionadas para o setor de TI e o crescimento das Startups no Brasil, na unidade 3.1, aplicou-se o levantamento bibliográfico que descreve os principais planos governamentais e marcos regulatórios que fortaleceram os dois setores. Na unidade 4.1, criou-se, para uma melhor visualização destas ações, uma linha do tempo que representa o avanço cronológico dessas políticas públicas, reforçando a premissa que, sem as ações sistemáticas de apoio desenvolvidas ao longo do tempo, hoje o setor de TI não teria a importância e as condições intrínsecas para gerar o movimento de criação e fortalecimento de empresas Startups. Como foi definido na unidade 3.6, as empresas Startups acontecem principalmente no desenvolvimento de inovações para o mercado de TI, pois foi em um cenário de explosão tecnológica que elas surgiram. Concluiu-se então, que os instrumentos públicos geraram uma grande influência no fortalecimento no setor de tecnologia, pois não deixaram faltar estratégias direcionadas, e como foi informado na seção 3.1, os fundos setoriais garantiram uma parcela de investimento direto necessários ao fortalecimento e incentivo para a área. As mais recentes políticas públicas descritas na unidade 3.2, apresentaram as características estratégicas que estão reservadas para o setor de TI para o período de 2012-2015. Como citado na unidade 3.4, o Programa TI MAIOR tem significativa importância em seus objetivos, para garantir a permanência e ampliação dos esforços que durante décadas o Brasil desenvolve para implementar de forma competitiva a cadeia das áreas tecnológicas. Identificou-se que, pela primeira vez na história das políticas públicas para o setor de CT&I, as empresas Startups foram incluídas como um dos alvos de incentivo público, por meio do Programa Startup Brasil. Na unidade 3.7, concluiu-se que o modelo de \"ecossistemas empreendedores\", validado pela OCDE, serviu de guia para a prática de fortalecimento e replicações de conhecimentos que constroem uma economia empreendedora. Com as informações apresentadas na unidade 3.4 concluiu-se que o modelo de gestão estratégico do programa Startup Brasil, utilizou-se das mesmas estratégicas que foram definidas no modelo desenvolvido por Insenberg (ecossistemas empreendedores), apresentadas na unidade 3.7. Este fato mostra o bem que a gestão estratégica, que orienta a formulação de políticas de inovação do país, como o programa STARTUP BRASIL, segue as tendências internacionais para políticas públicas consistentes e efetivas. Na unidade 3.6, uma variável teórica de extrema importância para o desenvolvimento desta pesquisa foi analisada: a definição sobre a existência e as características das empresas Startups. Os fatos analisados comprovaram a criação e a popularização desta categoria de empresas no mundo, a partir do estudo sobre formulações de autores consagrados da área sobre a definição de uma empresa Startup. Neste contexto, buscou-se pelo método bibliográfico, reunir material de caráter científico para apresentar o cenário econômico destas empresas. Assim, a taxa de crescimento sobre o número de unidades ativas no Brasil pode ser apresentada mostrando a dinâmica do setor. Na unidade 4.3, a pesquisa desenvolvida pelo IBGE sobre o cenário econômico empreendedor do Brasil foi utilizada como o principal documento de referência para o levantamento dos dados sobre as empresas Startups nacionais. Apesar da pesquisa do IBGE não adotar o termo Startup para a classificação das empresas empreendedoras, concluiu-se que, a descrição do grupo de empresas categorizadas dentro da pesquisa como empresas Gazelas 5 e 8, apresentam as mesmas características de modelo de negócio, idade e padrão de crescimento, definidos na unidade 3.6, como as características de empresas Startups. Isso tornou possível a construção do Quadro 1 - Crescimento das empresas Gazelas 5 e 8, apresentando o número estimado de Startups no Brasil, comprovando a existência de uma taxa de crescimento de 12%, no período de 2009 à 2011 e uma forte tendência de fortalecimento desta categoria empresarial. Portanto, à luz da análise dos dados, pode-se afirmar que a base de sustentação das atuais políticas públicas, direcionadas para o setor de TI e empresas Startups, alcançaram uma participação significativa na formação do cenário econômico, pois a constante articulação governamental, desenvolvida ao longo dos anos, para a evolução do Sistema Nacional de Inovação, foi objetiva em pontos cruciais para o fomento da inovação tecnológica no país. Conclui-se então, com os fatos relatados acima, a existência de uma forte relação entre a modernização e a criação de políticas públicas de CT&I direcionadas para o setor de TI e o atual crescimento de empresas Startups de base tecnológica - que hoje possuem novas políticas públicas direcionadas para o seu fortalecimento. Para trabalhos futuros, recomenda-se um acompanhamento das empresas Startups que foram aceitas no programa STARTUP BRASIL, para que assim identifique-se as empresas que obtiveram sucesso. Com isto é possível mensurar os principais pontos fortalecidos, recorrentes do apoio do programa. Assim, perante a observação e registro de depoimentos dos empreendedores, uma análise possa ser desenvolvida para concluir, se realmente o programa atendeu as expectativas, para alcançar a solidificação das Startups contempladas. Tornando possível um retorno de informações, para novas políticas públicas deste segmento desenvolvidas futuramente."
}