{
    "Autor": "Eduardo Presa",
    "Título": "PROPOSTA DE UM SISTEMA DE LOCALIZAÇÃO INTERNA PARA O AMBIENTE UNIVERSITÁRIO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Luciana Bolan Frigo",
    "Coorientador(a)": "Prof. Vilson Gruber, Dr.",
    "Resumo": "O sistema de posicionamento global (GPS) é uma ferramenta bastante popular e utilizada por boa parte dos usuários de dispositivos móveis, principalmente, pelos usuários de smartphones para o cálculo de rotas e indicação de localização. Esta tecnologia tem se mostrado muito eficiente para ambientes abertos, mas não apresenta o mesmo desempenho em ambientes fechados como no interior de prédios e casas. O objetivo desta monografia é de estudar as principais tecnologias disponíveis ao público em geral, para elaborar um protótipo que seja economicamente viável para a implementação de um sistema de localização interna para um campus universitário.",
    "Palavras-chave": "Geolocalização; Localização interna; Código de barras",
    "Introdução": "O termo Sistemas de Informação Geográfica (SIG) é aplicado para sistemas que realizam o tratamento computacional de dados geográficos e recuperam informações não apenas com base em suas características alfanuméricas, mas também através de sua localização espacial (Câmara e Ribeiro, 2014). Há uma ampla gama de aplicações que incluem áreas como agricultura, florestal, cartografia, cadastro urbano e redes de concessionárias. Existem pelo menos três maneiras de se utilizar um SIG: (i) como ferramenta para produção de mapas; (ii) como suporte para análise espacial de fenômenos; (iii) como um banco de dados geográfico, com funções de armazenamento e recuperação de informação espacial. Esta última é a definição que se enquadra neste trabalho.\n\nNa Europa, o geolocalizador já é utilizado em diversos aeroportos e shoppings. A perspectiva é que nos próximos anos, 85% dos sistemas de navegação sejam representados por smartphones e até 2014 serão 800 milhões de novos aparelhos em circulação pelo mundo, segundo pesquisa realizada pela Ptolemus Consulting Group (AGÊNCIA IN,2013).\n\nEstes sistemas estão mais presentes no nosso cotidiano de forma que muitas vezes nem percebemos, a partir de um dispositivo móvel conectado à internet é possível dizer o local de origem geográfica do mesmo, isto é a geolocalização e, geralmente faz uso do endereço IP do equipamento podendo informar o país, a cidade e a rua que este dispositivo está localizado juntamente com o horário em que esta verificação aconteceu.",
    "Conclusão": "Através da pesquisa realizada foi apresentada uma solução para o desenvolvimento de um sistema de geolocalização interna da UFSC – Campus Araranguá que atenda a realidade encontrada no ambiente do campus. Os modelos de engenharia de software auxiliam no planejamento de projetos de aplicações, onde ocorrem muitas mudanças. A modelagem dos casos de uso se mostrou importante na definição das funcionalidades e na descrição dos cenários, contribuindo assim com aplicação do trabalhos futuros. O processo evolucionário com prototipação assegura uma melhor especificação da solução. A escolha das tecnologias pesquisadas na seção 2.2 foi feita com base na infraestrutura atual do campus. No entanto, a construção do sistema protótipo não foi realizada devido à falta de cobertura da rede Wi-Fi em vários setores da universidade, o que comprometeria o uso do sistema. A utilização do QR-Code se mostra bastante satisfatório para o atendimento das necessidades explicitadas e testado na seção 3.5. O estudo apresentado nesta monografia cumpriu com os objetivos firmados, deixando claro que há grande vantagem com o uso de metodologias de acordo com tamanho da aplicação e com o aproveitamento das tecnologias já existente na infraestrutura. E este trabalho mostra que a maior parte das soluções conhecidas, até o presente momento, ainda são extremamente dependentes de uma infraestrutura local o que impossibilita o uso massivo das soluções apresentadas."
}