{
    "Autor": "Rafael Damiani Alves",
    "Título": "PREDIÇÃO DO DESEMPENHO DA REDAÇÃO DO ENEM UTILIZANDO TÉCNICAS DE MINERAÇÃO DE DADOS",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Cristian Cechinel",
    "Coorientador(a)": "Me. Emanuel Marques Queiroga",
    "Resumo": "O avanço das tecnologias da informação e comunicação tem proporcionado o armazenamento de bases de dados cada vez maiores. Devido a isso, as diversas técnicas de mineração de dados vêm sendo utilizadas para realizar descoberta de padrões que permitem a melhoria em muitas áreas, bem como vantagens competitivas, quando a mesma é aplicada sobre bases de dados comerciais. As técnicas de mineração de dados podem ser empregadas em quaisquer áreas, porém em algumas áreas como Marketing, Detecção de fraude, Investimentos financeiros, essas técnicas vêm sendo utilizadas com mais regularidade. A mineração de dados educacionais (EDM) é uma das diversas linhas de pesquisas da mineração, sendo a responsável pela descoberta de informações (KDD) em bases de dados que contém informações acadêmicas. Desta forma esse trabalho propõe-se a encontrar padrões e gerar um modelo preditivo do indicador de desempenho das notas da prova de redação referentes aos dados educacionais do Exame Nacional do Ensino Médio (ENEM) de 2016. Neste contexto, foram feitos experimentos onde os dados foram categorizados, para obter um melhor resultado na aplicação dos algoritmos. A classe predita foi a nota da redação que foi categorizada como: baixo, médio, alto e nulo. Os modelos finais foram treinados e testados por meio dos algoritmos: Naive Bayes e J48. Esses algoritmos foram utilizados através do pacote de software WEKA. Por meio da utilização dessas técnicas de mineração de dados, o modelo com o maior desempenho conseguiu prever 61.7464% das amostras presentes na base de dados do ENEM 2016.",
    "Palavras-chave": "Mineração de Dados, Dados educacionais, ENEM, Modelo preditivo.",
    "Introdução": "O Exame Nacional do Ensino Médio (ENEM), segundo INEP (2018), se trata de uma avaliação criada e aplicada pelo Ministério da Educação para mensurar a performance dos estudantes que completaram o ensino médio. A prova do ENEM é subdividida em 4 áreas, são elas: Ciências Humanas e suas Tecnologias, Ciências da Natureza e suas Tecnologias, Linguagens, Códigos e suas Tecnologias, Matemática e suas Tecnologias. Conforme INEP (2018) além destas 4 áreas também é realizada uma prova para avaliação da competência de redação. É nessa prova que esse trabalho de conclusão de curso (TCC) tem o intuito de prever o desempenho dos alunos, através da mineração de dados. Segundo Fayyad et al. (1996), as áreas científicas, governamentais, corporativas vem gerando um grande aumento nos seus bancos de dados, devido a isso se torna difícil analisar estes dados, necessitando da utilização de novas ferramentas e técnicas para análise automática e inteligente de bancos de dados. Devido a esse contexto, conforme Luan (2007), a mineração de dados pode ser utilizada para descoberta de tendências e padrões ocultos, com base nesses resultados gerados pela mineração de dados, os analistas e estudiosos da área podem analisar os mesmos e tomar decisões mais precisas, podendo focar a atenção nos pontos ou casos mais críticos e específicos. Além das áreas já descritas nesse trabalho de conclusão de curso, segundo Romero e Ventura (2010) outra área que vem produzindo um grande volume de dados é a educação, devido a isso surgiu uma nova área de estudo da mineração de dados chamada de mineração de dados educacionais (MDE). De acordo com Romero e Ventura (2010) mineração de dados educacionais é um segmento de pesquisa interdisciplinar que possui métodos para estudar dados originados a partir do cenário educacional. Tendo em vista que o ENEM é um dos exames que mais mobilizam os estudantes, e que vem ocorrendo um crescimento em relação a MDE e a evolução de suas técnicas, identificou-se uma oportunidade para uma pesquisa nessa área.",
    "Conclusão": "Podemos notar que apesar do crescimento na realização de pesquisas na área de mineração de dados educacionais, ainda é uma área que necessita ser mais explorada e estudada. Uma prova disso é que não se encontrou trabalhos com uma problemática bem próxima da desse trabalho, apesar de como relatado anteriormente, as redações do ENEM serem decisivas para o desempenho final do candidato e serem uma das maiores preocupações de alunos e professores. Através dos modelos de predição gerados nesse trabalho conclui-se que é possível prever com um mínimo de exatidão o desempenho dos alunos na redação do ENEM. Porém destaca-se que é necessário trabalhos futuros voltados ao mesmo assunto e objetivo desse trabalho de conclusão de curso, para que se possa evoluir significativamente os modelos de predição. As variáveis que mais causaram impacto foram praticamente as mesmas para os dois experimentos realizados, o que leva a crer que os gestores e especialistas da área da educação devem analisar as mesmas. Ainda em relação as variáveis destaca-se que as mesmas precisam ser coletadas de uma forma mais eficiente, tendo em vista que muitas vezes os candidatos deixaram em branco as perguntas do questionário socioeconômico. Para trabalhos futuros, julga-se importante a integração da base de dados utilizadas nesse trabalho com outras bases, para que as mesmas possam agregar em relação a novos atributos, onde os mesmos podem ajudar a aumentar o desempenho dos modelos preditivos. O objetivo principal desta pesquisa foi realizar um estudo e aplicar as técnicas e métodos de mineração de dados, para gerar modelos para predição do desempenho da redação do ENEM, por meio dos microdados do ENEM 2016 e algoritmos de classificação como o J48 e o Naive Bayes, e também gerar árvores de decisão. Baseado nisso, esse trabalho buscou auxiliar na melhora do desempenho dos alunos na prova de redação, por meio de modelos para predição do desempenho da redação do ENEM."
}