{
    "Autor": "Fernanda Yumeka Ogawa",
    "Título": "ANÁLISE E DEFINIÇÃO DO PERFIL EMPREENDEDOR DE ALUNOS DO ENSINO SUPERIOR E A INFLUÊNCIA DA UNIVERSIDADE NA SUA FORMAÇÃO: O CASO DA UFSC CAMPUS ARARANGUÁ.",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho aborda o fenômeno do empreendedorismo na Universidade Federal de Santa Catarina, no Campus Araranguá. Trata-se de um tema de interesse dos jovens universitários, que diante da complexidade do contexto contemporâneo e das incertezas do sistema econômico vislumbram uma possibilidade de futuro no seu negócio próprio. Nesse contexto, a universidade assume um papel fundamental, uma vez que, promove um ambiente de agregação de valor econômico e social, que estimula o espírito crítico e empreendedor dos seus alunos. Portanto, para desenvolver esta pesquisa foi utilizado o estudo de caso, a partir de uma abordagem de pesquisa de natureza qualitativa e exploratória. Esse estudo de caso investigou o perfil empreendedor dos alunos do Campus Araranguá, permitindo identificar no perfil desses alunos a presença de 81,3% das principais características do empreendedor. Participaram 11% do censo de 1058 alunos matriculados no Campus, que equivalem a 117 acadêmicos, estes estão distribuídos entre os Cursos de Engenharia de Computação, Engenharia de Energia, Fisioterapia e Tecnologias da Informação e Comunicação. Assim, foi confirmada a existência do perfil empreendedor dos alunos nessa instituição e a influência que a universidade agrega sobre os mesmos em seu processo de formação empreendedora.",
    "Palavras-chave": "Empreendedorismo; Perfil empreendedor; Universidade.",
    "Introdução": "O tema empreendedorismo está sendo utilizado intensamente nos dias de hoje, a sociedade vivencia uma época que há constantes transformações, gerando inovações que impactam, fortemente, o crescimento econômico das empresas e da nação. Esse processo faz com que o perfil empreendedor seja essencial para acompanhar o desenvolvimento do país e o mercado de trabalho. Por esse motivo, a cultura empreendedora tem se disseminado com muita rapidez e as universidades têm contribuído muito nesse processo, pois são responsáveis por oferecer uma educação que contempla a formação de um cidadão crítico e sua preparação para o mercado de trabalho, quer seja, como um colaborador ativo no quadro de uma organização ou, como um empreendedor que se lance no desafio de criar uma nova empresa. Nos últimos anos, a necessidade de mudanças rápidas de ideias e de atitudes em todas as áreas do conhecimento e das profissões exige tanto a disseminação como a gestão da cultura do empreendedorismo. Desde modo, aumentou consideravelmente a produção teórica sobre o empreendedorismo, com a realização de diversos estudos que formulam diversas ideias e conhecimentos que colocam em evidencia o perfil empreendedor. Sendo assim, essa pesquisa vem para agregar ao tema, pois a universidade assume um papel fundamental perante a sociedade, pois gradua profissionais que podem contribuir, de forma capacitada, para o desenvolvimento desse processo e o universitário nesta fase está apto novos conhecimentos. Neste sentido, o empreendedorismo e a universidade caminham unidos para o surgimento e consolidação de ações empreendedoras. Para ter uma dimensão do perfil empreendedor dos alunos que estão sendo preparados pela universidade é imprescindível uma avaliação científica do seu grau de empreendedorismo. Foi esse contexto que motivou a realização de uma pesquisa com os alunos dos 04 cursos de graduação ofertados pelo Campus Araranguá, da Universidade Federal de Santa Catarina, que busca definir o perfil empreendedor dos alunos do Campus.",
    "Conclusão": "O objetivo da pesquisa foi Análise e Definição do Perfil Empreendedor de Alunos do Ensino Superior e a influencia da universidade na sua formação: O Caso da UFSC Campus Araranguá. De acordo com os objetivos específicos, iniciou-se o estudo com a identificação da literatura para ampliar o entendimento do tema, sendo realizada uma analise histórica sobre o conceito de empreendedorismo; a manifestação do tema no Brasil; a definição e caracterização do perfil empreendedor; e o vinculo do empreendedorismo com o ensino superior. Com a revisão foi possível analisar os conceitos e sua interação com processo de inovação, assim foi permitido realizar a pesquisa do perfil empreendedor dos alunos do Campus Araranguá/ UFSC. Este estudo identificou a predominância do perfil empreendedor no Campus. De um censo 117 participantes, 81,3% manifestaram ter as principais características de um empreendedor, segundo apresentado na literatura analisada. Notou-se também que, a universidade influi nas características empreendedoras do aluno durante o seu processo de formação. Ao iniciar o ensino superior, o estudante já se depara com uma das características do empreendedor que é a de cumprir metas, durante o seu período de formação na graduação. A universidade como geradora de conhecimento, agrega ao aluno valores sociais e conhecimentos técnicos, que são outras características reconhecidas como do empreendedor. A universidade avalia no transcorrer dos cursos essa agregação de novos valores que inclui aspectos quanto à dedicação, persistência, comunicabilidade, liderança etc. É nesse tempo que desperta no aluno as características ligadas à sua personalidade, de acordo com seu autocontrole, autoconfiança, reconhecimento dos seus pontos fortes e fracos, como se posicionar perante um conflito, gestões e opiniões, etc. No final da investigação ficou mais evidente a importância da universidade no processo de construção do perfil empreendedor e também o papel dinâmico dos alunos, que de forma interativa com a ação da universidade contribuem para a formação e disseminação da visão empreendedora. A pesquisa evidencia que ainda há muito que estudar sobre o tema e entender sobre o empreendedorismo e a ação da universidade. Esta pesquisa contribui para a formação do conhecimento sobre empreendedorismo, especialmente, para compreender o papel da universidade como organização responsável por colaborar de forma ativa no processo de desenvolvimento da região Sul de Santa Catarina."
}