{
    "Autor": "José Pedro Schardosim Simão",
    "Título": "RELLE: SISTEMA DE GERENCIAMENTO DE EXPERIMENTOS REMOTOS",
    "Ano de publicação": "2015",
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Prof. Dr. Juarez Bento da Silva",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho trata do desenvolvimento de um sistema de gerenciamento de experimentos remotos, utilizando uma arquitetura baseada em módulos de hardware e software capazes de oferecer a usuários acesso remoto à laboratórios em diversas áreas do conhecimento. A solução foi concebida utilizando uma arquitetura baseada em soluções open source e de baixo custo, e que podem ser utilizados em diferentes níveis de ensino. A arquitetura é baseada em quatro módulos: o Laboratório Real, que trata dos experimentos, Computador Embarcado, que compreende a parte de disponibilização do experimento na rede, RELLE, que é o sistema de gerenciamento, e Cliente, que trata do modelo de acesso utilizado para manipulação dos experimentos. O trabalho foi desenvolvido em três fases nomeadas Planejamento, Protótipo, e Validação, baseadas no método Merise, que é uma metodologia que aborda todas as fases do desenvolvimento de sistemas de informação. O cliente para comunicação com os experimentos foi desenvolvido utilizando o framework PHP Laravel junto ao framework CSS Bootstrap. No desenvolvimento do cliente foi utilizada a metodologia ágil para desenvolvimento de software Scrum. O cliente pode ser acessado através de dispositivos móveis ou convencionais, e tem funções de gerenciamento de usuários e experimentos, além de integração com o ambiente virtual de aprendizagem Moodle, que fornece suporte documental e didático aos experimentos. O ambiente foi avaliado por especialistas da área de educação e tecnologias e experimentação remota, e foi aplicado em turmas experimentais no ensino básico e superior.",
    "Palavras-chave": "Laboratórios Remotos, Sistemas de Gerenciamento, E-Learning.",
    "Introdução": "É generalizada a preocupação com a escassez de profissionais nas áreas STEM. Segundo o relatório STEM: Country Comparisons, publicado pelo Australian Council of Learned Academies estas áreas têm sido preocupação central dos governantes e políticos em todo o mundo, pelo fato de gerarem benefícios econômicos diretos na medida em que ajudam a formar mão de obra qualificada. (ACOLA, 2013) No Brasil, segundo o Conselho Federal de Engenharia, Arquitetura e Agronomia – Confea (2015), estima-se que há um déficit de cerca de 20 mil engenheiros por ano. Já quanto aos profissionais de tecnologia, a Associação Brasileira das Empresas de Tecnologia da Informação e Comunicação – Brasscom (2013) diz que o setor deverá criar mais de 750 mil novas vagas de trabalho no Brasil até 2020. Esta realidade é ainda mais preocupante quando confrontada com os índices de matrícula e conclusão de cursos superiores no Brasil. Segundo o INEP (2014), o último censo da educação superior realizado em 2012 mostra que o número de concluintes em cursos das áreas STEM, para cada 10.000 habitantes, pode ser aproximadamente 12 vezes menor do que de alunos matriculados, conforme mostra o Gráfico 1. A carência na infraestrutura das instituições públicas de educação básica é um outro fator que pode afetar estes índices. Os dados do censo da educação básica brasileira, realizado pelo INEP (2015), apontam que no ano de 2014 as escolas contavam com a seguinte infraestrutura de suporte ao ensino: Internet (61%); Banda Larga (51%); Laboratórios de Informática (45%); Laboratórios de Ciências (11%); Média de computadores por escola para uso dos alunos (8.85). Neste contexto, a experimentação remota pode ser utilizada como ferramenta de apoio ao ensino e aprendizagem nas disciplinas STEM, como forma de amenizar os problemas de infraestrutura.",
    "Conclusão": "Este trabalho apresentou uma iniciativa de desenvolvimento de um sistema de gerenciamento de experimentos remotos baseado em módulos, com garantia de acesso exclusivo. No decorrer do desenvolvimento desta pesquisa, pôde-se perceber a ausência de ferramentas flexíveis para o gerenciamento de experimentos remotos. Assim, foi desenvolvida uma interface de criação e utilização de experimentos remotos e análise dos dados de utilização, com funcionalidades de criação e gerenciamento de usuários. Também foi criada uma interface de análise dos dados de utilização do sistema, e após a realização testes de performance e validação da plataforma, o código-fonte foi disponibilizado sob licença MIT em repositório público na internet. A solução aqui descrita pode melhorar a experiência de uso de experimentos remotos, uma vez que há um maior controle sobre os usuários e o tempo utilizado para cada experimento. Além disso, a fila garante que um usuário não possa interferir em uma experiência em andamento, o que prejudicaria os resultados. A utilização desta ferramenta vem atender a demanda crescente de usuários dos recursos disponíveis no RExLab, tornando o procedimento de utilização dos experimentos mais seguro e escalável. O desenvolvimento de soluções de baixo custo, fazendo uso de ferramentas de hardware e de software aberto é importante quando consideramos as diferentes realidades na educação. A solução apresentada pode ser facilmente replicada ou personalizada por outros desenvolvedores ou instituições de ensino. A partir dessas possibilidades, como trabalhos futuros se destacam a implementação de um sistema de filas utilizando Websocket, bem como uma API REST e WebSocket webservices. Estes aspectos poderiam tornar os experimentos disponíveis para um maior número de clientes, e consequentemente mais alunos. Além disso, uma análise nos termos de usabilidade e experiência do usuário são necessárias, assim como melhorias de acessibilidade e criação de conteúdo multimídia integrado à página do experimento. Nesse sentido, como trabalho futuro pode ser implementado um estudo com os professores e alunos que utilizaram o sistema nas turmas experimentais."
}