{
    "Autor": "Francielle da Cruz Medeiros Alves",
    "Título": "Uma proposta para utilização dos óculos de realidade virtual no processo de ensino-aprendizagem",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá, Santa Catarina",
    "Orientador(a)": "Profª Drª Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "O desenvolvimento das tecnologias educacionais tem refletido sinais de interatividade e inovação dentro de salas de aula nos mais diversos níveis de formação acadêmica. Uma das novas tecnologias que vem ganhando destaque no setor de interatividade são os óculos de realidade virtual (RV) que proporcionam para o usuário a sensação de estar de fato no lugar cujo a imagem é projetada nos óculos. Este trabalho de conclusão de curso visa a elaboração de um estudo que vai de encontro ao tema mencionado utilizando os óculos de realidade virtual como ferramenta de ensino, concatenando interatividade e aprendizagem. Esse estudo foi realizado através de um projeto piloto onde um professor do ensino médio de uma escola pública utilizou os óculos de realidade virtual como ferramenta auxiliadora durante a ministração de suas aulas. Foram então avaliados os resultados, repercussões e efeitos.",
    "Palavras-chave": [
        "Óculos de realidade virtual",
        "realidade virtual",
        "tecnologias educacionais",
        "educação"
    ],
    "Introdução": "A revolução tecnológica dos últimos tempos salienta o poder e fugacidade com que se propagam os avanços tecnológicos, remodelando a maneira como vemos o mundo e como com ele interagimos. O futuro que em épocas passadas imaginávamos e sonhávamos, se faz real hoje superando quaisquer expectativas e anseios, as realizações pessoais que crianças e jovens buscavam se limitava a uma realidade engessada conforme aquilo que era conhecido, o que hoje buscamos é grandioso e transcende o impossível. Contemplamos o avanço como uma realidade eminente, em inúmeros ramos de estudo e pesquisa como a medicina, ciência, e até mesmo agricultura, temos a oportunidade de evoluirmos mais rapidamente à medida que nos permitirmos fazer parte deste contexto, a tecnologia assume então papel principal na produção da realidade e do imaginário. Por intermédio de sutis ferramentas tecnológicas, deparamo-nos com variações produtivas no método em que professores de todo o mundo ministram suas aulas, a tecnologia tem contribuído abundantemente para um desenvolvimento surpreendente no âmbito educacional e se faz presente dentro e fora de sala de aula. Dirigindo-se ao encontro de tal inovação, manifestam-se os óculos de realidade virtual (RV) como potencial ferramenta de auxílio para professores utilizarem em sala de aula, objetivando proporcionar sensações jamais vivenciadas pelos alunos, conforme defendido por Cordeiro (2016) “Desfrutamos hoje de uma capacidade tecnológica que por si só, já nos leva para o caminho de um desenvolvimento, de forma exponencial”. Na prática, a RV permite que o usuário navegue e observe um mundo tridimensional, em tempo real e com seis graus de liberdade (6DOF). Isso exige a capacidade do software de definir, e a capacidade do hardware de reconhecer, seis tipos de movimento: para frente/para trás, acima/abaixo, esquerda/direita, inclinação para cima/para baixo, angulação à esquerda/à direita e rotação à esquerda/à direita. Na essência, a RV é um “espelho” da realidade física, na qual o indivíduo existe em três dimensões, tem a sensação do tempo real e a capacidade de interagir com o mundo ao seu redor. Os equipamentos de RV simulam essas condições, chegando ao ponto em que o usuário pode “tocar” os objetos de um mundo virtual e fazer com que eles respondam, ou mudem, de acordo com suas ações (VON SCHWEER, 1995). Podemos assumir a tecnologia como meio facilitador para auferir objetivos, através de um projeto com objetivo específico, podemos nos usufruir de recursos ilimitados para alcançarmos tal meta. Devido ao crescimento exponencial e massificação das tecnologias, o custo de produção e comercialização vem diminuindo gradativamente popularizando e democratizando a modernização para todos os níveis sociais e econômicos. Em 1965 surge a Lei de Moore através de um conceito estabelecido por Gordon Earl Moore, e especifica que a capacidade de memória e poder de processamento computacional dobra a cada dezoito meses, enquanto o preço cai proporcionalmente (FUSCO, 2009). Como disse o escritor Arthur C. Clarke “qualquer tecnologia suficientemente avançada não se distingue da mágica”, vivemos um momento ímpar e obrigamo-nos a desfrutar de tal ocasião. No presente trabalho visamos apresentar que inovação tecnológica e o processo de ensino aprendizagem podem de fato trabalhar juntos e impactar o método como ensinamos e aprendemos.",
    "Conclusão": "As novas tecnologias vêm crescendo e ganhando espaço nos mais diversos setores, inclusive no setor educacional, onde destacam-se escolas e universidades incentivando seus professores a inovarem e usufruírem dessa tecnologia dentro da sala de aula. Mediante a este trabalho observamos a utilização de 3 (três) metodologias diferentes para aplicação da mesma atividade: sem o uso de quaisquer tecnologias em sala de aula, utilizando o aparelho celular e empregando realidade virtual, e analisamos a interação dos alunos com o tema proposto e suas respectivas reações ao longo da aula. A problemática que foi utilizada como base para o trabalho foi: “Quais são as possíveis evoluções em potencial da utilização dos óculos de realidade virtual como ferramenta no processo de ensino aprendizagem?”, e foi sanada através do projeto e a presente proposta desenvolvida, apontando os óculos como uma ferramenta de grande eficácia, baixo custo e que proporciona alto índice de interatividade com os alunos. Após uma pesquisa de mercado foi definido quais seriam os óculos utilizados fundamentado no modelo que propiciava o melhor custo x benefício. Por intermédio do trabalho realizado, ficou evidente que quando o professor aplica tecnologia para ensinar em sua aula, os alunos interagem e ficam muito mais envolvidos e entusiasmados com o conteúdo estudado. O uso da realidade virtual ganha destaque pois se torna um meio de baixo custo e viável enquanto recurso para auxiliar os professores durante sua aula. Durante a realização das atividades foram feitos experimentos onde os alunos precisavam dividir a ferramenta virtual com suas duplas, em trios, e em grupos de 5 e de 6 alunos, e foi constatado que quando elevamos o número de usuários por óculos existe uma grande possibilidade de que alguns alunos se distraiam durante a aula e percam um pouco o foco, portanto a recomendação é que os óculos sejam utilizados por no máximo grupo com até 3 alunos. O ideal é que cada escola possa fazer uma aquisição de 10 óculos de realidade virtual para que seus professores possam utilizar em suas aulas. O custo médio de cada óculos é 30 reais, totalizando um investimento de 300 reais, pois os aparelhos celulares utilizados nas expedições são dos próprios alunos. Os óculos possuem boa durabilidade e podem ser utilizados para trabalhar também com realidade aumentada."
}