{
    "Autor": "Gabriel Linardi",
    "Título": "UM MODELO DE DADOS ABERTOS APLICADO EM UM CENÁRIO GOVERNAMENTAL",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": "",
    "Resumo": "Nos últimos anos a disseminação da informação, pública ou privada, em formato padronizado vem ganhando importância. Isto gera demandas principalmente em cenários governamentais onde a transparência das ações públicas é cada vez mais exigida pela sociedade. Para tal, torna-se necessário o estabelecimento de modelos abertos de dados que permitam o compartilhamento e a integração com fontes de informação diversas. Entre estes modelos encontra-se o baseado em triplas, ou seja, Sujeito, Predicado e Objeto, sendo o RDF (Resource Framework Description) um dos mais utilizados. Além da disponibilização deve-se considerar a infraestrutura para o armazenamento e consulta dos dados, bem como, para possibilitar o desenvolvimento de aplicações variadas. Este trabalho propõe um modelo de dados em formato aberto capaz de representar uma fonte de informação governamental. A fonte escolhida foi o Site DivulgaCand disponibilizado pelo Tribunal Superior Eleitoral que possibilita a qualquer pessoa consultar os registros de candidatura da eleição de 2012. Tais informações estão disponíveis, mas não em formato recomendado para dados abertos. Para viabilizar a carga do modelo proposto foi desenvolvido um protótipo que de maneira genérica efetua a leitura de uma fonte de dados origem e transfere as informações para uma base de dados triplificada. O desenvolvimento do trabalho permite assim afirmar que, apesar da iniciativa de dados abertos não ser algo tão recente, faltam exemplos principalmente no meio privado. Conclui-se também que existe, a partir dos dados abertos, potencial para o desenvolvimento de serviços com impacto na sociedade. Mais especificamente em relação ao modelo proposto, o mesmo se mostra adequado e capaz de responder a perguntas em linguagem apropriada permitindo assim um melhor entendimento do domínio de registro de candidaturas.",
    "Palavras-chave": "Dados Abertos; Dados Abertos Governamentais; Resource Description Framework; Tripla RDF.",
    "Introdução": "A internet atual pode ser definida como a Web Sintática. Nesta rede os computadores fazem apenas a apresentação das informações, porém o processo de interpretação é de responsabilidade de cada pessoa que deseja utilizar esses conteúdos. O processo de interpretação é algo muito mais difícil e trabalhoso e requer um grande esforço para avaliar, classificar e selecionar as informações de que se tem interesse. Sendo assim, chega-se a seguinte questão: Por que os computadores não podem executar serviços de interpretação? A razão da dificuldade de interpretação de informações pelas máquinas é por não possuírem informações suficientes que as descreva semanticamente de modo que interpretações possam ser realizadas. Como exemplo pode-se citar as consultas realizadas atualmente através de mecanismos de busca tradicional, a o se pesquisar por “Jaguar” o usuário recebe a página de maior relevância, mas este resultado não considera o real desejo do usuário, pois “Jaguar” pode ser um animal ou um carro. Deste modo, no atual estágio de tecnologia os computadores têm a função de direcionamento e entrega de informações, não sendo capazes de analisar de maneira mais ampla o conteúdo das páginas, uma vez que as informações estão estruturadas para serem utilizadas por pessoas e não por máquinas. Este é um dos motivos pela qual se enfrenta dificuldades quando se realiza uma consulta sobre determinado assunto e o que realmente se procura não é encontrado de modo fácil e da maneira desejada. Segundo Berners-Lee, Hendler e Lassila (2001), o modelo atual é chamado de Web de documentos e não de informações, por isso, os computadores oferecem ajuda limitada no acesso e processamento da informação, deixando as funções mais complexas, como a interpretação dessa informação a cargo dos seres humanos. Com estas premissas vem se desenvolvendo nos últimos anos o conceito de Web Semântica visto como uma evolução da Web atual ou a Web de Documentos. Esta nova proposição poderá oferecer estrutura capaz de permitir que dados e informações sejam compartilhadas e reutilizadas por aplicações computacionais de maneira mais inteligente. A Web Semântica é um projeto liderado pela W3C (World Wide Web Consortium) e tem envolvido um grande esforço de grupos de pesquisas de diferentes áreas (FENSEL et al., 2005). Além disso, a Web Semântica busca unir vários domínios para permitir que se alcance um entendimento compartilhado de diversos contextos. A Web Semântica visa permitir que os dados e conteúdos da Web sejam interpretados tanto por humanos quanto por sistemas informatizados, permitindo que programas de computadores tenham maior capacidade de interpretação de conteúdos visando a realização de tarefas complexas. Ela estende a Web Clássica ou Web de Documentos através da inserção de metadados nas páginas promovendo assim meios para se tornarem legíveis para máquinas. O modelo atual utilizado da Web foi proposto por Tim Berners-Lee quando ele trabalhava para o CERN (Organizações Européia para a Pesquisa Nuclear), em 1989, com a ideia de compartilhar os documentos de pesquisa entre seus colegas de trabalho (W3C, 2008b). Durante este período, Berners-Lee identificou algumas deficiências no modelo atual de Web e em 2001 publicou um segundo artigo juntamente com outros autores em que foi proposta uma nova forma de se utilizar a Web, uma forma mais próxima de utilizá-la em sua total potencialidade (BERNERS-LEE; HENDLER; LASSILA, 2001). Deste modo, foram iniciadas novas pesquisas para que se fosse criado um formato de Web onde os dados estariam mais organizados. Soma-se a isto o fato dos mecanismos de busca enfrentarem dificuldades para realizar pesquisas mais precisas entre documentos, uma vez que a diferenciação em termos de assunto, qualidade e relevância não é uma tarefa fácil. A tecnologia atual oferece pouca capacidade de diferenciar uma informação comercial de uma educacional ou informação entre idiomas e culturas. É necessário haver informações da própria informação, esta informação que é chamada de metadados possui o objetivo de classificar a informação e tornar os processos de busca mais eficazes. Portanto, algumas dessas novas estruturas necessárias já foram definidas e outras ainda estão sendo desenvolvidas pelo W3C. A W3C constituída por um consórcio de organizações interessadas na definição e desenvolvimento de novos conceitos, protocolos e padrões de estruturas para a Web, onde visam obter maior eficácia de seus recursos, a Web Semântica utiliza de padrões e linguagens tais como, XML (eXtensible Markup Language), XML Schema, RDF (Resource Description Framework), RDF Schema, OWL (Web Ontology Language), SWRL (Semantic Web Rule Language) entre outras, estes modelos de representação de informação utilizados para aumentar a usabilidade e funcionalidade da web e de seus recursos relacionados (SHADBOLT; HALL; BERNERS-LEE, 2007). Para que fosse possível demonstrar e trabalhar com as informações dispostas na Web de uma maneira mais estruturada, criou-se o RDF. RDF é uma linguagem para representar informações na Internet recomendada pela W3C que tem como objetivo simplificar o modelo de dados, utilizando o conceito de URI (Uniform Resource Identifier) (W3C, 2008a). A adoção de novos padrões e tecnologias é necessária para possibilitar o conceito de Web Semântica com o intuito de aumentar a usabilidade e funcionalidades, não somente do conteúdo atualmente disponível na Web, mas também dos dados mantidos por organizações públicas ou privadas. Com a utilização de padrões atualmente em desenvolvimento é possível que as informações sejam disponibilizadas em formatos úteis permitindo que qualquer pessoa ou organização possa utilizá-las, promovendo assim o conceito de dados abertos. Este conceito não é uma novidade, mas cria um contexto para que qualquer pessoa interessada possa utilizar determinada informação sem restrição visando facilitar o entendimento e a análise de informações (GRAY et al., 2012). Os dados disponibilizados de forma aberta são vistos como uma nova maneira de compartilhar dados e documentos entre pessoas e entidades na Web com finalidades variadas. Para a criação de aplicações e serviços não basta apenas ter dados disponíveis livremente, é preciso que esses dados sejam úteis, e que possam ser processados por máquinas. Ou seja, os dados precisam ser disponibilizados em formatos adequados para as aplicações que irão se utilizar dos mesmos. E isso é importante tanto para produtores quanto para consumidores de informação (BERNERS-LEE; HENDLER; LASSILA, 2001). A utilização de dados abertos busca estabelecer novos planos para a disponibilização de conteúdo coletivo que possibilite uma maior interoperabilidade entre sistemas. Com a disponibilização de dados abertos novos produtos e serviços podem ser criados por organizações públicas ou privadas, e mesmo por cidadãos comuns. De modo geral a disponibilização de dados abertos tem como finalidade o fato de que qualquer organização ou pessoa pode se utilizar, distribuir e/ou criar aplicações com base nestes dados sem qualquer restrição (AUER et al., 2007). O termo “dado aberto” (do inglês open data) ganhou popularidade em 2009 no evento conhecido como TED® onde Tim Bernes-Lee fez um apelo “Dado Aberto já”, solicitando que empresas, governos e cientistas disponibilizassem seus dados de forma gratuita. No nível tecnológico existem vários padrões e formatos que permitem a disponibilização em formato aberto. No entanto, Tim Bernes-Lee defende o uso de padrões baseados na Web Semântica (BERNERS-LEE, 2006), em que os dados estão conectados (linked) e possuem informações adicionais visando permitir que humanos e máquinas explorem os conteúdos disponíveis na Web. Para disponibilizar estes dados, empresas, governos e instituições deverão enfrentar grandes mudanças no modo de trabalho. Além disto, devem ter a consciência de que tudo que for disponibilizado será visível e utilizado por todos. Entre as instituições que vem disponibilizando seus dados encontram-se as governamentais, com o intuito de tornar públicas as informações sobre os gastos, recursos e investimentos realizados, promovendo assim uma maior transparência de seus atos. Segundo Diniz (2010), os dados abertos podem ainda ajudar na inclusão digital pelo motivo de fornecerem um meio padronizado e acessível permitindo a visualização do conteúdo com ferramenta especializada por qualquer pessoa. A disponibilização dos dados abertos governamentais possui um papel importante na responsabilidade de cada governo, pois o acesso facilitado aos dados do governo habilita as pessoas a monitorarem os atos dos governos criando assim, um vínculo entre cidadão e governo para atingir metas em suas políticas públicas. Um dos desafios para o crescimento da democracia é o desenvolvimento contínuo de novas ferramentas para unir cada vez mais o governo e sociedade, com as novas tecnologias da informação e comunicação, tendo ao seu lado a Internet como ponto central de suporte os governos podem estabelecer condições ideais para o acesso e a utilização dos dados públicos para os cidadãos. Para que estes dados sejam disponibilizados na Web de maneira correta, de modo que os usuários e os computadores possam entender por completo o conteúdo disponibilizado é necessária a aplicação de novas regras, Para isso, Berners-Lee sugere novas práticas para publicação de dados na Web com o objetivo de reduzir a diversidade atualmente encontrada (BERNERS-LEE, 2006). Segundo Berners-Lee (2006), para que se inicie este novo padrão de disponibilização dos dados alguns critérios devem ser seguidos, entre eles: (a) a disponibilização dos dados em seu formato mais bruto possível, ou seja, antes de qualquer agregação; (b) a disponibilização em formato aberto não proprietário, estável e de amplo uso; e (c) a não existência de instrumento jurídico que impeça sua reutilização. A adoção destas práticas e padrões objetiva tornar a Web um espaço interconectado mais rico em sua descrição promovendo assim uma maior utilidade e aplicabilidade dos dados, e permitindo que determinado conteúdo de interesse seja mais facilmente identificado.",
    "Conclusão": "O objetivo geral deste trabalho foi propor um modelo de dados abertos a partir de uma fonte de informação governamental visando a democratização da informação e interoperabilidade entre sistemas computacionais. A utilização deste modelo de disponibilização de dados permite que diversas organizações, não só de governo ou da área científica, mas também do meio corporativo, tornem públicos seus dados reforçando o que vem sendo caracterizado como uma tendência. Acredita-se que dentro de pouco tempo, a disponibilização de dados abertos seja o modelo padrão de fato no compartilhamento de informações na Web. A confirmação desta tendência promoveria a transformação de um espaço global de informação, para um espaço global de dados, formando a base para novas soluções e aplicações de conhecimento no futuro. Dados governamentais ou de qualquer outra organização em formato aberto pode potencializar a inclusão digital, uma vez que promovem uma padronização facilitando assim o acesso por pessoas ou sistemas computacionais. Este modelo de disponibilização tem o potencial de prover mais transparência uma vez que os dados podem ser reutilizados por terceiros, livremente permitindo uma visão muito mais ampla das ações do governo através da disponibilização de dados governamentais. A comparação de dados governamentais com dados de outras fontes pode conduzir a novas perspectivas na avaliação sobre o desempenho do governo e do impacto de suas ações. Contudo, esse potencial é ainda pouco explorado, mas tende a evoluir à medida que os dados governamentais sejam liberados sem restrição de uso. Cada restrição adicionada aos dados abertos exclui a possibilidade de reutilização impactando diretamente na sua disponibilização e utilidade. Outro benefício que dados abertos podem propiciar diz respeito à possibilidade de integração de dados de diferentes domínios, visto que disponibilizando dados usando padrões abertos facilita o compartilhamento de dados. A partir da integração entre diferentes fontes cria-se uma rede de dados potencializando descobertas úteis com o objetivo de melhoria da qualidade de vida da sociedade. Organizações do setor público ou privadas podem utilizar a informação dos mais variados órgãos públicos para prover valor agregado através da combinação de informação própria com outras fontes de dados. Apesar dos dados abertos proporcionarem benefícios e do crescente interesse na disponibilização, ainda existem muitos problemas e desafios que precisam ser enfrentados para que isso se torne realidade. Antes de tudo, o sucesso dos dados abertos governamentais requer uma mudança cultural, tanto por parte do governo quanto por parte da sociedade. Do lado governamental, é necessário que os gestores públicos entendam que os dados, em sua grande maioria, são de natureza pública e que, por este motivo, deveriam estar disponíveis para a sociedade como um todo. Menciona-se ainda como desafio a questão da qualidade dos dados. O receio de disponibilizar dados de baixa qualidade tem levado a uma resistência por parte de alguns órgãos que temem a publicação de dados que são gerados a partir de sistemas de informação transacionais usados no dia a dia do governo. De modo geral, é importante que se reconheça e perceba o valor e o potencial dos dados abertos em que o sucesso de uma iniciativa de dados abertos pode ser medido pela sua usabilidade a partir de sua publicação. A partir da revisão de dados abertos, do ferramental e dos padrões, desenvolveu-se um protótipo capaz de transferir informações de um modelo tradicional utilizado para representar informação, neste caso o modelo relacional, para o modelo de dados abertos mais utilizado atualmente, representado através de triplas RDF. O protótipo possibilitou a validação do processo de publicação dos dados considerando o modelo de dados proposto para representar as informações de um domínio governamental, neste caso o Site DivulgaCand. Este site, disponibilizado pelo Tribunal Superior Eleitoral divulga informações sobre candidatos a eleições possibilitando um conjunto interessante de filtros para análise da informação. Contudo, a informação não se encontra em formato aberto recomendado pelo W3C, o que motivou a escolha desse site como cenário para a proposta e desenvolvimento do modelo apresentado neste trabalho. Durante o desenvolvimento deste trabalho foram identificadas outras possibilidades para trabalhos futuros. Considerando o protótipo elaborado neste trabalho é possível identificar pontos de evolução no desenvolvimento de novas ferramentas e aplicações para a publicação de dados abertos, como exemplo, a flexibilização da interface, possibilidade de escolha das fontes de origem e destino, definição de prefixos para cada unidade de informação através da interface, entre outros. Uma possibilidade identificada na revisão bibliográfica refere-se à ausência de conteúdo adequado que promova um estudo amplo das tecnologias de armazenamento de dados triplificado em formato RDF. Como mencionado anteriormente, a publicação de dados em formato padronizado conduz a percepção de democratização e abre espaço para a criação de aplicações que possam melhorar serviços destinados aos cidadãos. Algumas aplicações foram pensadas como possibilidades para a extensão deste trabalho. Por exemplo, uma ferramenta que auxiliasse as pessoas que se utilizam de transporte rodoviário. Nesta aplicação estariam disponíveis para fácil acesso todas as rotas das empresas de transporte coletivo, municipal, estadual ou nacional, com seus preços e taxas de embarque. Isto se justifica já que para pesquisar horários e itinerários é necessária a busca pelas informações em cada empresa individualmente e muitas vezes o usuário desconhece a empresa que atue em determinada rota."
}