{
    "Autor": [
        "Lucas Manganelli Monteiro",
        "Natália Gonçalves Zanolli"
    ],
    "Título": "GAMIFICAÇÃO DE ESTUDOS INFANTIS BASEADOS EM METAS",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Eliane Pozzebon",
    "Coorientador(a)": "",
    "Resumo": "O problema visto pelos autores está relacionado aos estudos infantis, onde crianças que tenham muito acesso à tecnologia passam a ter problemas nas escolas, como déficit de atenção e hiperatividade com que faça que os alunos se afastem por falta de interesse das atividades escolares. A ideia é trazer a tecnologia para o benefício dos estudos infantis, e a melhor maneira é com gamificação. Ao observar as demais gamificações no mercado, foi observado que a maioria passa apenas sobre um conteúdo que ao não ter mais novidades ou interação na tecnologia, o aluno perde o interesse do game. A gamificação tem como definição trazer algumas características do jogo tradicional para a realidade. As principais características dos jogos tradicionais é o feedback constante, levar o jogador para outra realidade, ter regras e ter desafios e objetivos. Na gamificação o jogador não pode ir para outra realidade, as demais características do jogo devem vir para a realidade do jogador. Neste documento, será apresentado uma solução para gamificação da educação infantil através de uma aplicação web e mobile chamada WinScore. Para isto, foi desenvolvido a aplicação chamada WinScore, que tem por objetivo estreitar a comunicação entre os professores, alunos e os responsáveis, engajando os alunos a progredirem nos estudos para obterem recompensas de acordo com as metas estabelecidas pelos seus responsáveis, ou para evitar ter punições, também definidas pelos responsáveis.",
    "Palavras-chave": [
        "Educação",
        "Tecnologia",
        "Gamificação"
    ],
    "Introdução": "Em seu texto, Duarte (2014) cita que atualmente, há uma grande utilização das TIC nos contextos de ensino e aprendizagem. Que se pode utilizar nas mais variadas plataformas, desktops, tablets e smartphones. Este fato se dá com o perfil de alunos que crescem jogando videogames nessas mesmas plataformas, para eles, faz parte de seu cotidiano essa atividade, sendo assim, pode ser inserida em seus ambientes de aprendizagem. Muitas empresas vêm aplicando gamificação para engajar seus colaboradores, logo esse conceito não é tão novo, mas vem ganhando mais destaque atualmente. Basicamente a gamificação é a utilização de aspectos de jogos em outros contextos que não são jogos em si, como cita Pantoja (2018) Duarte (2014) cita que há diversos trabalhos que discutem e abordam o uso de games por professores. Werbach e Hunter (2012) destacam que o processo de gamificação pode ocorrer em contextos que exigem mudanças de comportamentos. Duarte (2014) fala da mudança:   Tal mudança, consequente da motivação, pode ser aplicada para mudança de hábitos alimentares, o estímulo à prática de atividades físicas, a construção de sistemas que auxiliam pessoas a economizar dinheiro para aposentadoria ou para a reconstrução da sala de aula a fim de estimular o gosto pela escola.  Logo a gamificação pode trazer benefícios a sala de aula, principalmente atingindo os estudantes de menor idade, pois os games os chamam muita atenção, e é considerada uma ferramenta de motivação. A gamificação poderá motivar o aluno a buscar notas melhores, ou de aprender alguma matéria com mais facilidade, de alguma forma alterar seu comportamento para se ter mais gosto pelos estudos. Neste trabalho de conclusão de curso é apresentado um aplicativo com base em gamificação voltado para que o aluno tenha motivações em tirar notas melhores, engajando juntamente responsáveis que estarão determinando as metas do aluno e os professores que lançarão as atividades e notas de cada turma que o mesmo leciona.  Este trabalho tem como foco estreitar a relação entre o corpo docente e o corpo discente, incluindo neste processo os responsáveis, que passarão a acompanhar o processo de aprendizagem mais de perto. Para isso, o aluno terá feedbacks de metas cumpridas e terá recompensas conforme as metas previamente estabelecidas, assim como poderá negativar a meta dependendo de seu rendimento escolar.",
    "Conclusão": "Como descrito nas definições de gamificação o jogador deve permanecer na realidade atual, sendo assim a aplicação WinScore trouxe as características do jogo tradicional para a realidade do aluno, fazendo com que as notas o façam ganhar pontos, para concluir metas, ou evitar que seja punido. Com a aplicação desenvolvida o aluno tem feedbacks constantes de suas notas, e se atingiu alguma meta, ou se recebeu alguma punição. Trazendo a gamificação para a realidade do aluno, não foi necessário levar todos os conteúdos para o game, mas sim, trazer o game para sala de aula, fazer com que as recompensas ou punições recebidas não seja de acordo com as ações no jogo, mas sim com as ações na realidade, com as notas que o aluno adquire. Para complementar e chamar a atenção de todos os alunos, foi passado a responsabilidade para os responsáveis do aluno, que propõem as metas e punições dos mesmos, pois apenas eles conhecem as necessidades e vontades do aluno. Com a pesquisa realizada com profissionais da área, foi recebido um retorno positivo, pelo fato de a aplicação unir os três pilares da educação, professores, alunos e responsáveis. Também considerando que a aplicação por ter metas e punições entra nas características necessárias na formação humana. Um dos profissionais entrevistados, deu como indicação uma melhoria na forma como os professores dão nota, em questão de experiência de usuário, mas ao finalizar o desenvolvimento, os autores notaram que a questão de telas cadastrais era desnecessária, já que a intenção é integrar com algum sistema já em funcionamento dentro da escola, em contrapartida a outra profissional entrevistada teve um questionamento forte sobre o game, de ter realmente um game a partir do avatar, o que fica para recomendação expandir mais a parte do avatar."
}