{
    "Autor": "MARIA PAULA CORRÊA ANGELONI; RAMON HENRIQUE PHILIPPI SILVEIRA",
    "Título": "INFLUÊNCIAS DOS ROTEIROS E SONS NOS JOGOS ELETRÔNICOS",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Luciana Bolan Frigo",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho de conclusão de curso tem como objetivo estudar influências e impactos causados sobre os jogadores de videogames a partir das narrativas e sonorização. Para que isso fosse possível, foram analisa dos os diferentes tipos de narrativas presentes nos games – o modo como as histórias presentes nos jo gos podem ser contadas – e como a trilha sonora e o tipo de áudio podem afetar e influenciar a experiência dos jogadores. A partir da descrição dos atributos de cada parte do trabalho, são apresentados exemplos que ilustram as respectivas características detalhadas. Além disso, um questionário foi respondido por 95 pessoas onde foi possível observar suas preferências em relação às histórias nos jogos, trilhas sonoras e gêneros de video games. Palavras -chave: games, narrativa, trilha sonora.",
    "Palavras-chave": [
        "games",
        "narrativa",
        "trilha sonora"
    ],
    "Introdução": "As pessoas têm contado histórias desde o início dos tempos. Mitos e lendas foram criadas pelo que começou sendo compartilhado ao redor de fogueiras por caçadores ou por histórias que se passaram através de gerações. Segundo Lebowitz e Klug (2012), alguns contos eram elaborados para ensinar, alertar ou dar sentido a grandes mistérios que não podiam ser explicados, enquanto outros tinham como objetivo apenas o entretenimento. Ao redor do mundo todo, entre todas as culturas, raças, tribos e civilizações, histórias estiveram presentes. Enquanto algumas destas foram lentamente se perdendo no tempo, outras moldaram religiões, filosofias e o próprio mundo. Os irmãos Grimm são ótimos exemplos de histórias que moldaram muitas pessoas. Seus contos tinham como objetivo passar, principalmente às crianças, alguma lição de moral. Algumas destas histórias acabavam sendo muito más e opressivas, e foram adaptadas com o passar dos anos tornando-as mais “confortáveis” para as crianças modernas. Mas toda história tem algo a ensinar ao leitor, independente da adaptação feita (Ken Mondschein; Grimm e Grimm, 2011). Lebowitz e Klug (2012) afirmam que poucas coisas tiveram tanta influência no desenvolvimento humano como as próprias histórias, pois estas levaram as pessoas a lutar, ter esperança, explorar e sonhar. Independente de seu interesse, existe uma história para ser ouvida graças ao desenvolvimento tecnológico, pois graças a televisão, impressão e a Internet temos uma infinidade de materiais disponíveis nos dias atuais. Existem muitas opções, e por este motivo, segundo os autores, não é surpresa que os seres humanos se tornem cada vez mais seletivos com as histórias que querem ouvir. De acordo com Cunningham, Grout & Picking (2011) jogadores exibem um grande envolvimento emocional com jogos digitais comparado com outras formas de entretenimento digital devido à interação; a emoção é um fator chave a se considerar. Mais de 60% das residências americanas têm alguém que joga videogames regularmente. Somente nos Estados Unidos, mais de 23,5 bilhões de dólares foram gastos pelos consumidores nesta indústria no ano de 2015, 1,1 bilhão a mais do que no ano anterior. A média da idade dos jogadores é de 35 anos (Entertainment Software Association, 2016).",
    "Conclusão": "Este trabalho de conclusão de curso abordou aspectos de narrativas e trilhas sonoras em videogames, suas influências, impactos e como as histórias e os sons podem afetar os jogadores durante a experiência vivida por estes durante a gameplay, auxiliando a imersão destes no mundo apresentado pelo jogo, conquistando sua atenção e interesse de forma única, aumentando então sua dedicação e instigando-o a seguir em frente através de aventuras e desafios propostos pelo game. Foram apresentados os diferentes tipos de narrativa – linear, ramificada, ramificada modificada, modular, semilinear, forçada, embutida, emergente e evocada – e o modo como estas se comportam nos jogos eletrônicos que foram incluídas. Através de exemplos de jogos aclamados pela crítica e pelo público pode ser observado que é possível que diferentes modos de contar histórias nos games sejam bem-sucedidos. Além dos estilos de narrativa, este trabalho apresentou como objetivo também concluir uma pesquisa bibliográfica sobre a trilha sonora, os efeitos causados pelos sons e como estes podem influenciar na jogabilidade do player. Um questionário foi desenvolvido e compartilhado online entre grupos de jogadores e respondidos por estes, onde avaliaram há quanto tempo e quantas horas, em média, jogam durante a semana, seus gêneros de games preferidos, atributos mais valorizados no momento da compra de um jogo e perguntas relacionadas à importância das narrativas e dos efeitos sonoros. A partir das respostas obtidas foi possível perceber que as pessoas não param de jogar com o passar dos anos, o que faz com que o mercado de games necessite ampliar o seu público-alvo. Uma grande parte dos players afirmou que joga sozinha, enquanto uma outra parcela declarou jogar com amigos, o que explica o fato de videogames multiplayer ou co-op (cooperação com outros usuários) estarem entre os mais vendidos. Em relação às narrativas dos jogos, nota-se que a maioria dos jogadores dá importância à trama contada, considerando que prestam atenção aos diálogos e cenas exibidas durante o game, além do fato de a maioria dos entrevistados ter alegado que a história contada é de “extrema importância” para o jogo. Em relação aos resultados sobre o áudio presente nos games, a maioria também afirmou que a trilha e os efeitos sonoros são de “extrema importância”, entretanto, estas respostas foram menos expressivas que as que foram obtidas na questão sobre a relevância da narrativa. A pergunta relacionada à atuação e vozes dos personagens também demonstrou que estas são valorizadas pelos jogadores, porém, a indagação com o resultado mais significante foi a que questionava se o som afeta a imersão do jogo: quase todos os entrevistados defenderam que o áudio é de extrema importância nesse quesito. Além disso, a maioria também relatou que os sons influenciam sua percepção sobre o jogo de um modo geral. Apesar da conclusão de que os jogadores valorizam as narrativas e trilhas sonoras nos games, foi possível identificar que os três atributos mais ponderados na hora da escolha da compra de um jogo são gênero do jogo, preço e seus gráficos. Os resultados obtidos a partir do formulário ratificam a relevância da narrativa e da trilha sonora apresentadas nos jogos eletrônicos, sendo estas extremamente significativas para o desenvolvimento do jogo e seu sucesso perante a crítica e o público, de modo que uma boa história de fundo conquista a atenção e dedicação do jogador, e os efeitos sonoros façam com que este sofra uma imersão no mundo do game e sinta-se dentro do universo disponibilizado por este."
}