{
    "Autor": "Janine De Lavechia",
    "Título": "APOIO A INCUBADORAS NO ÂMBITO DAS POLÍTICAS RECENTES DE CIÊNCIA, TECNOLOGIA E INOVAÇÃO",
    "Ano de publicação": "2013",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Paulo César Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho faz um estudo sobre as incubadoras de empresas do Estado de Santa Catarina e também faz uma análise sobre as políticas públicas de inovação que contribuíram para o surgimento e crescimento de incubadoras de empresas de base tecnológica. Onde também é apresentado os instrumentos de financiamento que ajudaram as incubadoras surgirem em um número tão grande atualmente. Sendo assim, este trabalho é um estudo predominantemente bibliográfico e documental, ou seja, a fonte documental quando o material consultado é interno à organização, e fonte bibliográfica quando for obtido em bibliotecas ou bases de dados. Foi utilizada também nesta pesquisa, dados secundários, trabalhando com os dados na forma de arquivos, em bancos de dados, e também foi utilizado sites da web que foram escolhidos entre as organizações reconhecidas e responsáveis pela divulgação de assunto veiculada em suas páginas.",
    "Palavras-chave": "Políticas de Inovação, Instrumentos de Apoio a Incubadora, Políticas Recentes em Ciência, Tecnologia, & Inovação.",
    "Introdução": "Um marco na história institucional da Ciência, Tecnologia e Inovação - C,T&I no país foi a criação, em 1985, do Ministério de Ciência e Tecnologia - MCT no país. Sua criação veio alterar a estrutura do Sistema Nacional de Desenvolvimento Científico e Tecnológico, criado em 1975. O Ministério da Ciência e Tecnologia passa a operar como órgão central do sistema federal de C&T coordenando os esforços do país para a formação de um Sistema Nacional de Inovação. Segundo Sbragia e Andreassi (2006) Sistema Nacional de Inovação pode ser definido como uma rede de instituições públicas e privadas que interagem para promover o desenvolvimento científico e tecnológico de um país. Incluem empresas, dos mais variados tipos, associações empresariais, universidades, escolas técnicas, institutos de pesquisa, governo, agências de fomento e agências reguladoras, num esforço de geração, importação, modificação, adaptação e difusão de inovações tecnológicas. Sua formulação busca acelerar a melhoria da posição brasileira entre as nações, no que se refere aos índices de promoção e incorporação de inovações pelos seus agentes econômicos e sociais com apoio de programas públicos de crédito visando o aumento da produtividade e competitividade. Porém, nem toda mudança é uma inovação. O inovador sempre busca novas formas de fazer. A Inovação é o conjunto de atividades de um processo que se desenvolve desde o nascimento de uma ideia até a sua comercialização. São etapas científicas, tecnológicas, organizacionais, financeiras e comerciais que conduzem, ou visam conduzir, a implementação de inovações ( JUNIOR et al. , 2012). É preciso compreender que a cultura de inovação e a necessidade de ambientes e contextos que a favoreça resulta em experiências bastante positivas quando bem direcionada. Além disso, desenvolver capacidades de proatividade, liderança, e poder de decisão é de fundamental importância para que se crie, cultive, e prospere uma cultura de inovação. Desta maneira, o processo realizado pelas incubadoras de empresas torna-se um fator indispensável para que se criem contextos favorecedores ( LABNITA , 2013). Atualmente, no meio de tantas Micro e Pequenas Empresas - MPEs existentes é necessário que o empreendedor além de ter uma empresa bem planejada, desenvolva algo inovador, seja produto, serviço, algo que chame a atenção do usuário final. Porém, para se conseguir esse diferencial no mercado hoje em dia, não é uma tarefa tão fácil quanto parece. Para Junior et al. (2012) a inovação é vista como algo novo, só ocorre com aplicação efetiva e resultados tangíveis. Mudança está associada à inovação. Por exemplo: produtos ou processos novos ou significativamente melhorados que mudam fundamentalmente usos e aplicaçõe, formas de operações introduzidas por novas tecnologias, alterando o nível de qualidade dos produtos e reduzindo custos. Para aumentar as chances de sucesso das MPEs vem sendo criados ambientes especiais que lhes oferecem uma condição diferenciada de competição no mercado. São os designados 'habitats' da Inovação. Incubadoras e Parques Tecnológicos que as auxiliam a definir com clareza seu plano de negócio e a implementar de forma monitorada suas estratégias de competitividade e inovação. As incubadoras de empresas desempenham assim, um papel fundamental para as MPEs, pois oferecem um ambiente que estimula a criação e o desenvolvimento para empresas nascentes e em operação, o que também facilita e agiliza o processo de inovação tecnológica ( MORAIS; SILVA; OLIVEIRA , 2012). Segundo a ??), as incubadoras são ambientes com capacidade técnica, gerencial, administrativa e infraestrutura, com o objetivo de amparar o novo empreendedor, disponibilizando espaço apropriado e condições favoráveis para abrigar a sua ideia inovadora e transformá-la em um empreendimento de sucesso. Para a formação e promoção da inovação é necessário o envolvimento de três elementos, atuando de forma interativa: O Governo; As Empresas; e As Universidades. A formação e expansão das incubadoras tem sido um instrumento de forte presença no movimento de geração da inovação. Muitos foram os Programas e Instrumentos desenvolvidos por meio de políticas públicas de interação universidade e empresas que contribuíram para a relevância desse instrumento no país.",
    "Conclusão": "O resultado da pesquisa cujo objetivo geral foi o de analisar as políticas públicas utilizadas para a formação de incubadoras de empresas de base tecnológica no estado de Santa Catarina, identificando a sua importância no processo de criação e manutenção da incubadora. Para tanto estabeleceu objetivos específicos visando-se atingir o objetivo principal. Em termos conclusivos podemos afirmar que o objetivo de situar historicamente o surgimento de incubadoras no Brasil foi atendido no capítulo 5 do trabalho, onde se faz um embasamento da historia das incubadoras no Brasil, iniciando nos primeiros anos da década de 1980, juntamente com a criação da ANPROTEC, e apresentado ao final uma tabela com os dados em números mais recentes encontrados, da situação de incubadoras no País. E no mesmo capítulo é explanado o objetivo de analisar a formação da rede de incubadoras no estado de Santa Catarina, e que obteve a formação da Rede Catarinense de Entidades Promotoras de Empreendimentos Tecnológicos - ReCEPET, que teve grande influência na expansão das Incubadoras, forneceu apoio a mais de 100 empresas e que gerou R$ 50 milhões de faturamento por ano. Foi apresentada ainda uma tabela com as incubadoras em atuação no ano de 2012 e que possuíam apoio da FAPESC. Analisando a importância das políticas públicas de inovação na estruturação da rede, foi apresentado no capítulo 3, onde foram analisadas as políticas públicas em forma de linha do tempo, e apresentado ao final as suas contribuições para a criação e consolidação das incubadoras de empresas. A ENCTI recebe uma atenção especial, pois junto a ela foi integrada o PNI, que é um programa voltado a incubadoras e que tem como objetivo fomentar a consolidação de incubadoras de base tecnológicas. E por fim, o objetivo de identificar os instrumentos de financiamento utilizados para formação da rede de incubadoras, foi apresentado no capítulo 4, onde foram buscadas informações sobre as maiores fontes de financiamentos e que disponibilizam apoio as incubadoras, tanto a FINEP, SEBRAE, e o BNDES estão investindo fortemente cada vez mais em inovação. Como ilustra a Tabela 3, resumidamente, estão dispostos os dados sobre a criação de incubadoras e as novas incubadoras que surgiram a cada ano, onde foram analisados os anos de 2003 a 2009, e teve como fonte o panorama da Anprotec, que foi divulgado a cada ano. Em comparação as políticas públicas de inovação pode-se observar que houve um aumento considerável a economia brasileira no ano de 2004 para 2005, no qual se relaciona com a política PITCE, a qual investia em inovação e tecnologia fortemente, e onde foram criadas aproximadamente 80 incubadoras, dos mais diversos segmentos. Já nos anos seguintes, pode-se observar uma grande queda no estímulo de criação de incubadoras o qual compreende os anos de atuação do PACTI. Concluindo assim que, as políticas de inovação possuem grande importância para a criação e consolidação das incubadoras, pois, através delas as incubadoras poderão encontrar alguma fonte de financiamento que ajudará as mesmas. Para trabalhos futuros pode-se sugerir o estudo quantitativo para identificar quantas incubadoras foram criadas a partir da mais nova Política - ENCTI, pois neste trabalho não foi possível identificar por falta de informações."
}