{
    "Autor": "Jeison Estevam Costa",
    "Título": "Engenharia social e segurança da informação no ambiente corporativo: um estudo de caso em uma cooperativa de crédito localizada no sul de Santa Catarina",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo César Leite Esteves",
    "Coorientador(a)": "",
    "Resumo": "A presente pesquisa refere-se a um estudo de Segurança da Informação com ênfase no conceito de Engenharia Social, tendo o objetivo de analisar as atitudes dos colaboradores de uma Cooperativa de Crédito localizada no Sul de Santa Catarina em relação às práticas de Engenharia Social que podem afetar a manutenção da Segurança da Informação da entidade. Quanto à metodologia, a pesquisa caracteriza-se como qualitativa, descritiva, sendo desenvolvida por meio de um estudo de caso. A coleta de dados foi realizada por meio de questionário e do teste de phishing. Os resultados obtidos revelaram que grande parte dos colaboradores mantém comportamento adequado para a manutenção da Segurança da Informação e de golpes provenientes de Engenharia Social, entretanto, uma parcela significativa ainda não segue rigorosamente as normas de Segurança da Informação. É fundamental que as organizações conscientizem todos seus colaboradores a respeito das consequências que a divulgação indevida de dados pode acarretar à sua política interna de Segurança de Informação, para a redução dos índices de fraudes e golpes.",
    "Palavras-chave": "Segurança da Informação. Engenharia Social. Cooperativa de Crédito.",
    "Introdução": "As tecnologias da informação e comunicação estão presentes no ambiente corporativo como ferramenta imprescindível para o desenvolvimento das organizações em suas mais diversas áreas. Ao mesmo tempo em que novas tecnologias se inserem no mercado, a fim de facilitar a gestão dos negócios, há o aumento da competitividade e, para tanto é fundamental inserir ou adequar os recursos tecnológicos já existentes para se manter em boa posição no mercado. Na década de 60, foram criados os primeiros sistemas de computadores, que tiveram como função auxiliar na administração de dados corporativos, ocupando o lugar dos procedimentos manuais que existiam até aquele momento (DIAS, 2000). A partir dessa época, o mundo da informática passou por muitos avanços tecnológicos. Cada vez mais, os computadores aumentam seus recursos de hardware e software, a internet passa a ser mais rápida e acessível. Até mesmo os usuários leigos passam a construir suas próprias aplicações devido ao grande número de ferramentas de software disponíveis (DIAS, 2000). Da mesma forma em que o acesso aos meios digitais se tornou mais fácil, houve o aumento da complexidade para armazenar informações importantes e confidenciais, visto que indivíduos mal intencionados, os quais estão entre a vasta gama de usuários beneficiados com a evolução tecnológica, estudam e criam métodos de manipulação para roubo de informações sigilosas. Estas, por sua vez, caso sejam roubadas ou perdidas, podem ocasionar danos irreversíveis para uma organização. A preservação da informação é vital para a entidade que a possui, uma vez que é através dela que se tem a possibilidade de gerir os processos existentes no meio corporativo. Deste modo, pode-se dizer que, sem informação, não se obtém resultados. Por conta da enorme facilidade de atribuir valor a produtos e serviços, as tecnologias propiciam caminhos que resultam na conquista dos objetivos organizacionais. Sendo um ativo de enorme valor, as informações essenciais para o negócio precisam ser protegidas contra as ameaças que podem pôr em risco sua adulteração, divulgação não autorizada e destruição (BEAL, 2008). São inúmeros os mecanismos para mantê-la sob confidencialidade: antivírus, firewalls, intranet, sistemas de autenticação, token, entre outros. Obviamente, que essas tecnologias têm papel importante para manter os dados em segurança. Contudo, ainda não é o suficiente para garantir a confidencialidade dos dados. Um ponto extremamente relevante que não pode ser negligenciado na segurança da informação, é a forma de se proteger de ataques provenientes de engenharia social. Pessoas mal intencionadas e Hackers, também conhecidas como engenheiros sociais, trabalham para aplicar seus golpes aproveitando-se da ignorância ou ingenuidade dos usuários, com o propósito de coletar dados confidenciais que podem afetar a segurança da organização (BEAL, 2008). Conforme Mitnick e Simon (2003) não importa quanto seja feito de investimentos na área de tecnologias da segurança da informação e, treinamentos de pessoal para garantir a confidencialidade de seus dados, bem como, os colaboradores seguirem as melhores recomendações para práticas de segurança e instalação de programas que, ainda assim, a organização estará vulnerável. Sendo assim, cabe salientar que diversas são as organizações que em algum momento se tornam vítimas de aplicações de golpes elaborados por engenheiros sociais. Dentre elas, as cooperativas de crédito, objeto dessa pesquisa, tendem a ser alvos comuns, em decorrência de sua atividade operacional estar relacionada a grandes movimentações financeiras, chamando a atenção desses indivíduos, os quais analisam e identificam oportunidades para a aplicação de golpes. Diante deste contexto, tem-se a seguinte questão de pesquisa: Quais atitudes dos colaboradores de uma Cooperativa de Crédito localizada no Sul de Santa Catarina em relação às práticas de engenharia social que podem afetar a manutenção da segurança da informação da entidade?",
    "Conclusão": "O objetivo desta pesquisa, foi identificar as atitudes dos colaboradores de uma Cooperativa de Crédito localizada no Sul de Santa Catarina em relação às práticas de engenharia social que podem afetar a manutenção da segurança das informações da entidade. Pode-se afirmar que o objetivo foi atingido, por meio dos objetivos específicos estabelecidos e da metodologia aplicada. Primeiramente, foram apresentados os elementos que integram a segurança da informação no ambiente corporativo. Desta maneira, foram explanados os conceitos físicos, lógicos e humanos da segurança da informação. Para tal, foi abordado a teoria pertinente à definição de informação, ativos de informação, segurança da informação nas organizações, seus princípios básicos e a política de segurança da informação, além de destacar as ameaças e vulnerabilidades encontradas no ambiente corporativo. Depois, foram expostas as características da Engenharia Social aplicada às organizações. Foi apresentado o conceito de Engenharia Social, o perfil que os engenheiros sociais possuem, as vulnerabilidades humanas exploradas por eles e os métodos utilizados para os ataques. Simultaneamente aos conteúdos de Segurança da Informação e Engenharia Social elucididos, foi destacada a importância de administrar os componentes da segurança da informação, sejam estes físicos, lógicos e, principalmente humanos. A Engenharia Social explora, em sua maioria, as vulnerabilidades dos indivíduos, com o intuito de obter dados confidenciais para utilizá-los em seu benefício ou, simplesmente, para causar algum tipo de dano. É fundamental que as organizações conscientizem todos seus colaboradores a respeito das consequências que a divulgação indevida de dados pode acarretar, sobretudo voltando a sua política interna para a redução dos índices de fraudes e golpes. Em análise às atitudes dos colaboradores e identificação dos pontos negativos e positivos, foi constatado que, embora a maior parte dos funcionários aja de acordo com as normas de segurança de informação, uma parcela ainda adota hábitos incorretos, os quais podem ser prejudiciais à Cooperativa. Alguns pontos a serem melhorados se referem ao compartilhamento de senhas com outros colegas de trabalho e anotações de senhas em locais próximos à mesa de trabalho. Outra característica observada, é sobre o repasse de informações por telefone, em que houve um alto percentual de funcionários que solicitam a confirmação de dados e depois repassam a informação, entretanto, pode-se tratar de um golpe proveniente de Engenharia Social, no qual o fraudador pode ter em posse, os dados de um associado. Além disso, um aspecto que precisa ser trabalhado é em relação à conscientização sobre os phishing, pois tanto no questionário e, principalmente, no teste de phishing aplicado, há um percentual preocupante de funcionários que clicam em links ou baixam anexos antes de confirmar sua autenticidade, o que pode comprometer seriamente à rede corporativa e, consequentemente, colocar toda a organização sob risco. Quanto às limitações da pesquisa, ressalta-se que, por se tratar de um estudo de caso, os resultados obtidos aplicam-se apenas ao objeto de estudo e, portanto, não podem ser utilizados para análises e interpretações de outras organizações. Sugere-se que, com base nessa pesquisa, sejam replicados estudos em outras instituições financeiras ou, até mesmo, organizações de outros segmentos, visando identificar quais aspectos são importantes para a Segurança da Informação, com ênfase na prevenção de ataques de Engenharia Social. Atrelado a isso, é relevante analisar quais públicos podem estar mais propensos aos ataques de Engenharia Social, como forma de identificar e propor métodos de conscientização voltados aos públicos mais vulneráveis."
}