{
    "Autor": "Jesiel Bitencourt",
    "Título": "GESTÃO DA SEGURANÇA DA INFORMAÇÃO: DESAFIOS E PERSPECTIVAS",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Mendonça Lunardi",
    "Coorientador(a)": "",
    "Resumo": "Este estudo trata -se de uma pesquisa bibliográfica com foco na segurança da informação na sociedade atual, na qual cada vez mais dados circulam pelas redes que conectam indivíduos, empresas e governos em todo o mundo. Essas tecnologias permitem que estudos, trabalho, negócios e lazer sejam conduzidos de forma simples, prática e facilitada, porém, não se pode afirmar que não existam riscos envolvidos. Diante disso, o objetivo geral foi definido como: investigar os principais desafios e perspectivas na gestão da segurança de informação. Os objetivos específicos, por sua vez, foram assim estabelecidos: a) identificar os principais conceitos de gestão de segurança da informação; b) verificar os desafios para a gestão da segurança de informação; e c) apontar perspectivas futuras para a gestão da segurança da informação. Verificou -se que área de segurança da informação evoluiu grandemente ao longo dos anos, todavia, os conhecimentos de usuários com intuitos ilícitos também foram expandidos e, assim, o cenário demanda de constantes melhorias. Enquanto os maiores desafios residem na necessidade de desenvolver barreiras que protejam os usuários de ataques diversos, as perspectivas recaem sobre a capacidade de obter, armazenar e proteger os dados disponíveis, tornando as empresas e instituições mais efetivas, com melhores resultados na tomada de decisões e capazes de se destacar das demais existentes no mercado.",
    "Palavras-chave": "Segurança da informação. Desafios. Perspectivas.",
    "Introdução": "Na sociedade atual a informação está disseminada em todos os seus setores e, cada vez mais, vem sendo vista como um recurso para empresas e pessoas que desejam alcançar resultados em sal vida pessoal, acadêmica, profissional ou social. Muitas dessas informações podem ser acessadas de forma aberta, sem custos e sem limitações, porém, existem dados que precisam ser resguardados e protegidos, em função dos riscos que acarretaria seu amplo acesso por outros indivíduos ou empresas (SILVA; STEIN, 2007). Diante dessa realidade, cada vez mais estudos vêm sendo conduzidos no sentido de encontrar formas de aumentar a segurança da informação, para que seu uso ocorra apenas por entidades e pessoas autorizadas a fazê -lo e, assim, evitando que sejam disseminadas livremente, colocando em risco os indivíduos a os quais esses dados se referem (SILVA; STEIN, 2007). Segurança da informação refere -se ao desenvolvimento de formas de proteger os dados dos quais uma empresa, instituição ou indivíduos em geral fazem uso em suas atividades. Atualmente a informação trata -se de um produto no mercado, essencial para empresas que comercializam bens e serviços e podem englobar estoque, clientes, contas a pagar, a receber, etc. (MARCIANO, 2006). Ocorre que essas informações podem representar o sucesso ou fracasso de uma empresa, além de sua privacidade e de seus clientes, de modo que protegê -las é indispensável para que a empresa mantenha -se competitiva no mercado e para que seus clientes estejam completamente seguros (MARCIANO, 2006). Rigon e Westphall (2011) esclarecem que tamanha é a importância das informações que circulam no mercado, que cada vez mais sistemas de proteção vêm sendo criados, porém, ao mesmo tempo, cada vez mais pessoas vêm se especializando em formas de invadir os sistemas de diferentes companhias para obter esses dados. A segurança da informação, de forma geral, está atrelada às pessoas que coletam, registram e armazenam esses dados. Há uma relação entre informação, segurança e cuidados assumidos pelos indivíduos para que esses dados sejam resguardados continuamente. Assim como as pessoas podem proteger as informações, elas também podem colocá -las em risco, caso assumam condutas inadequadas (SILVA; STEIN, 2007). Gerenciar as informações, bem como a segurança das mesmas, é atividade essencial para que os dados sejam protegidos e possíveis invasões não venham a colocar em risco empresas e pessoas cujos dados estão ali armazenados. Diante disso, o gerenciamento de segurança vem tomando uma relevância cada vez maior e diferentes ferramentas de proteção vêm sendo desenvolvidas (RIGON; WESTPHALL, 2011). Marciano (2006) acredita que muitas pessoas e empresas questionam a segurança da informação, porém, os esforços para alcançar essa segurança, apesar de apresentarem desenvolvimento constante, ainda não alcançaram os patamares desejados e, assim, o tema merece apreciação contínua para que se altere o cenário e se alcance segurança, confiabilidade e possibilidade cada vez maior de atividades por meio das Tecnologias de Informação e Comunicação com os menores riscos envolvidos. Neste sentido, inúmeros desafios permeiam a área, todos relacionados ao desenvolvimento de tecnologias e ferramentas que permitam elevar a segurança da informação e, assim, assegurar aos usuários dessas tecnologias de que suas informações não serão indevidamente utilizadas, o que poderia causar -lhes constrangimentos, riscos e prejuízos diversos. Não obstante, as perspectivas de futuro na área são ainda mais amplas, envolvendo tecnologias cada vez mais avançadas, com esforços constantes e globais para que a segurança não seja apenas uma teoria, mas se torne uma realidade em todos os níveis das tecnologias da informação (OLIVEIRA; MOURA; ARAÚJO, 2012). Proteger os usuários é proteger as empresas que fazem uso de seus dados e, assim, cada vez mais esse é um objetivo das instituições, pessoas e governos, não apenas no Brasil, mas em todo o mundo.",
    "Conclusão": "A sociedade atual encontra -se permeada pelo uso constante das tecnologias de informação e comunicação para as mais diversas atividades. Compras, vendas, serviços, estudos, trabalho, todas essas ações podem ser conduzidas a partir de um computador ou celular conectado à internet, o que faz com que as barreiras geográficas deixem de ser limitantes e pessoas de todo o mundo possam entrar em contato entre si em tempo real. Com essas tecnologias, surgiram oportunidades de mercado extremamente importantes e muitas empresas vêm se especializando em comércio virtual. Os clientes fazem seus negócios a partir de suas casas ou escritórios e não precisam deixar o conforto e a segurança para pagar ou retirar os produtos, tudo é muito rápido e fácil para todas as partes. Em face disso, o montante de informações que circulam nas redes todos os dias é muito alto, dados relacionados aos indivíduos, empresas, instituições e governos, fotos, vídeos, enfim, uma vasta gama de dados, alguns compartilhados abertamente, outros mantidos em sigilo visando à proteção e segurança dos usuários das tecnologias. Pessoas, empresas e governos fazem uso dessas informações e apresentam bancos de dados virtuais contendo dados, o que passou a chamar a atenção de indivíduos com intuitos escusos, ilícitos, interessados nessas informações como modo de obterem vantagens, o que trouxe consigo a ocorrência de invasões e roubo de informações. O que era para ser um grande benefício para todos os envolvidos passa a apresentar uma carga de inseguranças e riscos que, muitas vezes, afastam pessoas e empresas. Diante da ameaça de ter os dados acessados e utilizados indevidamente, surge o receio de prejuízos pessoais, morais e financeiros e os usuários passam a buscar as oportunidades virtuais que apresentam maiores índices de segurança, confiabilidade e satisfação relatados por outros clientes. Em face dessa realidade, surge a segurança da informação, um esforço verificado em todos os países do mundo, por meio do qual a busca central refere -se ao desenvolvimento de tecnologias e ferramentas que se tornem barreiras entre os bancos de dados existentes e as pessoas interessadas em acessá -los, mesmo não sendo autorizadas para isso. Diante dessa percepção, este estudo foi desenvolvido com o objetivo central de investigar os principais desafios e perspectivas na gestão da segurança de informação. Os estudos realizados permitiram verificar que a gestão de segurança da informação vem evoluindo continuamente ao longo dos anos e os esforços na área jamais são interrompidos, constantemente as empresas, governos e pessoas, assim como os desenvolvedores desses sistemas, vêm buscando formas de tornar suas atividades virtuais mais seguras, mantendo a si e a quem atuam com elas em segurança. Atualmente existem desafios consideráveis na área, como a prática de crimes virtuais. Esses crimes envolvem fraudes, roubos, desvios de verbas, mas também atingem a dignidade das pessoas quando são voltados ao âmbito moral. Ofensas, ameaças, calúnias, todas são formas de ação criminosa que podem não comprometer as finanças dos indivíduos, mas certamente atingem sua vida e comprometem sua satisfação. Práticas de estelionato com uso de informações alheias, como documentos, números de contas bancárias ou cartões de crédito também são comuns e podem gerar prejuízos imensos para a vítima, além de levar ao enriquecimento ilícito dos criminosos. De forma geral, as ocorrências envolvendo recursos financeiros são as mais combatidas, considerando-se a dificuldade de recuperar esses valores, porém, nos últimos anos leis vêm sendo desenvolvidas para punir aqueles que causam danos morais às vítimas escondidos atrás de recursos virtuais. Fica evidente, assim, que os maiores desafios existentes estão relacionados ao desenvolvimento de medidas efetivas que protejam todos os usuários dessas tecnologias, sem impedir o desenvolvimento social, econômico e pessoal que elas podem trazer quando são bem utilizadas. Manter seu uso reduzindo os riscos e ameaças é a preocupação mais comum na área no momento e jamais poderá deixar de ser assim. No que tange as perspectivas futuras, verifica-se que a segurança se torna um ideal buscado por todos os envolvidos nesse meio, como forma de assegurar o crescimento de suas atividades, fazendo com que os usuários alcancem máxima confiança e passem a indicar a outros determinados negócios como sendo seguros, eficazes e protegidos. Empresas, instituições e governos capazes de obter e proteger essas informações para seu uso, de acordo com a autorização dos indivíduos, tendem a proceder de uma tomada de decisões muito mais efetiva, sólida e pautada em dados reais e, assim, também seus resultados são amplamente beneficiados. A área de segurança da informação tende a crescer continuamente, pois sabe-se que quanto mais barreiras são desenvolvidas, mais usuários mal-intencionados buscam se especializar para poder ultrapassá-las, o que demonstra que a área não permanecerá estática sob nenhuma circunstância."
}