{
    "Autor": "Joana Fenali Leopoldo",
    "Título": "Perfil de Atuação dos Alunos Egressos do Curso de Tecnologias da Informação e Comunicação",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Fernando José Spanhol",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho de conclusão de curso foi construído fundamentando-se na revisão sistemática da literatura, foi desenvolvida uma pesquisa quantitativa com os alunos egressos do curso de Tecnologia da Informação e Comunicação do Campus da Universidade Federal de Santa Catarina. Na fundamentação teórica, buscaram-se referências sobre o impacto das tecnologias no cenário mundial, a importância das tecnologias para o desenvolvimento regional dos grandes centros e a importância das universidades nesse meio. Primeiramente essa análise é feita de maneira global, seguida de uma análise no país e na região. É feito um estudo sobre o curso de Tecnologia da Informação e Comunicação, as suas características o perfil do aluno egresso entre outros dados relevantes na elaboração da pesquisa. Com a pesquisa se buscou conhecer a atual realidade desses alunos, quais são as áreas de atuação com maior número de ex-alunos empregados, em quais regiões há uma maior demanda de profissionais e de quais áreas há essa demanda, bem como quais as áreas do curso lhes despertou mais atenção, além de questioná-los sobre quais as sugestões poderiam ser dadas para que o curso pudesse ser aprimorado. Enfim essa pesquisa também busca saber quais os anseios desses profissionais, de quanto eles podem contribuir para o desenvolvimento regional, quais as suas perspectivas futuras em relação à continuidade dos estudos se estão participando de algum programa de pós graduação, ou se pretendem futuramente ingressar em alguma pós graduação, nesse aspecto busca-se também reconhecer quais as áreas em que há o maior número de ex-alunos estudando. Qual a perspectiva em relação ao PPGTIC, programa de pós graduação desse mesmo curso superior.",
    "Palavras-chave": "TIC, Negócios Digitais, Tecnologias Digitais e Educação e Cultura Digital, alunos egressos.",
    "Introdução": "Muito se ouve falar sobre as TIC, mas o que são? A sigla TIC significa Tecnologia da Informação e Comunicação e diz respeito a um conjunto de inúmeros recursos tecnológicos software, hardware e ferramentas de comunicação decorrentes de meios digitais. “TIC correspondem a todas as tecnologias que interferem e perpassam os processos informacionais e comunicativos dos seres.” (AGÊNCIA BRASILEIRA DE DESENVOLVIMENTO INDUSTRIAL, 2010, p.16) Podem ser vistas como os grupos de recursos tecnológicos que consistem em quatro grupos “[...] software, hardware e sistemas, semicondutores e microeletrônica e infraestrutura de TI. Cada um deles requer uma visão de futuro e uma estratégia própria de ciência e tecnologia para vencer os desafios e evoluir em escala e qualidade internacional. ” (MINISTÉRIO DA CIÊNCIA, TECNOLOGIA E INOVAÇÃO MINISTÉRIO DA CIÊNCIA, TECNOLOGIA E INOVAÇÃO, 2012, p.54) Para compreender melhor o impacto dessa ferramenta é preciso reconhecer a atuação das TICs em vários setores com o ativo melhorador de processos. Com a potencialização da internet banda larga as TICs tomaram proporções colossais em todos os cenários desde então. “Contempla três componentes vitais para a inovação em TIC[ ...]proporciona: desenvolvimento do conhecimento básico nas instituições de pesquisa; o fluxo do conhecimento entre instituições de pesquisa e a indústria; o desenvolvimento do conhecimento pelas empresas.” (AGÊNCIA BRASILEIRA DE DESENVOLVIMENTO INDUSTRIAL, 2010, p.16) Responsável por grandes evoluções na esfera tecnológica, atua como propulsora no desenvolvimento global, não somente no âmbito industrial, mas também no meio institucional e acadêmico. “Os setores e TICs são altamente dinâmicos e originam boa parte das inovações que são difundidas pela economia. O setor de TICs é o maior investidor em pesquisa e desenvolvimento e ele direciona parte significativa da mudança técnica e inovação nas economias.” (AGÊNCIA BRASILEIRA DE DESENVOLVIMENTO INDUSTRIAL, 2012, p.23) Partindo dessa realidade, esta pesquisa pretende mostrar quais os ramos de atuação dos alunos egressos do curso de Tecnologias da Informação e Comunicação por meio de uma fundamentação teórica e pesquisa quantitativa com esses alunos. Para isso, buscou-se compreender um pouco do cenário das tecnologias no cenário mundial e principalmente no contexto local. O impacto da conclusão do curso aos alunos e quais as áreas de atuação têm maior demanda de mercado. Com este trabalho buscou-se conhecer melhor a realidade dos alunos após a conclusão do curso. O que estão fazendo atualmente os egressos do bacharelado em TICs? Quais as áreas de atuação com maior demanda regional? Quais contribuições podem ser deixadas para o melhoramento do curso, ou seja, quais as necessidades encontradas no mercado que poderiam estar contempladas no curso? Para responder a esses questionamentos no primeiro capítulo é abordada a importância das universidades para o desenvolvimento dos polos tecnológicos. São descritos exemplos de sucesso e principalmente é destaque o Vale do Silício. O impacto desses parques para a economia e a grande lucratividade que a tecnologia gera no mercado atual. Posteriormente, é feita uma descrição profunda do curso superior de Bacharelado de Tecnologias da Informação e Comunicação, como surgiu, qual o seu objetivo e qual o perfil de profissional que espera formar. Bem como é feita uma contextualização do ambiente local e a possibilidade de desenvolvimento regional que o curso traz. No último capítulo do trabalho são trazidas as respostas do questionário elaborado, bem como os resultados obtidos através da pesquisa. Esse capítulo também traz uma análise por área de atuação dos trabalhos de conclusão de curso de todos os alunos egressos. Por fim são apresentadas as considerações finais e em anexo seguem a pesquisa integral com as respostas, bem como todos os títulos dos trabalhos de conclusão de curso e as respectivas palavras chaves.",
    "Conclusão": "Em consoante com o documento que norteia a estratégia nacional de ciência tecnologia e inovação elaborado no ano de 2016 pode-se constatar a importância da pesquisa para o desenvolvimento do país. “Todos convergem ao entendimento de que a pesquisa é um investimento fundamental para a prosperidade de nossos descendentes, para o desenvolvimento sustentável e inclusivo e para a melhoria da qualidade de vida dos brasileiros. ” (MINISTÉRIO DA CIÊNCIA, TECNOLOGIA E INOVAÇÃO, 2016, p.6). É preciso que sejam investidos ainda mais recursos na área de pesquisas educacionais e principalmente na área das tecnologias para que hajam oportunidades de crescimento em todos os setores a partir do investimento das pesquisa nessas áreas. “A convergência tecnológica associada à conectividade e à interatividade são forças que influenciam umas às outras. Essas forças tecnológicas criam um ambiente que possibilita, cada vez mais, o acesso ubíquo em alta velocidade a diversos produtos e serviços.” (INSTITUTO DE PESQUISA ECONÔMICA APLICADA, 2015, p.101). Diante de tal afirmação mais uma vez é reafirmada a importância da tecnologia no cenário atual, e da necessidade de desenvolvimento de tais recursos tecnológicos a importância das TICs é reiterada bem como em conjunto com a conectividade e a interatividade são ferramentas tão presentes e indispensáveis no momento em que vivenciamos que segundo Simon, (,p.76) “[...] com o avanço das TICs, a sociedade cada vez mais se organiza em ambientes virtuais, o ciberespaço também ganha mais importância dentro da sociedade, explorando-se e se aperfeiçoando ainda mais suas funções e até mesmo criando novas”. Conforme o que foi visto durante a elaboração deste trabalho a influência das TICs é notável. “Configura-se como uma megatendência que surpreende a todo instante com seu poder de alterar o ambiente em que vivemos. Referências às TIC aparecem em todos os documentos consultados para identificação das megatendências. (INSTITUTO DE PESQUISA ECONÔMICA APLICADA, 2015, p.102)”. Com isso é reforçado o valor agregado que as TICs trazem em sua essência, pois esse setor do mercado é responsável por uma fatia bastante onerosa no mercado mundial. Diante dos aspectos apontados e da atual importância da tecnologia é sabido da necessidade por profissionais capacitados que atendam a essa demanda emergente e sejam capazes de propor soluções. “[...] indicadores das entidades que congregam as empresas de tecnologias da informação e comunicação do país, apontam que há uma carência de profissionais capacitados em tecnologia no Brasil e ao mesmo tempo, há um crescimento da oferta de novos cursos na área.” ( UNIVERSIDADE FEDERAL DE SANTA CATARINA, 2016, p.15 e p.16) . No intuito de suprir essa necessidade nasce o curso de Tecnologias da Informação e Comunicação, na cidade de Araranguá, para que possa atender a proposta de descentralização da Universidade Federal de Santa Catarina e ciente do potencial de fomento regional, o curso vem proporcionar a formação de profissionais aptos a lidarem com as necessidades do mercado de trabalho. Foi possível identificar outra potencialidade de mercado, o crescente número de startup, para isso o curso também fornece as ferramentas básicas para tornar-se um empreendedor. “O potencial empreendedor poderá ser despertado em alguns dos alunos do curso, e isso pode conduzi-los a apresentar soluções inovadoras e enfocar seus esforços no sentido de montar suas próprias empresas.” ( UNIVERSIDADE FEDERAL DE SANTA CATARINA, 2016, p.16) Em linhas gerais o que se pode perceber é a importância da capacitação desse profissional e do respaldo que encontrará no mercado. “[...] provocar um reconhecimento cada vez maior do curso e dos seus egressos, gerando assim um interesse cada vez maior do mercado nos profissionais aqui formados.” (UNIVERSIDADE FEDERAL DE SANTA CATARINA, 2016, p.16). Quanto a pesquisa a qual os alunos já concluintes foram submetidos, apesar de que a amostra coletada corresponder a menos de 50% de todos os egressos, foi possível identificar a mudança significativa que o curso promoveu na vida profissional. Além disso, outro fato que chamou atenção foi a evidente preferência pela área das tecnologias digitais em relação as demais áreas. Ficou nítida a crescente demanda pelos profissionais habilitados na área das tecnologias digitais, não somente na região de atuação do curso bem como em todas regiões onde os egressos estão residindo atualmente. Uma característica que não pode passar despercebida é a necessidade da base matemática que foi citada por várias vezes no questionário pelos alunos egressos, esse requisito surge como um importante alerta, diante dessa necessidade é preciso que sejam estudadas possibilidades para suprir a essa carência."
}