{
    "Autor": "João Carlos Cichaczewski",
    "Título": "ANÁLISE DA INTERFERÊNCIA MÚTUA ENTRE REDES IEEE 802.11 E IEEE 802.15.4",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Ricardo Moraes",
    "Coorientador(a)": null,
    "Resumo": "Atualmente, tem -se registrado um aumento constante na utilização de redes sem fio para controle e automação de processos nos mais variados ambientes. Nesse s processo s, as padronizações IEEE 802.11 e IEEE 802.15.4 figuram e ntre as redes de maior utilização. Porém, estes padrões de rede podem utilizar a mesma faixa de frequência para transmitir seus dados, ou seja, a faixa ISM de 2,400GHz à 2,480GHz. Essa banda é dividida em 11 canais no IEEE 802.11 e em 15 canais no IEEE 80 2.15.4, existindo sobreposição de canais em muitas situações. Entre os efeitos das interferências geradas pela transmissão em canais sobrepostos está o aumento no número de colisões e em seguida a perda de pacotes. Esses efeitos são altamente impactantes n as taxas de transferênci a das tecnologias supracitadas. Sendo assim, este Trabalho de Conclusão de Curso tem por objetivo avaliar experimentalmente a interferência mútua quando da operação simultânea de dispositivos IEEE 802.11 e IEEE 802.15.4 que comparti lham um determinado ambiente. Primeiramente é realizada uma revisão bibliográfica com o objetivo de fundamentar o estud o das redes sem fio e ao aprofundamento de questões próprias da padronização IEEE 802. Na sequência, apresentam -se os cenários montados e os resultados o btidos, onde contatou -se que ocorre interferência mútua nos casos de transmissão em canais sobrepostos, diminuindo as taxas de transmissão e aumentando o número de mensagens perdidas, efeito que não é registrado quando os dispositivos opera m em canais livre s de sobreposição.",
    "Palavras-chave": [
        "IEEE 802.11",
        "IEEE 802.15.4",
        "WiFi",
        "ZigBee",
        "Interferência",
        "Sobreposição de canais"
    ],
    "Introdução": "Atualmente, as redes sem fio são amplamente utilizadas em diversos domínios de aplicação, que variam de simples usos domésticos a complexos sistemas de automação industrial. A motivação para a utilização desta tecnologia está relacionada a questões como baixo custo e facilidade de instalação e manutenção. Atualmente, as redes padronizadas como IEEE 802.11 (802.11, 2012), conhecidas como redes WiFi, são o padrão de facto em conectividade para redes locais sem fio em ambientes domésticos e de escritório. Devido à implantação bem sucedida das redes sem fio nos ambientes supracitados, há um grande interesse de uso destas redes em outros domínios de aplicação. As redes de sensores sem fio (RSSF) são um exemplo desses novos domínios, onde a comunicação entre os nós é feita através de uma rede ad hoc ou infraestruturada sem fio, e há diversos nodos transmitindo valores do sensoriamento. A ideia é tirar proveito de dispositivos tão pequenos e (espera-se) baratos que possam ser usados em larga escala. Neste sentido, em 2004 o padrão IEEE 802.15.4 (802.15.4A, 2007) padronizou a primeira versão de uma tecnologia de transmissão sem fio de curto alcance, de baixas taxas de transmissão e, principalmente, com baixo consumo de energia. Essa tecnologia, que ficou conhecida comercialmente como ZigBee, incorpora diversas vantagens e é comumente empregada em projetos de monitoramento e sensoriamento remoto (ANDRIGHETTO, 2008). Uma característica comum nos dois modelos apresentados é a transmissão dos dados utilizando a faixa de frequência de 2,4GHz à 2,4835GHz, além da tendência em transmitir utilizando o canal de frequência default (GARCÍA; ALONSO, 2009; SHUAIB et al., 2005). Logo, em situações reais, atuais e futuras, é muito provável a ocorrência de sobrecarga do canal, podendo ocorrer colisões e atrasos na transmissão, além da consequente perda de dados (MATHEW, 2009), pois, como estas redes operam em um ambiente de comunicação aberto, será comum a existência de várias redes operando na mesma área de cobertura. Outra característica em comum nessas tecnologias é a utilização do protocolo CSMA/CA (Carrier Sense Multiple Access with Collosion Avoidance) (MORAES, R.; PORTUGAL; et al., 2010) como mecanismo de controle de acesso ao meio físico. Atualmente, um número significativo de trabalhos de pesquisa está sendo efetuado no desenvolvimento de redes sem fios de alto desempenho. Então, é provável que num futuro próximo, a ampla disponibilidade de soluções de redes sem fios deverá gerar um padrão de facto para comunicação sem fios na Automação, onde os protocolos IEEE 802.11 e IEEE 802.15.4 são os principais candidatos. A utilização de uma infraestrutura de redes sem fio para a Automação ainda apresenta grandes desafios. Os requisitos das aplicações nesta área são muito específicos. Para além do tráfego genérico, similar àquele encontrado em ambientes de escritório/domésticos, existe tráfego com requisitos de tempo real (TR). Este tráfego está tipicamente associado a aplicações de controle, para as quais os dados devem ser periodicamente transferidos entre sensores e controladores de acordo com metas temporais. Ademais, o meio de comunicação em ambientes sem fio é essencialmente aberto. Isso quer dizer que nestes ambientes, um conjunto de estações externas pode formar, por exemplo, uma rede ad hoc e transmitir na mesma faixa de frequência que as estações de tempo real, perturbando o tráfego de TR, que poderá não ser capaz de cumprir as suas especificações temporais. Assim, as abordagens utilizadas em redes cabeadas, baseadas no conhecimento de todo o tráfego da rede, não são mais adequadas. Como consequência, atualmente existem diversas questões em aberto, no domínio das comunicações para a Automação (MORAES, R.; PORTUGAL; et al., 2010). O presente Trabalho de Conclusão de Curso (TCC) pretende colaborar com os estudos referentes à questão das interferências em redes de sensores sem fio, geradas por sinais transmitidos por outras redes sem fio que, em um meio compartilhado, estejam a operar na mesma faixa de frequência.",
    "Conclusão": "A operação simultânea de tecnologias de redes sem fio em ambientes compartilhados, não só está se tornando cada vez mais comum, como é imprescindível que sejam propostas formas de melhorar a eficiência da comunicação nesse tipo de cenário. O presente trabalho se propôs a analisar os efeitos da interferência mútua entre os padrões IEEE 802.11 e IEEE 802.15.4, em operação simultânea e no mesmo ambiente de comunicação. Para tanto, constatou-se que as menores taxas de perdas de pacotes, durante uma transmissão em simultâneo, são verificadas nos canais 15 e 20 do IEEE 802. Através dos experimentos, conclui-se que a sobreposição de canal não só ocasiona colisões, aumentando o número de pacotes perdidos, como também afeta a taxa de transmissão. O padrão IEEE 802.11 também apresentou melhores resultados quando operando em canal não sobreposto, corroborando a necessidade de operar em canais distintos para maximizar a eficiência e a qualidade da comunicação."
}