{
    "Autor": "Joildo Schuero",
    "Título": "Desenvolvimento de um Sistema de Visão Artificial para um Robô Explorador",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Anderson Luiz Fernandes Perez",
    "Coorientador(a)": null,
    "Resumo": "Um robô móvel explorador de ambientes deve ser dotado de um sistema de visão artificial que seja capaz de captar e processar imagens provenientes de uma câmera a fim de encontrar padrões que possam ser utilizados para identificar um ou mais objetos presentes no ambiente. Um robô móvel equipado com um sistema de visão artificial é de grande utilidade, uma vez que o robô pode tomar decisões baseadas nas informações visuais recebidas e processadas. Este trabalho descreve um sistema de visão artificial para um robô explorador de ambientes indoor e outdoor. O sistema é baseado nas informações visuais lidas a partir de uma câmera posicionada na parte superior do robô. As imagens são processadas com o objetivo de calcular a trajetória do robô até um objeto mapeado, com base na trajetória calculada o sistema determina um novo posicionamento para o robô.",
    "Palavras-chave": [
        "Visão Artificial",
        "Processamento Digital de Imagens",
        "Robótica Móvel",
        "Robô Explorador"
    ],
    "Introdução": "Com o passar dos anos os sistemas digitais têm impulsionado diversos setores da economia mundial, com destaque para o processamento digital de imagens. Técnicas de processamento de imagens são empregadas para a obtenção de informações mais precisas, visando a melhoria da qualidade de diversos processos e o auxílio na tomada de decisões.\nO processamento digital de imagens é útil em áreas como a medicina (RONG et al., 2011), indústria (SARDIS; VARVARIGOU, 2010) e a robótica (CABRE et al., 2013). Ao longo dos anos pesquisas vêm sendo realizadas visando contribuir e/ou melhorar as técnicas de processamento de imagens (OKASAKI; DÜCK; ALVES, 2013).\nSegundo (GONZALEZ; WOODS, 2009) o processamento digital de imagens relaciona-se com:\n\nA melhoria na informação fotográfica para a interpretação humana;\nO processamento de dados, em forma de imagens para armazenamento, transmissão e representação para sistemas computacionais, com a capacidade de percepção automática.\nA medida que a capacidade do processamento computacional aumenta, novas tecnologias de processamento de imagens surgem, gerando novos desafios, principalmente no campo exploração e monitoramento. Informações provenientes do processamento digital de imagens podem trazer muitos benefícios importantes como a identificação de agentes patológicos de algumas doenças e o auxílio a tarefas do cotidiano humano. Por meio de imagens, sistemas computacionais podem realizar tarefas com um grau de acurácia maior do que os seres humanos.\nUm dos desafios na robótica móvel é fazer com que robô conheça o ambiente em que está inserido, possibilitando recolher informações das mais diversas possíveis por meio de sensores. Com o auxílio da visão artificial, um robô pode executar tarefas complexas (BAHN et al., 2011). Segundo (HUANG, 2011) os robôs móveis têm atraído atenção devido à capacidade de mover-se em qualquer direção, em locais dos mais variados e podem ser utilizados para:\n\nMonitoramento;\nExploração;\nExploração e monitoramento em conjunto.",
    "Conclusão": "Este trabalho descreveu um sistema de visão artificial, desenvolvido para um robô explorador de ambientes indoor e outdoor. O robô utilizado possui 6 (seis) sensores de ultrassom e uma câmera do tipo webcam. O hardware do robô foi projetado de forma híbrida sendo composto por dois módulos de controle. \nO objetivo do robô explorador é manter o foco sobre um objeto que pode estar em movimento no ambiente. Caso o objeto se desloque, fazendo com que a câmera perca a imagem do objeto, o sistema faz uma varredura no ambiente até localizar novamente o objeto e fazer com que a câmera mantenha este em foco. \nRobôs exploradores são utilizados para as mais diversas tarefas, podendo ser aplicados em problemas simples como aspirar o pó de uma residência ou problemas mais complexos, como inspecionar um duto de transporte de óleo ou gás natural. A visão é uma importante ferramenta para este tipo de robô, uma vez que permite que este localize e manipule determinados objetos reconhecidos no ambiente. \nSistemas de visão artificial também podem ser aplicados em outras áreas como a automação veicular. Nos dias atuais alguns modelos de veículos possuem sistemas que auxiliam o motorista em atividades como estacionar em uma vaga paralela. Num futuro espera-se que os veículos possam ser dotados de câmeras para identificar as placas sinalizadoras e faixas de uma autoestrada, desta forma, poderão auxiliar o motorista na tomada de decisões, como por exemplo, em uma ultrapassagem. \nOs resultados obtidos com o sistema de visão artificial demonstraram que o robô identificou o objeto em diferentes situações e gerou um novo posicionamento para o servomotor de controle da câmera e os motores de controle de direção e velocidade, fazendo com que o robô se posicionasse de maneira correta em direção ao objeto mapeado."
}