{
    "Autor": "Jonathan da Silva Maciel de Estefani",
    "Título": "Desenvolvimento de um protótipo de um sistema web para gestão de trabalhos acadêmicos",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Dr. Vilson Gruber",
    "Coorientador(a)": "",
    "Resumo": "Existem ferramentas gratuitas para gestão de projetos no mercado, possuem diversos recursos que auxiliam na gestão de projetos, porém voltadas para usos genéricos. Ao iniciar a disciplina de projeto integrador II para elaboração do trabalho de conclusão de curso, o discente muitas vezes fica sem saber por onde começar e como fazer uma gestão mais eficaz do seu projeto acadêmico. Existe documentos de template que auxiliam na elaboração da escrita do TCC para o discente, porém esses templates não auxiliam na gestão do cronograma, comunicação e do processo de desenvolvimento. Por outro lado o docente possui vários trabalhos para orientar e fazer a gestão desses projetos, a necessidade é que hoje existem muitas ferramentas de gestão de projetos no mercado, mas não especializadas para gestão de trabalhos acadêmicos, com isso o docente sente a necessidade de uma ferramenta que centralize todas essas informações para ajudar na gestão desses trabalhos e facilitar a orientação dos seus discentes, podendo usar ela inclusive para se comunicar com seus discentes, sem a necessidade de definir vários meios de comunicação. Através disso foi possível identificar que um sistema web que centralize todos os projetos acadêmicos e facilite a comunicação com seus discentes, iria resolver muitos desses problemas na gestão desses projetos, e centralizar toda a comunicação em uma única ferramenta com seus discentes, permitindo todos os envolvidos acompanharem o andamento na gestão do cronograma do projeto. Foram pesquisadas algumas tecnologias no mercado para tentar resolver esses problemas, e após análise optou-se pelo material design da google como padrão de layout e estilização de páginas web, framework materializecss que implementa os conceitos do material design, framework angular para a arquitetura de projeto e implementação das regras de negócio e todas as telas, a arquitetura REST para comunicar-se com a API do backend, e mattermost como ferramenta de comunicação entre todos os envolvidos no projeto. Foi implementado o protótipo de sistema web usando as tecnologias pesquisadas, configurado a ferramenta de comunicação a fim de tentar resolver o problema de comunicação entre os envolvidos no projeto, todas as telas do protótipo foram implementadas e sendo responsivas usando o framework materializecss e disponibilizado em um servidor na amazon para teste entre os envolvidos nesse protótipo. Com a implementação desse protótipo, ainda assim é possível identificar a necessidade de algumas melhorias que podem ser feitas, colocando mais recursos para o docente e discente, como relatórios sobre o acompanhamento, e uma comunicação integrada dentro da ferramenta, para resolver algumas questões de usabilidade para os usuários, e um aplicativo para integrar na ferramenta de gestão de trabalhos acadêmicos.",
    "Palavras-chave": "Trabalhos acadêmicos, Angular, TypeScript, Protótipo de Sistema Web.",
    "Introdução": "Com o avanço das Tecnologias da Informação e Comunicação em diversas áreas, tem-se percebido a grande mudança que nossa cultura tem passado, muitos processos manuais foram automatizados e outros melhorados, o que antes era necessário recorrer a um computador para se obter novos conhecimentos ou fazer alguma pesquisa, hoje temos tudo na palma da mão, através das TICs que invadiram o espaço em todos os aspectos, com isso surgiu a ideia de se adaptar a essa nova cultura e usarmos para benefício no meio acadêmico no processo de criação dos projetos de gestão. Diante desse cenário perceptível, é importante o apoio da universidade em investir e aplicar o uso das TICs para automatizar esse processo que vem sendo usado com dificuldade pelos docentes no meio acadêmico, precisamos refletir em como tirar melhor proveito das TICs e contribuindo assim para agregar novos hábitos, valores e costumes reconfigurando a cultura contemporânea (Damasceno; Cardoso e Costa, 2018). As TIC ampliam a capacidade cognitiva dos seres humanos (aumento da memória, percepção, imaginação), provocando dessa forma, \"uma profunda mutação na relação com o saber\". (LÉVY, 2010, p. 174). Essa cibercultura que as TICs estão trazendo, vai ser possível ver muitas mudanças no nosso meio, na construção do saber e uma inteligência coletiva (Pierre e Lévy, 2010). Com isso será possível que novos conceitos, produtos e serviços tecnológicos façam parte do nosso dia a dia, mudando muitos paradigmas que estamos acostumados a usar. A forma como gerimos nossa vida, ficará mais fácil através do uso das TICs, podendo trazer melhores resultados e mais apurados quando consultados, pois todas essas informações estão migrando para nuvem, conceito usado no armazenamento de informações e consumo de serviços pela web, pois muitos serviços antes feitos manualmente estão virando serviços online, através da internet podendo ser acessível a qualquer pessoa de forma fácil, em qualquer lugar a qualquer hora (Pierre e Lévy, 2010). Para Lemos (2000) uma grande evolução ocorreu na microeletrônica, que trouxe um grande impacto na economia e na vida das pessoas, onde foi possível ver grandes mudanças de paradigmas como na área dos softwares que estão fazendo parte da vida removendo tarefas que antes eram feitas manualmente, e que agora estão automatizadas conforme esse grande avanço da tecnologia. Segundo Saito (2016) uma forma de melhorar a inovação na área da tecnologia, é o apoio das empresas para melhorar a pesquisa e desenvolvimento aumentando assim o desenvolvimento econômico do país, gerando novas experiências e conhecimento para todos.  Através do incentivo a pesquisa e desenvolvimento, novas soluções poderão surgir para o meio acadêmico, e com essas inovações aplicada no meio acadêmico, o docente terá mais facilidades para fazer a gestão dos seus discentes e poder orientar, acompanhar todos os projetos acadêmicos em uma ferramenta centralizada. Para o discente mais organização e controle no desenvolvimento de seu projeto, aproximando-se mais do docente. Muitas ferramentas de gestão de projetos existentes no mercado visam melhorar a organização e gerenciamento dos projetos e de todos os stakeholders, porém com os recursos que elas proporcionam não atendem especificamente a necessidade de gestão de projetos acadêmicos, em que permita aproximar o docente e o discente no planejamento estratégico e acompanhamento das atividades do cronograma, no desenvolvimento e no processo de avaliação. O discente tem grande dificuldade em fazer a gestão do seu projeto de conclusão de curso com seu docente e sanar suas dúvidas, por falta de organização, e por não saber por onde começar o desenvolvimento conforme aponta a pesquisa de Alves, Urquiza e Roland (2016). Foi feito uma pesquisa e encontrado alguns trabalhos de conclusão de curso que têm os objetivos parecidos para atender essa necessidade, na gestão de trabalhos acadêmicos. Algumas são específicas para gestão de trabalhos de conclusão de curso, outros para gerenciamento de bancas e persistência em locais seguros de trabalhos acadêmicos. Diante do desafio apresentado pretende-se neste trabalho desenvolver um protótipo de sistema web que contribua para a melhoria no processo de gestão dos sistemas acadêmicos. Será que as TICs podem contribuir para um processo de gestão mais eficaz na gestão de cronograma e comunicação de projetos acadêmicos?",
    "Conclusão": "O resultado desse protótipo era possuir mais recursos, porém pela falta de mais conhecimento do framework, acabou dificultando um pouco no desenvolvimento, a integração entre outros frameworks front-ends e componentes, acabou levando um tempo maior que o previsto, mas como protótipo inicial, também vale ressaltar que deve ser avaliado por outros docentes se o sistema web já atende as necessidades e se é usável, ao ponto de ser útil como sistema padrão entre a maioria dos docentes. Foi possível observar que, é necessário o apoio do corpo docente para projetos como esse, para que venha haver mais interesse de outros colaboradores em desenvolver sistemas e ferramentas aproveitando todo o conhecimento adquirido durante todo o curso, aplicando em favor da universidade, trazendo mais benefícios a todos. O levantamento de requisitos para o desenvolvimento do protótipo de sistema web para gestão de trabalhos acadêmicos, possibilitou uma abstração melhor sobre como a gestão de projetos na área acadêmica é importante, principalmente usar as TICs ao nosso favor para obter melhores resultados e uma gestão que aproxime mais os docentes e discentes através de uma ferramenta específica para o desenvolvimento do projeto de conclusão do curso. No desenvolvimento desse protótipo, foi possível identificar futuras melhorias que serão abordadas no próximo capítulo em trabalhos futuros, mas que trouxeram novas ideias através de reuniões de Brainstorming com o corpo docente e discente, que podem diminuir ainda mais a distância entre os envolvidos no(s) projeto(s). Também foi possível identificar que o uso do Angular, possui uma curva de aprendizado maior que algumas bibliotecas convencionais como JQuery dentre outras usadas no mercado, gerando assim um tempo maior que o esperado no desenvolvimento de algumas telas que se fossem usadas as bibliotecas convencionais, levaria menos tempo, porém ao desenvolver um protótipo de sistema, deve-se analisar qual a finalidade que se deseja, buscar as melhores soluções para o problema, para um projeto se tornar escalável, diante disso, foi analisado que para esse projeto, seria melhor um framework que é mantido por uma das maiores empresas de tecnologia, garantindo assim, sempre novos lançamentos e correções de bugs e obedecendo a padrões de projetos que tornam o projeto escalável e seguro, confiável e mais atualizado, diante das inovações e exigências do mercado. O protótipo pode trazer novas experiências que atualmente não conhecia, através das documentações do framework foi possível adquirir ideias melhores para uma futura versão, melhorando o código fonte na estruturação de algumas classes do projeto. Em algumas implementações, foi possível identificar a necessidade de uma refatoração em algumas partes, evitando assim comentários para outros futuros desenvolvedores, um código escrito de forma clara, não existe a necessidade de ter comentários, se bem escrito, a maioria dos desenvolvedores irão entender. Com mais protótipos como esse, é possível que traga mais resultados na gestão de trabalhos acadêmicos, visto que o docente consegue acompanhar todas as etapas sem necessidade de ficar procurando um meio que foi combinado, como o docente possui vários discentes para orientar, fica mais fácil fazer uma gestão de todos eles em uma ferramenta que tem a intenção de centralizar toda a gestão e futuramente a comunicação entre todos os envolvidos. Inicialmente foi usado o Angular Material que é responsável em aplicar os conceitos do Material Design da Google em todos os componentes nas páginas, como botões, seletores, formulários dentre outros, porém durante o uso, foi identificado alguns problemas ao usar alguns componentes, para esse protótipo teve que ser buscado outra alternativa para contornar o problema, sendo a alternativa o framework MaterializeCss que é baseado na biblioteca JQuery. Durante a integração entre os dois frameworks, houve alguns problemas de compatibilidade com a versão do Angular que foi usado nesse protótipo. Foi feito diversas pesquisas em relação aos problemas encontrados, e alguns foi possível achar soluções alternativas para corrigir os erros encontrados ao usar alguns componentes, outros houve a necessidade de improvisar usando o Javascript dinâmico para corrigir alguns Bugs, durante as pesquisas em alguns fóruns como Stackoverflow, site responsável de perguntas e respostas e avaliações da melhor resposta, foi identificado que esses problemas seriam corrigidos pela equipe responsável dos componentes. Almejo em continuar o desenvolvimento desse projeto, entre outros que pretendo usar o conhecimento adquirido durante o curso para construir novas soluções para a comunidade de Software Livre e Open Source. Através desse protótipo, pude aprender e adquirir novos conhecimentos no desenvolvimento web."
}