{
    "Autor": "KAROLINI RODRIGUES DA CONCEIÇÃO, MIGUEL ANTENOR DE OLIVEIRA",
    "Título": "DESENVOLVIMENTO DE UM JOGO SÉRIO PARA O ENSINO DE ANATOMIA DO MEMBRO INFERIOR DO ESQUELETO HUMANO",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "Com a tendência crescente no desenvolvimento de novas tecnologias educacionais, em particular no campo da saúde, como dar suporte em diagnósticos, visualização de informação de dados ou mesmo em ambientes virtuais que auxiliam na cirurgia, é possível encontrar grandes oportunidades de inovação na construção de técnicas eficientes de ensino e aprendizagem das ciências da saúde. O aumento exponencial nos cursos de graduação e pós-graduação em ciências da saúde requer materiais avançados para estudos na área. O uso de livros ou modelos anatômicos nem sempre são capazes de fornecer um realismo que são abordados por novos recursos tecnológicos. Neste contexto surge a necessidade de ferramentas que podem auxiliar no ensino e aprendizagem, a fim de qualificar os profissionais de saúde para o futuro. Assim, este trabalho tem como objetivo apresentar um jogo sério para estudar a anatomia humana aplicando o uso de Tecnologias de Informação e Comunicação (TIC). Para isso, foi desenvolvido um jogo sério composto por um ambiente de aprendizagem e interação usando a plataforma de desenvolvimento de jogos conhecida como Unity 3D. O jogo sério intitulado EducaAnatomia3D apresenta um ambiente de interação dividido em duas partes principais: a apresentação do conteúdo para o estudo da anatomia humana, com foco nos acidentes ósseos do membro inferior do esqueleto humano, e a fixação do conteúdo. Todas as fases de desenvolvimento do jogo sério contaram com a participação de especialistas em Anatomia Humana. A metodologia utilizada consiste em estudos bibliográficos e exploratórios. Na avaliação de usabilidade do EducaAnatomia3D foi realizado um estudo de caso com alunos da disciplina de Anatomia II do curso de Fisioterapia da Universidade Federal de Santa Catarina (UFSC) – Centro Araranguá. Para tal foi elaborado um questionário de satisfação, contendo 15 perguntas relacionadas a 5 fatores de usabilidade, e solicitado ao final do estudo de caso o preenchimento do questionário por parte dos alunos (n=23) e do professor. Com base nas respostas obtidas pode-se concluir que o jogo sério apresentou resultados satisfatórios como uma ferramenta para auxiliar no processo de aprendizagem de estudos de Anatomia. Além disso, algumas sugestões de melhoria foram propostas pelos alunos, as quais serão levadas em consideração em futuros projetos nesta área.",
    "Palavras-chave": "Jogos Sérios, Jogos sérios na saúde, Ambientes virtuais de ensino de Anatomia.",
    "Introdução": "Com o passar dos anos, a disseminação da informação adquirida pelos avanços tecnológicos tornou as abordagens de conhecimentos mais complexas e consequentemente causaram uma mudança na forma de como as pessoas produzem a informação. Logo, o uso de jogos para treinar, aprender e executar atividades reais em ambientes realísticos pode melhorar o desempenho dos estudantes, pois possibilita a vivência de experienciais de aprendizagem produzidas individualmente de acordo com o estilo do estudante. (SILVA, 2012 apud PRIKLADNICKI e WANGENHEIM, 2008, p.13). Focando no âmbito da saúde se tem uma grande oportunidade no uso de jogos incorporados em disciplinas na área de anatomia, fisiologia, histologia, embriologia e neurofisiologia, servindo como um recurso facilitador para os estudantes. Desse modo, “através da combinação de modelos computacionais de estruturas anatômicas com software personalizado podemos ter alunos com novas formas de interagir com a anatomia que não poderia ser alcançado através do uso de imagens estáticas e diagramas. ” (MA; BALE; REA, 2010, p. 45). Desta forma, a utilização de jogos para o ensino se tornou oportuno, tendo em vista que contribui significativamente para a construção do ensino-aprendizado mais dinâmico. A aprendizagem baseada em jogos digitais é uma abordagem inovadora no domínio das universidades e está se tornando uma forma de conteúdo interativo, que merece ser explorada (SILVA, 2012 apud PIVEC, 2007, p.12). Neste trabalho é apresentado um ambiente voltado para o ensino de anatomia dos ossos do membro inferior humano. Para tal, foi desenvolvido o jogo sério intitulado EducaAnatomia3D, que visa auxiliar no ensino dos estudantes da área da saúde. Em particular, o jogo apresenta um ambiente de ensino da anatomia do membro inferior do esqueleto humano possibilitando o estudo e interação de conceitos associados à aprendizagem a nível de ensino para cursos de graduação na área da saúde.",
    "Conclusão": "Jogos sérios vem se tornando uma importante ferramenta de inovação e incorporação dentro das universidades, visto que possibilita um realismo maior na construção do ensino e aprendizagem. O jogo sério EducaAnatomia3D visa facilitar o ensino de Anatomia, permitindo uma nova forma de auxílio para estudos e testes do conhecimento nesta área. Existem jogos sérios e ambientes virtuais disponíveis na literatura para o ensino e aprendizagem da disciplina de Anatomia onde diversos sistemas do corpo humano podem ser explorados. No entanto, a abordagem no projeto de jogos sérios e dos ambientes virtuais para o ensino da Anatomia Humana encontrado na literatura apresentam normalmente diversos sistemas do corpo humano do ponto de vista de um atlas 3D. O estudo desenvolvido para o EducaAnatomia3D permitiu com o auxílio de especialistas em Anatomia Humana explorar informações importantes no entendimento da função e estrutura dos ossos através do detalhamento das informações associadas aos acidentes ósseos. Desta forma, o EducaAnatomia3D representa um passo na direção de jogos sérios onde os alunos de graduação na área de ciências da saúde possam fazer uso de um ambiente virtual de ensino e aprendizagem onde a apresentação do conteúdo de estudo e a fixação do conteúdo leva em consideração conceitos associados à função e estrutura dos ossos. A avaliação de usabilidade do jogo sério através de um estudo de caso envolveu a participação de 23 alunos, no qual foi possível perceber um resultado satisfatório na utilização do jogo. O estudo de caso obedeceu ao tempo proposto, na qual os alunos utilizaram o jogo de forma regular para depois ser respondido o questionário de satisfação para avaliação da aplicação. No geral a aplicação recebeu uma boa pontuação e boas ideias de possíveis melhorias para tornar a experiência mais completa e interessante."
}