{
    "Autor": "Leandro Faber Martins",
    "Título": "USO DE FERRAMENTA DE EAD PARA FORMATAR PROPOSTA DE IMPLANTA ÇÃO DO PLANO DE INST RUÇÃO E MANUTENÇÃO DIÁRIA NO CORPO DE BOMBEIROS MILITAR DE ARARANGUÁ",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Paulo Cesar Leite Esteves, Dr.",
    "Coorientador(a)": "Prof. Vilson Gruber, Dr.",
    "Resumo": "O presente trabalho foi elaborado por meio de uma pesquisa bibliográfica, documental e qualitativa as quais viabilizaram a elaboração de uma proposta de formatação do Moodle para a implantação do Plano de Instrução e Manutenção Diária (PIMD). Para tal, são abordados temas relevantes que fundamentam esta modelagem, como conceitos gera is de Educação à Distância (EaD), Ambientes Virtuais de Aprendizagem (AVA) e Educação Corporativa (EC). O sistema proposto tem por objetivo servir como ferramenta de apoio na atualização d o bombeiro militar no tocante à área de atuação deste. Os conteúdos utilizados na formatação do ambiente foram elaborados de acordo com os tipos de ocorrências atendidas e com uma base de dados já existente no Corpo de Bombeiros Militar de Santa Catarina (CBMSC). Após a formatação do ambiente denominado Atualização do Efetivo, foi então criado um questionário fechado com perguntas de múltipla escolha para validação e mostrados os resultados. Para finalizar é apresentada a conclusão referente ao ambiente formatado com as amostras de conteúdos.",
    "Palavras-chave": "Plano de Instrução e Manutenção Diária, Educação à Distância, Ambientes Virtuais de Aprendizagem, Educação Corporativa, Corpo de Bombeiros Militar de Santa Catarina.",
    "Introdução": "A educação, em todo o mundo, vem passando por transformações. Inicialmente, é oportuno destacar alguns aspectos significativos que estão influenciando e contribuindo para as grandes mudanças no campo educacional, são eles: a evolução do conhecimento, e a revolução tecnológica. No tocante à evolução do conhecimento, pode-se assegurar que estamos na Era do Conhecimento, num cenário de mudanças permanentes, onde o conhecimento se multiplica num ritmo acelerado, sendo, então, crescente a necessidade de educação continuada. A revolução tecnológica, por sua vez, vem contribuindo para modificação e criação de novas formas de lazer, de estudo e de trabalho das pessoas, trazendo grandes mudanças em seu cotidiano. No âmbito organizacional também há a exigência de acompanhar as mudanças no processo de educação. As organizações precisam, então, rever as práticas antigas de Treinamento e Desenvolvimento para assim apontarem para outro modelo, um modelo compatível com as diversas e inovadoras formas de promover a educação, bem como capaz de responder às necessidades de capacitação contínua ou educação continuada. Nesta perspectiva, a Educação Corporativa tem considerado o emprego das Tecnologia s de Informação e Comunicação (TIC), tornando dispensável a presença física do instrutor/professor em alguns níveis do processo de ensino, seja em cursos de nível superior, médio ou de atualização profissional. Este novo processo educacional conta com uma ferramenta que tem se configurado em uma das áreas do conhecimento que mais se desenvolvem: a Educação à Distância. No contexto organizacional público também se verifica a necessidade de capacitação de servidores para que estes possam cumprir, com excelência, o seu papel social. O serviço público atualmente tem o desafio de construir uma gestão, para o desenvolvimento de pessoas, que venha contribuir para o cumprimento de sua missão. Nessa perspectiva, o Corpo de Bombeiros Militar de Santa Catarina passa por um processo de modernização onde a gestão do desenvolvimento de pessoas ocupa lugar de grande importância, onde a EaD assume papel relevante neste processo. O CBM SC está em processo de implantação do Plano de Instrução e Manutenção Diária, um projeto lançado pelo Comando Geral com foco na busca constante pela atualização e manutenção de seu efetivo. Com base nestes elementos, o presente trabalho sugere uma proposta para estruturar o PIMD para ser implantado na 3ª Cia do 4º Batalhão de Bombeiros Militar (3ª/4ºBBM) de Araranguá utilizando uma ferramenta de EaD de forma a beneficiar os envolvidos no processo de ensino/aprendizagem mantendo assim a padronização do efetivo. Este trabalho busca ainda auxiliar na reflexão acerca das vantagens do uso de Ambientes Virtuais de apoio ao processo de Ensino e Aprendizagem no meio Corporativo, como elemento de suporte aos treinamentos semipresenciais. Entende-se por cursos semipresenciais aqueles em que parte dos encontros são presenciais e parte dos trabalhos são desenvolvidos na modalidade à distância, com separação temporal e geográfica entre os estudantes e os professores. O trabalho tem como foco a EaD para padronizar os conteúdos referentes à atualização e novos conhecimentos da área de atuação repassados para os bombeiros, possibilitando maior dinamismo nas atualizações de conteúdos, na disponibilização dos mesmos bem como horários mais dinâmicos e pertinentes àqueles que buscam o conhecimento. Convém destacar que este tema foi escolhido pelas seguintes razões: - A relevância que a modalidade EaD representa na educação corporativa, pois há um aumento considerável de organizações corporativas investindo em programas de EaD no Brasil, o que vem suscitando pesquisas nesta área. - Pela originalidade, pois ainda não há nenhum estudo sistemático acerca da implantação da EaD na modalidade semipresencial no CBMSC referente ao PIMD. - Por questão pessoal, pois o autor é bombeiro militar do CBMSC, que ainda não possui nenhum programa de EaD, mas poderá implantar futuramente. O autor pretende contribuir no processo de implantação dentro da corporação.",
    "Conclusão": "A resposta ao objetivo específico 1 que trata de um estudo referente ao Plano de Instrução e Manutenção Diária foi apresentada no capítulo 2, onde primeiro foi relatada a história resumida do CBMSC, a história também resumida da 3ª/4ºBBM e por fim é apresentado o PIMD. O PIMD foi elaborado pelo comando geral do CBMSC objetivando que cada unidade o utilizasse de forma a disponibilizar aos Bombeiros Militares a constante atualização e orientações nas mais diversas áreas de atuação do Corpo de Bombeiros Militar de Santa Catarina. As instruções contidas no PIMD são chamadas de Instrução e Manutenção de Tropa (IMT). Respondendo ao objetivo específico 2 referente a estudos sobre EaD foi elaborado o capítulo 3, onde foi apresentada uma breve história da EaD com interpretações de alguns autores como Giusta (2003) que cita que EaD é uma forma de interação onde ...” professores e alunos se envolvem em situações de ensino/aprendizagem, em espaços e tempos que não compartilham fisicamente, utilizando-se da mediação propiciada por diferentes tecnologias, principalmente pelas tecnologias digitais”. O capítulo 4 surgiu devido a pesquisa para responder ao objetivo específico 3 que tratava de um estudo referente à Educação Corporativa. Este capítulo mostrou que a EC tem como proposta alinhar os membros da organização a os seus objetivos, oferecendo soluções de aprendizagem para cada tipo de função em distinto. O item 4 e 5 dos objetivos específicos que tratam da realização de estudos mais aprofundado sobre o Moodle, suas funcionalidades e a formatação para que possa atender da melhor forma possível às necessidades da 3ª/4ºBBM foi foco de estudo no capítulo 5, onde foram verificados os recursos disponibilizados pelo Moodle e quais seriam relevantes para o ambiente pretendido, como exemplo de recursos relevantes pode-se citar o: fórum de discussão, chat, fórum de notícias, dentre outros. O capítulo 6 deste trabalho foi apresentado como resposta aos quesitos 6 e 7 dos objetivos específicos, que através da validação mostrou que o ambiente respondeu positivamente às expectativas esperadas pelos usuários e pelo autor do trabalho. Isso pode ser verificado através das respostas dados pelos usuários ao questionário objetivo que mensurou a satisfação dos usuários quanto a: recursos disponíveis; formas de apresentação de conteúdo; conteúdo disponível; navegação pelo ambiente; facilidade de acesso ao ambiente; dentre outros. Pode-se falar ainda sobre resultados obtidos que como fruto deste trabalho a 3ª/4ºBBM de Araranguá agora possui um Ambiente Virtual de Aprendizagem formatado, voltado ao Plano de Instrução e Manutenção Diária e com amostras de conteúdos referentes à Instrução e Manutenção de Tropa, para auxiliar o efetivo a manter-se atualizado no que tange à área de atuação do bombeiro militar. Este ambiente mostrou-se adequado a sua proposta e todos os usuários foram unânimes em apoiar a ideia de atualizar-se através de um AVA. Para finalizar, o autor considera que os objetivos propostos foram alcançados. Além do aprendizado com a formatação do ambiente e com os estudos para que tal formatação fosse possível o autor deixa para a 3ª/4ºBBM de Araranguá um ambiente já com algumas Instruções de Manutenção de Tropa para servir de modelo para novas instruções, objetivando-se assim um efetivo mais atualizado e padronizado a cada dia. O autor considera que o ambiente tem grandes chances de ser implantado em definitivo na 3ª/4ºBBM de Araranguá como padrão para atualização do efetivo. Trabalhos Futuros: Como sugestão para trabalhos futuros sugere-se a formatação de outros cursos dentro da corporação na modalidade EaD, como por exemplo o curso de Cabo Bombeiro Militar. Para a promoção de Cabo o Soldado deve deslocar-se para o Centro de Ensino em Florianópolis/ Santa Catarina para frequentar um curso de aproximadamente 2 meses onde a maior parte do conteúdo repassado no curso é teórico. Sendo assim, o futuro Cabo poderia fazer a parte teórica deste curso no lugar e horário em que mais lhe fosse conveniente e deslocar-se até o Centro de Ensino apenas quando as aulas exigissem práticas."
}