{
    "Autor": "Luis Alberto Kurten Seemann",
    "Título": "Uma plataforma experimental para a análise de desempenho de redes sem fio padrão IEEE 802.11",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Ricardo Alexandre Reinaldo de Moraes",
    "Coorientador(a)": "",
    "Resumo": "Uma forte tendência atual na área de automação industrial, residencial e hospitalar, é o da transferência de tempo real, através de uma estrutura de redes sem fio, de dados relacionados a sensores, atuadores e diagnóstico dos sistemas. Porém, as tecnologias e técnicas atuais ainda são incapazes de controlar tarefas com requisitos temporais (dead lines) críticos utilizando estas redes. Este trabalho de conclusão de curso (TCC) está enquadrado nesta área de pesquisa e durante o seu desenvolvimento, um cenário experimental para avaliar a comunicação de tempo real em redes sem fio, compatíveis com o padrão IEEE 802.11, foi construído. Experimentos foram realizados para avaliar o desempenho de uma rede composta de estações tempo real (TR) que compartilha o canal de comunicação com estações não tempo real (NTR). O conjunto de estações NTR transmite tráfego de fundo para simular um ambiente real que é aberto. Neste TCC, apresentam-se resultados preliminares para alguns valores das janelas de contenção (CW) no qual é um dos mecanismos responsáveis para fornecer prioridades na função EDCA, onde foi possível verificar que os valores definidos no padrão não são adequados em ambientes de comunicação abertos. Os resultados experimentais obtidos demonstram que há uma alta taxa de perda de dados.",
    "Palavras-chave": "Redes de computadores. Padrão IEEE 802.11e. Padrão IEEE 802.15.4. Automação.",
    "Introdução": "A necessidade de alternativas mais eficientes e comodas para prover a comunicação entre dispositivos computacionais está fazendo das redes sem fio a forma mais utilizada em ambientes domésticos e corporativos. As redes padrão IEEE 802.11 (IEEE COMPUTER SOCIETY, 2012), também conhecidas como redes WiFi, são hoje o padrão de facto em conectividade para redes locais sem fio (MORAES et al., 2007, 2010). Segundo Moraes, Vasques e Portugal (2010), atualmente, um número significativo de trabalhos de pesquisa está sendo efetuado no desenvolvimento de redes sem fios de alto desempenho e esta tendência é uma consequência da crescente utilização de comunicações sem fios em ambientes de escritório e doméstico. Então, é provável que num futuro próximo, a ampla disponibilidade de soluções de redes sem fios irá também gerar um padrão de facto para comunicação sem fios na automação, onde o conjunto de protocolos normalizados IEEE 802.11 (IEEE COMPUTER SOCIETY, 2012) é um dos principais candidatos. Ainda segundo Moraes, Vasques e Portugal (2010), a utilização de uma infraestrutura de redes sem fio na automação apresenta grandes desafios. Os requisitos das aplicações nesta área são muito específicos, onde além do tráfego genérico, similar àquele encontrado em ambientes de escritório/doméstico, existe tráfego com requisitos de tempo real (TR). Este tráfego está tipicamente associado a aplicações de controle, para as quais os dados devem ser periodicamente transferidos entre sensores, controladores e atuadores de acordo com metas temporais. Além disso, o meio de comunicação em ambientes sem fio é essencialmente aberto. Isso quer dizer que nestes ambientes, um conjunto de estações externas pode formar, por exemplo, uma rede ad hoc e transmitir na mesma faixa de frequência que as estações de TR, perturbando o tráfego de TR, que poderá não ser capaz de cumprir as suas especificações temporais. Assim, as abordagens utilizadas em redes cabeadas, que se baseiam no conhecimento de todo o tráfego da rede, não são mais adequadas. Como consequência, atualmente, há muitos problemas em aberto no domínio das comunicações para a automação.\nO presente Trabalho de Conclusão de Curso (TCC) colabora para demonstrar que as abordagens tradicionais para suportar comunicações de tempo real em redes CSMA (Carrier Sense Multiple Access) não são adequadas, uma vez que impõem modificações da interface de rede das estações externas que compartilham o mesmo meio de comunicação, ou seja, são baseadas no controle estrito das oportunidades de comunicação de cada dispositivo, o que requer um ambiente de comunicação completamente sob a esfera-de-controle da arquitetura de comunicação de TR.",
    "Conclusão": "A plataforma experimental construída e utilizada para a realização dos experimentos é composta por um conjunto de hardware e software, onde estações de TR e NTR compartilham o mesmo meio de comunicação. Os dispositivos utilizados na plataforma implementam o mecanismo EDCA conhecido comercialmente como WMM, as estações que foram utilizadas como TR tiveram os valores dos parâmetros da janela de contenção (CW) alterados no driver das placas de rede. No decorrer deste trabalho efetuaram-se testes com os softwares HTTPERF, MAUSEZAHN e IPtables, sendo que somente este último foi utilizado na realização dos experimentos. Os demais softwares não foram utilizados, principalmente, devido a dificuldades de interpretação dos resultados gerados por estas ferramentas. Para substituir as duas ferramentas foi utilizado o software IPerf, que foi capaz de gerar os tráfegos de TR e NTR e atuar como o servidor dos dois tipos de tráfego. Utilizando somente um software de geração, o funcionamento e a obtenção dos dados gerados pelos experimentos foram facilitados. Outros softwares foram utilizados nos experimentos tais como o IPtables, que realizava a marcação dos pacotes enviados pelas estações de TR e a utilização do Wireshark como ferramenta auxiliar, fazendo a verificação dos dados enviados e recebidos bem como se a marcação dos pacotes estava funcionando corretamente. Ao estudar o padrão IEEE 802.11e, primeiramente foi verificado quais as principais características relacionadas ao padrão, as diferenças entre os diferentes padrões, normas e as aplicações atuais que abrangem as redes sem fio. Com o foco no padrão IEEE 802.11e, verificou-se que este protocolo provê níveis diferentes de QoS para as aplicações que utilizam voz e vídeo através da inclusão de uma função chamada HCF que escalona oportunidades de transmissão TXOP, que pode ter o seu valor definido pelo EDCA. É no mecanismo EDCA onde são alterados as janelas de contenção CW nos drivers para a realização dos experimentos. Os experimentos foram realizados com o objetivo de avaliar o comportamento da categoria de voz, por ser a de maior prioridade do mecanismo EDCA. Utilizando para esse fim um ambiente de comunicação compartilhado, com estações transmitindo tráfego TR e estações NTR gerando quantidades de carga variáveis de 10%, 40% e 70%. As estações de TR por sua vez geravam a mesma quantidade de carga na rede, porém com valores de CW distintos. Os valores testados foram limitados devido às opções disponíveis no AP. Os experimentos realizados demonstram uma melhoria do nível de QoS provida às estações de TR, à medida que os valores da janela de contenção (aCWmin e aCWmax) são alterados para valores mais altos. Porém, mesmo com a alteração dos parâmetros realizados, pode-se observar que as estações NTR obtinham resultados superiores às estações TR mesmo estas possuindo mecanismos para a melhoria da transmissão. Este fato ocorre devido às múltiplas colisões que ocorrem nas transmissões de dados das estações de TR, que têm uma alta probabilidade de escolha do mesmo tempo de backoff para os valores avaliados. Por outro lado, as estações NTR operam com valores (default) para aCWmin=15 e aCWmax=1023. Portanto, a principal conclusão deste trabalho é que os parâmetros definidos para o mecanismo EDCA não são adequados para estações que operam em um ambiente de comunicação aberto."
}