{
    "Autor": [
        "Marcos Carlesso Lopes",
        "Sandriane Naspolini de Oliveira"
    ],
    "Título": "DESENVOLVIMENTO E AVALIAÇÃO DE UM APLICATIVO PARA VENDAS PESSOAIS UTILIZANDO DISPOSITIVOS MÓVEIS",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Eliane Pozzebon",
    "Coorientador(a)": "Prof. Dra. Luciana Bolan Frigo",
    "Resumo": "Este trabalho apresenta um sistema de vendas desenvolvido para dispositivo móvel. Este sistema, denominado Maximus, tem como objetivo agilizar e integrar os procedimentos de vendas, diminuindo o tempo de transmissão das informações e garantindo a consistência delas através de processos de sincronização e integração, além de oferecer uma solução moderna que proporcione uma experiência diferenciada aos seus usuários. O sistema consiste de dois módulos, sendo um deles um aplicativo para computadores de mesa, o qual é responsável pela configuração, sincronização das informações e integração com outros sistemas ERP, e um aplicativo móvel, no qual os representantes comerciais podem iniciar visitas, captar pedidos e cadastrar clientes, dentre outras funcionalidades. Com uso das características multimídia, o aplicativo conta também com um catálogo virtual de produtos, onde várias fotos podem ser adicionadas, assim como vídeos promocionais, auxiliando tanto o vendedor durante a oferta de sua linha de produtos como o comprador a entender melhor aquilo que está comprando. Neste trabalho são descritas as tecnologias utilizadas, as etapas de desenvolvimento, o produto final e uma avaliação de seu uso em algumas organizações, levantando questões relativas a usabilidade, sustentabilidade, custos e produtividade.",
    "Palavras-chave": [
        "sistema de vendas",
        "dispositivos móveis",
        "iPad"
    ],
    "Introdução": "Realizar o controle eficiente das atividades de uma organização sempre é um problema aos gestores. Baseado nessa necessidade, os softwares de gestão vieram para contribuir nesse sentido, automatizando uma série de procedimentos fundamentais, dentre eles os relacionados às vendas. Um deles de grande destaque é o CRM (Customer Relationship Management), cujo objetivo é oferecer um histórico do atendimento de clientes (SILVA; FERNANDES, 2008). Baseado nesse contexto, softwares que contribuam para agilizar e automatizar esses procedimentos de vendas podem ser uma solução viável para empresas. Os representantes comerciais atuam como um elo pessoal entre a empresa e os seus clientes. Para muitos clientes estes representantes simbolizam a própria empresa. Além disso são eles que trazem as informações sobre os clientes para dentro da organização. Assim, é importante que as equipes de vendas possuam ferramentas modernas, que facilitem e agilizem essa comunicação entre a organização e seus clientes, possibilitando um relacionamento mais próximo e eficiente. Os softwares para equipes de vendas em dispositivos móveis são uma excelente solução para auxiliar nessa comunicação entre organização e clientes, porém para o desenvolvimento destes, é necessário tomar alguns cuidados devido às características únicas desses dispositivos. Afinal de nada adianta ter um software em um dispositivo de última geração se ele não permitir ao vendedor realizar seu trabalho de maneira fácil e ágil, proporcionando ao cliente uma experiência diferenciada. Um dos fatores mais importantes em um sistema é a forma como os usuários irão se comunicar com ele. A interface deve ser de fácil aprendizagem, e, para atingir um objetivo, devem ser necessárias poucas interações do usuário. Outro fator relevante do uso de aplicativos moveis é a sustentabilidade, há cada vez mais uma preocupação no segmento empresarial, atendendo às novas exigências legais, da sociedade e do mercado em geral. O conceito torna-se mais amplo, onde as metas de crescimento já estão associadas a redução dos efeitos nocivos ao meio ambiente (SILVA; QUELHAS, 2006). Isso demonstra uma necessidade de uso consciente de recursos, reduzindo papéis e outros tipos de materiais no âmbito comercial, mais especificamente, evitando o uso de catálogos e blocos de pedidos impressos. Com base no que foi exposto, este trabalho tem como objetivo descrever os processos utilizados durante o desenvolvimento de um aplicativo móvel para equipes de vendas pessoais bem como apresentar a avaliação do uso deste aplicativo em algumas organizações, levantando questões como usabilidade, produtividade, custos e sustentabilidade. O foco principal do produto final são empresas de pequeno e médio porte brasileiras, principalmente distribuidoras, atacados e indústrias de qualquer segmento. O software permite que os empresários disponibilizem toda sua linha de produtos em uma única ferramenta, moderna e simples de usar. Com ela, os representantes comerciais podem expor os produtos e serviços da empresa de forma rápida e eficiente, bem como captar pedidos e cadastrar novos clientes. Além disso, evita-se a necessidade de vendedores carregarem catálogos e blocos de pedidos impressos até o seu cliente, reduzindo custos e, consequentemente, melhorando a sustentabilidade do processo de vendas. Por fim, esse sistema de apoio às vendas pode ser integrado ao software gestor das empresas, automatizando a comercialização e demandas no sistema ERP (Enterprise Resource Planning) da organização, o que pode acarretar um aumento de produtividade e vendas.",
    "Conclusão": "Analisando os resultados obtidos, percebe-se que o sistema é capaz de trazer muitos benefícios às empresas que o adotarem. Questões como redução de custos e aumento de produtividade levam as empresas a ter uma margem maior de lucro, o que pode acarretar uma queda nos preços dos produtos para acirrar a concorrência. Devido a capacidade de integração do sistema, os processos relacionados a venda se tornam mais ágeis e eficientes e os erros de digitação e falhas na identificação dos dados são minimizados. Analisando os resultados obtidos pela avaliação dos administradores do sistema é possível concluir que o aplicativo aproxima a organização de seus representantes comerciais e, consequentemente, de seus clientes, reduz custos e aumenta a produtividade além de contribuir para a sustentabilidade evitando o uso de materiais impressos. Pelos resultados obtidos na avaliação dos representantes comerciais fica claro que a ferramenta facilita o seu trabalho, evita erros na emissão dos pedidos, além de proporcionar aos mesmos o contato com tecnologias de ponta. Por fim, analisando os resultados de maneira geral, pode-se dizer que o sistema atinge todos os objetivos para o qual foi desenvolvido, trazendo muitos benefícios aos seus usuários e à empresa."
}