{
    "Autor": "Mauricio Teixeira Pereira",
    "Título": "Análise de Técnicas de Inteligência Artificial Aplicadas em Jogos Computacionais",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Dra. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho abrange a área de jogos computacionais e inteligência artificial (IA). O objetivo deste trabalho foi analisar algumas técnicas de Inteligência Artificial utilizadas no desenvolvimento de jogos, identificar as características destas técnicas e propor qual a técnica mais adequada para um jogo específico. Foram analisadas as técnicas de Redes Neurais, Lógica Fuzzy e Sistemas Multiagentes. O estudo de caso escolhido foi um jogo de estratégias táticas denominado Astorian Tears que está sendo desenvolvido no Laboratório de Tecnologias Computacionais da Universidade Federal de Santa Catarina. O jogo Astorian Tears acontece num cenário de fantasia-medieval, no qual o jogador controla as ações de um personagem – avatar -, que é o herói do jogo. O jogador deverá guiá-lo pelo mundo em busca de sua vingança pessoal contra um ditador cruel. Como resultado deste estudo de caso, foram identificadas as características do jogo e sugerida a utilização dos agentes cognitivos para tornar o jogo mais dinâmico e atrativo.",
    "Palavras-chave": "Inteligência Artificial, Jogos Computacionais, Estratégias Táticas.",
    "Introdução": "Denomina-se a espécie Homo sapiens – homem sábio – porque as capacidades mentais dos humanos são importantes para todos. Durante milhares de anos, buscou-se entender como os humanos pensam; isto é, como um “mero punhado de matéria” possa perceber, compreender, prever e manipular um mundo muito maior e mais complicado que ela própria. O campo da Inteligência Artificial (IA) vai ainda mais além: Não tenta apenas compreender, mas também construir entidades inteligentes. (RUSSEL; NORVIG, 2004). A inteligência artificial é uma das ciências que teve início após a segunda guerra mundial e, atualmente, abrange uma enorme variedade de áreas de uso geral até tarefas específicas, por exemplo, jogos de xadrez, demonstração de teoremas matemáticos, diagnóstico de doenças, etc. (RUSSEL; NORVIG, 2004). Uma definição mais abrangente, segundo Gomes (2010) é que a IA sistematiza e automatiza tarefas intelectuais e, portanto, é potencialmente relevante para qualquer esfera da atividade intelectual humana (GOMES, 2010). A partir dos conceitos de Gomes (2010), é possível constatar que os jogos computacionais estão incluídos nesta “esfera da atividade intelectual humana” e que para serem desenvolvidos apresentam certo grau de complexidade, incertezas durante o processo e tomadas de decisões. Para auxiliar no desenvolvimento destes jogos computacionais foram criadas técnicas de Inteligência Artificial para facilitar na implementação e automatização das tarefas intelectuais exigidas nos jogos. Como os jogos computacionais são produtos voltados ao entretenimento, os desenvolvedores devem inovar constantemente na elaboração dos jogos para que estes se tornem mais criativos e com ambientes cada vez mais realistas (PASSOS, 2012). Este trabalho abrange a área de jogos computacionais, principalmente para auxiliar os desenvolvedores na escolha da técnica de IA mais adequada para um determinado jogo.",
    "Conclusão": "A utilização de inteligência artificial em jogos computacionais agrega reais melhorias a estes softwares porque é possível aumentar a experiência e imersão do jogo. Neste trabalho, buscou-se as informações referente as técnicas de Inteligência Artificial com intuito de propiciar aos leitores um subsídio para que estes ampliem seu conhecimento na área para poder determinar qual a técnica – das três estudadas – possa ser aplicada ao seu jogo. Ao longo do estudo, foi possível constatar que cada técnica possui várias características que devem ser levantadas para aplicá-las num jogo específico como por exemplo, a correspondência entre as técnicas e as características do jogo. A técnica de Redes Neurais Artificiais é utilizada para problemas que simulam o comportamento humano nos jogos, por exemplo, um personagem do jogo que é autônomo e precisa tomar a decisão para vencer um adversário. Neste personagem terá que ser implementado o treinamento da rede neural para auxiliar este personagem na escolha da melhor ação durante o jogo. A entrada dos dados deste treinamento da RNA será alimentada com as diferentes situações que o personagem enfrentará no jogo e quanto maior o volume de dados para treinar a rede neural, consequentemente mais inteligente serão as decisões futuras deste personagem. A técnica de lógica Fuzzy é utilizada quando os problemas não são bem definidos num jogo, por exemplo, situações onde o personagem tem dúvidas quanto a mensurar os dados de entrada para tomar a decisão. Os dados de entrada variam entre 0 e 1, quente ou frio, rápido ou devagar, alto ou baixo, etc. O personagem terá que calcular o grau de pertinência destes dados para tomar a decisão mais adequada para as ações futuras. A técnica de Sistema Multiagentes é utilizada quando o problema é distribuído e precisa da cooperação e interação entre os agentes para atingir o objetivo do jogo. Por exemplo, um personagem no jogo que é representado por um agente cognitivo que analisa sua situação coletiva (adversários e/ou aliados) para tomar a decisão. A autonomia do personagem é de sua importância para a mecânica do jogo e a cooperação é importante para solução coletiva e distribuída do problema. Neste trabalho foi escolhida a técnica de Sistema Multiagentes a ser aplicada ao jogo Astorian Tears devido as suas características distribuídas. Neste jogo existe um conjunto de personagens autônomos que devem interagir para atingir um objetivo comum que reforça a necessidade de utilizar SMA; onde os agentes podem ser cada personagem do jogo. Por fim, é imprescindível analisar em cada jogo as características para decidir qual a melhor ou melhores técnicas de Inteligência Artificial a serem aplicadas."
}