{
    "Autor": "Michel Andreas Seemund Nicolás",
    "Título": "UMA ANÁLISE SOBRE O PROCESSO DE DESENVOLVIMENTO DE NEGÓCIOS INOVADORES DE BASE TECNOLÓGICA",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo César Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho propõe a realizar um estudo, como base uma análise sobre o processo de desenvolvimento de negócios inovadores resaltando principalmente suas aplicações em empresas de base tecnológica. Com isso, o trabalho realiza uma observação em aspecto temporal sobre os principais modelos de produção iniciados pela revolução industrial e de que forma estes se modificaram para propor soluções de acordo com suas realidades no mercado. Entretanto, observando aspectos que auxiliassem a um processo de desenvolvimento de soluções inovadoras, porém, com objetivo de auxiliar em melhorias no desenvolvimento de modelos de produção de negócios de base tecnologica com modelo de negócio de caracterítica repetível e de alta escalabilidade.",
    "Palavras-chave": "Inovação, Tecnologia, Modelos de Produção, Startup Enxuta.",
    "Introdução": "O mercado protagoniza com frequência cada vez maior o lançamento de novos produtos e serviços baseados no uso de tecnologias da informação e comunicação - TICs. Novos aplicativos que vem para resolver problemas e aproveitar oportunidades derivadas das demandas da sociedade que há muito tempo são investigadas, analisadas e que encontram solução por meio do desenvolvimento e uso de novos softwares com infinidades de aplicações inovadoras capazes de ser vendidos no mundo inteiro. Todo esse universo de possibilidades de mercado para emprego das TICs vem propiciando a criação de um grande número de empresas. Muitas destas concepções são desenvolvidas por empresas definidas como “Startups”, que, de acordo com a Associação Brasileira de Startups - ABS (2012) podem ser definidas como “Uma empresa de base tecnológica com um modelo de negócio repetível e escalável, que possui elementos de inovação e trabalha em condições de extrema incerteza”. Porém, a grande realidade é que dessas centenas ou até milhares de empreendimento de tecnologia grande parte acaba falindo antes de completar um ano de vida. De acordo com a revista Forbes (2012), a cada 10 startups, 9 falham. Isso é um desperdício de recursos, tempo e dinheiro que deveriam ser evitados. O que está ocasionando este fracasso tão grande de empresas de tecnologia? Para responder a essa pergunta é preciso analisar o processo histórico e metodológico de desenvolvimento de modelos de negócio inovadores e, especialmente a aplicação desses modelos em empreendimentos intensivos em tecnologia, como por exemplo, as startups.",
    "Conclusão": "O Objetivo geral deste trabalho foi efetuar uma análise das condições de um processo de produção de qualidade em empreendimento de base tecnológica inovadores, ressaltando um modelo de negócios próprio da área de tecnologica, caracterizado como sendo de alta escalabilidade e repetível, trazendo alta relevância para seu público alvo consequentemente alto valor social. Sendo assim, para uma melhor análise do processo de produção foi necessário estar ciente dos modelos de produção que deram origem ao processo produtivo sendo este os principais definidos como Fordismo e Toyotismo. Se aprofundando no processo da Toyota, foi possível identificar que está atribuía maior caráter inovador por apresentar um conjunto de fatores essenciais na sua aplicação, sendo seus principais: um modelo de produção em pequenos lotes, produção “puxada”, constante análise de clientes e usuários, objetivando um produto com grande diferencial competitivo em nível mundial, onde estes possuíam fatores de diferenciação e personalização. Com base no Toyotismo, foi proposto por Eric Ries, uma metodologia própria para startups sendo definida como “Startup Enxuta”, onde consiste de técnicas de desenvolvimento ágil de software, juntamente com conceitos relacionados ao processo de produção Toyota, como resultado um novo conceito de desenvolvimento muito mais ágil e condizentes com a realidade do mercado de tecnologia."
}