{
    "Autor": "Milena da Cunha Constante",
    "Título": "A Desigualdade das Mulheres no Mercado de Trabalho na Área de Tecnologias da Informação e Comunicação",
    "Ano de publicação": "2021",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Andréa Cristina Trierweiller",
    "Coorientador(a)": "",
    "Resumo": "As áreas de Ciências, Tecnologia, Engenharia e Matemática (STEM, acrônimo em inglês) apresentam expressiva desigualdade de gênero, que costuma ser naturalmente aceita pelo senso comum, tanto nos órgãos de ensino, como no mundo do trabalho. Este contexto em que a mulher tem grandes chances de sofrer discriminação ao escolher uma dessas áreas para atuar profissionalmente, é o que leva a muitas desistirem da formação, ou então, nem escolher estas carreiras. Considerando estas questões, o objetivo geral deste trabalho foi analisar a participação das mulheres no segmento de TIC e formular uma visão crítica do cenário atual, destacando pontos em que a mulher, como profissional, pode ser desvalorizada quando comparada aos homens. Na história, com frequência, o sexo biológico foi usado para definir papéis na sociedade para homens e mulheres, plantando e cultivando socialmente a ideia de que a chance biológica de ser mãe deveria fazer com que todas as mulheres fossem responsabilizadas, obrigatoriamente, pelos cuidados do lar, dos filhos e do marido. Este trabalho apresenta uma análise sobre dados atuais e dados históricos que mostram, com clareza, a expressiva desigualdade de gênero nas áreas já citadas. Palavras -chave: gênero, tecnologia da informação, trabalho, mulher, profissão.",
    "Palavras-chave": [
        "gênero",
        "tecnologia da informação",
        "trabalho",
        "mulher",
        "profissão"
    ],
    "Introdução": "Em um mundo que está em constante crescimento, as transformações que ocorrem nos âmbitos político, social e econômico, impactam diretamente o ambiente de negócios, e o mercado de trabalho, onde estão inseridas (GOMES, 2005). Apesar da inserção da mulher neste mercado, ainda há questões de igualdade de gênero que não foram resolvidas ao ponto de garantir as mesmas oportunidades profissionais entre homens e mulheres. Ainda que vagarosamente, a participação feminina tem sido maior a cada ano (REVELO, 2020). A desigualdade da mulher no mercado de trabalho, especificamente, na área de TIC (Tecnologias da Informação e Comunicação), é pouco comentada, são contáveis os que tentam igualar esta situação . Para tanto, alguns estudos como o da REVELO, Carreira, Ajamil e Moreira trazem dados que mostram a discrepância em relação aos salários, oportunidades de carreira e jornadas de trabalho de homens e mulheres neste segmento de atividade, conforme será apresentado no referencial teórico. Diante desse contexto, alguns questionamentos se mostram relevantes. Afinal, essa falta de representatividade que acontece já no âmbito acadêmico pode ser um dos motivos da diminuição da vontade de mulheres participarem destas áreas. Mas, para as poucas que ingressam neste segmento, como se sentem, como é a convivência em meio a tantos homens, será que é um ambiente hostil, pouco receptivo, desigual já durante sua formação? Essas são questões que serão esclarecidas neste trabalho. Por que muitas mulheres desistem da graduação, ou trocam de área assim que formadas? Como a sociedade trata mulheres que trabalham com ciência e tecnologias, a ponto de fazê-las desistir de suas carreiras? Essas questões são essenciais para se compreender o quão sério é esta situação. Quando se entende os porquês, consegue-se fazer mudanças realmente significativas. Para a contextualização desta temática e confirmação de sua relevância, apresentar-se-ão estudos que demonstram o pré-conceito com a mulher neste ambiente, mesmo que seja qualificada para a função. Sendo assim, este trabalho se justifica, pois é essencial compreender sua representatividade e como as mulheres têm atuado nesta área, tipicamente masculina.",
    "Conclusão": "Esta pesquisa, no caráter de um trabalho de conclusão de curso, teve como questão norteadora: Quais são as perspectivas das mulheres inseridas no setor de tecnologia da informação e comunicação? Buscando compreender as diferenças de gênero no campo de trabalho de TIC. Neste último capítulo, apresentar-se-ão as conclusões finais da autora referente ao objetivo geral e específicos, além de sugestões de possíveis trabalhos futuros, relacionados à pesquisa. O objetivo desta pesquisa foi trazer maiores contribuições tanto para a academia quanto para os profissionais da área de TIC, no que se refere à questão de gênero neste segmento, lançando oportunidades para pesquisas futuras. Entende-se que os objetivos propostos neste trabalho foram alcançados por intermédio da revisão da literatura e da pesquisa de campo. Ou seja, o objetivo geral: Analisar a participação das mulheres no segmento de TIC e formular uma visão crítica do cenário atual, destacando pontos em que a mulher, como profissional, pode ser desvalorizada quando comparada aos homens; foi alcançado tendo sido demonstrado, via análise do questionário, a baixa participação das mulheres no segmento de TI, ainda dominado pelos homens. As mulheres respondentes destacaram que, no geral, que se sentem menos motivadas por saberem recebem menores salários, que já sofreram algum tipo de bullying ou assédio em ambiente de trabalho ou universitário, os quais foram confirmados pela literatura, apresentada na fundamentação teórica neste TCC. Em relação aos objetivos específicos: Realizar levantamento de literatura sobre as definições centrais e temáticas, relacionadas ao desenvolvimento do TCC; bem como, verificar na literatura, instrumentos de coleta de dados que possam ser utilizados/adaptados para este trabalho – os mesmos foram alcançados, tendo sido demonstrados tanto o tema de gênero, quanto temáticas correlatas, e, ainda, instrumentos de coleta de dados foram identificados tendo sido considerados na composição do questionário aplicado neste TCC. Quanto ao objetivo específico: Analisar a percepção das colaboradoras que trabalham em empresas de TIC, por meio de aplicação de questionário; o mesmo foi atingido aplicando-se o questionário em larga escala, tendo sido feitas sugestões para trabalhos futuros. Para tanto, foi feita uma revisão da literatura sobre a temática e estudo de campo por meio da aplicação de um questionário junto a mulheres atuantes em empresas de TIC. Desta forma, foi possível perceber que a questão de gênero deve ser melhor abordada em estudos futuros, com oportunidades para levantamentos em temáticas correlatas com gênero: inclusão, assédio moral no trabalho, bullying, dentre outros, nos ambientes de TIC, de forma mais ampla e incluindo outras variáveis. Por meio do estudo de campo foi possível observar a relevância de se incentivar meninas e mulheres em fase de aprendizagem a procurar o caminho da tecnologia, de modo a aumentar a representatividade feminina no ensino superior, nos cursos STEM e, consequentemente, no campo de trabalho. Para isso, é de extrema importância que haja uma ação conjunta entre sociedade, governo e empresas para mostrar que é possível se ter mulheres seguindo carreira na área tecnológica, seja programando, analisando ou gerenciando."
}