{
    "Autor": "Norton Meidel Karam",
    "Título": "Laudo Pericial Digital",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Vilson Gruber",
    "Coorientador(a)": null,
    "Resumo": "O desenvolvimento das tecnologias de informação e comunicação e os modernos conceitos de sustentabilidade ecológica terminaram, já há algumas décadas, com o manuseio das máquinas datilográficas, e mais recentemente com o uso de papel, impressora e cartuchos de impressão. A implantação do laudo pericial digital na segurança pública visa agilizar o processo da persecução penal, encontrando, pela análise de evidências criminalísticas, a verdade de forma célebre. Ferramentas como o ambiente web e a certificação digital possibilitaram a produção de trabalhos periciais em qualquer computador com acesso à internet. A integração entre os setores de T.I. e os sistemas de informação dos órgãos vinculados à Secretaria de Segurança Pública do Estado do Rio Grande do Sul permitirá o imediatismo do recebimento das solicitações de perícia através de ofícios eletrônicos, e o envio dos laudos periciais assinados digitalmente, implantando o desuso de papel em todas as etapas do processo. É uma radical quebra de paradigmas, onde o principal enfrentamento é atender as demandas dos usuários em todos os tipos de perícia nos diferentes departamentos que compõe o Instituto-Geral de Perícias do RS, especialmente no Departamento de Criminalística.",
    "Palavras-chave": [
        "Laudo pericial digital",
        "Tecnologia da Informação e Comunicação",
        "Sistemas de Informação",
        "Segurança Pública"
    ],
    "Introdução": "Esta pesquisa pretende mostrar, através de análise qualitativa, que o processo de implantação de novos sistemas de informação precisa contemplar todas suas etapas, conforme concepções apresentadas pelos peritos criminais do Departamento de Criminalística. Para isso, articulou-se o conceito de Tecnologia da Informação e Comunicação na Segurança Pública e Direitos Humanos com o conceito de Criminalística. Efetuou-se pesquisa de recepção da inovação conforme questionário aplicado aos já usuários do novo sistema. Articulou-se os resultados a partir da ideia da efetiva aplicação das etapas de implantação de novos sistemas, especialmente com a criação de um Manual do Laudo Digital direcionado a esses novos usuários do sistema de controle das perícias atendidas pelo IGP/RS - DC. Apesar de todo o avanço tecnológico mundial, da pesquisa científica e sua divulgação globalizada, quase nenhuma bibliografia existe sobre o processo de produção de laudos periciais oficiais digitais, compreendendo desde a solicitação da perícia, até a entrega do trabalho pericial – o laudo, à autoridade policial – o delegado de polícia civil, o presidente do inquérito. Por ser um assunto relativamente novo, e que requer alto grau de segurança e sigilo, não existe, a nível nacional ou internacional, ampla e aberta publicação de um sistema de informação acabado – um pacote open source. A própria estrutura de segurança pública brasileira em cada unidade da federação, configurando as polícias civis e militares, cada uma delas com as suas competências, de acordo com o artigo 144 da Constituição Federal, tem certo efeito separatista que dificulta a propagação das informações além dos limites dos estados. No Brasil, além das seguranças públicas estaduais, onde, em alguns estados brasileiros, a polícia técnica (ou perícia) é subordinada à polícia civil, ainda existe o departamento da polícia federal, que utiliza outro procedimento pericial. Lá existe a figura do perito federal que reúne as informações de todos os exames periciais realizados (do legista, balística, documentoscopia, etc.) em uma determinada investigação, uma ocorrência, e elabora uma conclusão utilizando uma espécie de sistema de informação onde todos os pré-laudos daquela ocorrência acabam chegando nele. No Rio Grande do Sul, diferentemente de outros estados que optaram por adquirir sistemas de informação prontos, o sistema de informação da tramitação do trabalho pericial está em desenvolvimento. Chama-se PGP – Protocolo Geral de Perícias. Antigamente, utilizavam-se livros para registros de atendimentos periciais e os laudos eram datilografados. A partir de 2004, substituindo-se pequenos programas pontuais desenvolvidos em Access, do pacote Office da Microsoft, a empresa estadual de processamento de dados, PROCERGS, começou a desenvolver um sistema inicialmente chamado de PDC – Perícias do Departamento de Criminalística. A partir de 2009, com os excelentes resultados obtidos, a PROCERGS também desenvolveu (ampliou) o sistema de informação para os demais departamentos do Instituto-Geral de Perícias do Rio Grande do Sul: o DML – Departamento Médico-Legal, o DI – Departamento de Identificação e o então Laboratório de Perícias, hoje Departamento de Perícias Laboratoriais – DPL. Foi quando passou a chamar-se PGP. Mas o processo ainda não era totalmente digital. Ainda se utilizava papel. E muito. Ainda existe um volume muito grande de caixas de arquivo morto, onde estão armazenadas cópias reprográficas em preto e branco de todos os laudos produzidos no IGP RS, desde sua criação, em 1997, e anteriores a essa data também. Existem projetos para que essas cópias, emitidas até hoje (2015), sejam digitalizadas e armazenadas em ambiente digital. Porém, a maior preocupação no momento é a implantação do laudo pericial digital em 100% do IGP-RS. Por tratar-se de um documento mais simples, uma espécie de formulário, o laudo digital começou a ser implantado no Laboratório, primeiramente. Lá, os exames químicos de drogas, por exemplo, tinham apenas que verificar se a substância questionada era cocaína ou não. Foi criado uma espécie de projeto-piloto que começou em 2012. E obteve enorme sucesso. Então, o laudo digital passou a ser desenvolvido para os outros departamentos: DML, DI e DC. Porém, a complexidade de um laudo de local de crime é muito superior ao resultado de um exame químico ou clínico, como a determinação da quantidade de álcool no sangue de um motorista embriagado, por exemplo. O laudo de local de crime, como um homicídio, contém a descrição do local, do corpo, vestes e ferimentos, além de todas as demais evidências observadas no local, na casa, no veículo, ou na via pública, se for o caso, com a adição de fotografias e imagens que ocupam bem mais espaço em arquivos digitais. Isso tudo ainda sem levar em consideração o fato de haver peritos mais experientes no trabalho pericial, mas sem a prática da utilização da informática como ferramenta de trabalho. Existem peculiaridades inerentes aos cerca de 130 diferentes tipos de perícia no Departamento de Criminalística. Então como atender a todas essas diversas demandas utilizando uma espécie de laudo padrão? Impossível. Não havia uma forma imediata de elaborar um modelo de laudo único. No ano de 2014, adotou-se o protocolo único, como uma tentativa de unir as informações produzidas pelos quatro departamentos. Mas como o sistema PGP foi desenvolvido separadamente para cada um deles, existem importantes diferenças entre os sistemas dos quatro departamentos, apesar de o sistema ser único. Futuramente, talvez, esse protocolo único venha a se aproximar do método utilizado pela polícia federal. Mas, por enquanto, a integração entre os quatro departamentos apenas foi desenvolvida para a remessa de material para exame de um departamento para outro. Assim que é gerada a solicitação de exame no departamento de origem do material a ser analisado, automaticamente é aberta uma solicitação de perícia no departamento de destino, dentro do PGP. Em 2012 foi criado um quinto departamento, o DPI – Departamento de Perícias do Interior, visando atender todas as solicitações de perícias das ocorrências policiais nas cidades fora da região metropolitana de Porto Alegre. Agregando sete coordenadorias regionais: Santana do Livramento, Pelotas, Santa Maria, Caxias do Sul, Santo Ângelo, Passo Fundo e Osório, o DPI é composto por oito postos de criminalística, 30 postos médico-legais e 248 postos de identificação. Isso gerou a necessidade da criação de um novo sistema unindo os quatro já existentes em um só. Essa fase ainda está evoluindo para que as coordenadorias regionais sejam independentes do envio de materiais, como todas as armas de fogo envolvidas em crimes, por exemplo, para que sejam periciadas na Capital, demandando transporte, espaço para armazenamento, gerando excesso de acúmulo das chamadas “perícias de prateleira”, que são atendidas conforme a disponibilidade dos parcos recursos humanos, característica dos órgãos públicos estaduais da administração direta. Apesar de tantas diferenças entre os trabalhos periciais nos departamentos do IGP, o fluxo de trabalho – workflow – obedece algumas similaridades. Em todos os trabalhos periciais existe, inicialmente, uma solicitação de perícia: por ofício, em papel; ou pelo atendimento do telefone 190 da Brigada Militar, no antigo CIOSP – Centro Integrado de Ocorrências de Segurança Pública, hoje CICC – Centro Integrado de Comando e Controle, já utilizando integração de seu sistema (antigamente AIS – Atendimento Integrado de Segurança, hoje SIAE – Sistema de Atendimento de Emergência) com o PGP; ou, automaticamente, através de integração entre o PGP e o SRO – Sistema da Registro de Ocorrências, sistema que foi desenvolvido por um consórcio de empresas, entre elas a SISGRAPH, e será mantido pela PROCERGS, ainda em fase de implantação. E, também, em todos os trabalhos periciais existe a produção de um documento, que pode ser o laudo pericial, propriamente dito, ou outro documento, como um ofício-resposta, comunicando alguma consideração sobre a solicitação de perícia recebida. Então, por consenso do grupo gestor do PGP, o qual possuía um representante por departamento do IGP, reunindo-se periodicamente com a PROCERGS, a fim de encontrar a melhor forma de transferir um sistema desktop, com instalação do programa PGP em cada uma das máquinas da rede, dentro do domínio, com muitos problemas de atualização das constantes versões novas, para um ambiente web, onde, teoricamente, o sistema poderia ser acessado de qualquer computador conectado com a internet. Além de realizar a entrega do trabalho pericial de forma automática, pela integração dos sistemas PGP e SPJ, ambos mantidos pela PROCERGS, também, em um segundo momento, decidiu-se que a implantação do mesmo processo digital na solicitação da perícia, criando um novo sistema, o SRO, para ser utilizado tanto pelo CICC, como por todas as delegacias do estado. Ou seja, dessa forma, a entrada – a solicitação da perícia – no workflow se daria de uma única maneira, e a saída – a produção de documento – idem. Isso considerando a polícia civil a responsável por quase a totalidade das solicitações de perícia, pois as perícias também podem ser solicitadas pela polícia militar, ministério público, ou ainda, pela justiça.",
    "Conclusão": "Fica clara e evidente a necessidade de maior investimento em pessoal na área de TI, tanto em nível de DC – Departamento de Criminalística, quanto a nível de IGP, como um todo. Mas o importante da conclusão deste trabalho é que o IGP/RS, mais especialmente o DC, ganhou uma ferramenta imprescindível – o Manual do Laudo Digital – o Fluxo Digital no PGP Web, com diversas ilustrações e imagens com setas indicando onde clicar, o quê, e como fazer para desenvolver esse novo procedimento que sem dúvida alguma só tem a qualificar o serviço da perícia rio-grandense. Esperamos a leitura e compreensão dos diversos aspectos elencados neste trabalho para a melhoria do trabalho técnico de perícia desenvolvida pelos colaboradores do Departamento de Criminalística, com a certeza de que posicionamentos políticos não interferirão na qualificação desses profissionais. Por fim, contamos, mais uma vez, com a devida importância da Divisão de Tecnologia da Informação na sede administrativa do IGP/RS e seus representantes em cada departamento."
}