{
    "Autor": "Safyre Ayumy Farao",
    "Título": "Mulheres em cargos de liderança em tecnologia no Brasil: uma análise das experiências vivenciadas",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. ªAndréa Sabedra Bordin, Dra.",
    "Coorientador(a)": "",
    "Resumo": "Os cenários atuais das Tecnologias da Informação e Comunicação (TIC) vêm apresentando uma grande desigualdade de gênero na gestão em âmbitos corporativos. Existem menos mulheres na área de tecnologia e, somente algumas conseguem atingir cargos de liderança. O presente estudo possui o intuito de compreender empiricamente as experiências de mulheres que foram ou são líderes em TIC, de forma a entender quais as trajetórias percorridas por essas mulheres, incluindo os desafios, as estratégias de superação e as motivações para buscarem os cargos de gestão. A pesquisa teve uma abordagem qualitativa fenomenológica, com dados coletados por meio de cinco entrevistas. Descreveu-se o fenômeno a partir das experiências vivenciadas por essas mulheres. A análise dessas experiências confirmou a presença de desafios estruturais de uma sociedade marcada pela desigualdade de gênero que impacta direta ou indiretamente em setores como o de tecnologia. Percebeu-se, por fim, a necessidade de mudanças por parte das empresas para que se conquiste oportunidades mais igualitárias entre homens e mulheres.",
    "Palavras-chave": [
        "Liderança feminina",
        "Tecnologia",
        "Tecnologias da Informação e Comunicação",
        "TIC",
        "Mulheres",
        "Liderança",
        "Trajetória"
    ],
    "Introdução": "As tecnologias da informação e comunicação estão presentes em muitos setores da economia global, exercendo forte influência nas tomadas de decisão e estratégias de organizações. O papel econômico da tecnologia, como um todo, cresce cada vez mais e se torna, diariamente, mais evidente no surgimento de novas maneiras de produção de produtos e serviços (ANDINO, 2005). Logo, percebe-se uma necessidade de gestões significativas das TICs, buscando melhorar a integração e a otimização das ferramentas tecnológicas disponíveis e, dessa forma, alavancar a competitividade das empresas. Os líderes e gestores da área devem, portanto, compreender as tendências e apoiar uma maior capacitação das equipes, fortalecendo ou promovendo uma cultura organizacional mais dinâmica e resiliente, conduzindo a equipe nos momentos cruciais e garantindo uma harmonia nas operações. Pois, conforme Awari (2023) líderes de tecnologias são essenciais para fomentar uma cultura de inovação contínua. É importante destacar que o mundo da tecnologia possui uma desigualdade significativa no quesito de gênero. Isso se inicia no ensino superior. Segundo os dados divulgados pela Sociedade Brasileira de Computação (SBC, 2021), cerca de 240.000 mulheres optam por cursos voltados para a tecnologia, mas apenas 5.000 delas conseguem concluir esses cursos, evidenciando uma discrepância significativa. Esses dados estão alinhados com os percentuais da pesquisa feita pelo INEP (2020), onde há a clara predominância de concluintes do sexo masculino nos cursos de Engenharias e Tecnologias da Informação e Comunicação, com percentuais de 62,9% e 86%, respectivamente. Sendo que, entre os outros diversos cursos e áreas de formação das universidades, o sexo feminino demonstra percentuais mais altos em permanência e conclusão, com 72,6% na área da Saúde, 77,6 % na Educação, 57% em Administração e Direito, entre outros. Segundo a Associação Brasileira das Empresas de Tecnologia da Informação e Comunicação (BRASSCOM (2022)), mesmo as mulheres sendo maioria dentre a população brasileira (51%), o setor de tecnologia apresenta uma notável desigualdade com apenas 39% de presença feminina de um geral de 1,1 milhão de profissionais no setor. Corroborando com uma pesquisa do Instituto Thoughtworks (2019), na plataforma PretaLab, em que nas organizações do setor de tecnologia, 64,9% dos casos constam que as mulheres representam 20% das equipes, com cargos de desenvolvedoras, analistas, tester e designers. De acordo com a BRASSCOM (2022), ainda, esse cenário acontece, principalmente, pelo pouco ou nenhum incentivo para as mulheres nas formações nas áreas de tecnologia ao longo de toda a vida. Em termos de gestão, especificamente, os números permanecem ou ainda se tornam mais agravantes. Pela pesquisa e análise feita pela agência de recrutamento CATHO, somente 35% da mão-de-obra feminina de tecnologia ocupa cargos de liderança (CATHO, 2021). Considerando, também, os dados relatados por uma pesquisa feita pela empresa Plongê (2024) e publicada na rede do LinkedIn, em que a média salarial de CTOs (Chief Technology Officer - do inglês, Diretor(a) de Tecnologia) mulheres é 48% menor do que a dos homens, além de receberem 17% a menos em benefícios, mesmo que tenham a qualificação e o tempo de experiência iguais aos profissionais do gênero masculino. Quando se pensa em nomes de líderes femininas que se destacam, são poucas as pessoas que conseguem citar uma ou mais. Mas, quando as referências de ciência e tecnologia são masculinas, nomes como Jeff Bezos e Elon Musk são facilmente e frequentemente mencionados (VSOFT, 2022). Essa recorrência acontece pelo fato de o universo tecnológico ser “massivamente masculino”. A participação feminina em cargos de gestão é extremamente importante, pois viabiliza ao mundo empresarial e na gestão, propriamente dita, perspectivas diferentes (FELIZ; SILVA, 2019). Consequentemente, tem-se um embasamento para planos, ideias e processos diferentes da visão masculina, além da possibilidade de se formarem ambientes mais inclusivos na tecnologia, que são necessários para permitir maior diversidade e carreiras na área. De acordo com Struckman (2019), mundialmente 41% das mulheres deixam suas profissões de tecnologia justamente pelo fato dos ambientes de trabalho não serem inclusivos, o que prejudica a representatividade feminina em posições de liderança. Diante desta falta de representatividade feminina na área de TI e, mais especificamente em posições de liderança nessa área, é importante compreender quais as experiências vividas pelas mulheres que conseguiram alcançar tais posições. O entendimento dessas vivências pode ajudar a compreender quais as trajetórias percorridas por mulheres que ocuparam ou ocupam cargos de gestão em TI e quais os principais desafios que elas encontraram ao longo dessas trajetórias, assim como entender se os desafios permaneceram ou permanecem enquanto líderes. Há, ainda, o entendimento das estratégias de superação adotadas por essas mulheres e as motivações para buscarem tais cargos. Uma revisão sistemática de literatura acerca da liderança feminina na área de tecnologia encontrou 10 trabalhos com abordagens voltadas para as barreiras, as desigualdades e as superações das mulheres que alcançaram posições de liderança em tecnologia. Entre os 10 trabalhos analisados, identificaram-se algumas lacunas relacionadas às experiências vivenciadas pelas mulheres. Por exemplo, questões relacionadas à trajetória das mulheres para alcançar cargos de liderança na área de TI; se os desafios encontrados ao longo da trajetória são os mesmos encontrados na posição de líder; quais as motivações para buscarem um cargo de liderança, não foram significativamente abordadas nesses estudos. Entende-se assim, que existe a oportunidade para investigar diversos aspectos relacionados às experiências vividas por essas mulheres. A identificação e análise de tais aspectos pode permitir o desenvolvimento de boas práticas ou políticas que estimulem e favoreçam mulheres na ocupação de cargos de liderança em TI. Dadas essas contextualizações, definiu-se a seguinte questão de pesquisa: “Quais as experiências vivenciadas por mulheres que ocuparam ou ocupam cargos de liderança em empresas de base tecnológica no Brasil?”",
    "Conclusão": "O presente estudo, de caráter fenomenológico, buscou compreender as experiências de mulheres que ocuparam ou ocupam cargos de liderança na área de Tecnologia da Informação (TI) no Brasil. Por meio desse tipo de abordagem qualitativa, investigou-se a complexidade das experiências únicas e pessoais compartilhadas pelas cinco entrevistadas deste estudo. A busca na literatura por trabalhos com objetivos semelhantes trouxe evidências de que existem poucos estudos relacionados às experiências vivenciadas por mulheres que foram ou são líderes na área de TI. Dentre esses estudos, a maioria explora apenas questões sobre os desafios e dificuldades das carreiras femininas em tecnologia. Dados sobre como as mulheres se tornaram líderes, os desafios das posições de liderança e as motivações que tiveram ao buscarem cargos de liderança não foram contempladas de forma aprofundada. Os resultados dessa revisão sistemática serviram para delinear essa lacuna de estudos sobre as experiências das mulheres que ocuparam ou ocupam cargos de liderança em TI. Além disso, culminaram na publicação de um artigo no  18 ºWorkshop Women in Technology (WIT), evento base do 44 ºCongresso da Sociedade Brasileira de Computação (CSBC) (FARAO; BORDIN, 2024). Ao analisar os dados do presente estudo, percebeu-se que as trajetórias para posições de liderança foram, para a maioria das entrevistadas, um resultado de experiências únicas. Compreender, portanto, como essas singularidades afetaram as trajetórias das mulheres facilita no entendimento de quais fatores podem impactar no desenvolvimento de uma carreira feminina na tecnologia. Além disso, conhecer os detalhes dessas trajetórias pode inspirar o desenvolvimento de futuras carreiras femininas na área. Considerando as questões sobre desafios, identificaram-se desafios relacionados a questões sociais e culturais que se apresentam frequentes nas trajetórias das mulheres na área de tecnologia, bem como em seus cargos de liderança. Ademais, em geral, as mulheres entrevistadas relataram terem feito mudanças internas como formas de superar os desafios encontrados, como se a responsabilidade de lidar com eles e suas consequências fosse, exclusivamente, delas. Em vista disso, a identificação desses desafios compartilhados pelas mulheres demonstra um problema profundo, estrutural e preocupante. Logo, essa identificação auxilia na comprovação da necessidade de mudanças no setor de tecnologia, como investir em capacitação contínua para mulheres, adotar critérios de seleção justos, elaborar políticas de conscientização, estruturar planos de carreira mais igualitários, evidenciando, sobretudo, a importância de criar ambientes mais inclusivos. Este estudo revelou também, que as trajetórias das mulheres em cargos de liderança em tecnologia são impulsionadas por diferentes motivações. As diferenças são confirmadas desde a escolha da área de TI até as influências pessoais e/ou profissionais que impulsionaram ou impulsionam as mulheres a moldarem suas carreiras e a buscarem cargos de liderança. Identificar, portanto, essas motivações auxilia na compreensão dos fatores que podem atrair e reter mulheres no mercado tecnológico, influenciando futuras líderes mulheres, bem como demonstrando possíveis soluções para empresas que buscam avançar na igualdade de gênero. Ao analisar todos esses cenários e resultados, a autora deste estudo entende que as experiências de mulheres líderes na área de tecnologia são marcadas pela presença de desafios estruturais da sociedade. Tais desafios, apesar de não serem impeditivos, dificultam a carreira feminina em TI. Considerando, ainda, que as estratégias de superação das mulheres entrevistadas foram, na maioria dos casos, decorrentes de atitudes das próprias mulheres, há uma desigualdade de gênero significativa. Assim, em uma área reconhecida pela inovação, é contraditório e decepcionante constatar que ainda exista resistência à diversidade de gênero. Infelizmente, os ambientes empresariais e as condições das carreiras femininas no setor ainda não são inclusivos e nem demonstram equidade de gênero. Nesse sentido, a identificação e análise de todos os aspectos mencionados anteriormente podem servir para promover o desenvolvimento de boas práticas e políticas que estimulem e favoreçam mulheres na ocupação de cargos de liderança em TI. Entre essas práticas e políticas eficazes, há a criação de planos de desenvolvimento de carreira voltados para mulheres, possíveis ajustes nos processos de recrutamento e promoção de cargos para garantir maior igualdade, criação de políticas de diversidade e inclusão efetivas, além do fornecimento de condições de trabalho melhores para que se consiga um maior equilíbrio entre a vida profissional e pessoal. Reforçando essa necessidade de mudanças, é importante destacar que a igualdade de gênero é o quinto objetivo de desenvolvimento sustentável proposto pela Organização das Nações Unidas (ONU). Entre os indicadores desse objetivo, o 5.5.2 é justamente relacionado à proporção de mulheres em posições gerenciais. No Brasil, no entanto, as funções gerenciais são ocupadas por 61,4% de homens e apenas 38,6% de mulheres, conforme a categoria de Sexo e Grupo de Idade (IBGE, 2023b). É fundamental, portanto, que as empresas da área de tecnologia adotem medidas concretas para garantir oportunidades iguais e justas para mulheres, contribuindo assim para o desenvolvimento da sociedade como um todo."
}