{
    "Autor": "José Adelmo Becker Nandi",
    "Título": "O COMBATE AO DISCURSO DE ÓDIO NAS REDES SOCIAIS",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Mendonça Lunardi",
    "Coorientador(a)": null,
    "Resumo": "As redes sociais como instrumento de troca de informações e comunicação são importantes meios que reproduzem situações reais nos ambientes virtuais. O discurso de ódio que sempre esteve presente na sociedade agora é replicado e amplificado nas redes. Ele caracteriza-se por ofender, discriminar e instigar a violência ou retirada de direitos das minorias sociais. Por vezes é usado como justificativa para atitudes de descontentamento pessoal ou por defesa de medidas políticas que buscam restringir direitos. Nas redes sociais o alcance do discurso está ligado ao apoio e compartilhamento dessas ideias e convertem-se em reflexos prejudiciais à sociedade. Pelo aumento nos casos de discurso de ódio e por suas consequências sociopolíticas este trabalho através de uma pesquisa exploratória busca entender quais conceitos estão envoltos ao discurso de ódio nas redes sociais e quais medidas podem combatê-lo. Dentre algumas medidas identificadas, estão as de cunho político, tomadas por Estados de Direito que querem garantir a liberdade de expressão, contudo respeitando os direitos humanos e individuais dos cidadãos. Medidas tecnológicas como a inteligência artificial para identificação automatizada deste tipo de discurso, mas que ainda não apresenta uma resolução eficiente dependendo de mais estudos. Medidas administrativas nas políticas das empresas provedoras do serviço, com o objetivo de combater e penalizar os usuários que em suas redes infringem as regras da comunidade virtual. E por fim, medidas educativas que buscam mostrar e ensinar quais são os direitos individuais e coletivos, o que é liberdade de expressão, quais atitudes tomar na ocorrência de um discurso de ódio e estimular os usuários para que as redes sociais sejam lugar de liberdade e diversidade com respeito às diferenças.",
    "Palavras-chave": "Discurso de Ódio, Redes Sociais, Combate, Ódio, Tecnologia",
    "Introdução": "As tecnologias da informação e comunicação trouxeram novas formas de interação entre as pessoas e a sociedade como um todo. Os negócios, a aprendizagem, os relacionamentos, o entretenimento, sofreram mudanças. Barreiras físicas e de distâncias territoriais foram mitigadas principalmente pelo uso da comunicação pela internet. O acesso, compartilhamento e produção de informação foi “democratizado”. Qualquer indivíduo com acesso à internet é capaz de produzir conteúdo de entretenimento, educacional ou de opinião e compartilhá-los para que outras pessoas possam vê-lo. As novas interações mediadas pelo computador, foram proporcionadas por evoluções tecnológicas principalmente pós-revolução industrial. Como mediador o computador tem o papel facilitador na criação e manutenção dessa relação. Nos pontos extremos desta comunicação estão as pessoas que têm sua identidade construída de acordo com sua criação, seu ambiente, seu conhecimento, sua cultura, tudo isso influi no modo de como os laços sociais tanto virtuais como reais são feitos. As redes sociais virtuais fazem parte do cotidiano das pessoas e se tornaram a principal ferramenta de comunicação. Por elas os usuários através de seus perfis, postam o que sentem, o que viram no dia, o que pensam, conversam, debatem e até discutem. Tornaram-se um ambiente de expressão do Eu, um espaço onde o sujeito pode se expressar. Transformaram-se em disseminadoras em massa de informações, verídicas, inverídicas, de opinião, de ideologia, de qualquer assunto que o usuário queira compartilhar. Perfis mal intencionados podem utilizar as redes sociais para propagar ideologias que atentem contra a democracia, ou contra os direitos individuais das pessoas. Através de comentários, piadas ou opiniões, são elaborados discursos de ódio que discriminam, ofendem e tentam tirar da vítima sua legitimidade em se expressar ou ser quem ela é, querem impedi-las de ocupar o mesmo espaço público. Apesar do discurso de ódio ser um fenômeno relevante e que por causa das redes sociais ele está mais notório, ele não é um fenômeno novo. O ódio é um sentimento que faz parte da essência humana. É um sentimento que faz parte das relações. O discurso como método de expressão vem a ser uma ferramenta utilizada para externalizar esse ódio ao outro, ao diferente, que de alguma forma é a fonte desse desconforto. As redes sociais usadas como meio de divulgação e propagação para esse discurso têm papel fundamental no atual contexto histórico.",
    "Conclusão": "Através da pesquisa foi possível entender que o discurso de ódio proferido nas redes sociais ultrapassa as fronteiras da rede de computadores tanto na sua origem quanto na sua finalidade. O ódio é algo que faz parte do ser humano, seja de forma consciente ou não. Ter pensamento odioso ou sentimento repulsivo a determinado indivíduo ou grupo social, por si, não constitui um discurso de ódio, pois não é tangível, o que só ocorre mediante a externalidade desses sentimentos ou pensamentos em formas de ação, seja física, verbal, escrita ou qualquer outra forma de linguagem explícita. É aí que entra o discurso. Sendo um método de expressão o discurso é uma via para a externalidade do ódio. Por ele, modifica-se a sociedade, o mundo real. O discurso de ódio tem o objetivo de atingir minorias sociais para que não sejam vistas com os mesmos direitos garantidos à maioria dominante do poder. Essas minorias tornam-se vítimas de preconceito, discriminação, exclusão e, em alguns casos extremos, de violência física. O discurso funciona como um vetor para essa violência, estimulando e replicando a mensagem contra seus alvos para que abandonem o espaço do debate público, cerceando sua representatividade. Na internet através das redes sociais as ações de ódio estão alcançando uma visibilidade cada vez maior. Que por um lado pode ser boa, pois amplia o debate de ideias, mas, por outro lado, pode capitanear adeptos a compartilhar e apoiar esses ideais. Pessoas que muitas vezes não tinham coragem de expor seu pensamento, começam a se reconhecer e formar grupos, justamente com o propósito de compartilhar o ódio. Muitas coisas que acontecem nas redes sociais são replicadas do mundo real e vice-versa. Um dos perigos do discurso de ódio é seus reflexos no mundo real, principalmente em ideologias políticas e atos violentos. O discurso de ódio deve ser combatido, porém ainda é difícil fazer isso de forma eficiente. Os governos estão aprovando leis, mas elas têm resistência da sociedade, de alguns setores políticos e empresariais, pois devem ser muito bem embasadas para que não reprima o direito à liberdade de expressão. Também são muito mutáveis, dependendo de diversos fatores como contexto histórico e político, podendo em determinadas épocas avançar nas garantias contra o discurso de ódio, como também a possibilidade de regredir essas garantias. As empresas têm suas políticas contra o discurso de ódio, entretanto ainda ineficientes, pois dependem dos usuários para fazer as denúncias e de moderadores para avaliar o conteúdo, sendo caras e lentas para resolução dos casos. Além disso muitas vezes as empresas fazem vista grossa para casos de ódio aplicando alguma medida apenas quando ganham grande repercussão midiática. A inteligência artificial que poderia ajudar, ainda apresenta dificuldades na identificação do discurso por causa da complexa semântica linguística do ser humano, seria uma medida de “longo-curto” prazo, pois a pesquisa para torná-la eficiente pode ser longa, porém quando a tecnologia fazer-se aplicável promete apresentar resultados em curto prazo. E por fim, a educação para o uso da rede apresenta-se como o melhor caminho no médio e longo prazo, pois prepara as pessoas para reconhecer este tipo de situação e ajuda os usuários a treinar a empatia para que saibam respeitar o outro. Sempre com o objetivo de tornar as redes um lugar livre e democrático respeitando a diversidade."
}