{
    "Autor": [
        "Suelen Macedo Laurindo",
        "Patrícia Bordignon André"
    ],
    "Título": "UMA ARQUITETURA DE SERVIÇOS VOLTADA À RECUPERAÇÃO DE INFORMAÇÃO E RECOMENDAÇÃO DE CONTEÚDO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": null,
    "Resumo": "O avanço da Web tem promovido novas formas de interação por parte de usuários resultando no aumento do volume de informações, bem como em uma maior dificuldade na tomada de decisão. Os usuários passam a assumir um papel de produtores de conteúdo ao invés de simplesmente consumidores. Este cenário gera oportunidades na construção de sistemas capazes de auxiliar usuários em suas escolhas ou mesmo aprender mais sobre um domínio. Na área de Recuperação de Informação opiniões podem resultar em sistemas mais interativos e de maior valor agregado sugerindo documentos que sejam mais relacionados a determinado perfil de usuário. Este trabalho propõe uma arquitetura de serviços com foco na Recuperação de Informação e em Sistemas de Recomendação como forma de melhorar a interatividade e a localização de documentos que sejam de interesse de determinado usuário. A implementação e aplicação da arquitetura em um cenário de uso permitiu analisar a interconexão de todos os serviços e demonstrar, através de consultas as recomendações obtidas a partir da escolha de um documento em particular. Por fim, foi possível perceber que a elaboração de sistemas que levem em consideração informações obtidas a partir da interação de usuários tende a facilitar a localização de documentos de interesse além daqueles fornecidos em resposta a uma busca.",
    "Palavras-chave": [
        "Sistemas de Recomendação",
        "Recuperação de Informação",
        "Web 2.0"
    ],
    "Introdução": "A Web teve início na Organização Europeia para a Pesquisa Nuclear (Conseil Européen pour la Recherche Nucléaire - CERN), quando Tim Berners-Lee observou as dificuldades para o gerenciamento de informações que esta possuía. A organização das informações que o CERN apresentava se assemelhava a uma 'teia de aranha' com conexões múltiplas, onde as interconexões progrediam com o tempo (BERNERS-LEE, 1989). Diante desta situação, Tim Berners-Lee idealizou uma organização dinâmica, onde as informações que eram geradas em lugares distintos poderiam ser conectadas. Desta maneira, caso uma pessoa deixasse o CERN, as informações geradas por esta não seriam perdidas. A solução que Berners-Lee propôs a este problema foi a criação de um sistema distribuído por meio de hipertexto (BERNERS-LEE, 1989). Quando Tim Berners-Lee criou a Web, a definiu como um universo de informação acessível pela rede global, local onde ocorre interação entre as pessoas, e atualmente é composta por hiperlink, imagens e vídeos (BERNERS-LEE, 1996). A primeira arquitetura da World Wide Web foi proposta em 1989 por Tim Berners-Lee e em 1990 ele desenvolveu o primeiro navegador chamado WorldWide Web, que mais tarde foi renomeado para Nexus a fim de evitar confusão (BERNERS-LEE, 1996). Esta geração da Web é conhecida por Web 1.0 e segundo Primo (2007), os sites apenas eram trabalhados como unidades isoladas e estáticas. Berners-Lee criou a Web unindo as seguintes tecnologias: URL (Uniform Resource Locator), utilizado pra localizar recursos na Web, HTML (Hypertext Markup Language), utilizada para representar o conteúdo em páginas na Web e HTTP (Hypertext Transfer Protocol), protocolo utilizado para transferência de dados na Web (BERNERS-LEE, 1996). Com o passar dos anos a Web evoluiu para uma visão mais interativa, dando início ao que ficou conhecido como Web 2.0, onde o usuário passou a ser ativo não apenas consumindo a informação, mas também produzindo-a. Esse comportamento foi definido com o termo Prosumer, cunhado por Alvin Toffler em 1980 (TOFFLER, 1980). Segundo Primo (2007), a Web 2.0 é a segunda geração de serviços online. O termo Web 2.0 foi definido por Dale Dougherty em 2004 (O'REILLY, 2007). Além de mudanças conceituais, também ocorreram mudanças tecnológicas e adesão de novas ferramentas de desenvolvimento como: AJAX (Asynchronous JavaScript and XML), Flex (Adobe Flex), GWT (Google Web Toolkit), que permitem a construção de páginas dinâmicas (PRIMO, 2007). O novo conceito de Web a torna bidirecional, ou seja, uma Web participativa com leitura e escrita de conteúdo, potencializando as formas de comunicação, onde o usuário deixa de ser apenas o receptor e passa a interagir contribuindo com conteúdo. Este conteúdo deixa de apresentar um padrão estático, passando a ser dinâmico (AGHAEI; NEMATBAKHSH; FARSANI, 2012). A Web 2.0 trouxe consigo um novo paradigma e também repercussões sociais, difundindo a produção e circulação de informações, vista como uma nova plataforma que viabiliza funções online, aperfeiçoando a usabilidade e aprimorando o conceito de 'arquitetura de participação'. Essa arquitetura visa oferecer serviços, tais como: publicação em espaço de debate, gestão coletiva de trabalho, negociação coletiva, e interação social (PRIMO, 2007). Dentre os principais serviços da Web 2.0 podemos destacar os Blogs, o RSS (Really Simple Syndication), os Wikis, os Mashups. Estes foram os mecanismos que facilitaram e induziram o crescimento de usuários ativos na Web (AGHAEI; NEMATBAKHSH; FARSANI, 2012). O crescimento exponencial de informação gerada pela Web 2.0 trouxe como consequência uma grande diversidade de conteúdo à disposição do usuário, tornando-se necessário recursos que ajudem usuários a realizarem consultas e escolhas. Entre as áreas que promovem suporte encontram-se a Recuperação de Informação (RI) e os Sistemas de Recomendação (SR). Segundo Manning, Raghavan e Schütze (2009), a Recuperação de Informação (RI) consiste na localização de materiais de natureza não estruturada que satisfazem determinada necessidade por informação a partir de uma fonte de informação. O processo de recuperação de informação possui como objetivo encontrar em uma coleção de documentos (corpus) quais satisfazem a busca de informação do usuário (FERNEDA, 2003). A Recuperação da Informação abrange tecnologias de consulta e indexação e está fundamentada na análise e disponibilização automática de conteúdo, normalmente documentos textuais (FOLTZ, 1992; HERLOCKER, 2000). Para que as buscas realizadas pelos usuários sejam mais eficientes são utilizadas algumas estratégias, estas se baseiam nos modelos de recuperação de informação. Os modelos mais comuns são: booleano e vetorial. O modelo booleano é o modelo mais simples, está baseado na teoria dos conjuntos, em que as consultas podem utilizar os conectores lógicos AND, OR e NOT. Entretanto, este modelo não possui ordenação para o resultado apresentado. Por outro lado, o modelo vetorial é um modelo estatístico em que o documento é representado através de uma lista de termo (um vetor). Diferentemente do modelo booleano, apresenta ordenação para o resultado baseada no grau de similaridade entre os documentos relevantes para a busca (SOUZA, 2006). Além das estratégias de busca pode ser adequado um direcionamento para que o usuário saiba quais dos resultados listados melhor satisfazem a sua necessidade. Para tal, Sistemas de Recomendação podem proporcionar informações mais apuradas que complementam determinada consulta de usuário. Os Sistemas de Recomendação são ferramentas de software e técnicas que proporcionam sugestões de itens para serem utilizados pelo usuário (RICCI et al., 2011). Têm por objetivo a redução da sobrecarga de conteúdo, através da seleção de informações baseadas em prioridades do usuário (FIGUEIRA FILHO; GEUS; ALBUQUERQUE, 2008). As sugestões referem-se a vários processos de tomada de decisão, tais como os itens de compra, que tipo de música ouvir, ou que notícias ler. O primeiro Sistema de Recomendação comercial foi chamado de Tapestry e utilizava o conceito de filtragem colaborativa (GOLDBERG et al., 1992). Atualmente os SR têm sido classificados principalmente em três abordagens: sendo a primeira a baseada na comparação de conteúdo ou características de determinado item. A segunda é a abordagem colaborativa (CAZELLA; NUNES; REATEGUI, 2010). E a terceira abordagem é híbrida unindo as duas abordagens anteriores (FIGUEIRA FILHO; GEUS; ALBUQUERQUE, 2008).",
    "Conclusão": "O objetivo geral deste trabalho consistiu na proposição de uma arquitetura baseada em serviços para Recuperação de Informação e Sistemas de Recomendação. A partir da revisão bibliográfica das áreas Recuperação de Informação e Sistemas de Recomendação, foi possível adquirir conhecimento para o desenvolvimento de um protótipo que comportasse a arquitetura proposta neste trabalho. O foco da arquitetura proposta foi elaborar um conjunto de serviços capaz de armazenar as informações (documentos e interações) e prover respostas a partir da necessidade de consulta de determinado usuário. Para permitir a avaliação da arquitetura foi elaborado um cenário de uso composto de 305 documentos, oriundos da ScienceDirect® e um conjunto de registros gerados artificialmente, totalizando 149.000 linhas na base de interações. Também visando uma melhor apresentação dos serviços foi simulada uma interface que primariamente apresenta os resultados oriundos de uma busca, os dados apresentados nesta interface foram obtidos a partir da execução dos serviços em uma IDE Eclipse. Como resultado da busca, são retornados os documentos mais similares e para cada documento são possíveis dois tipos de interação, a leitura (acesso ao documento completo) ou a avaliação da relevância. As interações representam os dados necessários para a geração das recomendações, estas que na interface são acessadas através da opção 'More Like This'. Nesta opção, considerando determinado documento escolhido, são sugeridos três documentos através da abordagem baseada em conteúdo e três documentos por meio da abordagem colaborativa. Os resultados obtidos demonstram que a arquitetura proposta é capaz de realizar adequadamente recomendações de documentos textuais nas duas abordagens de recomendação apresentadas, a colaborativa e a baseada em conteúdo. Também foi possível perceber que as recomendações tendem a facilitar a localização de documentos de interesse que vai além das respostas providas pelo serviço de busca textual. No desenvolvimento deste trabalho foram observadas, algumas possibilidades de trabalhos futuros, como o desenvolvimento de uma interface gráfica que permita a interação do usuário com o protótipo, a qual daria suporte a uma interação amigável e intuitiva seguindo os padrões de usabilidade. Adaptar a camada de serviços que atualmente está em Servlet para a arquitetura OSGI (Open Services Gateway Initiative), pois esta tecnologia possibilita a criação dos serviços em módulos dinâmicos, ou seja, caso um serviço precise ser atualizado não será necessário interromper o funcionamento de toda aplicação porque cada serviço possui seu próprio ciclo de vida. Além disso, vislumbra-se o aprimoramento do modelo de dados proposto visando suportar outras formas de recomendação, principalmente aquelas relacionadas à dimensão tempo. Esta dimensão torna-se particularmente importante por criar meios de se avaliar a evolução do comportamento/perfil de um usuário, evitando assim sugerir itens que se tornam irrelevantes em função do tempo. Embora estas melhorias não tenham sido desenvolvidas, o protótipo foi planejado visando futuras melhorias."
}