{
    "Autor": "Paula Alicia Lessa Paulo",
    "Título": "USO DE METODOLOGIA ÁGIL EM UMA EMPRESA DE MEIO DE PAGAMENTO PÓS-PAGO: ESTUDO DE CASO NA EMPRESA KOIN",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Aldo Novak",
    "Coorientador(a)": null,
    "Resumo": "Devido a grande competitividade entre as organizações a busca por entregar produtos com qualidade e na velocidade que o mercado atualmente exige, faz com que muitas empresas adotem métodos que dizem suprir estas necessidades. Os métodos ágeis prometem atender tais requisitos valorizando as pessoas e as interações entre elas, ao invés de focar nos processos e nas ferramentas como as metodologias clássicas. E por estes motivos, a empresa Koin resolveu adotar no seu processo de desenvolvimento o Scrum, com o intuito de melhorar a produtividade e a qualidade dos seus produtos. Esta monografia tem como objetivo documentar e analisar os impactos ocasionados pela implantação de princípios ágeis, nos processos e nas pessoas envolvidas acerca dos fatores que influenciam positivamente ou negativamente na implantação.",
    "Palavras-chave": [
        "Metodologia Ágil",
        "Scrum",
        "Desenvolvimento de Software"
    ],
    "Introdução": "Na busca por lucro, as empresas desenvolvedoras de software procuram por uma metodologia que venha aperfeiçoar a entrega de seus produtos com qualidade. Com as metodologias ágeis a entrega do produto na qual o cliente adquiriu é reduzida em relação aos processos tradicionais de desenvolvimento, além disso traz proveito para todos os envolvidos pois estão estruturados, criando um software com mínimo de recursos desperdiçados( FADEL; SILVEIRA , 2010). Os métodos ágeis foram criados principalmente para organizações em que os requisitos especificados pelo cliente fossem alterados durante o processo de criação do software. A metodologia ágil quando inserida em uma organização é capaz de introduzir interatividade entre o cliente e a equipe de desenvolvimento. Desta forma, o cliente tem envolvimento direto com a equipe, podendo alterar ou propor novas soluções ao software durante seu processo de desenvolvimento ( SOMMERVILLE , 2007). Esta modificação resulta aumento de produtividade da equipe, consequentemente, acelera a entrega do produto para o cliente, proporcionando assim sua satisfação ( MILLER; SY , 2009). Com essas mudanças que os métodos ágeis são capazes de introduzir em uma organização, empresas que adotam esse método vem ganhando espaço e se destacando no mercado desenvolvedor de software ( MILLER; SY , 2009). O Manifesto Ágil é a base de todos os métodos ágeis, valorizando os indivíduos e interações mais que processos e ferramentas, entre outros. A proposta da cultura ágil é fornecer uma gestão que seja mais adaptável e empreendedora. Empresas ligadas ao setor de tecnologia possuem este aspecto da agilidade ainda mais evidente e, portanto a adoção de uma cultura ágil se torna uma necessidade. Este trabalho aborda um estudo de caso, a ser realizado na empresa Koin. Segundo o site da empresa, a Koin é uma empresa desenvolvida no segmento chamado 'Fin Tec', ou seja, empresas cujas atividades unem serviços financeiros e tecnologias. Formada por profissionais das áreas de e-commerce, meios de pagamento e finanças, a Koin opera sob uma plataforma proprietária de alta tecnologia e inovação ( KOIN, 2014).",
    "Conclusão": "O uso de uma metodologia ágil em uma organização pode levar muitos benefícios tanto para a organização quanto para o cliente. Entretanto, cabe à organização avaliar a metodologia ágil que mais irá se adaptar com os processos e com a cultura organizacional assim como, a forma de trabalho e interação entre os membros da equipe. Independente da tecnologia utilizada, o sucesso de qualquer metodologia aplicada numa organização, parte das pessoas que irão trabalhar sob tal metodologia e na firmeza da organização em assegurar que a metodologia seja aplicada com sucesso. Para isso, é necessária uma transformação cultural, que deve ser disseminada pela organização através de treinamento, incentivo e avaliação de aderência. Se as pessoas não utilizarem a metodologia adotada de forma plena, o processo de trabalho não será consistente e resultará em prejuízos para a organização. Não adianta ter a melhor ferramenta para controlar e gerir uma metodologia de trabalho se as pessoas não estão trabalhando aderente às boas práticas. Os objetivos deste trabalho foram plenamente atingidos, pois foi possível confirmar os benefícios da implantação da cultura ágil no setor de desenvolvimento da empresa Koin. Com os resultados dos questionários, pode-se evidenciar que as hipóteses inicialmente levantadas foram confirmadas. Houve uma melhora na comunicação entre os membros da equipe, principalmente com as reuniões diárias, que permitem a troca de experiências e rápida identificação e resolução de problemas. A melhora na comunicação e a documentação adequada, das necessidades e tarefas a serem realizadas, também geraram uma melhora na produtividade e uma redução de retrabalho. E por fim, sob a ótica do cliente, o produto e os serviços tem sido entregues com melhor qualidade e em menor tempo. Desta forma, a empresa Koin pode ainda ampliar os benefícios obtidos estendendo a cultura ágil para outros setores da empresa. Além disso, como trabalho futuro pretende-se aprofundar os conhecimentos a respeito da implantação dos testes ágeis e automatizados, pois no momento o setor de testes pode explorar melhor os valores e princípios ágeis, assim como, adotar ferramentas que auxiliem neste processo."
}