{
    "Autor": "Gabriel Miranda Cruz da Silva",
    "Título": "Explorando o Potencial do Processamento de Linguagem Natural e Visualização de Dados em Transcrições de Áudio",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.ª Dra. Marina Carradore Sérgio",
    "Coorientador(a)": "",
    "Resumo": "Nos últimos anos, o advento do big data e a ampla difusão de aplicações que utilizam dados de fala criaram desafios e oportunidades na análise de dados. Nesse contexto, os avanços no processamento de linguagem natural (NLP) e a utilização de técnicas de visualização de dados abriram novas possibilidades de extrair conhecimentos, levando à melhor compreensão de conteúdos falados e a obtenção de insights. Sendo assim, este estudo propõe um método para análise de transcrições de áudio, utilizando essas tecnologias para identificar as temáticas presentes e obter respostas para perguntas específicas. Para isso, foram empregados diferentes modelos de linguagem de grande escala (LLMs) em três módulos distintos: (1) transcrição de áudio, (2) análise de perguntas e respostas (Q&A) e (3) modelagem e visualização de tópicos. O primeiro módulo utiliza um modelo para a geração de transcrições de áudio, armazenando-as em um arquivo. O segundo módulo emprega a técnica de geração aumentada por recuperação (RAG) para obter respostas contextualizadas de um LLM, baseadas no conteúdo das transcrições. Por fim, o terceiro módulo emprega um framework adaptável, que emprega modelos baseados na arquitetura transformer, algoritmos de agrupamento, técnicas de modelagem estatística, e visualização de dados para a obtenção e exploração de prováveis tópicos no conteúdo analisado. Para demonstração e avaliação, o método proposto foi aplicado em um conjunto de 12 horas de áudio de um curso on-line. Os resultados apontam que a abordagem se mostrou eficaz ao utilizar técnicas NLP e visualização de dados para a condução das análises, possibilitando a exploração dos dados tanto em uma perspectiva específica quanto abrangente. Além disso, este estudo forneceu perspectivas em relação à aplicação dessas tecnologias em dados de áudio, destacando algumas de suas vantagens, desvantagens e possibilidades.",
    "Palavras-chave": "transcrição de áudio; processamento de linguagem natural; perguntas e respostas; modelagem de tópicos.",
    "Introdução": "Nas últimas décadas, a evolução tecnológica impulsionou a produção e o armazenamento de grandes volumes de dados de forma contínua. Mahmoudian et al. (2023) destacam que o surgimento de aplicações web e mobile, combinado com o avanço da Internet das Coisas (IoT) e da computação em nuvem, intensificaram esse fluxo de informações. Na visão dos autores, esse fenômeno, conhecido como big data, tem atraído a atenção de pesquisadores e organizações, que buscam maneiras eficazes de interpretar e analisar esses dados massivos. Segundo Cook, Lee e Majumder (2016), os dados são um recurso fundamental para entender o mundo, reunindo informações oriundas de diversas fontes. Essa diversidade caracteriza uma ampla gama de formas de dados e representa uma oportunidade significativa para extrair informações valiosas que auxiliam na tomada de decisões (Keim; Qu; Ma, 2013). Assim, os dados são considerados uma fonte essencial de conhecimento, impulsionando avanços na ciência de dados, além de se configurarem como um diferencial competitivo no mercado (Mauro; Greco; Grimaldi, 2015). Dentre esse vasto volume de dados gerados, os dados de fala representam uma fração significativa, sendo encontrados em diversos contextos. Mehrish et al. (2023) ressaltam que o campo do processamento de fala tem adquirido crescente importância, com aplicações nas áreas de telecomunicações, entretenimento e saúde. Desse modo, aplicações que envolvem dados de fala têm se tornado cada vez mais presentes, destacando o papel dos dados de áudio em análises. Nesse cenário, Chen et al. (2020) destacam a visualização de dados como um componente central e indispensável na descoberta de conhecimento em diversas disciplinas. De acordo com os autores, esse processo possui o potencial de revelar padrões relevantes, relações ocultas e novas conexões, utilizando de forma eficaz os mecanismos de percepção visual humana. Dessa forma, a visualização de dados facilita a interpretação de resultados e fomenta novas descobertas, o que evidencia sua relevância na análise de grandes volumes de dados (Ali et al., 2016). Além disso, Tucker, Capps e Shamir (2020) apontam que os avanços nas ferramentas tecnológicas viabilizaram estudos e análises antes impraticáveis por métodos manuais, ampliando significativamente as oportunidades no campo da descoberta de conhecimento. No contexto desses avanços, a combinação de técnicas de Processamento de Linguagem Natural (do inglês Natural Language Processing – NLP) e visualização de dados aplicada a transcrições de áudio surge como uma abordagem promissora, capaz de identificar padrões complexos e gerar insights em diversas áreas do conhecimento. O NLP, um ramo da inteligência artificial, inclui diversas tarefas voltadas para a interação entre máquinas e linguagem humana. Entre as tarefas mais relevantes para este trabalho, destacam-se: ● Transcrição de áudio para texto: Conversão de gravações de voz em texto estruturado; ● Perguntas e Respostas (do inglês Questions and Answers – Q&A): Sistemas que respondem a perguntas baseadas em bases de dados textuais; ● Modelagem de Tópicos: Identificação de temas recorrentes em grandes volumes de dados textuais. Nesse cenário marcado pelo big data e pelos avanços tecnológicos, torna-se essencial desenvolver métodos e técnicas que transformam dados em conhecimento. Paralelamente, as tecnologias emergentes abrem novas possibilidades para análises inovadoras. Assim, este trabalho propõe o desenvolvimento de um método para a transcrição automatizada de arquivos de áudio em texto. Essas transcrições serão utilizadas como base para a aplicação de técnicas de processamento de linguagem natural (NLP) e visualização de dados, permitindo análises mais aprofundadas e facilitando a interpretação dos resultados obtidos. Com base nessa proposta, a pesquisa busca responder à seguinte questão: Como técnicas de processamento de linguagem natural e visualização de dados podem contribuir para explorar, analisar e extrair conhecimentos presentes em transcrições de áudio?",
    "Conclusão": "As considerações finais deste estudo refletem os principais achados e a contribuição do método proposto para a análise de transcrições de áudio, destacando sua aplicabilidade, flexibilidade e escalabilidade. A combinação de técnicas de processamento de linguagem natural (NLP) e visualização de dados proporcionou uma abordagem sólida para compreender, explorar e analisar de forma eficiente os temas abordados nos áudios. O método, composto por três módulos interconectados, demonstrou ser eficaz na transcrição de áudio, na recuperação de respostas contextuais por meio de Q&A, e na modelagem e visualização de tópicos, facilitando a análise de conjuntos de áudios. A flexibilidade do Módulo 3, que permite a análise tanto a nível de frases quanto de documentos inteiros, amplia a aplicabilidade da abordagem a diferentes cenários de análise. O uso de Modelos de Linguagem de Grande Escala (LLMs), como o modelo Gemini, foi fundamental para a implementação da análise de Q&A e a Geração Aumentada por Recuperação (RAG), permitindo a extração de informações específicas de maneira eficiente e precisa. Este módulo possibilitou que as perguntas fossem respondidas com base em fragmentos específicos das transcrições, melhorando a precisão e a relevância das respostas. Por outro lado, a modelagem de tópicos, realizada com o BERTopic, forneceu uma visão geral sobre os principais temas discutidos nas transcrições, organizando e agrupando as informações em tópicos relevantes. Essa análise semântica mais abrangente permitiu uma exploração detalhada dos tópicos abordados nos áudios, como vigilância digital, privacidade e segurança dos usuários, entre outros. A visualização de dados, complementada por gráficos interativos, facilitou a interpretação dos resultados, tornando a análise mais acessível e compreensível."
}