{
    "Autor": "Priscila Cadorin Nicolete",
    "Título": "As tecnologias da informação e comunicação como ferramenta para observação da integração de alunos surdos e ouvintes no ensino fundamental em escola da rede pública.",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá, Santa Catarina",
    "Orientador(a)": "Professor Dr. Juarez Bento da Silva",
    "Coorientador(a)": "Professora Msc. Carolina Ferreira Pêgo",
    "Resumo": "A partir da Declaração de Salamanca passa a ser disseminado um conceito de necessidades educacionais especiais que ressalta a interação das características individuais dos alunos com o ambiente educacional e social, responsabilizando o ensino regular para o desafio de atender as diferenças. Desde então o governo brasileiro vem trabalhando nessa perceptiva, e optou pelo modelo de ensino inclusivo, na tentativa de colaborar para a inclusão social. Contudo, mesmo com essa perspectiva conceitual transformadora, sabe-se que as políticas educacionais implementadas ainda não foram suficientes para uma educação inclusiva eficaz. Pois ao ser incluído na escola regular, além dos problemas relacionados ao ensino propriamente dito – materiais e metodologias adequados – o sujeito surdo enfrenta problemas relacionados à socialização provocados pela dificuldade de comunicação com as crianças ouvintes. Pensando nisso a Escola de Educação Básica Castro Alves, da cidade de Araranguá, Santa Catarina, tem se esforçado para tentar mudar essa realidade. A escola optou por disponibilizar o ensino de Língua Brasileira de Sinais às crianças ouvintes, na tentativa de construir o meio de comunicação entre ouvintes e surdos. Neste sentido, a atual pesquisa pretende observar se a iniciativa da escola Castro Alves contribui para a socialização e interação entre as crianças. Para isso, será utilizada as Tecnologias de Informação e Comunicação como instrumento de observação, tendo em vista as potencialidades das novas tecnologias utilizadas no ambiente escolar, principalmente no meio escolar inclusivo.",
    "Palavras-chave": [
        "TIC",
        "Inclusão",
        "Educação Básica",
        "Ensino Fundamental",
        "Surdos",
        "LIBRAS"
    ],
    "Introdução": "Neste capítulo, são descritos os antecedentes do projeto e o contexto no qual foi desenvolvido, assim como os objetivos, o problema a ser resolvido e o escopo do projeto. Em um mundo de constantes mudanças e inadvertidos avanços, a tecnologia aplicada no âmbito da educação vislumbra um futuro sem limitações, no qual alunos com ou sem necessidades especiais podem usá-las e expressar-se através delas. Assim, a incorporação das Tecnologias de Informação e Comunicação no contexto educacional tornou-se particularmente relevante, sob a suposição de que estas ferramentas podem promover uma melhor qualidade do ensino e facilitar a aprendizagem, bem como ajudar a reduzir a exclusão digital. A educação inclusiva pretende responder a um enfoque filosófico, social, econômico, cultural, político e pedagógico que persegue a aceitação e valorização das diferenças na escola para cada um dos alunos. A escola inclusiva sugere que os alunos se beneficiam de um ensino de qualidade adaptado às suas necessidades. Reconhecendo que todos merecem oportunidades iguais, o Brasil fez opção pela construção de um sistema educacional inclusivo ao concordar com a Declaração Mundial de Educação para Todos e ao mostrar consonância com os postulados produzidos em Salamanca, na Espanha. A Declaração de Salamanca (UNESCO, 1994), em seus pressupostos, afirma que: A tendência da política social durante as duas últimas décadas foi de fomentar a integração e a participação e de lutar contra a exclusão. A integração e a participação fazem parte essencial da dignidade humana e do gozo e exercício dos direitos humanos. No campo da educação, essa situação se reflete no desenvolvimento de estratégias que possibilitem uma autêntica igualdade de oportunidades. (UNESCO, DECLARAÇÃO DE SALAMANCA, 1994, p. 5). A declaração afirma ainda que é em escolas com estratégias pedagógicas centradas na educação inclusiva 'que as crianças com necessidades educativas especiais podem progredir no terreno educativo e no da integração social' (UNESCO, DECLARAÇÃO DE SALAMANCA, 1994). Entretanto, a declaração afirma que para ter êxito neste processo é preciso de um esforço comum, não somente dos professores e do pessoal restante da escola, mas também dos colegas, pais, famílias e voluntários. A partir da Conferência Mundial de Educação Especial, da qual resultou o documento acima citado, paradigmas sobre a educação de crianças com necessidades específicas passaram por grandes mudanças. Passou-se a entender que a escola deve considerar as peculiaridades de cada aluno em seus processos de ensino e aprendizagem, além de gerar mudanças em seu sistema para atender todas as crianças. As necessidades educativas especiais incorporam justamente este princípio de uma pedagogia equilibrada que beneficie todas as crianças. Esta pedagogia parte do princípio de que todas as diferenças humanas são normais e de que a aprendizagem deve, portanto, ajustar-se às necessidades de cada criança, ao invés de cada criança se adaptar aos supostos princípios quanto ao ritmo e à natureza do processo educativo. Uma pedagogia centrada na criança é positiva para todos os alunos e, consequentemente, para toda a sociedade (UNESCO, DECLARAÇÃO DE SALAMANCA, 1994). Nesta perspectiva, o documento ressalta a importância da língua dos sinais como meio de comunicação para os surdos, bem como o dever de se assegurar a todos eles o acesso ao ensino da língua de sinais de seu país.",
    "Conclusão": "O presente estudo contribuiu para ampliação e aplicação de muitos conhecimentos adquiridos ao longo do curso de Tecnologias da Informação e Comunicação que devido a sua característica interdisciplinar oportuniza, entre outras, observar a importância da integração da tecnologia aos processos de ensino e de aprendizagem, principalmente no âmbito da educação básica e no envolvimento de crianças com necessidades específicas. O objetivo deste trabalho foi desenvolver e aplicar pelo menos um jogo de computador educacional bilíngue (LIBRAS e português) para crianças do ensino fundamental como instrumento de observação da efetividade das atitudes tomadas pela escola para a promoção da inclusão social no ambiente escolar. Um jogo educacional bilíngue foi desenvolvido e aplicado e outros dois foram desenvolvidos, porém, não houve tempo hábil para a aplicação. A partir de observações in loco na escola, dos questionários aplicados e dos logs de uso do jogo educacional desenvolvido buscou-se entender como se dá a interação das crianças surdas com crianças ouvintes na escola regular de Educação Básica parceira no projeto, tendo em vista uma das diretrizes da proposta da educação inclusiva – socialização e aceitação das diferenças. Neste sentido, pretendeu-se explorar a convivência das crianças no ambiente escolar. A partir da análise dos resultados obtidos constatou-se que para uma melhor análise desse cenário, seria necessária a realização de mais aplicações, com a utilização de mais de um tipo de jogo educacional, como era o intuito inicial do projeto. Contudo, devido às limitações de tempo para a realização do trabalho de conclusão de curso não foi possível aperfeiçoar a pesquisa. Entretanto, para trabalhos futuros, pretende-se dar continuidade na pesquisa, disponibilizando novos jogos educacionais bilíngues em mais seções, a fim de aprofundar os estudos em relação às questões da inclusão escolar para os alunos surdos, tendo em vista a posição da comunidade surda em relação a esse sistema de ensino. Outro ponto interessante percebido durante o tempo permanecido no laboratório de informática da escola foi a importância das TICs nas salas de aulas como recurso e apoio pedagógico, tanto para as crianças ouvintes, quanto para o aluno surdo. Percebemos que os alunos ficaram extremamente animados com os jogos educacionais e realizam todas as atividades propostas. A professora da turma havia utilizado o laboratório de informática apenas uma vez este ano para atividades com a turma e relatou a importância da utilização de novos recursos na sala de aula. Segundo a professora, '[...] os alunos estão aprendendo brincando. Essa experiência nos trouxe muitas informações e nos levou a pensar em novas formas de ensinar'. Em relação ao aluno surdo, este iniciou as atividades de forma tímida e com poucas expressões, porém, no decorrer da atividade e visualizando as explicações em sua língua, foi mostrando empolgação e se mostrou muito animado. A sua intérprete inicialmente o deixava assistir aos vídeos e depois lhe solicitava que explicasse o que tinha sido apresentado, e ele então explicava corretamente. Ao ser perguntado o que tinha achado do jogo com a tradução de Libras, sua resposta foi: 'entendi a interpretação do tradutor de Libras, não foi difícil de entender e gostei dos jogos'. A intérprete relatou a importância de jogos que contemplem as duas línguas, destacando para o ensino bilíngue. Segundo a docente, 'os surdos já conhecem Libras e têm bastante interesse em jogos com Libras, porque ajuda eles a aprenderem através da visualização e compreenderem também a escrita'. Com isso pode-se observar a importância da disponibilização de materiais voltados às pessoas surdas, tornando acessíveis conteúdos de diversas áreas e ainda estimular a aprendizagem do português escrito. Os autores Pereira, Campos & Magina afirmam que o crescimento da utilização dos recursos tecnológicos nas escolas favorece o ingresso e permanência dos estudantes com deficiências nas escolas regulares, pois as novas tecnologias auxiliam na acessibilidade destes às informações e na construção do conhecimento. Para trabalhos futuros visamos à melhoria dos softwares desenvolvidos e sua disponibilização via internet devido à dificuldade de instalação, manuseio e quantidade dos recursos de TI disponíveis nas escolas da rede pública de ensino. Também pensamos em iniciar a construção de um repositório de objetos educacionais, mais especificamente jogos educacionais bilíngues, disponíveis nas línguas portuguesa e espanhola. No caso do espanhol a partir da cooperação e parceria estabelecida com o projeto Vedoque."
}