{
    "Autor": "Eric Teixeira Pereira",
    "Título": "APLICAÇÃO DA REALIDADE VIRTUAL PARA O TRATAMENTO DE FOBIAS: UM ESTUDO NA LITERATURA",
    "Ano de publicação": "2021",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof, Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": "Profª Natana Lopes Pereira, Mestra",
    "Resumo": "Este trabalho de conclusão de curso visa explorar como a tecnologia de Realidade Virtual pode ser uma ferramenta eficaz na luta contra as fobias, ou seja, transtornos de ansiedade que causam medo exagerado a certas situações, objetos ou seres vivos. Para chegar ao objetivo deste trabalho foi aplicado um método denominado como Revisão Sistemática da Literatura, que consiste na busca por trabalhos relacionados ao tema em bases de dados, neste caso o PubMed que é um recurso gratuito desenvolvido pela Biblioteca Nacional de Medicina dos Estados Unidos que contém um grande acervo de publicações essenciais para a conclusão deste trabalho. A partir da exploração sobre o tema abordado foi realizado um levantamento a fim de descobrir os autores que mais publicaram trabalhos relacionados ao tema nos últimos cinco anos, através deste levantamento observou-se que o tema Realidade Virtual para o tratamento de fobias vem sido muito explorado, com um alto avanço de pesquisas nos últimos anos. Com o crescente número de pesquisas publicadas foi realizado um estudo com base no autor com o maior número de publicações deste período, onde foram abordados e destacados os objetivos e resultados das pesquisas deste autor. Com isso foram analisadas e descritas ao longo deste trabalho as vantagens, oportunidades e desafios para este tipo de tratamento, também foram realizadas comparações com os tipos de tratamentos convencionais e os métodos que utilizam realidade virtual. Foram explorados exemplos de sistemas e ambientes virtuais que consolidam a tecnologia para o tratamento, visando contribuir para a saúde dos indivíduos. Conclui-se que a tecnologia de realidade virtual tem muito a oferecer principalmente na área da psicologia, tornando o tratamento de fobias uma atividade segura, ágil, eficaz e de baixo custo para os envolvidos.",
    "Palavras-chave": "Realidade Virtual, Fobias, Exploração",
    "Introdução": "A Realidade Virtual (RV) por ser uma tecnologia experimental e inovadora pode ser usada em diversas áreas do conhecimento. Esta tecnologia aplicada para a área da saúde vem se tornando um referencial para tratamentos de transtornos psicológicos, dentre eles as fobias, que são as formas mais comuns de ansiedade, que por sua vez é o mais comum dentre os transtornos psicológicos. (NETTO, 2006, p. 1). De acordo com Keldt e Kapczinski (1999 apud ESTÁCIO; JACOB; ARTERO, et al., 2000) fobia é um medo irracional e incontrolável que um indivíduo experimenta diante de um objeto específico, atividade ou situação. O tratamento de uma fobia pode ser realizado de várias formas, como psicanálise e hipnose, porém a abordagem mais eficaz é conhecida como terapia cognitivo-comportamental. Esta abordagem “se baseia na dessensibilização gradual do indivíduo fóbico por meio da exposição ao estímulo causador do medo, controlando fobias em poucas sessões, é a mais procurada por pacientes fóbicos.” (NETTO, 2000, p. 1). Conforme proposto por Netto (2000) a tecnologia de Realidade Virtual possibilita esta exposição de uma forma muito mais ágil, segura e com baixo custo em relação aos tratamentos convencionais, pois permite que o paciente acesse ambientes, objetos e situações causadoras de fobia sem se expor realmente ao fator causador do transtorno fóbico. Apesar das terapias convencionais conseguirem bons resultados, mostra-se necessário o desenvolvimento de novas ferramentas que encorajem o indivíduo a procurar tratamento, pois estima-se que cerca de 60% a 85% das pessoas que sofrem desses transtornos não procuram ajuda, e por meio da realidade virtual o indivíduo se sente mais confortável ao procurar tratamento, de modo que não será exposto diretamente ao fator que lhe causa tanto medo.",
    "Conclusão": "A partir da exploração na base de dados PubMed, foi possível construir uma noção de como o assunto vem sendo explorado ao longo dos anos e atingiu-se o objetivo geral deste trabalho, que consistia na investigação de como o tratamento de exposição às fobias por meio da tecnologia RV vem sendo abordado e estudado nos últimos anos, onde observou-se que a quantidade de estudos na área está crescendo cada vez mais. Conforme visto durante o desenvolvimento deste trabalho o tratamento de fobias utilizando RV é superior em muitos aspectos em relação ao tratamento convencional, mas ainda possuem muitos pontos a serem explorados e que podem gerar dúvida para o terapeuta na hora de optar em realizar um tratamento convencional que já demonstra resultados satisfatórios ou apostar em uma tática alternativa para atrair mais pacientes. Foram abordados os tipos de tratamentos convencionais que utilizam a técnica de exposição in vivo, que consiste na exposição real ou imaginária do paciente ao fator fóbico, este tipo de tratamento é bastante eficaz para as fobias porém é perceptível a necessidade de inovação nesta área, através de uma comparação entre o método convencional e o método utilizando a tecnologia RV para criar um ambiente virtual semelhante ao real para o tratamento de fobias foi possível identificar que a tecnologia é capaz de transmitir ao terapeuta segurança, agilidade e ainda em baixo custo, permitindo que os pacientes se sintam confortáveis ao buscar o tratamento de uma fobia pelo fato de não serem expostos diretamente com o fator fóbico, como é realizado em tratamentos convencionais. A tecnologia RV tem muito a oferecer para a área do tratamento psicológico, vários tratamentos experimentais, já realizados, permitiram a validação da RV como uma ferramenta eficiente no tratamento de fobias. Os sistemas VESUP e IN2TUNNEL demonstram na prática como as tecnologias RV contribuem para o tratamento dos casos de fobias urbanas, atividades simples como subir em um elevador ou atravessar um túnel em uma rodovia podem causar extremo desconforto para indivíduos que possuem este tipo de fobia, neste cenários os ambientes virtuais disponíveis podem ser muito eficazes contribuindo para a extinção do medo persistente. Sabendo da necessidade de inovação na área do tratamento de transtornos mentais, como as fobias, espera-se atrair com este trabalho novas visualizações para a tecnologia RV, buscando esta ferramenta como alternativa para tratar os casos de fobias em pacientes com máxima eficácia, possibilitando uma significativa melhora na qualidade de vida da população mundial. É verídico que está tecnologia apesar de ser muito eficaz possui muitos desafios pela frente para que se torne uma ferramenta padrão para os tratamentos de fobias, para isso é preciso estudar meios nos ambientes para que o terapeuta consiga ter resultados precisos com o tratamento, evitando que análises e diagnósticos falsos sejam demonstrados."
}