{
    "Autor": "Rafael Ramos Pandini",
    "Título": "A UTILIZAÇÃO DE SOFTWARE DE AUTORIA NO AUXILIO AOS ESTUDOS EM SALA",
    "Ano de publicação": "2018",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Fernando José Spanhol",
    "Coorientador(a)": "",
    "Resumo": "Este estudo apresenta como tema o uso do software Hot Potatoes como forma de reforçar as atividades em sala. Para a realização desse trabalho elaborou-se diversos exercícios que foram utilizados como atividades no Moodle das disciplinas de educação à distância. O objetivo da pesquisa é utilizar o software de autoria hot potatoes, visando reforçar os ensinamentos passados em sala de aula, através de atividades. Assim o presente trabalho pretende responder a seguinte questão: O Ambiente Virtual de Ensino e Aprendizagem conjugado com o software de autoria, pode auxiliar no processo de compreensão e assimilação dos artigos apresentados em sala? Para responder tal questão se utilizou como base o questionário respondido pelos alunos. O trabalho fundamentou na análise do AVEA por Bortolato (2016), Silva (2011), Alarcon e Spanhol (2015), França (2014), Falcão e Rangel (2013), Haddad (2013) e Lacerda (2013) sobre a análise do software Hot Potatoes por Parreira Junior, Franco Neto e Costa (2009), em conceitos sobre a utilização dos jogos na educação por Prensky (2001) e Tarouco, Konrath e Grando (2005), fundamentado pelos métodos científicos de Prodanov e Freitas (2013), Marconi e Lakatos (2003), Gil (2010) e Freire (2013). A análise dos dados coletados demonstrou a importância da utilização dos hot potatoes no âmbito de reforçar os estudos em sala. O estudo identificou algumas dificuldades encontradas pelos alunos, sendo a principal o tempo para obter mais conhecimento sobre a utilização das ferramentas. Cabe um estudo mais aprofundando sobre o uso do software Hot Potatoes para aprofundar mais a utilização dos jogos na educação a distância como forma de facilitar/fixar o conteúdo utilizando ferramentas disponíveis no moodle e assim tendo em mente uma pesquisa maior para intensificar esse uso na disciplina.",
    "Palavras-chave": "Educação a Distância, Hot Potatoes, Ambiente Virtual de Ensino e Aprendizagem.",
    "Introdução": "O rápido avanço da tecnologia fez com que a educação se adaptasse a uma nova forma de ensino. O ensino que até então vinha a ser apresentado em um modo formal, onde se tinha o professor e os alunos em sala utilizando muitas vezes ferramentas tradicionais, vem dando espaço a novas ferramentas de ensino, levando em conta a flexibilidade, o uso de tecnologias e a liberdade de expressão. De acordo com as tendências evidenciadas no projeto de pesquisa Horizon Report (ADAMS BECKER et al., 2017), descreve que ao longo dos anos a utilização de tecnologia no ensino é vista pelos estudantes e professores como uma alternativa viável para um novo método de aprendizagem. Com isso a aprendizagem híbrida vem ganhando forças visto que o número de plataformas educacionais está aumentando, desta forma oferecendo uma facilidade no acesso aos elementos multimídias e tecnologias sofisticadas que são as novas tendências que influenciam diretamente no ensino dos alunos. Neste sentido, nota-se uma crescente expansão do uso da tecnologia dentro das escolas, apresentando dificuldades no início da sua implementação hoje é de grande valia para a educação. A sua influência fez com que as escolas trouxessem novas formas de ensino, equipando-se de recursos tecnológicos como forma de atrair os alunos envolvendo a aprendizagem e o mundo virtual, trazendo um novo desafio para os professores de como introduzir esses recursos nos ensinos dentro de sala de aula. De acordo com Serafim e Souza (2011), espera-se que as escolas através de um novo olhar consigam se adaptar ao uso dessas tecnologias com o intuito de sobreviver no meio educacional, e nessa perspectiva afirmam que é essencial que os professores aproveitem os ensinos advindos das tecnologias da informação e comunicação para uma implementação em suas práticas pedagógicas. Ainda completa que é de extrema importância os educadores trabalharem juntamente com essas ferramentas em torno de um só objetivo de proporcionar motivação e aprendizagem. Com base nessa afirmação, nos últimos anos o uso de Ambiente Virtual de Ensino e Aprendizagem – AVEA está tornando-se cada vez mais presente no ambiente acadêmico como uma opção de tecnologia para oferecer um apoio ao processo de ensino-aprendizagem. As ferramentas de tecnologia da informação e comunicação juntamente com o Ambiente Virtual de Ensino e Aprendizagem - AVEA possibilita uma interação maior entre aluno e professor no processo de aprendizagem em aula. O desenvolvimento da Educação a Distância – EaD juntamente com o AVEA comprova que existe um espaço para utilização de novas práticas pedagógicas. A comunicação que ocorre de forma multidirecional entre aluno e professor vinculada ao AVEA que promove uma interação e comunicação maior faz com que se promova uma aprendizagem saindo de um processo de ensino sistemático e formal (BORTOLATO, 2016). Com o passar dos anos a EaD vem fortalecendo o processo de ensino-aprendizagem através do uso de tecnologias. De acordo com Moore e Kearsley (2005), a utilização de ferramentas tecnológicas permitiu o avanço do processo de conhecimento, tendo como mediador os recursos tecnológicos para a criação, disponibilização e interação entre alunos e professores. Neste contexto, o AVEA da Universidade Federal de Santa Catarina (UFSC) possui diversas ferramentas interessantes quanto ao seu uso. Uma ferramenta interessante é a introdução de jogo para utilização como forma de exercício. Com isso uma das formas mais interessantes de unir a educação e a tecnologia é através da utilização de jogos online como forma de aprimoramento dos conteúdos. Visto que os jogos estão entre os educandos, trazer essa prática para dentro de sala com uma perspectiva educacional é uma nova forma de motivação e de repassar a aprendizagem de uma forma dinâmica e como forma de reforçar os conteúdos utilizados em sala. O contato com os jogos potencializa habilidades que são essenciais para o processo de ensino aprendizagem, visto que a atenção, criatividade, o raciocínio lógico, a visão estratégica são elementos que possivelmente serão desenvolvidos na utilização dos jogos, pois viver situações de conflitos nos jogos contribui para a formação profissional dos estudantes. Com isso, o uso dos jogos é uma maneira de promover a aprendizagem dinâmica e interativa afim de desafiar as capacidades cognitivas dos educandos (ALVES, 2009). Prensky (2001), completa que os jogos têm um grande poder, o poder de prender a atenção dos alunos, e a força dos jogos vai além desse sentido, pois ainda assim tem a capacidade de ensinar. Afirma que a utilização da metodologia certa em seu uso pode ser uma grande motivação com o intuito de ajudar os educandos a aprenderem, pois, os jogos estimulam o raciocínio lógico dos alunos possibilitando a criação de novos métodos de aprendizagem com base nas abordagens utilizadas. Com isso, a utilização do software Hot Potatoes oferece atividades divertidas tornando o processo de ensino-aprendizagem mais atrativas, fazendo com que facilite o processo de absorver o conhecimento discutido em sala de aula e fazendo com que o aluno se torne um sujeito ativo, pois tem a possibilidade participar no processo de construção e de criação das atividades (DIELLO; MOZZAQUATRO, 2011). Contudo, introduzir jogos na matéria de educação a distância é uma nova experiência visando ter resultados satisfatórios e como forma de reforçar as teorias de utilização das novas tecnologias, agregando novos ensinamentos baseados em um método de ensino pouco utilizado pelos educadores. Então, a proposta consiste em utilizar o software hot potatoes para reforçar os conteúdos trabalhados em sala, visando enfatizar a importância da utilização dos jogos em sala de aula, como forma de melhorar o desenvolvimento do aluno e atuando na sua participação em sala.",
    "Conclusão": "De acordo com os objetivos apresentados no início dessa pesquisa, foi utilizado o software de autoria para a elaboração de exercícios nas disciplinas. Com isso as atividades elaboradas foram aplicadas utilizando as ferramentas nas disciplinas de EaD para auxiliar no desenvolvimento dos resumos publicados no fórum. Então, através desses objetivos foi possível verificar a eficácia e eficiência dos recursos do hot potatoes, através do formulário do próprio Moodle, como forma de coletar dados com as turmas. Contudo através dos percentuais observados na coleta dos dados, nota-se que os educandos têm uma motivação, um desempenho melhor quando se utiliza atividades para sair da rotina tradicional e com isso através de exercícios aumentar sua participação na aula e desempenho na disciplina. Os objetivos em questão foram alcançados e nortearam a execução do trabalho para concluir o objetivo geral do trabalho. A pesquisa bibliográfica proporcionou maior conhecimento dos temas da Educação a Distância, AVEA e Software de Autoria Hot Potatoes. Prensky (2001), afirma que a utilização da tecnologia no âmbito acadêmico detém muito potencial, pois a medida que se tem avanços na utilização de softwares como forma de auxiliar nas aulas se tem um progresso no entretenimento dos educandos quanto ao uso dessas tecnologias. Através da execução do protótipo aplicado e da análise comparativa dos dados coletados entre as turmas, se tem a confirmação de que as atividades contribuíram na assimilação dos conteúdos ministrados em sala. De acordo com os resultados obtidos quando questionados se a atividade realizada no software educacional auxiliou no conhecimento adquirido na disciplina, 69% e 72% das turmas de 2017.2 e 2018.1 respectivamente, concordam que de alguma forma os exercícios foram eficientes como forma de assimilar as informações dos conteúdos disponibilizados. Por meio dessa abordagem percebe-se a relevância das atividades e do fórum no processo de realização das atividades. Camargo (2016) complementa que o uso desse software no ensino traz diversos benefícios para os educandos e educadores além de inovar na prática pedagógica e criando exercícios de acordo com a realidade dos alunos. Essas afirmações podem ser confirmadas pelo fato que 87% e 77% dos educandos realizaram as atividades propostas nas disciplinas das turmas de 2017.2 e 2018.1 e com isso afirmam que contribuiu para o processo de aprendizagem dos mesmos. Além da contribuição do Software por meio dos exercícios, a pesquisa apontou algumas dificuldades encontradas pelos alunos das turmas, sendo a principal os problemas com internet. Devido à quantidade de atividades realizadas, a indisponibilidade de tempo para a criação de novas formas de atividades com conteúdos diversificados foi um agravante no desenvolvimento da monografia. Através dessa pesquisa, enfatiza-se a importância do uso de novas tecnologias nas salas de aula, assim como novos métodos de exercícios como forma de atrair a atenção dos alunos e equivaler ao mesmo universo em que os educandos compartilham informações e com isso auxiliar no reforço dos conteúdos para sair de um modo entediante e formal de ensino. Então, com a leitura dessa pesquisa os professores sintam-se incentivados a utilizar softwares de autoria em suas aulas, pois, conforme os resultados o uso dessas ferramentas de multimídia é uma forma diferente de aprender, ensinar e compreender os diversos conteúdos ministrados em sala, de forma a utilizar a tecnologia e o conhecimento como fortes aliados."
}