{
    "Autor": "Raí do Nascimento de Matos",
    "Título": "AVALIAÇÃO DA CAPACIDADE DE INOVAÇÃO DAS EMPRESAS RESIDENTES EM UMA INCUBADORA PRIVADA, NA REGIÃO DO EXTREMO SUL DE SANTA CATARINA.",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá, Santa Catarina",
    "Orientador(a)": "Dra. Solange Maria da Silva",
    "Coorientador(a)": null,
    "Resumo": "O modelo organizacional de incubadoras de empresas vem crescendo muito nos últimos anos. O apoio das incubadoras aos novos empreendimentos é fundamental para a empresa na fase de nascimento, crescimento e na consolidação. O presente estudo tem como tema a capacidade de inovação de empresas incubadas na cidade de Criciúma, no extremo sul de Santa Catarina, mais especificamente na incubadora InSite. O objetivo desta pesquisa é avaliar a capacidade de inovação de empresas de base tecnológica (EBT) residentes na incubadora privada InSite. O procedimento metodológico deste trabalho está voltado para um estudo exploratório-descritivo e uso de abordagem qualitativa. Na pesquisa desenvolveram-se dois questionários como instrumentos de coleta de dados: um questionário foi direcionado ao gestor da incubadora e o outro direcionado às empresas incubadas, esse último com base na metodologia desenvolvida por Silva (2006) para avaliação da capacidade de inovação das empresas e classifica as empresas em pouco inovadoras, medianamente inovadoras e inovadoras. O resultado da pesquisa mostra que 75%, ou seja, a maioria das empresas incubadas na InSite é classificada como Medianamente Inovadora. Uma empresa foi classificada como inovadora e nenhuma empresa foi considerada pouco inovadora. Ao fim do trabalho algumas das conclusões foram que as empresas que conseguem obter um grau de inovação maior, apresentaram como características a diversificação das fontes de inovação, interagindo com todos os stakeholders, a utilização de todas as formas de inovação, investem mais em P&D. O trabalho apresenta também as dificuldades e obstáculos que prejudicam as atividades inovadoras, os maiores problemas em geral são: os riscos econômicos excessivos e a falta de pessoal qualificado. A pesquisa apontou, ainda, que a influência da incubadora em relação ao grau de inovação das empresas incubadas está relacionada ao ambiente, por estarem todos em busca da inovação, e ao incentivo e acompanhamento da incubadora para o desenvolvimento do negócio e da inovação.",
    "Palavras-chave": [
        "Capacidade de inovação",
        "Empresa de Base Tecnológica",
        "Incubadora Privada",
        "InSite"
    ],
    "Introdução": "O modelo organizacional de incubadoras de empresas vem crescendo muito nos últimos anos. No último estudo realizado pela ANPROTEC, em 2011, no Brasil existiam 384 incubadoras, sendo essas responsáveis por 2.509 empresas graduadas (empreendimentos que já saíram do processo de incubação) e 2.640 empresas incubadas (ANPROTEC; MCTI, 2012). O apoio das incubadoras aos novos empreendimentos é fundamental para a empresa na fase de nascimento, crescimento e na consolidação. Contribuindo assim, para diminuir a alta taxa de mortalidade das micro e pequenas empresas recém-criadas. (ANPROTEC; MCTI, 2012). Além da estrutura física e da questão de gerenciamento, as incubadoras procuram estimular a inovação, abraçando empreendimentos que têm o intuito de inovar. As incubadoras têm uma importante tarefa de incentivar o empreendedorismo, gerar empregos, renda e o desenvolvimento de inovações, promovendo e apoiando ideias de empreendimentos de pequenos empresários inovadores com serviços de apoio gerencial, financeiro, legal, além de estrutura física e contatos com outros empreendedores (DORNELAS, 2002). As incubadoras têm ambientes propícios para a geração de inovações (JABBOUR; DIAS; FONSECA, 2005), pela sua relação com instituições de ensino e centros de pesquisa, mão-de-obra qualificada, suporte gerencial e custos reduzidos, condições essas que também favorecem a sobrevivência de pequenas empresas. Elas também contribuem para o desenvolvimento econômico das regiões onde estas atuam (ANPROTEC; MCTI, 2012). O presente estudo busca avaliar a capacidade de inovação de empresas de base tecnológica, residentes em uma incubadora privada na cidade de Criciúma, no extremo sul de Santa Catarina, mais especificamente na incubadora InSite, buscando identificar quais variáveis estão relacionadas ao grau de inovação de cada empresa incubada, e a influência que a incubadora pode ter para esse grau de inovação. Tendo em vista que se tratam de micro e pequenas empresas, esse estudo também abordará os conceitos relacionados às micro e pequenas empresas, trazendo a sua importância como geradora de inovação e as principais causas de sua alta taxa de mortalidade, e discorrerá, por fim, sobre as empresas de base tecnológica.",
    "Conclusão": "Empreendedores encontram algumas dificuldades quando estão começando um novo negócio, por isso, eles buscam, muitas vezes, apoio e suporte nas incubadoras de empresas. As incubadoras se mostraram importantes para as novas micro e pequenas empresas incubadas, por possuírem um ambiente favorável ao desenvolvimento de um negócio novo e que contribui para o processo de inovação dessas empresas. Este estudo foi realizado devido à necessidade que as empresas de base tecnológica têm de desenvolverem alta capacidade de inovação, como forma de sobrevivência e de competitividade em seu mercado. E também pela falta de pesquisas realizadas nesta área em incubadoras privadas, em especial, na Cidade de Criciúma/SC. Diante disso, essa pesquisa teve como objetivo principal avaliar o nível de inovação das empresas incubadas na InSite, e a influência que a incubadora tem em relação ao grau de inovação das empresas incubadas na percepção de seus dirigentes. A pesquisa conseguiu cumprir esse objetivo geral, ao caracterizar o perfil das empresas residentes da incubadora InSite, ao descrever os critérios de seleção e de avaliação das empresas, e ao apresentar os problemas e obstáculos à inovação encontrados pelas empresas, as características empresariais que, na percepção de seus atores, contribuíram para a capacidade de inovação das empresas incubadas, ao analisar, na percepção do administrador da InSite, o impacto socioeconômico da incubadora para a região, e ao descrever a percepção dos empreendedores e dos gestores da incubadora sobre a sua influência para o grau de inovação da empresa incubada. Quanto ao primeiro objetivo específico que trata da caracterização do perfil das empresas de base tecnológica residentes da incubadora InSite, obtiveram-se os seguintes resultados: são todas micro empresas (SEBRAE), a maior parte dos funcionários é constituída por homens, com nível superior e de média idade. Quanto aos clientes dessas empresas, a maior parte consiste em empresas privadas, de médio e grande porte. Quanto ao segundo objetivo específico que trata de uma análise do impacto socioeconômico da incubadora para a região, alcançaram-se os seguintes resultados: a incubadora impacta socioeconomicamente na região através da criação e o desenvolvimento de novas empresas de alto valor agregado, além do apoio ao desenvolvimento local e regional por meio da geração de emprego e renda. O terceiro objetivo específico trata de uma análise dos critérios de seleção e avaliação das empresas instaladas, alcançaram-se os seguintes resultados: os critérios de seleção da incubadora InSite são baseados em três fatores: potencial de mercado, capacidade de realização do empreendedor e escalabilidade. A avaliação das empresas instaladas se dá por meio de workshops de modelagem de negócios, realizados periodicamente."
}