{
    "Autor": "Ramon de Brittos Souza",
    "Título": "DESENVOLVIMENTO DE UM PROTÓTIPO DE FERRAMENTA PARA CRIAÇÃO DE VISUALIZAÇÕES DE PROTOCOLOS DE REDE",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Fabrício Herpich, Dr.",
    "Coorientador(a)": "Prof. Gerson Luiz Camillo, M.e",
    "Resumo": "O objetivo é tornar mais fácil o aprendizado dos protocolos, que são complexos e podem ser tediosos de estudar de forma passiva. A falta de interatividade no ensino dos protocolos é um problema a ser abordado, e a tecnologia pode ser uma solução para isso. A ferramenta desenvolvida será flexível e extensível, permitindo a criação de fluxos de comunicação por meio de uma linguagem específica. Serão utilizadas tecnologias web, como HTML, CSS e Javascript, devido a sua acessibilidade e evolução recente. O objetivo geral é desenvolver um protótipo de ferramenta para criação de visualizações de protocolos de rede em um navegador web. Os objetivos específicos incluem a criação do protótipo de sistema para web, a criação de um interpretador de expressões para fornecer interatividade às visualizações e a criação de visualizações que demonstrem os fluxos de conexão nos protocolos TLS 1.2 e TLS 1.3.",
    "Palavras-chave": [
        "protocolos de rede",
        "TLS",
        "visualizações",
        "interatividade",
        "tecnologias web"
    ],
    "Introdução": "A comunicação entre dispositivos, como, por exemplo, na internet, depende de protocolos. Os protocolos em redes de computadores definem o formato e a ordem das mensagens que são trocadas (KUROSE; ROSS, 2021). O presente trabalho propõe-se a criar um sistema para a visualização de protocolos com o objetivo de tornar mais fácil o aprendizado dos mesmos. Como existem muitos protocolos em redes, foi necessária uma escolha o alvo de estudo e validação para a ferramenta a ser desenvolvida foi o Transport Layer Security (TLS). A escolha foi motivada tanto pela sua importância e utilização, quanto pela sua complexidade. O TLS é um protocolo de segurança utilizado para estabelecer conexões seguras entre clientes e servidores na web. O TLS fornece autenticação e integridade dos dados, e utiliza certificados digitais para verificar a identidade dos servidores e garantir que os dados não tenham sido alterados durante a transmissão. Isso impede ataques de \"man-in-the-middle\", em que um terceiro intercepta a comunicação e tenta se passar por um dos participantes legítimos. Com o TLS, os usuários podem ter confiança de que estão se comunicando com o servidor correto e que os dados não foram modificados durante a transmissão.",
    "Conclusão": "Neste projeto, foi desenvolvida uma ferramenta para auxiliar o ensino de protocolos de redes, visando abordagens mais interativas e práticas para aprimorar a compreensão desses conceitos. Através do protótipo criado, tornou-se possível gerenciar visualizações, proporcionando uma experiência de ensino mais dinâmica. Um dos aspectos-chave desse trabalho foi a criação de um interpretador de expressões, que ampliou a flexibilidade na criação das visualizações. Essa abordagem permitiu uma personalização mais abrangente às especificidades dos protocolos. No experimento conduzido, os protocolos de segurança TLS 1.2 e TLS 1.3 foram explorados como caso de estudo, dada sua relevância para uma internet mais segura e a complexidade inerente. Com base nos resultados e nas contribuições deste estudo, acredita-se que haverá avanços significativos no desenvolvimento de ferramentas que auxiliem o ensino de redes. Vale ressaltar que o protótipo desenvolvido não se restringe apenas aos protocolos de redes de computadores, podendo ser aplicado em diferentes áreas, permitindo a criação de visualizações interativas em diversos contextos de ensino. Em resumo, este trabalho enfatizou a importância de ensinar protocolos de rede e a necessidade de abordagens mais interativas e personalizadas nesse campo. A ferramenta desenvolvida demonstrou ser capaz na criação e execução de visualizações, proporcionando uma experiência de ensino mais atrativa. Espera-se que as contribuições deste estudo incentivem a contínua melhoria no ensino de redes e inspirem novos avanços no campo das tecnologias educacionais."
}