{
    "Autor": "Rangel Machado Simon",
    "Título": "Redes sociais virtuais e novas formas de aprendizado: um estudo de caso no curso de Tecnologia da Informação e da Comunicação (TIC) da UFSC.",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Marcio Vieira de Souza",
    "Coorientador(a)": "",
    "Resumo": "Objetiva-se explorar as relações contemporâneas entre mídia e educação, com o foco específico nas redes sociais virtuais. Para tanto, adota-se como metodologia a pesquisa bibliográfica, documental, descritiva e aplicada, a fim de buscar, sob uma perspectiva interdisciplinar, as principais características deste espaço de ensino-aprendizagem. Assim, no presente trabalho, são apresentados os elementos constituintes do atual contexto socioeconômico e tecnológico, um breve histórico das redes, bem como sua relação com a educação. Em seguida, apresenta-se um cenário evolutivo por meio dos ambientes virtuais de aprendizagem e das redes sociais virtuais, o surgimento dos massive open online course (MOOC), destacando-se, ainda, sua influência na construção do conhecimento na atual sociedade. Como resultado, busca-se contribuir na discussão e no avanço da ciência, apontando, também, alguns elementos do contexto supracitado (tidos como relevantes para o campo da educação à distância), assim como colaborar no processo de construção do conceito de educação em rede. Por fim, relata-se um estudo de caso do Laboratório de Mídia e Conhecimento (Labmídia) da UFSC e suas experiências com Ambientes Virtuais de Aprendizagem e educação em rede.",
    "Palavras-chave": "Conhecimento. Educação. Mídia. Redes Sociais Virtuais.",
    "Introdução": "O surgimento das mídias digitais e o avanço das tecnologias da informação e comunicação como dispositivos móveis multifuncionais, bem como a produção de softwares livres e a consolidação de movimentos como o Creative Commons - que, segundo Lemos (2013), objetiva flexibilizar o uso de direitos autorais, de acordo com a vontade do criador intelectual, permitindo-se a livre circulação da obra, salvo para fins comerciais-, foram decisivos para o crescimento de conteúdos públicos e colaborativos na rede web. A virtualização atinge mesmo as modalidades do \"estar junto\", a constituição do \"nós\": comunidades virtuais, empresas virtuais, democracia virtual (LEVY, 1996). Cada dia que passa, a imersão nos meios tecnológicos é maior e a quantidade de informação recebida cresce exponencialmente conforme se aprofundou neste domínio. Segundo Paulo Freire (1987), este aspecto é favorável para a construção do conhecimento, já que a concepção do mesmo ocorre por meio de relacionamentos e da interação entre os atores envolvidos no ambiente, destacando também, o autor, que “ninguém educa ninguém, ninguém educa a si mesmo, somos educados e através de nosso compartilhamento e mediatiados pelo que nos rodeia. Neste ponto, é visto a relação que os meios sociais, no contexto das tecnologias da informação e da comunicação, acarretam na sociedade, sendo diretamente relacionada a produção de conhecimento fora das paredes de escolas e universidades. Sendo o ato de aprender considerado um fenômeno social (VYGOTSKY, 1991), convém lembrar que o ser humano é um ser sociáveis desde seu surgimento, conforme já definiu Wallon (1995). Sendo assim, o ato de compartilhar o conhecimento faz parte da essência da sociedade humana. Dessa forma, é sabido que as interações sociais praticadas geram uma rede, a qual, atualmente, pode ser digitalizada. Entretanto, a noção de rede, aqui estudada, deve ser observada como restrita ao conceito de redes sociais de relacionamento da Internet, como Facebook e Twitter. Vale lembrar que estes canais são meios que facilitam a comunicação, a organização e até a criação das redes de movimentos sociais. Nesta perspectiva, as novas mídias se tornam um canal eficiente de ensino e aprendizado, sendo que uma de suas características fundamentais é a troca de experiência entre usuários das redes de aprendizagem ou mesmo de redes não voltadas especificamente para isto. Freire (1987) propôs a educação libertadora, na qual o processo de ensino-aprendizagem não é imposto, mas desenvolvido por meio de diálogo e de troca de experiências entre os agentes envolvidos no processo educativo. Por conseguinte, é notório que, com o avanço dos anos, a internet tem se configurado como importante disseminadora da Educação à Distância (EaD), uma vez que, segundo Porcher (1974), este conjunto de circuitos, informações, conhecimentos, formações culturais que chegam aos alunos, bem como aos demais pessoas fora da escola, é o que caracteriza escolas paralelas.",
    "Conclusão": "O papel da informática e das técnicas de comunicação com base digital não seria “substituir o homem”, nem aproximar-se de uma hipotética inteligência artificial, mas promover a construção de coletivos inteligentes, nos quais as potencialidades sociais e cognitivas de cada um poderão desenvolver-se e ampliar-se de maneira recíproca (LÉVY, 2013, p. 25). Mattar (2013) afirma que se vive um desafio na educação: como incorporar e combinar diferentes tipos de ferramentas propiciadas pelas TICs, repensando como professores devem agir e interagir com essas tecnologias e este novo ciberespaço? Nota-se que, com o avanço das TICs, a sociedade cada vez mais se organiza em ambientes virtuais, o ciberespaço também ganha mais importância dentro da sociedade, explorando-se e se aperfeiçoando ainda mais suas funções e até mesmo criando novas. À vista de eventos presentes, onde a sociedade em diferentes lugares do mundo se organizou através de redes sociais virtuais para protestos e marchas com diferentes cunhos políticos, percebeu-se que os usuários deste ambientes praticam atos não apenas em cunho virtual. O conhecimento gerado pelo nível de compartilhamento, criação e discussão de ideias é potencializado no ciberespaço e a virtualização deste conhecimento é cada vez mais presente em todas as áreas da sociedade. Não estando fora desse vínculo de digitalização, a educação cada vez mais passa por um processo de virtualização do conhecimento, tendo a EaD como forte tendência em todos os lugares do mundo. Castells (2007) fala que esta tendência se deve a um processo natural e, com as TICs, ganha um maior poder de penetração nas redes da sociedade. Nosso estudo sobre as estruturas sociais emergentes nos domínios da atividade e experiência humana leva a uma conclusão abrangente: como tendência histórica, as funções e os processos dominantes na era da informação estão cada vez mais organizados em torno de redes. Redes constituem a nova morfologia social de nossas sociedades e a difusão da lógica de redes modifica de forma substancial a operação e os resultados dos processos produtivos e de experiência, poder e cultura. Embora a forma de organização em redes tenha existido em outros tempos e espaços, o novo paradigma da tecnologia da informação fornece a base material para sua expansão, penetrante em toda estrutura social (CASTELLS, 2007, p. 565). Como vimos, a rede funciona através do compartilhamento de saberes e é formada não por softwares, mas sim por pessoas, e é aí que pode acontecer a educação, na troca de informação e conhecimentos, seja por meio físico ou virtualizado. As TICs fazem com que estas redes ganhem proporções cada vez maiores, facilitando este processo de troca, seja por softwares de redes sociais ou outro meios vinculados ao ciberespaço. Mesmo que a forma de se passar o conhecimento tenha diferentes tipos de linguagens, como já visto, sua essência de transmissão persiste da mesma forma. Seja em ambientes fechados ou abertos, vídeo-aulas focadas em público-alvo ou MOOCs, não há como negar que se vive um momento onde a educação está inserida no contexto da web 2.0. E é nesse contexto que ela deve ser pensada e disseminada, pois é preciso se ter claro que a maneira de se passar um conhecimento presencialmente ainda é diferente de se passar virtualmente, mesmo que se utilize de ferramentas para facilitar essa transmissão, como vídeos, áudios e textos colaborativos, como os usados neste estudo. Este trabalho pode demonstrar que a união de diferentes tipos de mídias, vinculando diferentes tipos de inteligências, é benéfica quando se trata de auxiliar o estudante no aprendizado. Como visto, os estudantes puderam, além de acessar o benefício possibilitado pelas mencionadas TICs, interagir com diferentes tipos de mídias com conteúdos passados de diferentes maneiras, tentando se demonstrar, dessa forma, que todas as mídias relatadas são capazes de transmitir o conteúdo, se forem pensadas para tal caso. É importante ressaltar que na pesquisa realizada, como visto no capítulo anterior, todas as mídias mostraram-se relevantes aos usuários podendo se tirar dessa análise que cada indivíduo possui características que melhor se adaptam com determinada mídia, sendo importante se avaliar, e melhor pesquisar, como as mídias devem ser expostas em aulas de EaD, por exemplo. Durante o estudo de caso realizado, observou-se que é necessário se pensar na forma de construir aulas para o Ensino à Distância, como foi visto nas respostas apresentadas pelos entrevistados. Nesse caso, foi constatado que não se deve deixar de lado formas mais antigas de transmissão de conhecimento, como o texto, que teve uma boa aceitação geral dos entrevistados, sendo interessante pensar como as multimídias agem, ao se tratar as diferentes inteligências. Hoje, a infinidade de recursos das TICs propiciam subsídios a se pensar em melhores propostas para os ambientes virtuais. A exemplo disso, modelos que apenas transmitem informação têm sido substituídos por modelos onde o conhecimento possui mais de um canal, sendo mais dinâmico a todos os envolvidos. Modelos presenciais, que são apenas gravadas e distribuídas, podem ser repensadas, envolvendo melhor o público alvo e criando mais dinâmica ao curso, podendo este ser um bom estudo a ser realizado por laboratórios, mostrando a diferença entre modelos de interação e modelos estáticos de transmissão de conteúdo, pois mesmo esses modelos ainda um pouco mais conservadores já tentam agregar funções das mídias, deixando, por exemplo, os alunos fazerem perguntas via redes sociais como Twitter e Facebook, respondidas pelo professor ao final da aula, por exemplo."
}