{
    "Autor": "Renan Plínio Linhares",
    "Título": "UMA PROPOSTA DE JOGO VOLTADO A REABILITAÇÃO TERAPÊUTICA",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": null,
    "Resumo": "Atualmente, a tecnologia vem proporcionando importante ferramental para lidar com problemas relacionados à saúde. Entre estes problemas encontram-se os pacientes que sofreram algum tipo de lesão e que tenham que passar por um processo de reabilitação e/ou condicionamento físico. Graças a algumas tecnologias, como os sensores de movimento, é possível tratar tais problemas através da interação do paciente com o computador por meio de jogos eletrônicos. Uma das vantagens dos jogos eletrônicos é a sua capacidade de entreter o usuário, o que pode ser utilizado para fazer com que o paciente de determinado processo de reabilitação não se sinta desmotivado e desista. Baseado nessa ideia, o presente trabalho propõe um jogo ao nível de protótipo com características que podem auxiliar no processo de reabilitação e/ou condicionamento físico. O jogo foi desenvolvido para interagir através do sensor Kinect® da Microsoft® e possui 5 (cinco) fases que aumentam de complexidade a medida que o jogo evolui. Cada fase é composta por um conjunto de objetos numerados sequencialmente e distribuídos aleatoriamente na tela. Para a avaliação do jogo foi solicitada a participação de um conjunto de usuários sem problemas motores ou cognitivos visando obter insumos para uma análise. Os resultados, ainda que iniciais, permitem afirmar que a quantidade de erros e o tempo de execução de cada fase estão atrelados a atenção dispensada durante cada sessão. Por fim, foi possível verificar que o jogo é útil e tem potencial para ser aplicado em pacientes com problemas cognito-motores. Neste sentido, a evolução deste trabalho pode propiciar informações detalhadas que conduzam a avaliações clínicas mais precisas.",
    "Palavras-chave": [
        "reabilitação",
        "jogos sérios",
        "jogos eletrônicos"
    ],
    "Introdução": "No mundo atual, não são difíceis as ocorrências de lesões causadas por uma série de motivos, tais como esforços repetitivos, acidentes e problemas vasculares. Isto conduz à uma série de problemas locomotores e psicológicos afetando a saúde do ser humano. A saúde, segundo Wattasoontorn (2013), é uma das questões que mais afetam as pessoas no mundo inteiro, desde crianças até idosos. A saúde é uma necessidade básica da população mundial e deve ser tratada com prioridade por todos. De acordo com a Organização Mundial da Saúde (OMS, 2013) (do inglês World Health Organization), pode se definir saúde como “o completo estado de bem-estar físico, mental e social, e não simplesmente a ausência de enfermidade”, ou seja, ela é entendida como a composição de vários fatores, visando atingir um estado de bem-estar completo. Preconiza assim que saúde não é somente o bem-estar do corpo físico, e sim, um conjunto de fatores aliados, tanto mentais quanto físicos. Dentre os fatores estabelecidos pela OMS para se ter um estado saudável, encontra-se o bem-estar físico. Este engloba a necessidade de um corpo saudável e sem injúrias, sendo que muitas vezes, é necessário que haja um processo de readaptação locomotora, chamado de processo de reabilitação, para que seja alcançada a recuperação do corpo. Este processo é trabalhado pelos profissionais da Fisioterapia. O Conselho Federal de Fisioterapia (COFFITO, 2013), define Fisioterapia como uma ciência da saúde que estuda, previne e trata os distúrbios cinéticos funcionais intercorren tes em órgãos e sistemas do corpo humano, gerados por traumas, alterações genéticas e por doenças adquiridas. Segundo Oliveira (2013), a Fisioterapia em geral, preconiza um atendimento individualizado, gradativo e extenso voltado a reabilitação e/ou condicionamento físico. Sendo que para realizar os tratamentos é necessário que haja o acompanhamento do profissional (SAPOSNIK et al., 2012). A reabilitação é conhecida como especialidade médica há cerca de 60 anos, sendo a mesma impulsionada pela segunda Guerra Mundial, devido ao grande número de jovens que precisavam de cuidados devido às mutilações sofridas pelos ataques (AMORIM, 2010). A reabilitação enquanto especialidade da área da Saúde, visa desenvolver o potencial locomotor e prover uma reintegração social ao indivíduo lesionado. Infelizmente, devido à grande repetitividade de exercícios aliado ao grande período de submissão ao tratamento, acaba-se por promover a desistência de pacientes, devido principalmente a falta de motivação e aborrecimento causado pela repetição procedimental (MENDONÇA & GUERRA, 2004). Conforme Mejia-Downs et al. (2011), a recomendação para adultos é de um mínimo de 150 minutos de exercícios físicos por semana, redefinida para cada situação. Estes fatores promovem desafios para a área da Saúde, mas também geram oportunidades na elaboração e desenvolvimento de meios alternativos e/ou complementares aos comumente aplicados. Neste sentido, problemas cardíacos, respiratórios e principalmente locomotores podem se utilizar da tecnologia de jogos como forma de tratamento envolvendo a reabilitação e o condicionamento físico para pessoas com problemas nas funções motoras ou cognitivo-motoras. Segundo Huizinga (1995), um jogo é um desafio físico ou mental, com um objetivo, jogado através de uma série de regras impostas por quem desenvolveu o mesmo. Deste modo, estabelece o que o jogador pode ou não pode fazer dentro do jogo. Frequentemente, os jogos eletrônicos possuem uma má qualificação perante a sociedade. Normalmente é compreendido que os jogos eletrônicos são uma forma que causa vício e não traz benefício algum à quem o está jogando. Segundo Sawyer (2008), o pensamento convencional alega que os jogos eletrônicos não oferecem benefício algum para a educação, são uma perda de tempo e prejudicam a saúde. Janarthanan (2012) afirma que todo o jogo disponibilizado possui algum objetivo. Entre eles estão os de entreter, produzir, ensinar, motivar, socializar, comunicar ou educar diferentes culturas. O jogador (também chamado de gamer) é exposto a diferentes tipos de jogos que podem ser caracterizados como: jogos casuais, jogos sérios e advergames (jogos de advertência). Em geral jogos voltados a algum tipo de aprendizado são caracterizados como Jogos Sérios (Serious Games). Apesar de não haver uma definição correta para o termo, é entendido que os jogos sérios são utilizados para promover algo além do mero entretenimento, podendo ser aplicado nas mais diversas áreas (WATTANASOONTORN et al., 2013). Os jogos sérios são usados para uma série de áreas. Entre essas áreas estão a educação, pesquisa científica, treinamento militar e saúde. Jogos sérios para a saúde (Serious Games for Health) são jogos com foco no cuidado do tratamento da saúde e na preservação do corpo e da mente do ser humano (FUCHSLOCHER; NIESENHAUS; KRÄMER, 2011). Como exemplo de Jogos Sérios de destaque estão o SimCity, o Civilization e o Hidden Agenda (JANARTHANAN, 2012). De acordo com Janarthanan (2012), os jogos sérios são usados basicamente para garantir uma saúde melhor e um bom ambiente educacional. Eles também são uma ferramenta para auxiliar nas áreas já citadas anteriormente. Em uma ideia genérica, os jogos sérios são utilizados essencialmente para algum tipo de aprendizagem. Diferentemente dos video games tradicionais, em que o controle ocorre através de botões, os video games voltados para a saúde requerem uma série de exercícios que se deve realizar para completar o objetivo do jogo (SMITH, 2009). Estes exercícios são tanto mentais quanto físicos, dependendo da condição física do paciente. Atualmente, os desenvolvedores de jogos sérios vem atuando intensamente. Segundo Janarthanan (2012), a mesma cresce constantemente e representa uma oportunidade nova e significante para os desenvolvedores de jogos e as empresas provedoras de tecnologias interativas. Lange et al. (2010) alegam que o uso de jogos interativos como uma ferramenta terapêutica, tanto para a realização de tratamentos mentais, quanto para tratamentos físicos vem crescendo na área da saúde, sendo que a mesma ainda é muito carente na questão da quantidade e qualidade de jogos. O uso de jogos para tratamentos de saúde é uma ótima alternativa para a área, uma vez que, conforme Laver et al. (2011), os jogos são acessíveis e confortáveis, podendo ser usados em uma grande quantidade de ambientes, como em casas, em clínicas e até mesmo em escritórios. Além do mais, eles provêem uma integração social entre pessoas de gerações diferentes, uma vez que os jogos têm a capacidade de atrair pessoas das mais variadas faixas etárias. Corrêa (2008) afirma que os jogos trazem uma nova estruturação do mundo do entretenimento, da informação e da educação. Eles envolvem, seduzem e divertem, produzindo uma nova forma comunicacional, onde a atenção tanto de adultos, quanto a de jovens, pode ser mais facilmente conseguida. Conforme afirma Smith et al. (2009), com a utilização de jogos para o processo de reabilitação física é possível que médicos acompanhem o tratamento do paciente a distância. Uma grande vantagem de jogos voltados a reabilitação é a utilização da realidade virtual e da realidade aumentada como formas de interação do jogo com o paciente. O termo Realidade Virtual (RV) é bem descrito por Montero & Zanchet (2003), onde define a mesma como uma maneira de “definir os mundos virtuais desenvolvidos com o uso de alta tecnologia para convencer o usuário que ele se encontra em outra realidade”. Sendo assim, pode-se dizer que é uma interface humano-computador, onde ocorre a simulação de um ambiente real, utilizando imagens virtuais para o mesmo. Segundo Machado et al. (2011), a RV consiste em três conceitos fundamentais: interação, imersão e envolvimento. A interação se baseia em uma forma de permitir com que o jogador possa sentir-se parte do ambiente. Para isso, podem ser utilizados aparelhos de captura de movimentos para uma interação natural. A imersão consiste em fazer com que o usuário se sinta presente no ambiente tridimensional. O envolvimento consiste em fazer com que o paciente tenha motivação para completar determinada atividade estabelecida. Por outro lado, a Realidade Aumentada (RA) trabalha com o uso de objetos virtuais envolvidos no meio real, ou seja, trabalha com ambientes virtuais e reais, permitindo uma mistura do ambiente para o jogo, fazendo o jogador se sentir mais confortável e identificado (BARTOLOMÉ; ZORRILLA; ZAPIRAIN, 2011). Atualmente, existe a possibilidade de se utilizar várias ferramentas e dispositivos, já disponibilizados no mercado, para a utilização de jogos em processos de reabilitação. Entre essas ferramentas estão o Joystick do Nintendo® Wii, o sensor Kinect® do Microsoft® Xbox 360®, o Xbox One®, o Windows OS®, o Sony EyeToy® para Playstation 3® e Playstation 4®, entre outros. O Kinect® é um aparelho capaz de detectar o movimento de diversas partes do corpo humano. Com ele, é possível que os movimentos detectados para um jogo possam ser utilizados em prol da reabilitação do paciente, além de motivar o paciente para a não desistência do tratamento. Para o desenvolvimento deste trabalho se utilizou o Kinect®. O mesmo será melhor descrito no Capítulo 3.",
    "Conclusão": "O objetivo geral desse trabalho consistiu na proposição de um jogo com foco na reabilitação terapêutica com possibilidade de aplicação na reabilitação e/ou no condicionamento físico. Visando cumprir o objetivo geral inicialmente foi realizada uma pesquisa bibliográfica apresentando uma revisão inicial sobre jogos eletrônicos, considerando o contexto histórico e as tecnologias mais atuais. Também foi discutida a finalidade dos jogos eletrônicos ressaltando que além do entretenimento o mesmo vem sendo aplicado em diversas áreas. A partir desse cenário foi apresentado o conceito de Serious Game, ou seja, a utilização da tecnologia de jogos buscando benefícios além do entretenimento. Áreas como educação, treinamento e saúde vêm se utilizando deste conceito. Após a revisão iniciou-se o desenvolvimento do protótipo de jogo utilizando a tecnologia de captura de movimentos através do sensor Kinect® da Microsoft®. Composto por 5 fases possui uma jogabilidade simples, em que o usuário precisa selecionar com o movimento dos membros superiores determinados objetos numerados sequencialmente, mas dispersos na tela de maneira aleatória. O conjunto de fases caracteriza uma sessão em que é computada a quantidade de objetos selecionados de maneira correta ou incorreta. Para promover suporte ao jogo proposto foi desenvolvido um modelo de dados capaz de armazenar as informações provenientes das interações do jogador com o jogo. Entre essas informações constam a data de cada sessão, a quantidade de acertos e erros, bem como, a hora de início e de fim de determinada sessão. De modo a avaliar o protótipo de jogos o mesmo foi aplicado em um estudo de caso. Para o estudo foram convidados 5 (cinco) pessoas com idade entre 21 e 40 anos que não realizam atividade física frequente. Cada usuário participou de 5 (cinco) sessões em dias alternados. As informações na base de dados permitiram análises iniciais do comportamento dos usuários perante o jogo. Ainda que os usuários não apresentem problemas relacionados a alguma disfunção motora e/ou cognitiva grave, o estudo inicial permitiu avaliar o protótipo e verificar a sua consistência e potencial. Entre os resultados é possível observar dois pontos principais. O primeiro se refere ao aumento da quantidade de erros à medida que as fases evoluem. Essa tendência somente não é observada na última fase devido a disposição dos objetos, que tem a sua seleção facilitada a partir de determinados objetos. O outro ponto importante a ser mencionado diz respeito ao tempo que, assim como a quantidade de erros, possui uma tendência de incremento à medida que se avança nas fases. Entretanto, nota-se que 2 (dois) usuários tiveram mais dificuldades em algumas fases. Durante as entrevistas constatou-se que a modificação do posicionamento do objeto de referência (identificado pelo número 1) entre as fases promove certa dificuldade momentânea de localização, impactando assim no tempo da fase. De maneira geral, o desenvolvimento e aplicação do jogo em um grupo de estudo permitiu concluir que os objetivos foram atingidos e que a utilização desta ferramenta pode conduzir à utilização da mesma em diversas áreas, com destaque, para as áreas da saúde, educação e treinamento. Durante o desenvolvimento do projeto outras possibilidades foram vislumbradas tanto de novos jogos quanto da tecnologia a ser empregada. No que se refere aos jogos identificou-se áreas com potencial de aplicabilidade, por exemplo, na avaliação do desempenho da dupla tarefa cognitivo-motora, ou seja, tarefas que envolvam mais de uma tarefa ao mesmo tempo, por exemplo, falar ao telefone enquanto caminha. Pessoas com Doença de Parkinson apresentam dificuldade na realização de atividades que envolvam a função cognitiva e a motora ao mesmo tempo. No que se refere a avaliação e diagnóstico do grau de comprometimento da capacidade de execução de tais atividades existem testes padronizados, tais como, o Trail Making Test (TMT), consistindo em traçar retas em uma folha de papel com caneta ou lápis, conectando uma sequência de números ou de números e letras alternados. Sendo assim, a tecnologia de sensor de movimento pode substituir o uso do papel e de caneta/lápis por comandos executados a partir do(s) movimento(s) da(s) mão(s). Num contexto mais amplo, a aplicação de jogos desta natureza e o consequente armazenamento dos parâmetros e sinais observados durante as sessões podem conduzir a estudos clínicos mais precisos. Considerando a tecnologia, novos dispositivos têm surgido, por exemplo, o LeapMotion® e o Myo®. Por meio do LeapMotion® é possível capturar o movimento das mãos e dos dedos durante a interação com o computador. O outro produto chamado Myo®, da empresa Canadense ThalmicLabs®. Este dispositivo disponibiliza a tecnologia EMG (electromyography) capaz de detectar a ativação muscular de braços e pernas em tempo real e enviar as informações coletadas para determinado computador. Estes produtos possuem baixo custo e representarão um elemento importante em aplicações computacionais que procuram explorar interfaces interativas levando em consideração o movimento e a atividade muscular nas mais variadas áreas do conhecimento."
}