{
    "Autor": [
        "CARLYLE TORRES B. DE MENEZES FILHO",
        "JOSÉ DE LIMA DE SOUZA"
    ],
    "Título": "REGISTRO GERAL DE ANIMAIS (RGA): UM SISTEMA PARA O REGISTRO E IDENTIFICAÇÃO DE ANIMAIS DE COMPANHIA",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Vinicius Faria Culmant Ramos",
    "Coorientador(a)": null,
    "Resumo": "Diversos municípios brasileiros enfrentam problemas relacionados à falta de políticas de controle das populações de animais de companhia dentre eles o abandono, a superpopulação de animais não domiciliados, os maus tratos e a transmissão de zoonoses. As consequências deste quadro, nos âmbitos ambientais e de saúde pública, levam a necessidade da identificação e registro dos animais de companhia em vista da elaboração e aplicações de ações de controle populacional, educação para guarda responsável e atribuição de responsabilidades no tocante ao direito da posse de animais de companhia. Este trabalho tem como objetivo o desenvolvimento de uma ferramenta para o registro e identificação da população de cães, extensível a população de gatos, utilizando tecnologias voltadas ao desenvolvimento web, tais como os frameworks JHipster, Spring, Angular e Bootstrap, para criar uma base de dados que possibilite aos gestores locais armazenarem informações sobre a população local de animais de companhia e através delas traçarem estratégias de controle populacional e controle de zoonoses, vinculando cada animal a um responsável e armazenando dados relativos a capacidade reprodutiva e histórico de vacinas.",
    "Palavras-chave": [
        "Sistema de Registro e Identificação",
        "Animais de Companhia",
        "Zoonoses",
        "Guarda responsável",
        "Bem-estar animal"
    ],
    "Introdução": "A domesticação de animais remonta há cerca de dez mil anos, durante o período neolítico, quando o homem substituiu o nomadismo pelo estabelecimento de aldeias e a prática da agricultura. Os lobos estão entre os primeiros animais a serem domesticados, tendo estabelecido relações de tolerância e benefício mútuos com os habitantes dos assentamentos. Os descendentes destes animais, os cães, vêm acompanhando os homens deste então, e suas atividades variam de cães de companhia a cães treinados para realizar tarefas específicas, como cães-guia no auxílio de deficientes visuais, e cães empregados nas forças militares. Uma variedade de aspectos culturais modifica a influência dos cães no ambiente onde estão inseridos e na saúde humana, bem como as responsabilidades relacionadas à posse de animais de companhia apresentam diversos níveis de tolerância de acordo com o contexto social local. Algumas culturas, sobretudo em países industrializados, desenvolveram políticas para minimizar os impactos indesejáveis que os animais domésticos podem causar a uma comunidade, dentre eles danos a propriedades de terceiros, desequilíbrio populacional da fauna local, superpopulação de cães não domiciliados e a transmissão de doenças, dentre elas a raiva. Diversas ações são empregadas, de acordo com as necessidades locais, para atenuar os aspectos negativos que uma população não monitorada de animais de companhia pode causar. Dentre elas estão campanhas educativas para conscientização sobre a guarda responsável, subsidio de esterilização e vacinação e programas de adoção. Para que estas ações tenham sucesso é indispensável à adoção de um mecanismo para a identificação de cada animal individualmente. Desta forma é possível armazenar e recuperar informações relativas ao histórico de vacinação, capacidade reprodutiva, endereço e demais dados pessoais do responsável, dentre outros que identifiquem o animal, como nome, idade, sexo e capacidade reprodutiva. Com o vínculo do animal a um responsável, é possível atribuir ao cidadão um registro oficial de posse ou guarda, o que lhe confere direitos e deveres relativos aos cuidados com o animal. Desta forma, espera que ao se adquirir um animal de companhia, o guardião se comprometa em atender as necessidades físicas, psicológicas e ambientais de seu animal, assim como prevenir os riscos que seu animal possa causar à comunidade ou ao ambiente. Além de causar sérios transtornos ambientais, a superpopulação de cães não supervisionados propicia a proliferação de zoonoses, doenças transmitidas dos animais para os seres humanos. Segundo a OMS, mais de cem doenças zoonóticas são transmitidas dos cães para os homens. Dentre elas estão doença de Chagas, leishmaniose e raiva. (OMS, 1990) No Brasil, segundo o Ministério da Saúde, entre 1990 e 2016 foram registrados 408 casos de raiva humana tendo como espécie agressora cães e gatos. (BRASIL, 2014). Um outro fator desencadeado pela falta de ações que reforcem as políticas de manejo de animais de companhia orientada sob os princípios da guarda responsável é a compra impulsiva de animais. Para Santana, a aquisição de animais, estimulada por comerciantes que os expõem como mercadorias, muitas vezes, não desperta o vínculo afetivo que deve nortear a relação entre homem e animal, por terem sido originadas pelo impulso do consumismo, fazendo com que as pessoas acabem descartando seus animais de estimação, por se tornarem desinteressantes após a empolgação inicial (SANTANA et al., 2004). O abandono destes animais adquiridos de forma impulsiva resulta em sérios problemas ambientais, uma vez que a taxa de reprodução de cães é exponencial, pois eles se tornam sexualmente maduros aos dez meses de idade, e uma fêmea adulta pode gerar a partir de quatro filhotes por ano, proporcionando as condições para a população triplicar a cada ano. (OMS, 1990) Para Moutinho, na maior parte dos municípios brasileiros há superpopulação de cães não domiciliados, os quais trazem problemas associados à ordem urbana, ao meio ambiente e à saúde coletiva, além de sofrerem maus-tratos. Nesse contexto, vislumbra-se a necessidade do desenvolvimento de ações de controle populacional desses animais. (MOUTINHO, 2015). Com a intenção de servir como suporte às ações de controle populacional de animais de companhia, este trabalho se propõe em apresentar uma ferramenta para o registro e a identificação da população animal local, dos proprietários e do histórico de vacinas de cada animal. Para esta tarefa, foram utilizadas tecnologias voltadas ao desenvolvimento web, tais como os frameworks JHipster, Spring, Angular e Bootstrap, que propiciam uma rápida curva de implementação, maior controle e organização do projeto, padronização do código, e maior facilidade de manutenção devida a sua estrutura desacoplada. O intuito da criação de uma aplicação web foi possibilitar uma maior disponibilidade de acesso, através da internet. Graças ao seu design responsivo, é possível o acesso em dispositivos com diferentes resoluções de tela. Também proporciona um menor consumo de recursos de hardware, por ter uma infraestrutura centralizada e escalável. Este modelo de aplicação nos concede também uma maior flexibilidade no gerenciamento de usuários.",
    "Conclusão": "O presente trabalho obteve êxito em implementar os requisitos levantados para usabilidade do sistema, permitindo o registro dos animais, dos proprietários e do histórico de vacinas. Cada animal é vinculado a apenas um proprietário, o que permite atribuir-lhes as responsabilidades previstas para a posse ou guarda de animais de companhia. Foi possível também criar uma base de dados com o histórico de vacinas, onde cada animal pode ser vinculado a múltiplas doses de vacina, proporcionando informações que permitam as equipes de vigilância em saúde identificar animais que possam ser potenciais portadores de doenças zoonóticas. Foram abordados e referenciados os temas pertinentes ao assunto, com ênfase no controle populacional de animais, controle de zoonoses, bem-estar animal e guarda responsável e a legislação brasileira existente, bem como o estudo de casos de programas de registro e identificação de animais em execução no exterior. A utilização das tecnologias voltadas ao desenvolvimento web citadas no referente trabalho, propiciaram uma rápida curva de implementação, maior controle e organização do código e maior facilidade de manutenção. A criação de uma aplicação web possibilitou maior disponibilidade de acesso, através da internet, e graças ao seu design responsivo, a viabilidade e ergonomia em dispositivos móveis. Também proporcionou um menor consumo de recursos de hardware, por ter uma infraestrutura centralizada e escalável. Este sistema buscou se utilizar das tecnologias mais atuais e modernas, mantendo o foco em reusabilidade, ergonomia e acessibilidade, baseado nas deficiências desses elementos e componentes em sistemas existentes e na carência de sistemas desse porte, segundo a pesquisa bibliográfica. Como todo software, este também, neste momento, não pode atender a todas necessidades que serão encontradas em seu período inicial de utilização. Porém, como a construção de software e a metodologia utilizada, nos confere a capacidade de melhoria, poderemos incrementar as funcionalidades necessárias e a adequação às legislações previstas na sua área de localização. Para trabalhos futuros, pretende-se ampliar as funcionalidades existentes, como a implementação de módulo para intermediar a adoção de animais, ferramentas para gerenciamento de informações, como relatórios de dados estatísticos e remodelagem da interface visual."
}