{
    "Autor": "RICARDO NAGEL MACHADO",
    "Título": "PROPOSTA DE SISTEMA BASEADO NA PLATAFORMA KINECT PARA SUPORTE A REABILITAÇÃO DE PACIENTES COM PATOLOGIAS LIGAMENTARES NOS JOELHOS",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Juarez Bento da Silva",
    "Coorientador(a)": "",
    "Resumo": "A popularização e o baixo custo dos dispositivos de interface natural dos videogames atuais têm proporcionado estudos nas mais diversas áreas do conhecimento. Neste contexto, pesquisas com esses dispositivos na área de reabilitação fisioterapêutica são cada vez mais comuns, uma vez que a interação natural, aliada a um ambiente diferenciado, podem ser benéficas à motivação do paciente. Dessa maneira, este trabalho possui como intuito propor uma aplicação para a plataforma de interação natural Microsoft Kinect que possibilite complementar processos de reabilitação de pacientes com patologias ligamentares nos joelhos.",
    "Palavras-chave": "Kinect, fisioterapia, serious game, SDK.",
    "Introdução": "Há cerca de quarenta anos atrás o consumidor de jogos eletrônicos convivia com um hardware simples, dispondo de processamento de apenas 8 bits, alguns kilobytes de memória, além de interfaces e joysticks limitados. Entretanto nas últimas duas décadas é notável o vertiginoso avanço das tecnologias, que aliadas à grande concorrência do setor de videogames propiciam com cada vez mais frequência inovações tecnológicas, tanto gráficas quanto de hardware. Estas ultrapassam as fronteiras estabelecidas do setor de games beneficiando diferentes áreas por meio de atividades de pesquisa e desenvolvimento (P&D - pesquisa e desenvolvimento). Dentre os elementos que mais evoluíram, se destaca a interface para o usuário. Comumente, na realidade atual a interação entre homem e máquina é exercida através de teclado, mouse, touch screen e mais recentemente também por interfaces naturais para o usuário (NUI – Natural User Interface). Conforme Preece, et al. (2005) afirmam, busca-se há anos a minimização máxima das dificuldades de operações que envolvem máquinas e equipamentos eletrônicos. Para que isso seja possível foram desenvolvidas interfaces que buscam aproximar estas operações com as reais atividades praticadas diariamente pelas pessoas, no intuito de facilitar o aprendizado e manuseio de equipamentos. No entanto, ocorreu um longo processo evolutivo para se chegar ao atual cenário em que dispomos de uma gama de interfaces como opção. O processo evolutivo das interfaces para usuários dos videogames se iniciou na década de 70 por meio do Paddle, um botão rotatório que simplesmente movia os gráficos dos primeiros arcades, mais conhecidos como fliperama no Brasil, assim como dos primeiros aparelhos domésticos, que se moviam em sentidos verticais, tais quais as raquetes do jogo Pong (ATARI, 1972), ou em sentido horizontal, como veículos do jogo Night Driver de 1976. (TAVARES, 2011). Conforme o mercado dos videogames se expandiu ao ponto do conceito de arcades se transformar em consoles domésticos e os mesmos disporem de maneiras para receberem jogos além dos presentes na sua memória, exigiu-se a transformação da interface física dos joysticks para que suportassem controlar diversos jogos. Com a evolução dos consoles domésticos, gradativamente foram incorporados cada vez mais botões aos joysticks. O que antes era simples se tornou complexo de manusear. Conforme Tavares (2011) aponta, a exigência de habilidades além da capacidade de muitos jogadores, fez com que muitas pessoas se afastassem dos videogames, o que acarretou na mudança de público, assim concentrando-se mais no mercado para crianças e adolescentes. Desta maneira o mercado tornou-se gradativamente mais propício aos usuários que possuem aparelhos cognitivos mais intactos e dispõem de muito mais tempo para treinar e desenvolver todas as habilidades exigidas para essa prática: técnicas motoras e cognitivas. Apesar do aumento da complexidade dos joysticks no decorrer da história, isso não evitou com que pesquisas e desenvolvimentos de novos meios de interação entre homem e máquina surgissem. A indústria de jogos eletrônicos é uma das grandes responsáveis pela busca de inovações na experiência de interação, destacando-se a empresa nipônica Nintendo. Essa investiu ao longo da sua existência em diversas inovações nas interfaces para os usuários, até consolidar uma das suas invenções, o console Nintendo Wii. Dentre os dispositivos lançados pela Nintendo está a pistola (ZAPPER, 1984), o (POWER GLOVE, 1989) e o (VIRTUAL BOY, 1995). Este último sendo o maior fracasso da Nintendo, visto que era um portátil de realidade virtual com várias limitações que não proporcionava ao usuário uma experiência tridimensional da qual prometia. Além disso, outros fatores críticos causaram o fracasso desse dispositivo, como dores de cabeça nos jogadores e a classificação indicativa do aparelho, pois poderia prejudicar o desenvolvimento ocular de menores de 7 anos. Apresentado em 2005 na Tokio Game Show (CESA, 2005) e posteriormente lançado no mercado no fim de 2006 (NINTENDO WII, 2006), o Nintendo Wii sofreu com as críticas por ter gráficos inferiores aos seus concorrentes Xbox 360 e Playstation 3. No entanto o principal conceito por trás do Wii dizia respeito à interface de controle. Chamado de Wii Remote e apelidado e Wiimote, o joystick do Nintendo Wii é munido de um acelerômetro capaz de medir acelerações em três eixos (x, y e z), além de infravermelho que permite a medição das rotações do controle em relação aos três eixos, conexão Bluetooth para a transmissão das informações para o console e número reduzido de botões simplificando a jogabilidade. Essas características fizeram com que o Nintendo Wii alcançasse outros públicos combinando jogabilidade intuitiva e jogos simplificados, diferente do que usuários experientes são habituados. Visto o grande sucesso que o Nintendo Wii se tornou, levando a Nintendo ao topo na condição de líder do mercado de videogames por alguns anos, lugar o qual não ocupava há mais de 17 anos, aliado ao baixo custo do Wiimote, despertaram o interesse de pesquisadores e desenvolvedores. Desta forma, hoje em uma rápida consulta na internet é possível encontrar diversos estudos científicos e aplicações que utilizam o Wiimote, tais como: (SCALCO ; FREITAS , 2011 ), (DEUTSCH; BORBELY; FILLER, J. et al. 2008), (GONZÁLEZ -FERNÁNDEZ, GIL -GÓMEZ, ALCAÑIZ, et al. 2010). Impulsionada pelo sucesso evidente do novo modelo de interação de jogabilidade proposto pela Nintendo, a Microsoft em 2010 lançou o Microsoft Kinect. Baseado em um projeto intitulado Project Natal, o Kinect é um periférico para o console Xbox360 capaz de capturar movimentos do usuário permitindo assim uma jogabilidade natural por meio de gestos corporais e comandos de voz (KINECT, 2010). O sucesso de um sistema de interação natural depende do quão ele influencia as pessoas a experimentarem isso (VALLI, 2005). Dentro desse contexto o Kinect se destaca, pois alcançou o recorde de vendas em âmbito mundial com uma média de 133.333 unidades por dia nos seus primeiros 60 dias de vendas. (GUINNES WORLD RECORDS, 2011). A popularização do Kinect torna cada vez mais frequentes pesquisas e aplicações baseadas nesse dispositivo. Contudo, estudos utilizando o periférico iniciaram de forma independente por meio de adaptações do dispositivo para empregá-lo junto ao computador, além da elaboração de bibliotecas livres para implementação de aplicações. O interesse da comunidade open source despertou a atenção comercial por parte da Microsoft, a qual posteriormente lançou uma versão denominada Kinect for Windows. Esta versão exclusiva para utilização em computadores dispõe de um SDK (Software Development Kit) oficial desenvolvido pela Microsoft, além do suporte com atualizações do mesmo feito pela empresa norte-americana. Desse modo, visto o interesse da comunidade científica e o suporte por parte da própria criadora do periférico em trazer os desenvolvedores para perto de si de maneira oficial, os estudos têm crescido demasiadamente. Em contrapartida, por se tratar de uma tecnologia recente, lançada em 2010, ainda há muito que ser explorado em estudos de viabilidade de sua utilização, fornecendo assim cada vez mais materiais a respeito desse dispositivo, o qual pode ser uma solução plausível para diversas questões pendentes na sociedade atual.",
    "Conclusão": "O presente trabalho possibilitou através da interdisciplinaridade da proposta, o entendimento aprofundado acerca da tecnologia de interação natural Microsoft Kinect, além do conhecimento sobre métodos fisioterapêuticos para procedimentos de reabilitação motora para patologias ligamentares nos joelhos. A análise referente ao Kinect possibilitou compreender a complexidade por trás desta tecnologia. O que alguns anos atrás somente seria possível por meio de diversos dispositivos atuando em colaboração, além de marcadores distribuídos no corpo, o que pode incomodar pacientes limitando os movimentos, atualmente faz-se apenas com um dispositivo portátil e de baixo custo. No que tange as ferramentas de desenvolvimento para o Kinect, observou-se uma variedade delas, cada qual com sua complexidade, destacando-se o Kinect for Windows SDK e o OpenNI. Estas plataformas para desenvolvimento são semelhantes, no entanto a análise de requisitos desses SDKs, juntamente a averiguação de estudos como de (FERRAZ; YAMASHITA, 2012) possibilitou a entendimento de que o SDK que propicia o maior ganho é o Microsoft Kinect SDK. Esta conclusão foi tomada em virtude de uma diversidade de fatores, tais como: calibração do esqueleto é realizada pelo próprio dispositivo, facilidade na instalação do SDK, ferramenta Kinect Studio que permite gravação do conteúdo, detecção de 20 articulações do corpo, estimativa das posições das articulações mais correta, menor ocorrência de falso-positivos, ou seja, verifica-se a menor incidência de detecções erradas do esqueleto e menos confusões na detecção do esqueleto junto a um objeto. Ex.: paciente sentado em uma cadeira, near mode, que possibilita a detecção de 10 pontos de articulação a partir de 40cm da tela em que o usuário se faz presente, suporte da Microsoft em constantes atualizações do SDK, documentação mais detalhada referente ao SDK, suas funcionalidades e uma diversidade de exemplos de códigos para testes. Apesar de possuir uma variedade de vantagens sobre o OpenNI, o SDK do Kinect possui limitações. Devido aos direitos comerciais pertencerem a empresa norte-americana Microsoft, o desenvolvimento é limitado aos dispositivos com o sistema operacional Windows 7 e 8, já o OpenNI é open source e assim multiplataforma. O levantamento referencial para este trabalho possibilitou o conhecimento de uma gama enorme de estudos utilizando o Kinect nas mais diversas áreas do conhecimento. Dessa maneira, conclui-se que o advento dessa tecnologia tem contribuído em demasia para o avanço de pesquisas relativas à interação natural. Para a fisioterapia, o Kinect representa a oportunidade de adicionar dinamismo e ludicidade, assim aliviando o estresse e a rotina que os processos de reabilitação tradicionais proporcionam. No intuito de viabilizar as características descritas acima, foi visto que alguns estudos mais complexos fazem uso de motores gráficos para criação de jogos mais imersivos, o que é um fator positivo, pois demonstra cada vez mais a importância do Kinect e o interesse por pesquisas na área de interação natural."
}