{
    "Autor": "Sara Rodrigues Baptista Bueno",
    "Título": "Jogos Sérios Aplicados na Aprendizagem de Crianças Portadoras de Deficiências",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Eliane Pozzebon",
    "Coorientador(a)": "",
    "Resumo": "Os jogos evoluíram ao lado do ser humano através dos anos. E, com cada nova tecnologia desenvolvida, os jogos ganharam novos recursos. Passaram de ferramentas auxiliares simples para ferramentas eletrônicas e digitais. Com recursos informáticos surgiram os jogos sérios, que são softwares, ou softwares e hardwares, com as características de um jogo (fundamentalmente interatividade) que tem o intuito de ensinar, instruir ou treinar o jogador acerca de um assunto. Neste estudo foi realizada, documentada e apresentada de forma linear uma pesquisa que tem o intuito de afirmar se os jogos sérios existentes atualmente são satisfatórios para o ensino de crianças portadoras de deficiências. Para tanto foi definido um jogo sério gratuito e bem conceituado, chamado Menino Curioso, para ser aplicado com crianças portadoras de deficiência auditiva, de TDAH, de deficiência intelectual e ainda para crianças sem qualquer deficiência diagnosticada para que seus resultados fossem usados como parâmetro comparativo. As crianças pesquisadas estavam na data da pesquisa matriculadas na Escola de Ensino Básico Castro Alves e as que portavam alguma deficiência participavam do SAEDE, Serviço de Atendimento Educacional Especializado, nesta mesma escola. Durante a pesquisa foi feita coleta de dados por observação direta e ao fim da pesquisa todos os dados foram estudados, comparados e analisados. A partir de tal análise e comparação foi possível afirmar que para deficientes auditivos é necessário apenas uma adaptação simples que confira a cessibilidade nos jogos sérios. Já para os deficientes intelectuais não há necessidade de desenvolvimento de jogos sérios específicos, e sim maior empenho na seleção dos jogos sérios que serão aplicados. E o único grupo que demanda desenvolvimento de jogos específicos é o de portadores de TDAH, que carregam a necessidade de pesquisa específica para parametrizar um jogo ideal ou ao menos jogos mais atrativos para estas crianças.",
    "Palavras-chave": [
        "Jogos Sérios",
        "Ensino",
        "Portadores de Deficiência"
    ],
    "Introdução": "Observando-se a conjuntura da interatividade dos jogadores com os jogos, sejam eles lúdicos ou não, podemos aferir que jogos são atividades muito mais atraentes para estudantes do que leituras e aulas expositivas. Segundo Robaina (2008), há um poder nos jogos que permite a tornar aulas comuns em momentos de um aprendizado eficiente, criativo e prazeroso para os alunos, além de propiciar aos professores a diversificação de suas aulas, tornando-as mais interessantes, criativas e desafiadoras. Como exposto, nos jogos há interatividade do envolvido com o conteúdo apresentado o que faz com que os estudantes que se encontram na infância se interessem por eles mais do que o público geral. Além disto, quando tratamos de jogos digitais, sejam por meio de videogames ou computadores, temos o desenvolvimento da capacidade do aprendizado pela ação do jogador como pela observação de outro jogador quando realiza a mesma atividade. A atratividade dos jogos, aliada a conteúdos educativos e aliada ainda à tecnologia digital nos traz os jogos sérios. Estes jogos sérios, especificamente, ganham espaço no estudo e nas aulas complementares. Cada vez mais se encontram disponíveis para utilização online ou para download jogos dos mais diversos temas e didáticas, como foi possível confirmar através da pesquisa realizada neste estudo onde três jogos foram selecionados para uma avaliação mais profunda e citada neste trabalho. Os jogos ajudam a criar um entusiasmo sobre o conteúdo a ser trabalhado, como afirma Chaguri (2008). Porém, jogos podem ser prejudiciais ao desenvolvimento da criança quando trouxerem mensagens de violência ou conteúdo confuso e controverso. Com o advento da internet e a disseminação do conhecimento de desenvolvimento de jogos digitais, hoje uma vasta gama de pessoas pode criar e divulgar um jogo digital. Pessoas mal intencionadas ou mal informadas, bem como empresas que visam simplesmente o lucro, e que não possuem responsabilidade social, têm a possibilidade de lançar na Internet jogos que, não só deixam de lado uma mensagem positiva, quiçá educativa, mas ainda introduzem lições torpes de atitudes condenáveis pelos parâmetros sociais atuais. Portanto, é necessário que antes de uma criança ser exposta a qualquer jogo, sejam eles lúdicos ou recreativos, estes jogos sejam selecionados por um adulto instruído e que tenha uma carga de bom senso. Este adulto não necessariamente precisa ser um pedagogo, ou então um profissional da educação, podem ser pais, responsáveis, instrutores, irmãos mais maduros, ou qualquer pessoa que possua bom senso e discernimento aguçado para visualizar e separar dos jogos em geral aqueles que são apropriados às crianças. Tudo isto para que a experiência com o jogo seja proveitosa, sendo adequada para a fase em que o aluno se encontra. Em uma busca e seleção de jogos para crianças, primeiramente chegaremos a um grupo de jogos que instruem acerca de algum assunto pertinente, ou que ao menos passam uma mensagem ética, portanto, são genericamente indicados para crianças. Entretanto, as crianças não são padronizadas, cada peculiaridade é responsável por uma parte do todo indissolúvel do desenvolvimento de cada pessoa. Existem classificações de jogos indicados para crianças de determinada idade ou fase escolar, porém, ambas são maneiras superficiais de agrupamento, pois cada uma carrega seu conhecimento empírico, além de suas próprias limitações e potencialidades. Ainda existem os jogos que são desenvolvidos especificamente para portadores de deficiências, comumente desenvolvidos para uma deficiência específica, visando potencializar a aprendizagem dos portadores dela. Entretanto não são muitos os que estão disponíveis de forma gratuita na rede mundial de computadores. Havendo assim classificações para os jogos, por serem genéricas e pouco efetivas, encontra-se outra diferenciação que se dá pelos grupos de deficiências que algumas crianças carregam. Também extremamente genérica, torna-se mais específica quando definidos grupos menores, de uma deficiência, apenas. Porém, jogos tão específicos são raros. Tratando-se de crianças portadoras de deficiências encontramos um motivo ainda maior para utilizar jogos sérios em sua aprendizagem que é conseguir avanços em seu desenvolvimento. O ensino convencional é padronizado da forma mais ampla possível, por idade. Esse padrão prevê exceção para as crianças que não obterem desenvolvimento dentro do padrão estabelecido para aquela idade, aferido através de conceitos estabelecidos pelos professores por intermédio de avaliações diversas. E, mesmo no ensino convencional, pode ser otimizado por atividades lúdicas que proporcionam um maior impulso para a criança em direção à conquista de metas estipuladas, até mesmo a superação delas. Se para crianças que se enquadram fora de qualquer grupo de deficiência já podemos ver o resultado positivo da aplicação de atividades lúdicas, em específico de jogos sérios, quando tratamos de crianças dentro de um desses grupos de portadores de deficiências os resultados podem ser até mais surpreendentes. Cada deficiência traz consigo uma limitação específica, como as deficiências que serão abordadas neste estudo que são a falta de audição, a redução da capacidade intelectual e o transtorno de déficit de atenção com hiperatividade (TDAH), que pode ser trabalhada com atividades desenvolvidas especialmente para desenvolver esta limitação, amenizando-a. Ou também que apenas respeite a limitação, não gerando uma dificuldade a mais para desempenhar as atividades propostas pelo jogo sério. Por serem indicados e positivos para o ensino padrão ou especial, hoje são muitos os jogos sérios, mas, como dito anteriormente, não existem em grande quantidade jogos sérios específicos para portadores de deficiências. É então que surge a questão: são necessários jogos educativos digitais específicos para portadores de deficiências ou os jogos que existem são bem interpretados e satisfatórios para este público? Para obtenção de uma resposta para esta pergunta é que se desenvolve a pesquisa foco deste estudo.",
    "Conclusão": "Esta é a última fase deste estudo, onde todo o material pesquisado na bibliografia, todas as experiências obtidas e dados coletados quando da aplicação do jogo sério às crianças, bem como todos os resultados aferidos serão fechados em uma resposta. Não pretende-se, aqui, apresentar uma verdade absoluta, uma informação irrefutável, mas sim uma diretriz, quase que um conselho, aos desenvolvedores de jogos sérios, com o fim de poder dá-los uma motivação a desenvolver jogos adequados ao mercado atual, fazendo com que as crianças tenham acesso a materiais adequados a elas. Ademais foi verificado que seria deveras pertinente que os jogos, sejam sérios ou não, possuíssem uma classificação semelhante à dos filmes ou até mesmo melhorada, indicando em sua capa, ou na sua descrição, quais tipos de estímulos, conteúdos, etc, serão desenvolvidos e abordados nele. As atividades propostas para esta pesquisa foram capazes de demonstrar que o desenvolvimento e a conclusão de jogos sérios para crianças portadoras de deficiência auditiva e de crianças sem deficiência alguma são praticamente iguais, excetuando casos em que o áudio seja parte fundamental ao jogo. Por esta questão é que se salienta a necessidade não de jogos específicos para portadores de deficiência auditiva, mas sim jogos com acessibilidade para eles, ou seja, quando o áudio for fundamental, que haja legendas inseridas no vídeo ou a possibilidade de exibi-las. É uma maneira simples de transformar um jogo ou atividade atrativo para este público, além de garantir sua compreensão por parte do usuário portador desta deficiência. Portanto, para portadores de deficiência auditiva os jogos existentes são suficientes, sim. Salientando apenas a sugestão de acessibilidade por meio de legendas, adaptação esta que podem ser feitas pelo desenvolvedor do jogo sério ou pelo instrutor que utiliza-lo de forma alternativa ou como tradutor simultâneo. Para crianças com deficiência intelectual é necessária uma seleção de jogos mais minuciosa, que defina para eles uma atividade condizente com sua capacidade de realizá-la. Jogos específicos para portadores desta deficiência seriam de veras específicos, visto que níveis diversos de intensidade da deficiência. A vista disso, aqui aponta-se que não há a necessidade de desenvolver jogos sérios específicos, mas sim de empenho do orientador, educador, tutor, responsável, etc, pela criança em buscar um jogo sério para que aquela criança tenha um bom aproveitamento da atividade, e não que sejam desenvolvidos jogos específicos para cada criança ou para a categoria de crianças portadoras de deficiência intelectual. O grupo mais complexo é o portador de TDAH, pois é a deficiência onde havia maior probabilidade de resultados positivos, visto que estas crianças possuem dificuldade de concentração e necessitam de maneiras alternativas para visualizar e assimilar conteúdo. Porém na aplicação dos jogos seus resultados não foram muito bons, além de falta de interesse, havia distração e muitos equívocos. Para este grupo, possivelmente, jogos desenvolvidos especificamente para eles poderiam ser de grande valia, visto que são crianças que necessitam de forte atratividade da atividade para se manterem focadas. Então fica definido que para os portadores de TDAH é necessário o desenvolvimento de jogos sérios especiais. Fica como contribuição deste trabalho, assim sendo, o entendimento de que não há necessidade de desenvolvimento de jogos sérios específicos para portadores de deficiência auditiva e intelectual. Porém, para portadores de TDAH é, sim, necessário que sejam desenvolvidos jogos sérios específicos. Ainda como contribuição deste estudo deixa-se a sugestão de que se leve em consideração o tempo de duração das atividades constantes em um jogo sério voltado a portadores de TDAH, visto que a atividade mais longa utilizada nesta pesquisa foi a que menos despertou a curiosidade e o interesse destas crianças. A recompensa rápida de atividades curtas e objetivas pode fazer com que a criança se mantenha envolvida nela de seu início ao seu fim, sem necessitar de estímulos externos. Contudo, para que um jogo seja desenvolvido para este grupo de deficiência será necessário estudo específico com aplicação, então, de diversos jogos sérios para cada criança do grupo pesquisado, a fim de definir quais os pontos e tipos dos jogos que mais os atraem. Além de pesquisa com os educadores de crianças portadoras de TDAH para que o jogo sério seja completo em forma e conteúdo. A partir deste futuro estudo será possível definir diretrizes para serem utilizados como guias ao desenvolvedor de jogos sérios para portadores de TDAH, que poderá realizar seu empreendimento sem a necessidade de pesquisa própria específica, ressaltando-se que muito provavelmente um jogo sério com maior atratividade será ainda mais atrativo que os jogos digitais também para crianças sem deficiência, ou com as demais deficiências apresentadas neste trabalho."
}