{
    "Autor": "Sarah de Rezende Guerra",
    "Título": "ESTUDO DA APLICAÇÃO DE UM EXPERIMENTO REMOTO PARA APOIO AO ENSINO DA LEI DE HOOKE EM ALUNOS DO ENSINO TÉCNICO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Vilson Gruber",
    "Coorientador(a)": "",
    "Resumo": "As novas tecnologias da informação e comunicação (NTIC’s) estão cada vez mais presentes em nosso dia a dia, inclusive os indivíduos que nascem rodeados por toda essa tecnologia são chamados de “nativos digitais”. Para acompanhar esse mundo globalizado, os mais diversos setores da sociedade estão se adaptando e aderindo as tecnologias, por exemplo, a educação. O uso das NTIC’s na educação é um grande desafio, sendo necessário buscar a cada dia novos métodos e formas de transmitir o conhecimento para esta nova geração de pessoas “plugadas”. Este trabalho representa um esforço para submeter as NTIC’s no processo de ensino e aprendizagem do ensino técnico. Para isso, foi utilizada uma proposta de ensino que envolve um experimento remoto de uma prensa didática que pode ser acessado através de um sistema de gerenciamento de aprendizagem. O conteúdo abordado nesse sistema é a Lei de Hooke, área da física que estuda as propriedades elásticas dos materiais. É de conhecimento corrente que os alunos geralmente possuem dificuldades em aprender física, neste sentido, esse experimento remoto permitirá aos alunos colocar em prática a teoria aprendida e assim auxiliá-los no processo de aprendizado. Para a realização deste trabalho, fez-se necessária uma aula com um grupo de alunos do ensino técnico, na qual os mesmos fizeram uso dos recursos citados acima. Os métodos avaliativos empregados para a consolidação da proposta envolveram a aplicação de um questionário para identificar as habilidades cognitivas dos estudantes (questionário VARK), exercícios em forma de avaliação e um questionário de avaliação da satisfação dos alunos em relação ao uso das tecnologias que foram aplicadas.",
    "Palavras-chave": [
        "Experimentação Remota",
        "NTIC’s",
        "Sistema de Gerenciamento de Aprendizagem",
        "Ensino Técnico"
    ],
    "Introdução": "As novas tecnologias da informação e comunicação (NTIC’s) possibilitaram abrir novos horizontes para a educação criando novas formas para transmitir o conhecimento. Com a evolução instantânea das tecnologias, surgem a cada momento novas ferramentas para auxiliar em no processo de aprendizagem, na qual podemos citar a Educação a Distância (EAD). A EAD está crescendo e evoluindo cada dia mais em busca de novas ferramentas e meios para levar o conhecimento a alunos do mundo todo. Neste contexto, surgem os laboratórios remotos, que são locais onde experimentos reais podem ser acessados e controlados via internet, garantindo a interação e possibilitando a aprendizagem do estudante mesmo este estando a quilômetros de distância (PALADINI, 2008, p.12). Esses laboratórios podem ser utilizados tanto na EAD como no ensino presencial, no chamado “blended learning”, que mistura esses dois estilos de ensino, grande parte presencial e a distância (EAD) (MARCELINO, 2010, p.13). Os sistemas de gerenciamento de aprendizagem (SGA’s) também são uma ferramenta poderosa da EAD, dando suporte não somente a esse modelo de ensino, mas também para o ensino presencial, o qual pode utilizar dessa ferramenta simplesmente como repositório de dados virtuais onde o aluno tem a opção de buscar informação a hora que quiser. Universidades ao redor do mundo já trabalham com experimentos remotos e SGA’s, um exemplo é a própria Universidade Federal de Santa Catarina, que conta com o RExlab, um laboratório de experimentação remota que disponibiliza vários experimentos e atualmente conta com cinco diferentes países em sua rede, no intuito de estimular os jovens a inserirem-se nas carreiras científico-tecnológicas e buscar iniciativas que integrem a educação científica ao processo educacional (REXLAB, 2014). Tecnologias voltadas para a educação são uma realidade, existem e já fazem parte de muitas instituições de ensino. Desta forma, a proposta deste trabalho é aplicar um experimento remoto integrado a um sistema de gestão da aprendizagem em um grupo de alunos do ensino técnico e realizar uma avaliação referente ao uso dessas tecnologias na educação.",
    "Conclusão": "As novas tecnologias da informação e comunicação crescem e se popularizam cada vez mais em diversas áreas da sociedade, sendo a educação uma delas, ganhando um destaque especial, pois é uma grande beneficiada desses novos meios de levar e transmitir o conhecimento para alunos do mundo todo. Os sistemas de gerenciamento de aprendizagem (SGA) e os experimentos remotos que foram tratados neste trabalho mostraram-se ferramentas interessantíssimas para agregar nos processos de ensino e aprendizagem dessa nova sociedade globalizada. O questionário VARK mostrou que em uma sala de aula podemos encontrar alunos com características de aprendizagem distintas, tivemos como exemplo a sala de aula utilizada neste trabalho, mas que fique bem claro que não é apenas nesta sala que foi trabalhada, ao redor do mundo, vamos encontrar indivíduos que aprendem de maneiras diferentes, alguns são visuais, outros sinestésicos e assim por diante, então importância dos educadores oferecerem maneiras variadas de buscar e assimilar o conhecimento. Os resultados da proposta aplicada apontaram que todos os alunos aprovaram o acesso ao portal Labtel e ao experimento remoto. Esses resultados são satisfatórios e motivadores, pois as tecnologias evoluem a cada dia, ou seja, novas formas e ferramentas surgem para auxiliar na educação e devem ser estudadas e aplicadas, pois os próprios alunos estão acompanhando essa evolução e anseiam por métodos novos para o ensino. Como sugestão para trabalhos futuros seria a aplicação das tecnologias citadas neste trabalho em mais turmas para verificar a constância dos resultados obtidos ou em outros níveis de ensino, como por exemplo, no ensino médio ou ensino superior para verificar se haverá resultados positivos e benefícios para a aprendizagem dos alunos como os identificados nesta proposta. Outra sugestão é a aplicação dessas tecnologias em cursos totalmente à distância, no qual seria interessante a inclusão de outras tecnologias, como por exemplo, os mundos virtuais 3D, que podem ser agregados aos experimentos remotos e SGA’s, criando assim uma proposta diferenciada para ser testada na educação. Segundo Marcelino (2010, p. 16) “nos últimos anos tem-se observado alguns estudos do uso dos mundos virtuais 3D para uso no processo de ensino-aprendizagem, principalmente para o ensino a distância.”"
}