{
    "Autor": "Silvana Pires da Silva",
    "Título": "A UTILIZAÇÃO DA EXPERIMENTAÇÃO REMOTA NA EDUCAÇÃO BÁSICA: Um estudo em escolas das redes pública e privada",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Juarez Bento da Silva",
    "Coorientador(a)": null,
    "Resumo": "Esta pesquisa teve por objetivo desenvolver e implementar um ambiente de formação baseado no uso da experimentação remota para utilização em aulas de Física através da internet, na Educação Básica, em escola da rede privada de ensino e comparar os dados obtidos com pesquisa similar aplicada em escola da rede pública de ensino, a fim de buscar verificar o interesse e a integração com as Novas Tecnologias da Informação e Comunicação. A amostra pesquisada foi de 27 alunos do terceiro ano do Ensino Médio, da disciplina de Física na em escola da rede privada de ensino no município de Araranguá, Santa Catarina e para comparação dos dados foi utilizado a pesquisa desenvolvida por Marília Matias Kestering Tavares, do curso de TIC no projeto “Informática na educação: Ensinar e aprender com o uso dos laboratórios de experimentação remota” desenvolvido no Laboratório de Experimentação Remota (RExLab) da UFSC. Os dados coletados foram obtidos a partir de dois questionários utilizando a escala de Likert de cinco pontos a fim de mensurar o grau de concordância dos alunos. O resultado com maior escore médio (4,13) foi para a questão que buscou investigar a percepção dos alunos questionando se os “Laboratórios de experimentação remota possibilitam experiências de aprendizagem para além das salas de aula”, ou seja, ocorreu uma forte concordância em relação a um dos principais objetivos deste trabalho. Neste documento é apresentado o ambiente desenvolvido e implementado para dar suporte a presente pesquisa bem como os instrumentos, os dados obtidos e os principais resultados e conclusões. Por fim, foi possível perceber que as atitudes positivas quanto a integração com as novas tecnologias foram similares nas duas instituições de ensino.",
    "Palavras-chave": [
        "Experimentação Remota",
        "Educação Básica",
        "Ensino",
        "Aprendizagem",
        "Ambientes Virtuais de Aprendizagem"
    ],
    "Introdução": "O avanço das Novas Tecnologias da Informação e Comunicação (NTICs) na sociedade tem provocado grandes mudanças tecnológicas nas áreas de: economia, engenharia, telecomunicações, medicina, área industrial, entre outras. Tal avanço responde pela portabilidade da informação; pelo acesso frequente à internet; pela diversidade de meios eletrônicos (dispositivos móveis, computadores portáteis e dispositivos específicos). Além disso, a cada instante surgem novos equipamentos exigindo das pessoas que acompanhem essas evoluções constantes atualizações. Este novo contexto faz parte das novas gerações que já crescem em meio às tecnologias aprendendo desde muito cedo e com rapidez como utilizá-las. Por conseguinte, o ambiente educacional vem respondendo a estas transformações com a introdução aos poucos das NTICs no ambiente escolar; com novas organizações do processo de ensino e aprendizagem que ultrapassem os trabalhos dentro das salas de aula como o ensino a distância, a experimentação remota, os laboratórios virtuais, dentre outros. Uma característica dessa nova organização escolar são as atividades participativas tratadas com esforço cooperativo entre os atores envolvidos. Essa participação é ativa, e a interação possibilita que o conhecimento possa manifestar-se por meio de um diálogo entre os participantes compartilhando ideias e informação. Entre as ideias inovadoras presentes nos projetos realizados pelo grupo de pesquisa Rexlab, está o interesse na formação básica e nas aulas práticas das disciplinas científico-tecnológicas, por compreender a importância para a formação profissional dos alunos e por perceber que a qualidade da formação em disciplinas nas áreas das ciências poderá resultar em ingressos nas áreas das engenharias ou tecnológicas. Ainda é de interesse do grupo fornecer meios de apropriação de conhecimento pela experimentação remota, ao qual a autora faz parte desde 2011, focando na utilização de ferramentas tecnológicas para apoiar os estudantes nas aulas práticas. No entanto, o ambiente educacional encontra-se em mudanças quanto às possibilidades de aprendizagem, atualmente oferecidas pela sociedade, as quais estão multiplicando-se e a formação prática dos estudantes encontra-se carente necessitando de novos métodos de ensino que possam auxiliar a desenvolver esta etapa tão importante de sua formação (SILVA, 2013). Desta forma, de um lado temos o avanço tecnológico e do outro lado à resistência dos educadores a novos métodos de ensino baseados na internet. Tal fato está ligado, principalmente, pela ausência de domínio das novas tecnologias no ambiente educacional. Desta maneira, o ponto de partida para este estudo se dá pela convergência destas duas situações. Sobre este ponto formulamos a pergunta que pretendemos responder com o trabalho e destacamos os objetivos em desenvolver o mesmo: Com o trabalho desenvolvido por Tavares (2013), que buscou compreender se a complementação pelo uso da experimentação remota a unidade curricular da disciplina representou um fator positivo para o processo de ensino e aprendizagem no Ensino Público, surgiu à possibilidade de fazer uma comparação com o Ensino Privado para verificar se “O uso da experimentação remota é similar nas duas instituições de ensino?” “O interesse dos alunos é o mesmo?” “A integração com as NTICs é a mesma?",
    "Conclusão": "Neste tópico são apontadas as conclusões da pesquisa realizada até o presente momento. Busca-se mostrar respostas às questões em estudo a fim de atender as intenções propostas. Esta pesquisa foi importante para aprimorar os conhecimentos adquiridos no decorrer do curso de Tecnologias da Informação e Comunicação. Seu objetivo principal foi verificar como os alunos percebem a integração das NTICs a partir da utilização da experimentação remota em suas atividades de ensino e aprendizagem, através de dados coletados na rede privada de ensino pela autora e por Tavares (2013) na rede pública de ensino. A utilização em apenas uma instituição privada no município de Araranguá e a falta de interesse de outros professores, além do curto período da aplicação limitou os resultados apresentados. As NTICs têm provocado grandes mudanças tecnológicas em diversas áreas, por meio dessa mudança o ambiente educacional aos poucos vem respondendo a estas transformações com a introdução das mesmas no ambiente escolar. No entanto, os educadores encontram-se resistentes a esses novos métodos de ensino, tal resistência pode estar relacionada pela ausência de domínio das NTICs. Desta forma, o trabalho buscou responder se “O uso da experimentação remota é similar nas duas instituições de ensino?” “O interesse dos alunos é o mesmo?”e “A integração com as NTICs é a mesma?”. Com base nos resultados na aplicação dos questionários pode-se perceber que os alunos das duas instituições de ensino, pública e privada, apresentaram atitudes positivas quando à integração das NTICs a partir do uso da experimentação remota, pois o escore médio geral dos questionamentos da escola pública foi de 3,88 e da escola privada foi de 3,72. Ainda sobre a integração das NTICs foi possível perceber concordância por parte dos alunos, pois baseado nas respostas dos mesmos a experimentação remota permite um estudo mais autônomo, possibilita um reforço do conhecimento teórico, amplia as experiências de sala de aula, agrega qualidade ao estudo entre outros. Fato esse que pode ser confirmado por Silva (2006), o acesso ao laboratório remoto pode propiciar aos alunos e a sociedade em geral, meios para geração, experimentação, descobrimento e transmissão de conhecimentos. Desta maneira, os educadores precisam estar preparados para as transformações proporcionadas pelas NTICs no ambiente educacional. Além de minimizar as barreiras da resistência quanto ao uso de novos métodos de ensino. Por fim, para recomendações a trabalhos futuros seria fundamental trabalhar mais com o ambiente virtual de aprendizagem, para explorar mais as ferramentas como chats, fóruns etc., além de trabalhar com a experimentação remota em diferentes instituições de ensino e disponibilizar mais experimentos remotos aos alunos. Além disso, realizar pesquisas de âmbito psicológico sobre os participantes da aplicação do projeto. Ainda realizar uma avaliação das perspectivas da aplicação dessas pesquisas num âmbito maior, considerando questões, geográficas, aceitação entre diferentes instituições pública x privada, etc. E por último, uma avaliação de gestão sobre as condições atuais, tais como situações de “alunos clientes” muitas vezes com foco maior nas mensalidades do que na qualidade de ensino."
}