{
    "Autor": "Bruna Beza da Silva Gonçalves",
    "Título": "Softwares de Apoio à Pesquisa Científica: Levantamento e Análise de Características",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Patricia Jantsch Fiuza",
    "Coorientador(a)": null,
    "Resumo": "A civilização evoluiu ao longo de muitos anos, com ela evoluíram também o pensamento, a linguagem e o fazer ciência. Pesquisa é uma prática voltada para a resolução de problemas por meio de métodos científicos e pode ter um enfoque qualitativo e quantitativo para verificação dos dados. Outra grande evolução da civilização é a tecnologia, que foi parte fundamental do desenvolvimento humano, pode-se afirmar que desde o descobrimento de técnicas para manuseio do fogo até a descoberta dos microprocessadores, que possibilitaram uma revolução no que se conhecia por computador. E com o uso dos computadores aumentando de forma significativa, o mesmo aconteceu com a internet e os sistemas de computadores, itens essenciais para a vida que o homem possui nos dias atuais. Verificado que esses sistemas podem ser utilizados para auxiliar as pesquisas, através de geração de gráficos, geração de tabelas, inserção de bibliografia, e outras funcionalidades. O resultado alcançado na pesquisa mostra que ainda existe um baixo acervo de materiais sobre tais sistemas e que são muito pouco utilizados nas pesquisas, mesmo sendo ótimas ferramentas, com funcionalidades úteis.",
    "Palavras-chave": [
        "Pesquisa Científica",
        "Conhecimento Científico",
        "Software",
        "Tecnologia",
        "Sistemas",
        "Ferramentas"
    ],
    "Introdução": "No homem sempre habitou o desejo pelo conhecimento. Esse desejo guiou o homem na busca de respostas e soluções para situações vividas em seu cotidiano. Este trabalho aborda o processo de construção da ciência, que tem os primeiros indícios com a civilização Grega, conforme descreve Carvalho (2010), desenvolveram o instinto e a intuição, que destacou a possibilidade em gerar teorias unitárias sobre a natureza e desvincular o pensamento racional mítico. A Idade Moderna é marcada pela necessidade em explicar os fenômenos e acontecimentos de forma mais concreta. Religião e mitologia sozinhas, já não conseguiam responder as indagações humanas. Houve a necessidade de comprovar e fundamentar as explicações, com fatos e registros. E essa necessidade é fundamental para que a pesquisa pudesse evoluir. A Idade Contemporânea o homem busca esclarecer o que não é ciência e o que é ciência, colocando a prova as afirmações de filósofos embasadoras do pensamento científico. Homem também se depara com a popularização do conceito de metafísica e com a influência de pensamentos como o Positivismo lógico de Viena, o Princípio da Falseabilidade de Karl Popper, o Anarquismo Metodológico de Feyeraband, o Pós-positivismo, o Construtivismo, entre outros. Todas essas etapas foram fundamentais para a pesquisa científica, para elaboração de conceitos e a fundamentação de todos os pensamentos utilizados em pesquisas. Uma vez que nenhum pensamento sozinho é capaz de construir ciência por si só. E cada etapa da evolução científica foi fundamental não só para as construções intelectuais, mas também para as invenções, dentre elas a tecnologia. O homem utiliza tecnologia desde os mais longínquos períodos. Pode-se afirmar que ao começar utilizar materiais que o ambiente proporcionava para auxiliar suas tarefas cotidianas, já usufruía de tecnologia. Ao longo da evolução a tecnologia foi se refinando e tornando-se, em alguns casos, mais refinada. Afirma-se que tecnologia é parte fundamental na vida humana. Nos deparamos com tecnologia em uma compra em um supermercado até na elaboração de um trabalho científico. Em relação a tecnologia, o homem também desenvolveu ferramentas que pudessem contribuir e simplificar as atividades. Há no homem uma grande capacidade de adaptação com o meio em que vive. Para isso ele modifica o meio, através das invenções, citadas acima, ou então permite que o meio o modifique. Os sistemas são um exemplo dessa adaptação. O homem desenvolveu ferramentas para executar processos, análises, cálculos, cadastros, buscas e etc. Tais ferramentas são utilizadas nos mais diversificados meios, seja empresarial, comercial, industrial. Entretanto foi verificado uma grande resistência, no meio acadêmico referente a utilização de ferramentas de auxílio a pesquisa. Outro ponto verificado é o baixo referencial bibliográfico referente a tais ferramentas. Os livros de metodologia científica não se aprofundam sobre tais ferramentas. Somente citam algumas delas, na maioria as mais conhecidas. Tais ferramentas são facilitadores que contribuem com a análise dos dados de pesquisas, qualitativas e quantitativas, no gerenciamento de bibliografia. Este trabalho pretende demonstrar essas ferramentas, as funcionalidades, para que pesquisas são indicadas. Para elaborar tal levantamento, foi realizado uma pesquisa básica quanto á natureza, exploratória em relação aos objetivos, qualitativa quanto a abordagem do problema e bibliográfica. Este trabalho está constituído por esta introdução que apresenta os objetivos do trabalho, o capítulo 2 que destaca a evolução da pesquisa científica, no capítulo 3 são apresentadas as tecnologias e sua história. O capítulo 4 se concentra nos softwares que podem ser usados nas pesquisas científicas seguido pelo capítulo 5 que apresenta o percurso metodológico deste trabalho. No capítulo 6 é apresentado as análises dos dados e no capítulo seguinte as considerações finais. As referências utilizadas no trabalho são apresentadas no último capítulo.",
    "Conclusão": "Percebe-se que ao longo da história da humanidade o conceito de pesquisa foi evoluindo, inicialmente o homem explicava todos os fenômenos da mitologia, do senso comum. Sendo que em um determinado período esse conhecimento não conseguia responder a perguntas mais elaboradas, mais complexas. Então surge a necessidade em pesquisar, e elaborar e buscar comprovações para os motivos que antes respondiam seus questionamentos. Ao longo da história muitas foram as mudanças sofridas pela humanidade. E os tipos de conhecimentos foram fundamentais para cada etapa vivenciada. Homem evoluiu e a maneira de lidar com o mundo também, desde o fogo, a roda até pequenas máquinas com poder de processamento “miraculoso”. O computador é de longe um marco na vida da sociedade, a partir dele muitas coisas se tornaram possíveis, como por exemplo, até alguns anos atrás comunicar-se com o outro lado do mundo parecia inalcançável, porém a internet rompeu com este impossível, permitindo, entre outros, gerenciar as empresas, estoques e nossa rotina por meio de um sistema. Verifica-se por meio da ciência, que a pesquisa é a principal responsável por tamanhos avanços, sempre possibilitando o ser humano a pensar mais, investigar mais, fazer melhor. E este trabalho verificou que estes avanços tecnológicos, muitas vezes, não são utilizados pelo meio acadêmico, mais especificamente nas elaboracões dos textos das pesquisas. Para elaboração deste trabalho foram pesquisadas as ferramentas para análise de dados, formatação de textos e referencial bibliográficos, e com isso foram estudadas as seguintes: SPSS, SPSS Amos, SPSS Standard, SPSS Samplepower, Excel, Action, Minitab, Nvivo, Atlas.Ti, EndNote e Latex. Para seleção das ferramentas foi levado em consideração as citações encontradas nos livros de metodologia científica. Não foi alvo desta pesquisa a análise detalhada de nenhum dos sistemas supracitados, muito menos submete-los a um teste e elevar pontos fortes e fracos. Percebeu-se que as ferramentas possuem uma vasta funcionalidade, e cada uma possui um diferencial em relação às outras. Destaca-se que o estudo não buscou realizar uma comparação para elencar qual ferramenta seria a mais indicada ou a mais completa. Mesmo assim é possível identificar que existem ferramentas para todas as etapas do trabalho acadêmico. Seja na escrita do texto (Latex), no gerenciamento das referências bibliográficas (EndNote) e para o tratamento dos dados nos enfoques diferentes de pesquisa, seja qualitativa (NVivo e Atlas.Ti) ou quantitativa (SPSS, SPSS Amos, SPSS Standard, SPSS Samplepower, Excel, Action, Minitab). As ferramentas, conforme citado, ainda são muito pouco utilizadas, e o que poderia fomentar a utilização das mesmas seriam as próprias universidades. E foi isso que aconteceu com o NVivo e o Atlas.ti. Maria Campos Lage descreve que a ferramenta foi adotada por centros de pesquisa dentro de grandes universidades, como USP, Unicamp, UFRGS. Destaca-se que o presente trabalho alcançou o objetivo geral que era pesquisar e estudar os tipos de softwares que podem ser usados nas análises de dados, formatação de textos, e referencial bibliográfico para pesquisas quantitativas e qualitativas. Bem como os objetivos específicos de pesquisar sobre os tipos de pesquisa qualitativa e quantitativa e identificar os softwares mais indicados para análises de pesquisas qualitativas e quantitativas descrevendo e comparando as principais características, funcionalidades e aplicabilidade dos softwares. O estudo apresentado neste trabalho foi realizado por meio da leitura, compilação e sistematização do conteúdo disponível em obras científicas respaldado em métodos científicos de coleta e análise dos dados. Cabe ressaltar a carência com relação à não existência de um vasto material bibliográfico, dificultando assim o processo de pesquisa. Durante a elaboração desta pesquisa, foi verificado a escassez de referencial bibliográfico referente aos sistemas e suas funcionalidades. Em livros e artigos muito pouco é abordado, sendo que na maioria das vezes os autores só fazem uma citação para informar a existência da ferramenta. Isto é, não existem materiais de referência específicos para cada software e sim algumas poucas obras que apresentam vários modelos de maneira resumida e escritas de modo generalista. Essa constatação indica a necessidade de maiores investimentos em pesquisas científicas na área dos softwares de apoio à pesquisa. Conclui-se que as ferramentas atendem as necessidades dos pesquisadores, entretanto o baixo material teórico e o fato das ferramentas serem pagas não permite que as próprias universidades incentivem o uso e isso se tornou um dos fatores para o baixo uso das mesmas nas elaborações de trabalhos acadêmicos."
}