{
    "Autor": "TAIRONE SOARES DE SOUZA, THIAGO PATRÍCIO",
    "Título": "GESTÃO ESPORTIVA APLICADA A ÁREA DO TÊNIS COM SISTEMAS MULTIPLATAFORMA",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Luciana Bolan Frigo",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho aborda o desenvolvimento de dois sistemas capazes de gerenciar quadras para jogos de tênis. Cada sistema terá uma abordagem específica. O primeiro deles possui todas as funcionalidades gerenciais e administrativas e opera sobre plataforma fixa (windows). O segundo possui a característica de ser portátil, apresenta apenas as principais funções e opera sobre a plataforma web. Com este recurso, torna-se possível realizar o controle e gestão de quadras por um clube. Desta forma, eventos podem ser agendados e organizados com maior facilidade, trazendo benefício direto para jogadores, expectadores e administradores envolvidos no processo. Para que fosse atingido este objetivo, todo o sistema foi baseado em um projeto piloto de um clube local. Foi realizado um estudo e os sistemas foram desenvolvidos com base na opinião de tenistas e necessidades deste clube. Ambos os sistemas foram desenvolvidos com ferramentas livres (open source), porém, devido ao seu valor comercial, seu código fonte não será disponibilizado. Além da característica de agendamento de horário das quadras, o sistema faz também um gerenciamento de competições, trazendo um maior dinamismo e utilização das quadras. É um sistema inovador nesta modalidade de esporte.",
    "Palavras-chave": "Tênis, Gestão, Tecnologia Móvel.",
    "Introdução": "Na década de 40 e 50, o tênis era visto com certo desprezo. De acordo com Carta e Marcher era um jogo estranho, no qual se usava um cabo longo. Veio para o Brasil a partir de clubes britânicos e alemães, e ficou localizado principalmente no eixo Niterói - São Paulo - Porto Alegre. Carta e Marcher afirmam ainda que, até meados de 2004, apenas o futebol tinha destaque no cenário nacional. Clubes de tênis eram caros e não existiam quadras públicas. O tênis só conseguiu ganhar espaço quando atletas brasileiros, como Gustavo Kuerten, começaram a ganhar torneios mundiais. Desta forma o tênis deixou de ser um esporte da elite. (CARTA e MARCHER, 2004) Com a proximidade das olimpíadas e copa do mundo, e pelo fato de o Brasil ser o país sede no ano de 2014, a preocupação com a gestão esportiva vem crescendo cada vez mais. O uso de recursos tecnológicos como Desktops, Notebooks, Tablets e Smartphones facilitam a portabilidade e praticidade na utilização de softwares de gestão. O uso da Internet está em constante crescimento. Aplicativos desenvolvidos para jogos, educação e informação estão cada vez mais difundidos na rotina das pessoas. Segundo dados do IBOPE, (2012), média realizada em dezembro de 2012, o Brasil era um dos maiores países em usuários ativos na internet, ficando atrás apenas dos Estados Unidos e Japão. Ainda segundo a pesquisa, os usuários brasileiros são os que passam mais tempo acessando a internet, com cerca de 43 horas e 57 minutos por mês.",
    "Conclusão": "O objetivo proposto neste trabalho, de desenvolver um sistema capaz de gerenciar as quadras de tênis seguindo os princípios de engenharia de software, foi atingido. Conforme questionários aplicados previamente com os usuários, foi desenvolvido o software personalizado de modo a atender as necessidades dos mesmos. Deste modo, percebeu-se no teste do software que as principais tarefas realizadas no sistema são feitas de forma prática e rápida. O sistema ainda não está implantado totalmente, porém, acredita-se que o potencial de gerenciamento deve facilitar, tanto para o cotidiano dos funcionários do clube (administradores do sistema) quanto para os tenistas que utilizam as quadras. A utilização do software está relacionada apenas a uma mudança de hábitos, devendo ocorrer naturalmente à medida que ambos os tenistas passem a fazer uso do sistema. Conforme a Figura 16, todo o trabalho foi desenvolvido sobre o método cascata. Na etapa de Definição de Requisitos, aplicamos um questionário com os tenistas usuários do sistema, a fim de definir as regras de negócio do software e elaborar o diagrama de casos de uso. Após concluir esta etapa, foi iniciada a segunda parte referente ao projeto de sistema e software. Nesta etapa, foi elaborado o diagrama de classes do software, juntamente com o documento de requisitos, que traz todo o software documentado. Em seguida, foram implementados os dois softwares. Um na versão desktop, e o outro na versão web. Concluída esta fase, iniciou o processo de testes e integração com o clube. Esta etapa não foi totalmente concluída. Porém, conforme planejado, este trabalho cumpriu seu objetivo, que era chegar até o desenvolvimento do software. Fica como sugestão de trabalho futuro, realizar os testes e avançar para a etapa seguinte, implantando o software no clube e fazendo as manutenções necessárias para o correto funcionamento."
}