{
    "Autor": "Tatiana Nilson dos Santos",
    "Título": "APLICAÇÃO DA ROBÓTICA NO PROCESSO DE ENSINO APRENDIZAGEM NA EDUCAÇÃO BÁSICA",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "A robótica educacional é um campo dentro da área das Tecnologias da Informação e Comunicação (TICs) que tem tido um interesse crescente nos últimos anos, por ser uma forma atraente e lúdica de se trabalhar os conceitos vistos em sala de aula, motivando os alunos a refletirem sobre estes conceitos e a resolverem os problemas apresentados. Este trabalho apresenta a aplicação de uma ferramenta tecnológica, a robótica, com o intuito de motivar os alunos da educação básica e tornar as aulas mais atrativas para os mesmos. Foi aplicado, em dois grupos de alunos de duas escolas diferentes da cidade de Araranguá/SC, uma atividade para a educação ambiental de três formas de aprendizagem diferentes: método tradicional de ensino; método tradicional auxiliado pela robótica; e somente por meio da robótica. Analisou-se o grau de interesse dos alunos e sua motivação em participar das aulas e observou-se que o método tradicional de ensino auxiliado pela robótica foi o que obteve o resultado mais satisfatório, demonstrando que os alunos interessavam-se mais pelas disciplinas na qual eram ensinadas por meio de uma ferramenta tecnológica.",
    "Palavras-chave": [
        "Robótica Educacional",
        "Educação Ambiental",
        "Educação Básica",
        "Tecnologias Educacionais"
    ],
    "Introdução": "A robótica é uma área de pesquisa multidisciplinar, pois engloba o conteúdo de diferentes disciplinas objetivando a construção de robôs para desempenhar as mais variadas tarefas (JONES; FLYNN; SEIGER, 1999; BEKEY, 2005). É cada vez mais comum o uso de robôs para auxiliar os seres humanos em inúmeras tarefas, desde um simples aspirador de pó até a exploração espacial. Robôs geralmente são aplicados em tarefas consideradas repetitivas, estressantes ou perigosas para um ser humano (NEHMZOW, 2000).\n\nPor ser uma área que desperta bastante curiosidade, a robótica educacional pode ser usada como ferramenta didática para auxiliar professores em diferentes conteúdos dependendo da disciplina a ser ensinada (TRAYLOR; HEER; FIEZ, 2003). Para os alunos, a robótica é uma excelente ferramenta para exercitar a criatividade, estudar e praticar conceitos relacionados a diferentes disciplinas.\n\nExistem diferentes kits de robótica que podem ser usados para tal atividade. Entretanto, o kit Lego Mindstorm (BAGNALL, 2002) se destaca, tanto por sua característica lúdica, por se tratar de peças lego conectáveis umas às outras, como por permitir construir diferentes tipos de robôs ou equipamentos automatizados, como por exemplo, fábricas, indústrias, etc., dependendo do problema em questão e da criatividade dos alunos.\n\nOs kits de robótica têm se destacado como ferramenta para a motivação de estudantes nas mais diversas áreas das ciências para auxiliar professores a reforçar conceitos das disciplinas. Por exemplo, o professor da disciplina de física poderia usar os robôs para demonstrar na prática os efeitos de cinemática, dinâmica, inércia, movimento retilíneos, etc. O professor pode propor desafios para os alunos e estes construírem desde simples robôs até robôs mais complexos com um maior número de peças e componentes.\n\nA complexidade teórico/prática, inerentes a robótica, depende do grau de exploração que proporcionar a uma visão de aprendizagem significativa para o aluno, fazendo com que o ensino da robótica dê oportunidade de vivência direta através de simulações na construção de um dispositivo. Por outro lado, a dinâmica do trabalho com robótica cria condições de contextualização e discussão diversificada, que conduzem o professor e o aluno a uma interação com projeto/conteúdo pedagógico/aprendizagem significativa.",
    "Conclusão": "Após a aplicação da mesma atividade, de 3 (três) maneiras diferentes e considerando 3 (três) métodos de ensino distintos, observou-se as semelhanças e diferenças significativas no processo de ensino-aprendizagem dos alunos. Um dos principais fatos observados, é que o meio onde o aluno está inserido e a opinião alheia influenciam muito na tomada de decisão do aluno. Conforme mostra na tabela a seguir, em qualquer método de ensino, em qualquer metodologia utilizada pelo professor, o ambiente onde o aluno está inserido pode interferir na absorção do conteúdo. Na tabela 2 abaixo, são demonstrados alguns parâmetros analisados nos 3 (três) métodos de ensino e feita a devida comparação entre os mesmos. \n\nComo pode-se observar na tabela abaixo, a absorção do conteúdo ocorre nos 3 (três) métodos de ensino, porém, a forma como elas ocorrem é que difere de cada método; por exemplo, no método tradicional auxiliado pela robótica, percebeu-se que os alunos tiveram maior facilidade de entendimento perante o assunto, foi passado a eles previamente os conceitos e exemplificado, para melhor entendimento, com o robô. Este tipo de metodologia utilizada, pode ser comparada ao modelo Blended Learning ouB-Learning , o qual busca unir a educação presencial com a educação a distância, de modo que esta união proporcione aos alunos um ambiente vantajoso para o seu desenvolvimento cognitivo e que eles também consigam acessar, por diversas vezes, os conteúdos visto em sala de aula (MOREIRA; FERREIRA; SOBRAL, 2010)."
}