{
    "Autor": "Marcos Francisco Rocha",
    "Título": "ANÁLISE DE PERFIL DO PÚBLICO FEMININO DO CAMPUS ARARANGUÁ COM RELAÇÃO AOS JOGOS DIGITAIS E DE TABULEIRO",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Drª Luciana BolanFrigo",
    "Coorientador(a)": null,
    "Resumo": "Apesar dos jogos digitais estarem cada vez mais presentes na cultura brasileira, alguns estereótipos de que o perfil destes jogadores seja formado por um público predominantemente masculino e jovem continua sendo difundido. No entanto, algumas pesquisas têm mostrado que dependendo do estilo de jogo as mulheres já são maioria e o público não se concentra mais apenas na faixa etária de jovens, ou seja, o público jovem de décadas passadas continua jogando. Algumas pesquisas científicas têm atuado no sentido de apresentar o papel das mulheres na indústria de jogos, o sexismo dos personagens e a inclusão das mulheres no mundo da tecnologia. Buscando mais informações para ações que minimizem o efeito dos estereótipos, foi realizada uma pesquisa quantitativa com base em uma análise do perfil das mulheres com relação aos jogos digitais e de tabuleiro na UFSC de Araranguá. Para esta tarefa foi disponibilizado um questionário online, onde acadêmicas e docentes da UFSC/Campus Araranguá puderam responder questões referentes às mulheres e os jogos. Como resultado dessa pesquisa, observou-se que a maioria das mulheres gosta de jogos e cerca de dois terços (2/3) respondeu que joga algum tipo de jogo durante a semana, principalmente pelo smartphone, notebook e videogame (console). Essas mulheres independentes da área profissional gostam de tecnologia, bem como de jogar, mas não têm o hábito de comprar jogos. Os jogos preferidos são do tipo raciocínio, corrida, tabuleiro e simulação e isto se confirma na afirmação de que o joystick não é necessário para os jogos que elas gostam.",
    "Palavras-chave": "jogos digitais, jogos de tabuleiro, mulheres",
    "Introdução": "Desde o início da humanidade há registros de jogos, que foram derivados de brincadeiras, que envolvem diversão e podem até mesmo serem utilizados para auxiliar no aprendizado de pessoas de idades diferentes. O que difere os jogos de brincadeiras são características que envolvem objetivos, desafios, regras e interatividade (LOPES; SORIANO; OLIVEIRA, 2008). Contudo, não há uma definição aceita universalmente para o que é um jogo. Ludwig Wittgensteinfoi o primeiro acadêmico a tentar definir a palavra “jogo”, em sua obra “Investigações Filosóficas” (WITTGENSTEIN, 1953). Na mesma obra, concluiu, então, que o conceito de “jogo” não pode ser expresso por nenhuma definição única, mas que o mesmo tem de ser visto como uma série de definições que englobam semelhanças entre si (LOPES; SORIANO; OLIVEIRA, 2008). Posteriormente, Caillois (1961), sociólogo francês, definia que “jogo” é uma atividade que precisa possuir as seguintes características: hesitação e incerteza, governada por regras, fictícia e não-produtiva – a atividade é definida em um tempo e lugar, seu resultado é incerto e é acompanhada pela ciência dos participantes que se passa numa realidade alternativa. Os altos valores que são movimentados todos os anos pelo mercado comprovam que os jogos eletrônicos deixaram de ser brincadeira de criança. Segundo levantamento feito pelo banco de investimentos de produtos digitais Digi-Capital (2015), a indústria mundial de games deve faturar em torno de U$ 110 bilhões no ano de 2018. Sendo o 4º maior consumidor de jogos digitais do mundo, segundo SEBRAE (2014), o Brasil está à frente de países como o Reino Unido, Alemanha e Espanha. Um contraste diante desse posicionamento é a baixa expressividade da indústria brasileira de jogos digitais no cenário mundial. Estimativas da participação das regiões nas vendas globais indicam a Ásia como o maior mercado, seguindo pela Europa e pelos Estados Unidos (E.U.A). A América Latina tem participação modesta no mercado, de apenas 2%. Os países líderes dessa indústria global lançaram mão de políticas públicas diversas para alcançar suas posições. No Brasil, uma das iniciativas mais recentes, divulgadas pelo BNDES (Banco Nacional do Desenvolvimento Social), é o lançamento do Mapeamento da Indústria Brasileira e Global de Jogos Digitais (NÚCLEO DE POLÍTICA E GESTÃO TECNOLÓGICA, Relatório Final, 2014) e do Relatório de Proposição de Políticas Públicas Direcionadas à Indústria Brasileira de Jogos Digitais (NÚCLEO DE POLÍTICA E GESTÃO TECNOLÓGICA, Relatório 9, 2014). Ainda em fase de aprendizagem, o setor nacional comporta essencialmente empresas de micro e pequeno porte, que trabalham isoladamente na grande maioria dos casos, o que não permite a obtenção de escala no que diz respeito à inovação. Porém, é possível observar que há uma concentração dessas empresas no estado de São Paulo, seguido pelos estados do Rio Grande do Sul, do Rio de Janeiro e de Santa Catarina, o que mostra que as empresas se concentram nas regiões sul e sudeste. Essa concentração pode ser explicada pelo fácil acesso à internet, as ferramentas de desenvolvimento e as oportunidades de negócios. Também pode ser explicado pela concentração geográfica de cursos preparatórios e universidades que têm cursos de desenvolvimento de Jogos Digitais (SEBRAE, 2014). Um exemplo é o curso de Tecnologia em Jogos Digitais, ofertado pela UNESC – Universidade do Extremo Sul Catarinense, que tem como foco a atuação no mercado de trabalho e a curta duração, sendo a conclusão em dois anos e meio.",
    "Conclusão": "Este trabalho foi elaborado a partir dos dados obtidos pela aplicação de um questionário abordando questões de gênero no mundo dos jogos. Atingiu-se um índice de participação de 47,2%, totalizando 214 respondentes. Deste total, 92% delas pertenciam ao grupo de acadêmicas (sendo 56,9% do curso de Fisioterapia, 19,8% de Engenharia de Energia, 17,8% de Tecnologias de Informação e Comunicação e 5,6% de Engenharia da computação) e as demais ao grupo de docentes. A coleta de dados foi feita em duas etapas, a primeira pelo convite por e-mail e redes sociais e como a quantidade de respostas foi insuficiente, optou-se por realizar o convite abordando pessoalmente as entrevistadas. Para as acadêmicas foram enviados 420 e-mails obtendo-se 197 respondentes (46,9%). Para as docentes foram enviados 33 e-mails, sendo que foram atendidos 17, o que corresponde a 51,5%. Quanto ao perfil destas mulheres destaca-se: a maioria (82,3%. ) são jovens entre 16 e 25 anos. Cerca de 66% delas afirmam jogar de 30 minutos a 8 horas enquanto que 34% afirma não jogar ou não saber quanto tempo joga. Os jogos digitais são a preferência delas, destacando-se o smartphone/celular com 57,9%. Os jogos de tabuleiro obtiveram 13,6% e outros não identificados 1,4%. Das respostas obtidas quanto à seleção do sexo do personagem (item 8), 2% ratificam o que aponta Aquila (2006), que muitas jogadoras ficavam descontentes com a situação dos personagens femininos (beleza a ser consumida), pois estas muitas vezes eram as mais fracas do jogo, o que fazia com que fosse necessário jogar com papéis masculinos para finalizar a aventura. Como justificativa para a escolha do personagem masculino a demonstração de poder, o índice de emoção, a dificuldade e o respeito foram citados, porém a preferência por personagens femininos obteve 39%. Das respostas obtidas, 41% possuem preferência por gênero do personagem, no entanto, 26% não apresentaram nenhuma preferência. A maioria das respondentes (91%) apresentam muito interesse/interesse por tecnologia. Cerca de 55,6%, apesar de gostar de jogar não costuma comprar jogos, preferindo os jogos gratuitos e que também as micro-transações existentes nos mesmos são pouco utilizadas, cerca de apenas 1,4% das mulheres realizam essas compras. Já a compra no varejo físico obteve 6,5% e no varejo online 5,9%. Os dados obtidos na pesquisa refletem a situação atual das mulheres dos cursos da UFSC campus Araranguá e reforçam as hipóteses sobre os jogos digitais e de tabuleiro assim como reforça que, o uso de joystick, a compra de jogos e a participação em competições são itens que não despertam tanto interesse deste público. Para trabalhos futuros sugere-se ampliar a área de atuação da pesquisa envolvendo mulheres de áreas como humanas, por exemplo. Incluir também o público masculino para a obtenção de estudo mais amplo e um comparativo entre os gêneros."
}