{
    "Autor": [
        "João Antônio Farias da Silva",
        "Rafaela Oliveira Padilha"
    ],
    "Título": "E-COMMERCE E MARKETING DIGITAL NO DESENVOLVIMENTO DE UM SITE DE RECOMENDAÇÕES – O CASO i OBRAS",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": "",
    "Resumo": "O presente estudo tem como objetivo apresentar por meio de pesquisa qualitativa, uma revisão teórica sobre os principais termos pesquisados neste trabalho: Comércio Eletrônico (E-commerce) e o Marketing Digital. O objetivo é o de identificar se estas ferramentas vindas do avanço das Tecnologias da Informação e Comunicação (TIC’s) são atrativas para o consumidor nos dias de hoje. Para isto será analisado por meio de estudo de caso, um site de recomendação de profissionais autônomos e empresas do setor de obras e reformas em geral, denominado Iobras.com. Esta análise expõe as principais características e funções desta plataforma virtual e, sua análise mostra o poder de atração do Comércio Eletrônico e do Marketing Digital para o desenvolvimento de novos negócios baseados em TIC’s.",
    "Palavras-chave": [
        "TIC’s",
        "E-commerce",
        "Marketing Digital",
        "Sistemas de Recomendação"
    ],
    "Introdução": "As TIC’s (Tecnologias da informação e comunicação) abrangem todas as tecnologias que afetam e medeiam processos de informação e comunicação dos seres humanos. Segundo Ferreira (1986), a tecnologia é normalmente vista como um conjunto de conhecimentos, principalmente científicos, que são aplicados a um determinado ramo de atividade. Podendo ser também considerada como uma ciência que cuida da técnica. Para complementar estas afirmações, Fleury (1993) vê a tecnologia como: “um pacote de informações organizadas, de diferentes tipos (científicas, empíricas...), provenientes de várias fontes (descobertas científicas, patentes, livros, manuais, desenhos...), obtidas por diferentes métodos (pesquisa, desenvolvimento, cópia, espionagem...), utilizada na produção de bens e serviços.” Acrescentando ainda que conhecimentos e habilidades aplicadas na produção desses pacotes tecnológicos constituem a capacitação tecnológica. O crescente avanço das tecnologias nos diversos setores da sociedade tem causado nas pessoas uma nova maneira de pensar, agir, trabalhar, se relacionar, conhecer e se comunicar. Segundo Brito e Purificação (2006, p.24): Neste início de século, um rol de novos instrumentos é apresentado: são novas ferramentas que estão possibilitando transformações da sociedade, pois oferecem novas formas de conhecer, de fazer e talvez de criar. Dentro deste volume crescente de evoluções, pode-se observar que as tecnologias estão sendo cada vez mais inseridas no sistema produtivo. Assim, estruturas e modelos pelo qual o trabalho é executado estão apresentando modificações, no que se diz respeito ao trabalho de produção e ao trabalho de coordenação. No trabalho de produção, o trabalho físico é modificado pelo uso de máquinas e robôs, pela automação de processos e pelo uso de computadores para processar e controlar dados. O trabalho de coordenação torna-se mais efetivo com o ingresso das tecnologias, pelo aumento da capacidade de coletar, processar e transferir informações. Onde a velocidade na comunicação e a velocidade nas respostas apresentam-se maiores. Com estas mudanças, pode-se perceber ganhos na produtividade, através da eliminação de etapas no processo produtivo, facilidade no monitoramento dos processos da organização, aumento da comunicação e aumento do feedback interno, entre outros. O chamado comércio eletrônico (E-commerce) é mais um dos frutos deste crescimento da tecnologia. Teve seu surgimento no ano de 1995, nos Estados Unidos, com o website “Amazon.com”. No Brasil, o E-commerce ganhou evidência nos anos 2000, sendo até hoje, um dos meios mais procurados na hora de adquirir um novo produto ou serviço. Ele é um formato de varejo virtual, onde apresenta produtos e serviços, proporcionando a compra pelos consumidores finais. Ele engloba toda a atividade comercial que existe entre uma empresa, clientes e parceiros, por meio da internet. Segundo Ladeira (2000, p. 9): O varejo virtual vem como uma solução ao oferecer justamente conveniência, maior número de informações e de melhor qualidade e preços menores, entre outras diversas variáveis que podem influenciar e, por vezes, determinar a opção de compra virtual. Segundo a fundamentação teórica apresentada no trabalho, dentro do comércio eletrônico pode-se citar principais categorias: E-business: onde ocorre a menção da utilização das tecnologias e telecomunicações aplicadas a transações empresariais, oferecendo assim, produtos e serviços em estrutura virtual; Business-to-administration (B2A): engloba todas as transações executadas online entre as empresas e a Administração Pública; Business-to-business (B2B): transações de e-commerce por empresas; Business-to-consumer (B2C): transações de e-commerce realizadas entre empresas e o consumidor final; Consumer-to-administration (C2A): onde são abrangidas todas as transações eletrônicas executadas entre pessoas e a Administração Pública; Consumer-to-consumer (C2C): onde envolve negociações diretas entre os consumidores. Juntamente ao e-commerce tem-se o chamado Marketing Digital, o mesmo é incluído de certa forma no comércio eletrônico, de maneira natural, pois estas duas ferramentas são consequências do avanço das Tecnologias da Informação e Comunicação. A principal diferença entre o marketing digital e o marketing tradicional é que o primeiro utiliza tecnologias digitais e apresenta facilidade na criação de relacionamentos entre clientes e empresas, e o último é considerado massa de comunicação orientada. (ALKHATEEB et al. 2008). Desta forma, o objetivo deste trabalho é compreender a eficácia da aplicação do E-commerce e Marketing Digital, analisando-os no contexto da plataforma virtual iObras.com. A plataforma virtual deverá ser capaz de atingir seu público-alvo, e atrair clientes finais quando os mesmos estiverem à procura destes profissionais.",
    "Conclusão": "Com as Revisões Bibliográficas presentes neste trabalho, apontando os principais conceitos e características das evoluções das TIC’s, o chamado E-commerce e o Marketing Digital, pode-se concluir que o avanço das Tecnologias da Informação e Comunicação trouxe diversos benefícios para a vida das pessoas. Junto com os benefícios, as TIC’s mudaram setores sociais, econômicos e empresariais. O foco deste trabalho foi apresentar uma dessas ferramentas, o chamado E-commerce. O comércio eletrônico, principal foco desta pesquisa, proporciona comodidade na vida dos seres humanos, pois os mesmos têm a possibilidade de adquirir novos produtos ou serviços sem saírem de suas casas. Para melhor análise deste tema, foi feito um estudo de caso do site iObras.com, mostrando suas características e principais funções. O site iObras.com teve seu lançamento no final de dezembro de 2016 e tem como objetivo recomendar profissionais autônomos e empresas do setor de obras e reformas em geral. O iObras vende perfis para estes profissionais, que são divulgados no site, com o propósito de atingir seus clientes finais. Assim, pessoas que estiverem buscando mão de obra para reformas ou construções de casas, apartamentos, condomínios entre outros, ou buscando empresas atuantes neste setor, podem identificá-las facilmente utilizando o iObras.com. Foi analisado, em formato gráfico, o crescimento do primeiro trimestre desta plataforma virtual estudada, onde apresentou um crescimento expressivo. No seu primeiro mês (Janeiro) a plataforma apresentou 178 (cento e setenta e oito) profissionais inscritos. Já no mês de fevereiro, novas 136 pessoas entraram no site, atingindo um total de 314 (trezentos e quatorze) cadastros. No seu último mês (Março), outras 345 se cadastraram no iObras.com. Os números mostram assim, que o site iObras.com atingiu mais de 800 profissionais em seu primeiro trimestre no ano de 2017. Com estes dados apresentados, pode-se concluir que a plataforma virtual iObras.com possui grande aceitação no meio em que interage. A venda de perfis para a divulgação mostrou ser de grande interesse para os profissionais autônomos que buscam a divulgação de seu trabalho sendo, ao mesmo tempo, válido para empresas que atuam neste meio. Da mesma forma, chama a atenção os clientes finais, para os quais a ferramenta facilita a busca de profissionais e empresas do setor de obras e reformas. As sugestões para futuros trabalhos seria a realização de uma análise futura sobre o site Iobras.com, mostrando como se dá seu crescimento nos demais meses do ano de 2017, para diagnosticar se os acessos à plataforma continuarão crescendo. Outra proposta é a elaboração de um aplicativo do site para dispositivos móveis (como citado no tópico 4.3), ampliando as formas de comunicação com o cliente, tornando-a mais fácil. Assim os mesmos poderão ter todas as funcionalidades do aplicativo na palma da mão."
}