{
    "Autor": [
        "Juliano Oliveira de Almeida",
        "Rafael Cândido"
    ],
    "Título": "Memórias Digitais de Araranguá: Desenvolvimento de uma Aplicação Multimídia para Web do Museu Histórico de Araranguá",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Robson Rodrigues Lemos",
    "Coorientador(a)": "",
    "Resumo": "Atualmente, graças aos avanços tecnológicos e aos estudos das tecnologias da informação e comunicação, é possível utilizar ferramentas da área de museologia as quais contribuem para a disseminação e recuperação de documentos históricos. Afinal, a história deve ser preservada e os acervos documentais em papel não oferecem confiança de integridade a longo prazo, pois sofrem com a ação do tempo, além de outros problemas. Com este intuito o objetivo deste trabalho é desenvolver uma aplicação multimídia para Web do museu histórico de Araranguá, no qual seja possível disponibilizar o acervo de documentos e fotografias digitalizadas em grande escala, utilizando como base para o estudo um Totem Digital desenvolvido em projetos anteriores dentro do contexto do Laboratório de Mídia e Conhecimento (LabMídia) da UFSC (Araranguá). Na busca de mais informações sobre as imagens que representam as memórias virtuais de Araranguá, há uma necessidade de expansão, sendo necessário disponibilizar o acervo na Web, onde as pessoas podem obter informações e anotar suas contribuições na aplicação Web através do acompanhamento de um moderador como ocorre em conteúdos disponibilizados na plataforma Wikipédia. Para tal investigou-se os diferentes tipos de museus virtuais, as principais tecnologias utilizadas em museus virtuais e soluções tecnológicas para desenvolver a aplicação Web utilizando tecnologias open source. Ao final, os resultados deste trabalho estão disponibilizados para comunidade de Araranguá e ao redor do mundo, através da navegação e anotação de conteúdo de aproximadamente 8 mil documentos do acervo histórico do Museu de Araranguá, em uma aplicação multimídia para Web hospedada em um servidor do SETIC da UFSC a qual pode ser acessada através de um Web browser utilizando computadores desktop ou dispositivos móveis sensíveis ao toque, tais como notebooks, smartphones e tablets.",
    "Palavras-chave": [
        "Memórias Digitais",
        "Museu Virtual",
        "Acervo Digital",
        "Sistemas Multimídia",
        "Tecnologias da Informação e Comunicação",
        "Tecnologias Interativas na Educação",
        "Cultura Digital"
    ],
    "Introdução": "No atual cenário brasileiro, não é espantoso encontrar pessoas que não frequentam museus, ou que até mesmo nunca fizeram uma visita. Para muitos um museu serve apenas para guardar e mostrar coisas velhas, funcionando como um depósito de registros. Por essa péssima prática adotada por algumas pessoas, os museus não recebem o seu devido valor e normalmente não são caracterizados como um local de cultura e sabedoria. Uma pesquisa feita em janeiro de 2016 no Museu do Amanhã localizado no Rio de Janeiro teve como objetivo mapear o perfil dos seus visitantes, levantando dados como faixa etária, sexo e frequência de visitas. O resultado foi que, de 839 visitantes entrevistados, 32% não visitavam museus há mais de um ano, e 10% nunca haviam entrado em um museu. No museu histórico de Araranguá além do baixo número de visitas, algumas informações não são totalmente disponibilizadas ao visitante. Entre estas informações encontra-se cincos caixas contendo documentos e fotografias históricas da região. A falta de disponibilização deste material motivou Veloso (2015) junto a equipe de acadêmicos colaboradores do Laboratório de Mídia e Conhecimento (LabMídia) da UFSC a projetar um Totem Digital. O Totem Digital é composto pode um computador protegido por uma cabine, já que são direcionados ao uso externo. Possui uma tela para exibir as informações e pode ter teclados, joysticks a própria tela sensível ao toque. É um equipamento onde as pessoas podem visualizar os documentos e fotografias digitalizadas do acervo histórico do museu de Araranguá. Atualmente este equipamento está vinculado a UFSC e está fisicamente no campus Araranguá. Por ser grande e pesado a sua locomoção se torna difícil, o que diminui um pouco a frequência das suas demonstrações. Além disso, o hardware e o sistema operacional disponíveis atualmente no Totem Digital apresentam limitações por utilizarem uma tecnologia já defasada para os padrões de interação nos dias de hoje. A Figura 1 apresenta o Totem Digital do Museu Histórico de Araranguá. Apesar das inúmeras vantagens do Totem Digital do Museu Histórico de Araranguá, existem algumas desvantagens no projeto. A falta de mobilidade diminui as demonstrações, além da utilização ser possível por apenas um usuário por vez e a ausência da possibilidade de compartilhar as informações vistas. Por isso, a melhoria desses pontos resulta na maior disseminação do conhecimento e acesso de mais pessoas. Se por um lado, a produção de material histórico é crescente e as visitas a museus físicos têm sido menos frequentes, por outro, a internet tem modificado a forma de comunicação entre pessoas e instituições de todas as áreas. Assim, a internet “possibilitou um interagir de forma globalizada, alterando a noção de tempo e de espaço: na internet o museu nunca fecha” (SILVA; OLIVEIRA, 2007, p. 751). Em outras palavras, a internet trouxe para a museológica uma maior abrangência de público e interatividade através dos museus virtuais. Em relação ao conceito de museu virtual é preciso esclarecer que o museu virtual pode ter duas configurações: vertentes virtuais de determinado museu físico, ou seja, podem ser uma outra dimensão do museu físico (como o Sagres, por exemplo) ou museus essencialmente virtuais. Nesse caso, a existência de um museu virtual não pressupõe a existência de um museu físico. No primeiro caso, os museus virtuais são complementos do museu físico, pois podem trabalhar suas ações museológicas de forma diferente em suas duas vertentes (HENRIQUES, 2004, p. 68). De acordo com Schweibenz (2004) os museus virtuais podem ser divididos em três categorias: Museu Folheto, Museu de Conteúdo e Museu de Aprendizagem. O Museu Folheto apresenta informações básicas sobre o museu, com o objetivo de informar os visitantes sobre horários, localização e exposições em andamento. O Museu de Conteúdo apresenta o banco de dados do museu com informações técnicas, o que geralmente é mais útil para especialistas do que para leigos. Já o Museu de Aprendizagem oferece o acesso de acordo com o perfil do visitante, onde a informação é orientada ao contexto e não ao objeto. Afim de maximizar a disseminação das informações contidas nos documentos do Totem Digital do Museu Histórico de Araranguá, este trabalho visa a criação de uma versão Web deste acervo. Além de demonstrar todo o material disponível atualmente no Totem Digital, esta versão terá uma funcionalidade similar a plataforma Wikipédia, onde os visitantes poderão contribuir na construção e descrição do documento que está sendo visualizado através da participação de um moderador. A ideia é levar o acesso à informação para o maior número de pessoas possível, haja vista que a limitação geográfica não é um problema. Além disso, a interface deve ser intuitiva e de fácil entendimento, para ser acessado por diversos perfis de visitantes, dos iniciantes aos experientes em tecnologias de modo geral.",
    "Conclusão": "Os estudos das tecnologias da informação e comunicação possibilitam a criação ou a melhoria de inúmeras ferramentas que contribuem com a sociedade. A disponibilização online do acervo digital do museu histórico de Araranguá o torna mais atrativo e desperta o interesse das pessoas em conhecer mais sobre os documentos e imagens históricas e também sobre outros elementos que podem ser encontrados no museu. Os avanços tecnológicos contribuem para que a disseminação da informação se torne cada vez mais comum. Por ser uma página Web, em poucos segundos um link pode ser compartilhado em redes sociais, sites, entre outros. Assim, as pessoas podem acessar e utilizar a aplicação simultaneamente, de qualquer lugar do mundo e em qualquer horário. A sociedade precisa conhecer e dar valor aos fatos acontecidos, desde problemas passados, evoluções, relações, etc. Analisar como as coisas mudam, como foram construídas ou destruídas, ampliando assim sua noção temporal e consequentemente a visão de como poderá ser o futuro. Existem possíveis funcionalidades que podem ser criadas em trabalhos futuros para a aplicação Web Memórias Digitais de Araranguá. O primeiro é o CRUD, que é a inclusão, alteração e remoção dos documentos e imagens, de forma que novos documentos e imagens da região possam ser inseridos na aplicação por um moderador ou uma pessoa responsável. O segundo é um filtro avançado, onde pode ser possível fazer uma filtragem de todas as informações da aplicação, desde informações fixas como o código das imagens, e categorias no estilo checkbox, até as informações dinâmicas que são alimentadas pelos usuários, por exemplo, as imagens onde os usuários realizaram anotações e identificaram uma pessoa específica presente na imagem histórica. Este projeto abre inúmeras possibilidades de trabalhos e estudos futuros. O material disponibilizado na aplicação Web e as informações que serão recebidas podem ser utilizadas em diferentes cenários. Como exemplo, um material adicional em sala de aula em matérias como história e sociologia. Demonstrações em dias culturais e eventos públicos, assim maximizando o número de acesso e a quantidade de novas informações recebidas para aplicação Web Memórias Digitais de Araranguá."
}