{
    "Autor": "Mauro Moraes Sá",
    "Título": "Um Jogo Para Aprender Sobre As Normas e Leis de Trânsito",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª Drª Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho apresenta o desenvolvimento de uma proposta de um jogo voltado para auxílio no processo de ensino-aprendizagem de leis de trânsito. A aprendizagem das leis de trânsito é obtida através do jogo Primeira Habilitação que não possui faixa etária, e segue o Código de Trânsito Brasileiro (CTB). O mercado de jogos tem um valor muito expressivo dentro do país, porém há falta da mão-de-obra especializada para produzir. Os jogos educacionais são uma das áreas das Tecnologias da Informação e Comunicação (TICs) que vem ganhando muito espaço, por ser uma ferramenta de ensino-aprendizagem, os professores que utilizam esta ferramenta notam que as crianças se divertem com os jogos educativos conseguindo resultados expressivos na área de educação. Este projeto foi aplicado com crianças do quarto ano e sétimo ano do ensino fundamental de uma escola pública de Araranguá e obtiveram-se resultados positivos, medidos por dois questionários que foram aplicados um antes e outro depois da aplicação do jogo.",
    "Palavras-chave": "Jogos, Educação, Tecnologia, Leis Trânsito.",
    "Introdução": "No mundo atual, não é difícil encontrar jogos digitais, os jogos podem ser encontrados nos principais aparelhos eletrônicos utilizados em nosso cotidiano como os smartphones, os notebooks, os vídeo games, os vídeos games portáteis. Os jogos digitais estão muito presentes no cotidiano de crianças e adultos como uma forma de lazer. O mercado brasileiro de games segundo o Instituto de Pesquisa de Mercado NewZoo (NEWZOO, 2014) indica que o Brasil é o décimo primeiro maior mercado de games no mundo em termos de faturamento, com cerca de “US$ 1,28 bilhão em 2014”. O Brasil vem ganhando valor como um dos grandes consumidores de jogos do mundo, com poucas empresas brasileiras que trabalham no desenvolvimento de jogos, isso torna um mercado atrativo para investidores no Brasil, mas para isso deve haver primeiro um investimento em universidades e cursos para gerar mão de obra qualificada no desenvolvimento de jogos. Outro mercado que está crescendo muito é o de jogos educativos, que tem como seu principal objetivo ensinar. Segundo um experimento realizado pelo jornal Molecular Psychiatry (MOLECULAR PSYCHIATRY, 2013), noticiado pelo Mashable (MASHABLE, 2013), onde fizeram adultos jogarem um jogo do gênero plataforma por 30 minutos ao dia durante dois meses. Como resultado deste experimento foi o aumento significativo da matéria cinzenta. Os estudos indicam que jogos auxiliam no desenvolvimento da educação, principalmente com crianças, porém depende muito do jogo que é aplicado e do objetivo desejado. Os jogos educativos estão se popularizando no Brasil, há diversos incentivos do governo na área, existem projetos em diversas áreas da educação, uma das áreas com maior problema é a de trânsito que segundo o ONSV em 2013 foram 42.266 mortes de trânsito. Outra área que causa problema é a de reprovação na prova do DETRAN de acordo com a pesquisadora Karol Carvalho (CARVALHO, 2012) “em Criciúma, de cada três alunos que fazem a prova, um é reprovado na prova do DETRAN. Em Florianópolis - SC, este índice chega a 50%”. O trânsito faz parte da vida de todos os cidadãos, porém parece haver uma preocupação com ele somente quando irá fazer a CNH. É necessário passar isso a crianças e adultos, e não somente a quem pretende dirigir. Através disso surgem os jogos digitais de trânsito que trazem uma abordagem diferente da vista em Autoescola, podendo ser usados para diversas faixas etárias, trazendo as leis e como se comportar no trânsito para pedestre e veículos. Com base nestes problemas, este presente trabalho propõe a criação de um jogo digital para ensinar sobre o trânsito e suas leis. Este jogo tem como base de dados perguntas e respostas adaptadas do CTB. No qual são aplicados no jogo de uma forma divertida fazendo com que o usuário aprenda através do jogo.",
    "Conclusão": "Neste trabalho foi criado o protótipo do jogo e realizada a aplicação do jogo PRIMEIRA HABILITAÇÃO em sala de aula com alunos do ensino fundamental de uma escola pública de Araranguá. As aplicações em sala tiveram uma boa aceitação pelos alunos, por aprender de uma maneira criativa e visual. Foi aplicada com turmas com idades menores para ressaltar a importância de aprender sobre o trânsito desde criança, pois muitas crianças desconhecem o perigo que é o trânsito e isso causa acidentes. As atividades propostas saíram como esperado, no primeiro questionário a maioria das crianças conseguiram responder a parte de lógica, e nas questões de trânsito foram apenas alguns alunos que responderam aleatoriamente e acertaram. No questionário após o jogo, houve um nítido avanço nas questões de trânsito, as crianças conseguiram acertar a maioria das questões sobre trânsito, já nas questões de lógica mantiveram os dados semelhantes. Com a aplicação do jogo foi obtido resultados melhor que o esperado, as crianças gostaram muito do jogo. Posteriormente às atividades, foi um pouco difícil recuperar a atenção delas, devido à empolgação com o jogo. Conclui-se que há falta de informação sobre o trânsito para crianças, e que o jogo Primeira Habilitação atendeu a proposta de ensinar sobre o trânsito, mesmo de forma lúdica permitindo o aprendizado sobre o trânsito brasileiro."
}