{
    "Autor": "Jeiel Miguel Lopes",
    "Título": "UM ESTUDO COMPARATIVO ENTRE BANCOS DE DADOS CONSIDERANDO AS ABORDAGENS RELACIONAL E ORIENTADA A GRAFO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": null,
    "Resumo": "Nos últimos anos, como reflexo do advento da tecnologia surgiu a necessidade de automatizar não somente a forma de persistir a informação, mas a capacidade de integrá-la de forma eficiente. Para atender esta demanda, por um longo período, o modelo relacional de bancos de dados se tornou predominante no mercado de software. Entretanto, por conta da expansão do conceito vindo da Web 2.0 em que novos dados são produzidos rapidamente, tem-se afirmado que o modelo relacional apresenta problemas no que tange a escalabilidade e tempos de resposta a consultas complexas. Visando atender a esta nova demanda a comunidade acadêmica passa a discutir novas soluções, entre elas o uso de modelos de bancos de dados orientados a grafo que permitam uma administração voltada não mais pela estrutura em si, mas com foco na informação e em seus relacionamentos. Os grafos podem ser aplicados em diversos cenários da vida real e sua representação em um modelo de banco de dados pode simplificar o gerenciamento da informação. Este trabalho vislumbra a utilização destes conceitos no domínio da Ciência Tecnologia e Inovação (CT&I), mais especificamente sobre a base de currículos da Plataforma Lattes. Para tal, foi elaborado um protótipo que após a integração de um conjunto de currículos em memória realiza a persistência nos dois modelos de dados objetos de estudo deste trabalho, o relacional e o orientado a grafo. De acordo com análises comparativas realizadas no cenário estabelecido para este trabalho em que há uma evolução temporal dos dados correlacionados, o banco de dados relacional apresentou desempenho superior quando considerada a individualidade da transação. Já o modelo orientado a grafo (através do banco de dados Neo4J) apresentou uma degradação no desempenho quando existe a necessidade de múltiplas e constantes escritas em disco. Por outro lado, quando os dados são mantidos em memória e a confirmação em disco é postergada, o Neo4j apresenta um desempenho superior na fase de correlação dos dados. Conclui-se que o modelo orientado a grafo tende a ser superior caso este possua disponibilidade de memória, enquanto que o relacional é mais indicado para aplicações que exijam acessos frequentes ao meio de armazenado físico.",
    "Palavras-chave": "Grafo; Banco de Dados; Plataforma Lattes; Gerenciamento de Informação.",
    "Introdução": "Nos últimos anos o incremento na capacidade de processamento computacional, a conectividade e o armazenamento de informações vem permitindo um avanço nas soluções providas pela Tecnologia da Informação (TI). Contudo, o início da área de Banco de Dados teve suas bases e origens em soluções simples ou pouco práticas para problemas impactantes nas rotinas organizacionais (BARROS, 2010). Considerando as áreas relacionadas ao processamento, ao armazenamento e a localização da informação, estas iniciam sua evolução no final da década de 1950. Neste período, Bar-Hillel desenvolveu sua teoria sobre a recuperação de informações (GRIER, 2012). De maneira concomitante as empresas começaram a reconhecer que os negócios empresariais de fato necessitavam de soluções para processar suas informações. De acordo com Grad (2012), na década de 1960 e início dos anos 1970, foram desenvolvidos os Sistemas de Gerenciamento de Banco de Dados (SGBD) em rede e hierárquicos que atenderam a demanda do mercado de softwares de mainframe, sendo fortemente utilizados e vendidos até os anos 1990 por algumas das maiores das empresas de software independentes, entre elas, a IBM® (International Business Machines). Ainda na década de 1970, Edgar Frank Codd, publicou um estudo sobre uma nova abordagem envolvendo a aplicação e criação dos conceitos de álgebra relacional (CODD, 1970). Posteriormente, Codd juntamente com a IBM® desenvolveu um SGBD com enfoque no modelo relacional que foi largamente difundido por três grandes corporações, IBM®, Oracle® e Ingres®, cujos elementos básicos são as relações (tabelas), as quais são compostas de linhas (tuplas) e colunas (atributos). Soma-se a isto a contribuição do trabalho de Donald Chamberlin, fundador da linguagem de programação dos SGBDs Relacionais (SGBDR), o SQL (Structured Query Language) (GRAD, 2012). Através da linguagem SQL é possível manipular bancos de dados de forma otimizada, sendo que os comandos desta linguagem podem ser classificados em três grandes categorias: as instruções DDL - Data Definition Language (Linguagem de Definição de Dados), DCL - Data Control Language (Linguagem de Controle de Dados); e DML - Data Manipulation Language (Linguagem de Manipulação de Dados) (RAMAKRISHNAN; GEHRKE, 2008). Os comandos de DCL são utilizados para conceder as permissões aos usuários sobre os objetos no banco de dados; os comandos DDL para criação de procedimentos, funções, tabelas, ou ainda a manutenção destes; e os comandos DML para execução de consultas e manipulação de dados na base, tais como os comandos insert, update, delete e select. O modelo de banco de dados desenvolvido por Codd marcou não somente o início de uma nova era, mas estabeleceu uma relação entre os aspectos de sistemas gerenciadores de bancos de dados relacionais e os conceitos gerais de um sistema de informação. De acordo com Grier (2012), os conceitos de Codd concentram-se em projetar bancos de dados relacionais eficazes e eficientes, como uma nova e poderosa forma de organizar as informações de um sistema de informação. Para William Marchant (1955 apud GRIER, 2012, p.12), manter os dados armazenados de forma organizada é parte relevante no processo de recuperação de informações com impacto no dia a dia das organizações. Marchant defendia que um sistema de informação, apesar de representar o progresso e a automatização dos processos empresariais, não iria retirar as pessoas do mercado de trabalho e sim otimizar o tempo e as rotinas organizacionais.",
    "Conclusão": "O objetivo geral deste trabalho foi realizar um estudo comparativo entre as abordagens de Banco de Dados Relacional e NoSQL considerando aspectos gerais de desempenho no que tange a população de dados. A partir do levantamento bibliográfico nas áreas de Banco de Dados com foco principal em Banco de Dados NoSQL buscou-se entender o domínio e o contexto do trabalho de forma que a partir deste conhecimento fosse possível implementar um protótipo capaz de mensurar dados quantitativos para atender o objetivo proposto. O protótipo proposto foi aplicado em um cenário real sobre as bases de dados Lattes do CNPq para realizar o mapeamento de frequência individual de termos e frequência conjunta (coocorrência) entre termos. Para a avaliação de desempenho foram realizados estudos com 10, 50 e 100 currículos cujo modelo de dados relacional foi baseado no trabalho desenvolvido por Sérgio (2013) e a partir deste, foi também modelada uma estrutura de dados orientada a grafo (NoSQL). Considerando a implementação do protótipo foi possível analisar a coleta de resultados estabelecendo parâmetros comparativos sobre o desempenho apresentado nas duas estruturas/modelos de dados estudados. O modelo de dados relacional apresentou um desempenho superior em comparação ao modelo de dados orientado a grafo (Neo4j) quando a implementação da carga de dados estabelecia o controle de persistência termo a termo. Apesar disto, percebe-se que com o aumento da carga o processo se tornava proporcionalmente mais lento no modelo orientado a grafo. O modelo de dados orientado a grafo mostrou-se muito eficiente somente quando o controle de persistência de dados foi realizado em grandes grupos de dados, diminuindo o acesso a disco e mantendo os dados em memória de forma que quanto maior o volume de dados submetido maior a vantagem percentual do grafo sobre o banco de dados relacional. Cabe salientar que apesar da aparente vantagem dos bancos de dados orientados a grafo para o segundo cenário isto exigiria, para uma base com milhões de currículos, uma capacidade considerável para armazenamento de dados em memória. Levando-se em conta o atual estágio atual tecnológico, tal cenário ainda constitui um desafio computacional. Apesar do atual desafio de se obter uma alta capacidade de armazenamento de dados em memória, o que pode comprometer também a durabilidade dos dados que é um dos pilares das características ACID, pode-se vislumbrar um futuro promissor tendo em vista as recentes descobertas/propostas de integração das tecnologias SSD à memória RAM. Exemplo dessa tecnologia vem sendo desenvolvida pela empresa Apacer® capaz de prover uma capacidade superior a 512 GB de memória com tendência de em breve alcançar o horizonte de 1 TB (CUNNINGHAM, 2014). Considerando estruturas distribuídas de alto desempenho, a capacidade de armazenar dados em memória com capacidade de persistência tende a crescer nos próximos anos. De modo geral, pode-se concluir que o modelo orientado a grafo apresenta desempenho superior para lidar com dados interconectados quando considerando a possibilidade de manter as informações em memória. No entanto, considerando as tecnologias computacionais disponíveis no mercado e com base nos resultados do estudo realizado pode-se considerar que o modelo de dados relacional ainda é uma estrutura extremamente eficiente e capaz de comportar problemas complexo. Por fim, vale mencionar que o avanço do conceito de bancos de dados em memória irá impactar positivamente em modelos relacionais e não relacionais. Durante o desenvolvimento deste trabalho e pensando em perspectivas de pesquisa foram vislumbrados alguns trabalhos futuros. Entre as possibilidades encontra-se a continuidade deste trabalho no que tange ao aumento no número de Currículos Lattes para alguns milhares. Para tal, seria necessária uma estrutura capaz de manter os dados em memória. Outra possibilidade reside na expansão da análise realizada neste trabalho comparando a abordagem relacional com outros modelos NoSQL. Inclui-se a isto a necessidade de avaliação de abordagens recentes classificadas como NewSQL que mesclam alta disponibilidade e escalabilidade com os requisitos de transacionais e de consistência dos dados. Por fim, estudos em diferentes domínios utilizando a abordagem orientada a grafo podem ser realizados. Entre estes domínios encontram-se a aplicação desse modelo em problemas que envolvam os conceitos de Web 2.0, tais como, os Sistemas de Recomendação. Mesmo em cenários de tomada de decisão mais clássicos, como análise e simulação de impactos econômicos, podem ser modelados como grafos."
}