{
    "Autor": "Julia Graziela Luciano",
    "Título": "O papel dos jogos digitais no ensino e aprendizagem na educação básica: Uma revisão de literatura",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Prof.(a) Giovani Lunardi, Dr.(a)",
    "Coorientador(a)": "Prof.(a) Marcus Vinicius, Dr.(a)",
    "Resumo": "Esta revisão de literatura investigou a produção bibliográfica brasileira entre 2014 e 2024 sobre o uso de jogos digitais no processo de ensino e aprendizagem na educação básica. A pesquisa mapeou artigos científicos nas bases de dados Scopus e Web of Science, buscando identificar o impacto do uso de tecnologias educacionais, em especial de jogos digitais, na educação básica. Os resultados revelaram um número limitado de estudos sobre o tema no Brasil, em comparação com outras regiões, como América do Norte e Europa. No entanto, os artigos selecionados destacaram o potencial dos jogos digitais para engajar os alunos, promover a aprendizagem ativa e facilitar a compreensão de conceitos complexos. A pesquisa também apontou para a necessidade de mais estudos sobre o impacto a longo prazo dos jogos digitais na educação básica e a importância da formação de professores para o uso efetivo dessas ferramentas. Espera-se que os resultados desta pesquisa contribuam para a compreensão do papel dos jogos digitais no processo de ensino e aprendizagem, identificando boas práticas, desafios e lacunas na sua utilização.",
    "Palavras-chave": "educação; aprendizagem; jogos digitais.",
    "Introdução": "A crescente presença da tecnologia na sociedade contemporânea tem impulsionado uma revolução em diversos setores, e a educação não é exceção. A era digital trouxe consigo novas ferramentas e abordagens pedagógicas, abrindo um leque de possibilidades para transformar a maneira como ensinamos e aprendemos. Entre essas ferramentas, os jogos digitais têm se destacado como um recurso promissor, capaz de engajar os alunos de forma lúdica e interativa, ao mesmo tempo em que promovem o desenvolvimento de habilidades essenciais para o século XXI. A Geração atual, nascida em meio à explosão tecnológica, apresenta características únicas que a diferenciam das gerações anteriores. Nativos digitais, esses jovens cresceram imersos em um mundo de interatividade, conectividade e instantaneidade. Seus cérebros foram moldados pela exposição constante a estímulos visuais e sonoros, pela busca por recompensas imediatas e pela necessidade de se conectar com outras pessoas através de plataformas digitais. Nesse contexto, os jogos digitais se apresentam como uma linguagem natural para essa geração, capaz de despertar seu interesse e motivá-los a aprender de forma autônoma e colaborativa. No entanto, a utilização de jogos digitais na educação básica ainda é um campo em construção, com desafios e potencialidades a serem explorados. A falta de formação adequada dos professores, a resistência de alguns educadores em relação ao uso de tecnologias na sala de aula e a dificuldade de integrar os jogos ao currículo escolar de forma significativa são alguns dos obstáculos a serem superados. Por outro lado, as pesquisas na área têm demonstrado que os jogos digitais, quando utilizados de forma planejada e intencional, podem ter um impacto positivo no desenvolvimento de habilidades cognitivas, como resolução de problemas, pensamento crítico e criatividade, além de habilidades socioemocionais, como colaboração, comunicação e empatia. Esta pesquisa propõe investigar o papel dos jogos digitais no ensino e aprendizagem na educação básica, através de uma revisão de literatura. O objetivo é mapear e analisar a produção científica sobre o tema, buscando identificar as principais tendências, desafios e lacunas na utilização de jogos digitais nesse contexto. Além disso, a pesquisa busca compreender o potencial dos jogos digitais para o desenvolvimento de habilidades cognitivas e socioemocionais dos alunos, bem como sua integração ao currículo escolar, alinhando-se à quinta competência da Base Nacional Comum Curricular (BNCC), que trata da cultura digital.",
    "Conclusão": "Em síntese, os artigos analisados nesta revisão de literatura convergem para a importância dos jogos digitais como ferramentas pedagógicas promissoras na educação básica, alinhados à quinta competência da BNCC, que trata da cultura digital. As pesquisas destacam o potencial dos jogos para engajar os alunos, promover a aprendizagem ativa e facilitar a compreensão de conceitos complexos através de experiências lúdicas e interativas. O estudo de Castro-Bissacco et al. (2014) demonstrou a eficácia de um ambiente virtual com jogos no desenvolvimento de habilidades matemáticas em crianças com discalculia, enquanto Oliveira et al. (2022) exploraram os efeitos positivos da gamificação personalizada na motivação e no prazer dos alunos. Tecnologias como a realidade aumentada (RA), explorada por Sobrinho Junior e Mesquita (2023), e a inteligência artificial (IA), abordada por Bittencourt et al. (2023), emergem como ferramentas complementares aos jogos digitais, com potencial para enriquecer ainda mais a experiência de aprendizado. A RA, por exemplo, pode criar interfaces interativas que integram o conteúdo do livro didático com elementos virtuais, tornando o aprendizado mais imersivo e engajador. Já a IA pode ser utilizada para personalizar a experiência de jogo de acordo com as necessidades e o ritmo de cada aluno, otimizando o processo de aprendizagem. No entanto, a utilização eficaz de jogos digitais na educação básica ainda enfrenta desafios significativos. A necessidade de formação adequada para os professores, que muitas vezes não se sentem preparados para utilizar essas ferramentas em sala de aula, é um obstáculo importante. Além disso, a criação de jogos que atendam às especificidades do contexto educacional brasileiro e a garantia de acesso equitativo à tecnologia para todos os alunos são desafios cruciais. Outro ponto importante a ser considerado é a necessidade de equilibrar o conteúdo educativo com a diversão nos jogos, como apontado por Sobrinho Junior e Mesquita (2023). A ludicidade é um elemento fundamental para o engajamento dos alunos, mas é preciso garantir que os jogos também transmitam conhecimentos e habilidades relevantes para o currículo escolar. Este estudo reforça a importância de um olhar crítico e reflexivo sobre o uso de jogos digitais na educação básica. É preciso ir além do entusiasmo inicial e investigar de forma rigorosa os impactos dessas ferramentas no processo de ensino e aprendizagem, a fim de garantir que seu potencial seja aproveitado ao máximo em benefício dos alunos. Este trabalho explorou o potencial dos jogos digitais como ferramentas de aprendizagem, abrindo caminho para diversas pesquisas futuras na área de tecnologia educacional. Uma possibilidade é investigar o impacto de diferentes gêneros de jogos no aprendizado, explorando como elementos específicos de cada gênero podem ser utilizados para promover o desenvolvimento de habilidades cognitivas, socioemocionais e motoras. Outra linha promissora é o estudo da personalização de jogos educacionais, adaptando-os às necessidades e preferências individuais dos alunos, maximizando o engajamento e a eficácia da aprendizagem. Além disso, pesquisas futuras podem se concentrar na integração de tecnologias emergentes, como realidade virtual e aumentada, em jogos educacionais, criando experiências imersivas e interativas que potencializem a aprendizagem. A análise do impacto da inteligência artificial na criação de jogos adaptativos e personalizados também se apresenta como um campo de pesquisa relevante. Por fim, é crucial investigar a efetividade dos jogos digitais em diferentes contextos educacionais, como escolas públicas e privadas, ensino superior e educação corporativa. A análise de como os jogos podem ser utilizados para promover a inclusão e a acessibilidade de alunos com necessidades especiais também é fundamental. Em suma, o futuro da tecnologia educacional é promissor e a pesquisa contínua nessa área é essencial para garantir que as ferramentas digitais sejam utilizadas de forma eficaz para promover o aprendizado e o desenvolvimento humano."
}