{
    "Autor": "Leonardo Daitx de Bitencourt",
    "Título": "UM SISTEMA VOLTADO À INDEXAÇÃO E RECUPERAÇÃO DE INFORMAÇÃO INTEGRADO À ONTOLOGIA",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": null,
    "Resumo": "O aumento da quantidade de informação disponibilizada tanto na internet quanto nas organizações geram desafios, principalmente se considerado a a questão de como recuperar conteúdo relevante. Muitas instituições necessitam de métodos de recuperação de informação aprimorados tendo em vista que a informação tornou-se um recurso essencial e o uso adequado desta é de suma importância em cenários competitivos. Além da questão da utilidade da informação, menciona-se como desafio a própria evolução dos motores de busca uma vez que, para satisfazerem requisitos cada vez mais complexos torna-se necessário a utilização de semântica. Para viabilizar essa evolução, cada documento pertencente a determinado corpus necessita ter seus principais conceitos e os seus relacionamentos identificados e armazenados em estruturas adequadas. Entre essas estruturas encontram-se os índices invertidos, para a realização de buscas textuais, e as ontologias, visando a capacidade de realização de inferências. Neste sentido, o presente trabalho apresenta uma proposição de integração das áreas de Recuperação de Informação e Ontologia. Para a avaliação da proposição realizada neste trabalho desenvolveu-se um protótipo e em que este foi aplicado sobre uma base exemplo contendo artigos da área de Ontologia. Visando garantir que o usuário tenha uma visão integrada da informação, o protótipo realiza consultas em duas bases (índice textual e ontologia) de forma coordenada e demonstra de forma mais abrangente as informações que compõem o contexto de consulta por ele informado. Considerando os objetivos do trabalho e analisando os resultados da integração das informações pode-se concluir que o trabalho os cumpre, pois se acredita que o mesmo seja capaz de fornecer informações que contribuem para que o usuário obtenha um entendimento mais completo de determinado domínio de interesse de maneira interativa e iterativa.",
    "Palavras-chave": [
        "Ontologia",
        "Indexação",
        "Recuperação de Informação",
        "Busca Semântica"
    ],
    "Introdução": "A popularização das tecnologias da informação e comunicação vem contribuindo diretamente para o aumento expressivo de conteúdo informacional de forma estruturada e não estruturada. O fator determinante para o armazenamento de grande quantidade de informação se deve aos avanços do poder computacional de armazenamento e processamento de dados. Por outro lado, o crescimento progressivo e intenso de informação desencadeia a necessidade de novas de técnicas para armazenamento organizado dos dados visando permitir acesso rápido e coerente a um determinado conteúdo. Bovo (2011) afirma que uma das vantage ns de informações em demasia são as oportunidades que o seu uso adequado pode propiciar às pessoas para a tomada de decisões. Isto gera desafios em como armazenar, recuperar, e transformar essa informação em conhecimento. Neste sentido, possuir capacidade de armazenamento e meios eficientes de lidar com a informação torna-se crucial para facilitar processos de tomada de decisão nas organizações. Segundo Hilbert (2011) em 2007, a humanidade já contava com recursos computacionais capazes de armazenar 2,9 x 10^20 bytes, comunicar quase 2 x 10^21 bytes e realizar 6,4 x 10^18 instruções por segundo em computadores de uso geral e estimativas revelam que no mesmo ano 94% da informação armazenada era digital. Em 2002 mais de 500 milhões de pessoas já acessavam cerca de 3 bilhões de documentos na Web diariamente (FENSEL, 2002). Conforme Ceci (2010), grande parte dos dados que as organizações possuem estão disponíveis na forma textual e eletrônica, cujo conteúdo se refere a informações e ativos de conhecimento como redes de relacionamento, competências e dados que auxiliam na tomada de decisões e permitem a criação de bases de conhecimento. Contudo, para uma organização somente o conhecimento não gera lucro, ele só se concretiza com a tomada de ações efetivas (HEBELER; VAN DOREN, 1997). O conhecimento é visto como parte tão fundamental que segundo Nurmi (1998), é aceito como o quarto fator de produção, juntamente com terra, trabalho e capital, tamanha é a sua importância e apesar da produção em massa superar o conhecimento em volume de negócios, este tem um potencial maior em termos de desenvolvimento. Dessa forma, segundo Cao, Li e Gao (2009), a agregação de recursos de tecnologia da informação no dia a dia das pessoas promove cada vez mais facilidades para se produzir conteúdo. Por outro lado, gera desafios, pois se tornam necessários métodos computacionais apropriados para que o ser humano seja capaz de extrair conhecimentos relevantes das bases de dados, ainda mais por que a informação pode estar fragmentada em diferentes bases de dados, e a busca manual de conteúdo se constituiria em perdas de recursos para a organização. Informações textuais na Web estão basicamente na forma de artigos científicos e páginas Web, mas trabalhos acadêmicos estão em menor número, enquanto que as páginas Web se proliferam sem controle de qualidade ou custos de publicação (PAGE et al., 1998). Por essas razões, os sistemas de recuperação de informação devem ser capazes de possibilitar buscas em grandes quantidades de informações de maneira adequada, visto que a falta de uniformidade nos dados fornecidos por documentos é um problema para aplicações que precisem navegar no seu conteúdo. Para Hogan et al. (2011), na perspectiva do usuário os mecanismos de busca atuais estão longe de ser a solução consumada para pesquisas na Web. O autor se justifica ao afirmar que o motivo disso é a falta de respostas diretas a perguntas, em que o resultado é sempre uma seleção de documentos a partir da Web. Afirma ainda que recentemente o Google ™ vem oferecendo respostas diretas a determinados modelos comuns de perguntas como “Quanto é 100 dólares em reais?” ou “Quanto é 200 vezes 3700?”, mas essa funcionalidade é restrita a um pequeno subconjunto de consultas. Existem meios de permitir maior capacidade de consulta com maior relevância às respostas a partir da aplicação de semântica em sistemas de recuperação de informação. Uma dessas maneiras é por meio da representação do conhecimento utilizando-se de ontologias. Ontologia é uma tecnologia chave para permitir processamento de informação orientada a semântica, e é estimado que a próxima geração de sistemas de gerenciamento da informação vá contar com modelos conceituais na forma de ontologia (MAEDCHE et al., 2003). Neste sentido, representam a organização do contexto de um domínio do conhecimento codificado computacionalmente. Sua definição e utilização serão detalhadas no Capítulo 3. Contudo, preencher uma ontologia e mantê-la atualizada pode representar um desafio. De certo modo, torna-se necessário a utilização de estratégias que permitam extrair a semântica dos documentos visando manter a ontologia e, consequentemente, os sistemas que dela dependem atualizados. A extração significa em si possibilitar a anotação de conceitos e relacionamentos entre estes conceitos diretamente no texto, ou seja, possibilitar a anotação semântica. A anotação semântica de documentos se faz uma técnica crucial para permitir a partilha de informação, troca de conhecimento e maior fidelidade em resultados obtidos da consulta a documentos. Essa técnica define formalmente o conteúdo de textos, o que torna possível a maior precisão e relevância da informação retornada (ZHANG; SHEN, 2009) e adiciona informações para que agentes de software possam atuar sobre seus campos. Entretanto, é ainda um processo muito manual, pois a anotação semântica semi automática não é capaz de realizar classificação com grande precisão (PIPITONE; PIRRONE, 2012).",
    "Conclusão": "O objetivo geral desse trabalho foi apresentar um sistema que possibilitasse aplicar semântica aos motores de busca. A partir da análise dos sistemas de recuperação mais utilizados foram buscadas referências para entender o funcionamento destes e sua evolução. Com base nos dados obtidos foi possível realizar estudos e avaliações para definir as possibilidades de construção de um protótipo que permita a adição de conteúdo complementar ao disponível no corpus, ou seja, a semântica. Atualmente, se um usuário deseja conhecer melhor autores de uma determinada área, este deve realizar um processo de pesquisa que poderá ser demorado quando considerado o modelo atual dos mecanismos de busca. Necessitará assim, de um período de reconhecimento para saber quais autores são mais mencionados em textos da área. Neste sentido, o protótipo desenvolvido pode ser visto como um facilitador, uma vez que o usuário pode-se utilizar de caminhos alternativos para analisar e, possivelmente, entender o contexto de determinados autores. O processo de busca por documento com assuntos relevantes também ficou facilitado. Os meios de determinar relacionamento entre documentos através de assuntos ou autores contribuem para que o usuário tenha um melhor proveito de suas pesquisas. Quanto ao funcionamento geral, o protótipo demonstra potencial no que tange o entendimento de determinado domínio, sendo este o foco principal do trabalho. A análise do desempenho em relação ao tempo de consulta tanto no índice quanto na ontologia não é relevante neste trabalho, pois o índice textual e a ontologia são pequenos. Neste sentido, as APIs OWL e Lucene, corresponderam de maneira satisfatória no provimento de um mecanismo de busca e um mecanismo de representação de conhecimento e inferência. Apesar disto, escolhas foram tomadas durante o processo de construção do protótipo quando sua composição lógica e física ainda não estava efetivamente consolidada. A primeira delas refere-se ao processo de anotação semântica automatizada. Em função da complexidade desse processo, seria requerida a utilização de técnicas de Processamento de Linguagem Natural, o que vai além do escopo do trabalho. Dessa forma a anotação semântica e a ontologia foram preenchidas manualmente considerando os documentos selecionados na Plataforma Science Direct. Existem ainda possibilidades de se aprimorar a forma de indexação textual, entretanto, durante a construção do protótipo foi utilizada uma versão do Lucene (3.0.3) que não é capaz de indexar subcampos, o que permite a composição de estrutura hierárquica em cada campo. Atualmente, toda a informação, ainda que tenha hierarquia, deve ser concatenada em um mesmo campo o que em muitos casos pode misturar os conteúdos promovendo um resultado errôneo em uma busca. Para o protótipo isto seria de grande auxílio, pois todas as informações afirmadas ou inferidas que constam na ontologia poderiam residir em subcampos do índice, aumentando o desempenho das consultas se considerados grandes índices. É importante mencionar que outra limitação existente é que as consultas quando submetidas à ontologia devem ser realizadas com termos na mesma forma em que foram armazenados, além disso, as buscas realizadas na ontologia são processadas de maneira sequencial, em que todos os indivíduos são inspecionados. Uma ontologia em si não possui uma estrutura de índice, contudo, isso poderia ser resolvido por meio da integração da ontologia em um índice textual como discutido anteriormente, ou mesmo, em bancos de dados específicos para este fim. Durante o desenvolvimento do trabalho outras possibilidades foram vislumbradas como trabalhos futuros. Entre estas possibilidades menciona-se o desenvolvimento de uma interface que permita a integração, tanto da sistemática de navegação discutida neste trabalho quanto à utilização de grafos para a apresentação das informações. Além disso, a adição de técnicas de análise de rede pode facilitar em muito a compreensão em como indivíduos de determinado domínio do conhecimento se interconectam. Desta forma, o usuário poderia encontrar autores de referência em alguma área muito mais facilmente do que navegar manualmente nas informações para identificar quais destes possuem maior influência em determinada área. Pode-se vislumbrar ainda o desenvolvimento de um sistema de anotação semântica capaz de extrair padrões relevantes de determinado documento (chamados de entidades) e os relacionamentos entre estes. Estas informações poderiam ser atribuídas diretamente à ontologia reduzindo o esforço operacional em mantê-la atualizada. Entretanto, vale mencionar que, apesar da evolução dos métodos e técnicas na área de extração de informação, a participação de um especialista em determinado domínio do conhecimento para realizar possíveis correções e evoluções em uma ontologia é fundamental."
}