{
    "Autor": [
        "Cristiano Santos Pereira de Abreu",
        "Tiago Jampietro Bastos"
    ],
    "Título": "AUTOMAÇÃO DE ABRIGOS DE CULTIVOS PARA CULTURAS HIDROPÔNICAS",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Anderson Luiz Fernandes Perez",
    "Coorientador(a)": null,
    "Resumo": "Um abrigo de cultivo hidropônico é um ambiente protegido, empregado como uma solução adotada na agricultura que visa proteger a cultura das intempéries da natureza em relação ao cultivo convencional em solo ou em céu aberto. Entretanto, todo o controle do abrigo, que é necessário para o melhor desenvolvimento da cultura, é executado manualmente ou semiautomaticamente, através de instrumentos como termo-higrômetros, sistema de sombreamento e ventilação. Este trabalho propõe o desenvolvimento de um sistema para automação de abrigos de cultivos, baseado na coleta das condições climáticas do ambiente tais como luminosidade, temperatura e umidade através de sensores instalados no interior do abrigo.\nPalavras-chave: automação agroindustrial, computação embarcada, hidroponia, abrigos de cultivo.",
    "Palavras-chave": [
        "automaçao agroindustrial",
        "computação embarcada",
        "hidroponia",
        "abrigos de cultivo"
    ],
    "Introdução": "No Brasil grande parte do cultivo agrícola é feito em cultivares direto no solo sem nenhum tipo de proteção contra intempéries. Porém, esta prática apresenta desvantagens quando se trata de clima, uma vez que a safra pode ser perdida por uma baixa temperatura, por exemplo. Como alternativa a essa prática o cultivo agrícola em ambientes protegidos, como estufas ou abrigos de cultivo, possibilita um melhor desenvolvimento das plantas, aumento na produtividade, colheita em períodos de entressafra e menor incidência de pragas e doenças. A hidroponia vem se popularizando no Brasil como alternativa ao cultivo tradicional em solo, isso se dá por ser uma alternativa menos trabalhoso e mais produtiva. Este tipo de cultivo apresenta diversas vantagens em relação ao cultivo tradicional, tais como maior produtividade, aumento na proteção contra doenças, pragas e insetos, economia em até 70% no uso de água em relação à agricultura tradicional, possibilidade de plantio fora de época entre outras. O cultivo hidropônico está diretamente ligado ao cultivo em ambientes protegidos, uma vez que por se tratar de uma forma de cultivo sem solo e sua solução de nutrição não possa sofrer contaminação de chuva, por exemplo, o uso de um abrigo de cultivo se torna necessário. Porém, o cultivo em abrigos é mais complicado, exigindo mais experiência do produtor no manejo do abrigo. O manejo pode ser entendido como o gerenciamento de fatores que influenciam no crescimento e desenvolvimento das plantas, com o uso de instrumentos de controle de um abrigo, tais como uma janela, ventiladores, exaustores, cobertura de sombreamento, irrigação etc. O presente trabalho propõe o desenvolvimento de um sistema de controle para abrigos de cultivo, a fim de facilitar e aumentar a produção de pequenos produtores.",
    "Conclusão": "Abrigos de cultivos são alternativas adotadas por produtores agrícolas para um melhor controle sobre as doenças e pragas, aceleração do desenvolvimento da cultura, produção nas entressafras, controle das condições climáticas dentro do abrigo entre outras vantagens. O controle das condições internas de um abrigo necessitam de um monitoramento constante, a fim de fornecer as condições ideais para o crescimento do cultivo. É muito comum que este controle seja feito manualmente demandando tempo e dedicação. O presente trabalho apresentou um sistema eletrônico para automação de abrigos de cultivos voltados para hidroponia, como alternativa ao manejo convencional, permitindo que as condições climáticas no interior do abrigo sejam constantemente monitoradas e registradas, proporcionando geração de gráficos, visualização do histórico de leitura do sensoriamento, operando para manter o abrigo nas melhores condições para o cultivo presente de acordo com a configuração estabelecida pelo usuário. Para comprovar a eficiência do sistema desenvolvido, foram realizados testes experimentais, inicialmente para verificar se as leituras realizadas pelos sensores estavam de acordo com o esperado e, em seguida, os testes foram executados em um mini abrigo de cultivos, concebido para simular um abrigo real, onde as condições climáticas foram alteradas diversas vezes para analisar o comportamento do sistema. A partir dos testes realizados pode-se afirmar que o sistema se mostrou robusto e respondeu conforme o esperado diante das situações impostas, realizando todas as tarefas de acordo com as configurações definidas, automatizando o abrigo de cultivo, cumprindo o objetivo proposto no trabalho."
}