{
    "Autor": "Álvaro William da Conceição",
    "Título": "Um sistema voltado ao armazenamento e recuperação de conteúdo textual de diferentes contextos",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": "",
    "Resumo": "Atualmente a quantidade de informação gerada cresce exponencialmente, sendo que uma quantia significativa de informações encontra-se em formato não estruturado, ou seja, textos. Com o grande volume de informações disponíveis, seja na web ou mesmo nas organizações, coletar e disponibilizar essas informações constitui-se em um desafio computacional. Superando os obstáculos, a área de Recuperação de Informação (RI) pode constituir uma importante ferramenta para a integração e a disponibilização de conteúdo. Neste sentido, surgem os Sistemas de Recuperação de Informação (SRIs) que promovem meios de se localizar documentos ou informações dentro de documentos através de uma solicitação do usuário. Esses documentos podem estar disponíveis na Web ou em uma organização. Com esse pressuposto é apresentado neste trabalho um Sistema de Recuperação de Informação visando o armazenamento de conteúdos textuais com diferentes contextos. Propondo atingir esse objetivo, o trabalho baseia-se na definição das visões lógica e física com a capacidade de suportar o desenvolvimento de um sistema que possibilite a recuperação de documentos textuais. A demonstração de viabilidade é realizada através da implementação de um protótipo que possui os serviços de indexação e consulta. A aplicação do protótipo em um cenário permitiu demonstrar que o sistema proposto é capaz de obter resultados consistentes e satisfatórios, tanto para a indexação quanto para a consulta de documentos.",
    "Palavras-chave": "Recuperação de Informação; Sistema de Recuperação de Informação; Modelo Vetorial; Índice Invertido.",
    "Introdução": "Nos últimos anos, vem sendo observado um crescimento na quantidade de informação tanto na web quanto nas organizações. Lyman (2003) afirma que isso tem ocorrido em escala exponencial. Segundo Bovo (2011), tal situação se deve, principalmente, aos avanços nas tecnologias da informação e comunicação que permitem não somente lidar com esse aumento, mas também tornar as informações cada vez mais acessíveis. Mesmo antes do advento da internet já era possível perceber um grande aumento na quantidade de informação em diferentes áreas acadêmicas e mesmo nas organizações em geral. Segundo Himma (2007), já em 1987 a quantidade de informação técnica e/ou científica dobrava a cada 5 a 15 anos. Exemplo disso é a base MEDLINE, um banco de dados bibliográfico com artigos científicos publicados nas áreas de ciências biomédicas (medicina, farmácia, etc.), que contém mais 221 milhões de registros. Lyman (2003) afirmava que o mundo estaria produzindo entre um e dois exabytes de informação em um único ano, ou seja, cerca de 250 megabytes por cada pessoa na terra. Outro aspecto que chama a atenção foi relatado por Hilbert e Lopez (2011), em que estes afirmam que a informação armazenada globalmente tem um aumento anual de 23%. Contudo, a capacidade da humanidade em agregar/incorporar essa informação para si própria é de apenas 6%. A isso se somam as informações das organizações disponíveis como relatórios técnicos, manuais sobre procedimentos e/ou softwares, registros de sugestões/reclamações de clientes, entre outros. Com isso surgem duas situações: a primeira se refere à interferência da informação no processo de tomada de decisão, uma vez que se torna difícil agir com grandes quantidades de informação, muitas vezes dispersas. A segunda é mais estruturante, pois surgem problemas no estabelecimento de soluções definitivas em como localizar, armazenar e disponibilizar essa informação de maneira fácil e rápida. (BEPPLER, 2008). Segundo Ren e Bracewell (2009), nas décadas de 60 e 70, os computadores começaram a ter poder de processamento suficiente para lidar com a recuperação da informação e ter resultados satisfatórios. Com o início da Internet, a área de Recuperação de Informação (RI) tornou-se cada vez mais relevante e pesquisada. Atualmente, tornou-se comum que pessoas com a necessidade de localizar determinada informação na web se utilize de sistemas de recuperação de informação (motores de busca), como por exemplo, o Google ™ e o Bing ™. Esse cenário é também cada vez mais comum dentro das organizações com a implantação e utilização de sistemas de busca corporativa. A busca corporativa (Enterprise Search) nada mais é que um sistema de recuperação de informação dentro de uma empresa. No entanto, os colaboradores das empresas vêm criando expectativas devido à eficácia de suas experiências satisfatórias em motores de busca na Web. Neste sentido, essa ferramenta está tornando-se cada vez mais importante devido à necessidade de manipulação de grande quantidade de dados no contexto empresarial. (THROOP, 2006; DEMARTINI, 2007). Com o objetivo de prover Sistemas de Recuperação de Informação (SRIs) adequados surgem três desafios principais sendo: a) a capacidade de armazenar documentos com estruturas diferenciadas; b) a possibilidade de integrar informações estruturadas (vindas de bancos de dados relacionais, por exemplo) e não estruturadas (documentos em geral); c) a capacidade de interpretar adequadamente consultas realizadas por usuários e a partir disso recuperar documentos que sejam de interesse desses usuários. Segundo Manning (2009), a Recuperação de Informação objetiva facilitar o acesso aos documentos de maior relevância conforme a necessidade de informação do usuário, em que, essa necessidade é, normalmente, expressa por meio de uma consulta a qual se utiliza palavras-chave. A recuperação de informação nesse contexto consiste basicamente na determinação de quais documentos de uma coleção contêm as palavras-chave da consulta realizada pelo usuário. A dificuldade está não somente em localizar os documentos, mas também em decidir a sua relevância.",
    "Conclusão": "Este trabalho teve como objetivo geral o desenvolvimento de um sistema computacional que possibilita o armazenamento de informação estruturada e não estruturada de diferentes domínios. Esse objetivo foi viabilizado com o estudo de frameworks e soluções para recuperação de informação, e toda a pesquisa bibliográfica que abrange os conceitos que guiaram a implementação de um sistema de recuperação de informação. Com o uso dos conceitos obtidos por meio da revisão bibliográfica, foi proposto um sistema de recuperação de informação com o armazenamento flexível de conteúdo textual. Sendo assim, o sistema proposto foi dividido em duas partes, sendo a primeira, a visão lógica e a segunda, a visão física. A visão lógica promove uma explicação geral das funcionalidades do sistema explicando o funcionamento dos processos de coleta de dados, os tipos de indexação, os serviços de consulta e indexação e a aplicação cliente. Por outro lado, a visão física promove a explicação das funcionalidades do sistema com ênfase no detalhamento dos componentes tecnológicos utilizados nos serviços de consulta e indexação com a aplicação. Com o intuito de validar os conceitos utilizados no trabalho foi desenvolvido um protótipo tendo como componente principal o framework Lucene. O protótipo possui basicamente dois serviços, sendo um voltado à indexação de documentos (conteúdo textual) e outro voltado à consulta. A interação com os serviços, indexação e consulta, acontece por meio de mensagens configuradas utilizando-se o padrão JSON. No que tange ao serviço de consulta este exige, além da requisição, um retorno que é configurado através do padrão XML. O retorno de uma consulta devolve todos os documentos que satisfazem determinado interesse de busca informado por um usuário, bem como, algumas informações adicionais que podem ser utilizadas em uma camada de apresentação. Por meio da implementação do protótipo, foi possível verificar a flexibilidade e do framework Lucene na constituição de soluções para a área de recuperação de informação. Isto vale tanto para a indexação, de modo que cada documento (vetor) armazenado no índice não necessita possuir a mesma estrutura, quanto para a consulta, em que múltiplas possibilidades estão disponíveis. No Capítulo 4 foram apresentadas quatro possibilidades de consultas, mas são possíveis várias outras, entre elas, a busca de conteúdo aproximado e a indicação de pesos em cada um dos termos da consulta. A primeira consulta procura encontrar, a partir dos termos indicados, quais documentos possuem termos iguais ou similares. Isto é interessante, pois a escrita de um documento pode conter pequenos erros e, considerando esta abordagem, o mesmo seria recuperado. Já a indicação de pesos é interessante quando se deseja aumentar a relevância de determinado termo da consulta, uma vez que por padrão todo termo possui peso 1. Para tal, basta informar para cada termo um peso maior do 0 e menor ou igual a 1. Quanto menor for o peso menor será a contribuição do termo no processo de similaridade vetorial com determinado documento. Com o desenvolvimento deste trabalho surgiram outras possibilidades que não foram consideradas, de maneira que tornaria muito extenso. Como trabalhos futuros pode-se vislumbrar a utilização da computação distribuída tanto no processamento da coleta e parser dos documentos (existem múltiplos formatos de documentos), quanto no armazenamento do índice textual. (SHUANG, 2011). No primeiro caso, uma solução utilizando algum framework de computação distribuída que facilitasse o desenvolvimento seria adequado. Quanto ao armazenamento, torna-se necessária uma solução mais robusta uma vez que para garantir alta disponibilidade, característica esta essencial para grandes índices, é requerida a funcionalidade de replicação do índice. Atualmente, existe um framework de distribuição livre chamado ElasticSearch que possibilita o desenvolvimento de sistemas de recuperação de informação com esta característica. Além das possibilidades estruturais e de alta disponibilidade cada vez mais se tornar necessário recuperar a informação de maneira adequada e precisa. Para tal, o uso de semântica que auxilie na interconexão entre os elementos formais de um texto (entidades e relacionamentos) pode ser entendida como fundamental para promover um melhor entendimento de determinado domínio de conhecimento que é mapeado por uma coleção de documentos (corpus). Nesse sentido, as Ontologias podem fornecer o arcabouço teórico e tecnológico para a criação de sistemas de recuperação de informação que levem em consideração a semântica de um domínio em particular. Outras possibilidades podem ser vislumbradas, como por exemplo, o desenvolvimento de uma camada de serviços com diversas funcionalidades visando facilitar a concepção de sistemas de recuperação de informação. Contudo, os exemplos apresentados anteriormente podem ser vistos como os principais, pois tratam das demandas mais atuais para esta classe de aplicação, ou seja, robustez, escalabilidade e maior entendimento de determinado domínio."
}