{
    "Autor": "Amanda Irizaga Lucrecio",
    "Título": "Comparação e aplicação de diferentes ferramentas para ensino de programação para crianças",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Eliane Pozzebon",
    "Coorientador(a)": "",
    "Resumo": "No presente trabalho, real izou-se a aplicação de duas ferramentas de ensino de programação, Scratch e Visu Alg, em duas turmas compostas majoritariamente por alunos do 8º e 9º ano do ensino fundamental de uma escola pública na cidade de Araranguá. A programação de computadores é uma disciplina presente em muitos cursos superiores de caráter computacional, é também trabalhada com crianças e adolescentes, por sua característica em incentivar o racio nínio lógico e a resolução de problemas, o que traz benefício ao desempenho escolar, em disciplinas como português e matemática, em razão disto, a problemática deste trabalho é verifi car qual ferramenta é a mais eficaz para o ensino de programação. Programar computadores pode ser uma tarefa difícil para dif erentes níveis de educação, mesmo no ensino superior, a disciplina possui um alto nível de reprovação, portanto, uma das motivações deste trabalho é encontrar um método que facilite a aprendizagem dos conceitos básicos, desmistificando que programação é al go imposs ível, bem como analisar e comparar as diferentes ferramentas exis tentes que servem de auxílio para o ensino. Para corroborar com a proposta do trabalho, um questionário foi desenvolvido contendo questões sobre todo o conteúdo explorado ao longo das atividades, além da observação direta dos alunos no que se refere a resolução de exercí os em sala de aula. Após analisar os resultados obtidos, é possível afirmar que a ferramenta Scratch é a mais adequada para o aprendizado dos conceitos básicos e ini ciais de programa ção, além disto, a opinião geral dos alunos foi positiva , levando em consideração as respostas da questão aberta sobre as atividades como um todo, atingindo então,  o objetivo inicial do trabalho.",
    "Palavras-chave": "Programação de computadores, Ferramentas de programação, Alunos, Ensino Fundamental, Scratch, Visu Alg.",
    "Introdução": "A tecnologia educacional dentre várias definições, pode ser entendida como “o con junto de processos, métodos e técnicas para enfrentar os problemas das práxis educativas e para favorecer a dinâmica da aprendizagem.” (GUÉDEZ ,1982, p.19 apud CROCHIK , 1998) Na escola , os alunos já estão inseridos em um ambiente tecnológico, pois, o quadro negro, assim como o giz, mesmo que ultrapassados, também são tecnologias. Porém, mais do que isto, celulares e computadores fazem parte do dia a dia destes alunos, e muitos deles inclusive, trazem estas ferramentas para dentro das salas, o que pode ser um infortúnio para os professores. Felizmente, alguns docentes buscam transformar esta adversidade em oportuni dade, fazendo o uso destas tecnologias aliado ao ensino e aprendizagem. Como a utilização de tablets dentro da sala de aula, esses que foram entregues gratuitamente a diversas escolas de ensino público pelo Ministério da Educação através do Programa Nacional de Tecnologia Educacional -ProInfo (PORTAL MEC,2016). Os dispositivos móveis como os celulares e tablets, são poderosas ferramentas para complementar o ensino regular nas escolas, pois são como “computadores de bolso”, isto é, se a escola possui internet, os alunos podem utilizar ferramentas de pesquisa como o Google sem ter que sair da sala de aula, ou então, fazer uso de aplicativos educacionais previamente instalados nos dispositivos, para que atividades sem uso de internet possam ser uma opção. Os tablets servem como ferramenta de apoio pedagógico, não sendo necessária a substituição dos livros, os alunos leem sobre tecnologia, mas o passo mais importante é justamente utilizar desta tecnologia para incrementar o conhecimento dentro da sala de aula. E toda esta expansão tecnológica só é possível pois, mais países estão buscando a inclusão digital. Inclusão digital segundo Ribeiro (2016) se refere “ao acesso à informação que está nos meios digitais e, como ponto de chegada à assimilação da informação e sua reelabo ração em novo conhecimento, tendo como consequência desejável a melhoria da qualidade de vida das pessoas”, isto é, não basta fornecer o computador e a internet, é necessário que o usuário aprenda algo, e consiga aplicar este aprendizado no seu dia a dia. Se isto não for possível, então não temos inclusão digital. A escola tem um papel importante no que diz respeito a inclusão digital, pois muitos alunos só têm acesso à internet por conta dos laboratórios existentes na mesma. Mas existe uma questão eminente no meio acadêmico, que é sobre o que a internet vem proporcionando aos alunos, bem como o conteúdo acessado por eles, e se de fato, está ocorrendo o que chamamos de inclusão digital. A quantidade de adeptos tecnológicos é diretamente proporcional a quantidade de tecnologias existentes, e só cresce. Em contrapartida, enquanto o número de adeptos aumenta, a faixa etária dos mesmos diminui. Isto ocorre, pois, crianças e adolescentes estão cada vez mais cedo, tendo contato com a tecnologia, e isto pode ser algo bom e proveitoso, pois, desta forma, a criança terá mais facilidade em lidar com as tecnologias apresentadas no decorrer da sua vida, pois, mesmo que a tecnologia mude, o impacto inicial já foi quebrado. Considerando isto, projetos relacionados a programação de computadores vem ganhando força, pois reúnem tecnologia e ensino, além de todo o aparato característico da programação, como raciocínio lógico, incentivo a criatividade e a resolução de problemas. Para Stroustrup (2014) , “A programação é a arte de expressar soluções para problemas de modo que o computador possa executá-las”. Programar nada mais é do que escrever uma sequência de comandos para que o computador interprete. A programação, por se tratar de sequências lógicas de comando, pode facilitar o aprendizado em outras áreas, como a matemática e física, que exigem o raciocínio lógico para a resolução de problemas. Incentivar crianças e adolescentes a programar, é mostrar uma nova perspectiva em relação ao mundo e suas coisas. Iniciativas como “Hour of Code” no Estados Unidos e “Code Club” que tem a extensão do projeto no Brasil, proporcionam a crianças e adolescentes momentos de lazer aliado ao saber. O fundador do “Happy Code” na Estônia, Rodrigo Santos, acredita que é fundamental que crianças e adolescentes aprendam a programar. Segundo Dantas e Costa (2013) programar explora “a habilidade de raciocínio lógico, conhecimentos matemáticos, trabalho em equipe, capacidade de resolver problemas e o estímulo da criatividade”. Para participar destas iniciativas, as escolas interessadas devem se cadastrar, e ao fazerem isto, tem um papel muito importante no que diz respeito ao incentivo aos alunos, para que os mesmos continuem até o fim. Este incentivo pode surgir em forma de competição, resolução de problemas, dinâmicas, entre outros, de qualquer forma, é essencial que os professores se comuniquem com os alunos para buscar a melhor forma de ensino/ aprendizagem. Mas se há tantos pontos positivos ao ensinar programação, porque ainda não é uma prática mais comum? Muitas podem ser as justificativas, Gomes et al. (2008) acredita que “Os métodos de ensino tradicionalmente utilizados não parecem adequados às necessidades da maioria dos alunos”. Um dos desafios em ensinar programação é entendê-la. Se tratando de raciocínio lógico, muitas pessoas podem apresentar dificuldade nesta área, transformando-a em um impasse. Além disto, há um certo desconhecimento no conceito de programar, o que dificulta o interesse tanto dos professores quanto dos alunos, pois os mesmos acreditam que este conhecimento adquirido pode não servir para algo no futuro.",
    "Conclusão": "Neste trabalho, foi apresentada a aplicação de duas ferramentas de ensino de progra- mação em turmas de alunos provenientes do ensino fundamental de uma escola pública, com o objetivo de entender os motivos pelo qual o ensino de programação nas escolas, não seja uma prática mais comum, além de constatar através dos resultados obtidos com um questioná- rio, qual ferramenta é a mais adequada para ensinar os conceitos básicos iniciais da programa- ção. No decorrer das atividades propostas, pode-se observar o entusiasmo dos alunos ao lidarem com as ferramentas, bem como, a criatividade que os mesmos aplicavam na resolução dos exercícios. Levando em consideração que a programação é flexível quanto as respostas certas, diferentes soluções para o mesmo problema foram criadas, o que representa um bom desempenho do raciocínio lógico. As turmas foram separadas por turno e ferramenta, fazendo uma avaliação geral, ambas gostaram do curso, mas ficaram insatisfeitas quanto ao tempo de duração. As atividades duraram 4 dias, com duração de 3 horas e 20 minutos, totalizando aproximadamente 14 horas semanais. Por esta razão, muitos sugeriram que o curso deveria ser estendido para 1 mês, com mais horas por dia. Após avaliar as respostas do questionário, é possível afirmar que, para este caso, em específico, a ferramenta Scratch se mostrou mais satisfatória para ser utilizada como ferramenta de apoio ao ensino de programação, pois, os alunos que utilizaram-na tiveram uma porcentagem de acertos maior, do que os alunos que trabalharam com a ferramenta Visu Alg, além disto, estes tentaram solucionar a maior parte dos exercícios, enquanto que os alunos que utilizaram o Visu Alg, deixaram boa parte das questões em branco. Ao realizar uma busca sobre o tema proposto, foi possível encontrar vários trabalhos relacionados, porém, recentes. O que indica que ensinar programação para crianças e adoles- centes é uma prática relativamente nova e não tão desenvolvida, uma justificativa para o tal é a falta de conhecimento na disciplina por parte dos docentes que não são da área, ou até mes- mo na dificuldade em não saber como aplicar a programação, nas disciplinas diárias como português e matemática. Nos tópicos a seguir, são apresentadas algumas propostas para aplicação em trabalhos futuros: Aplicação de ferramentas para o ensino de programação com idosos; Aplicação de ferramentas para o ensino de programação com alunos da 1ª fase de cursos voltados a computação; Aplicação de ferramentas para o ensino de programação com crianças das sé- ries iniciais; Aplicação de ferramentas que utilizem linguagem de programação (C, Java, Delphi) com alunos do ensino médio."
}