{
    "Autor": "Tatiana Marcelino de Freitas",
    "Título": "MOTIVAÇÕES DE CONSUMO DE PRODUTOS ORGÂNICOS E UTILIZAÇÃO DAS REDES SOCIAIS COMO MEIO PROPULSOR DE DIVULGAÇÃO.",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Andréa Cristina Trierweiller",
    "Coorientador(a)": "",
    "Resumo": "Diant e do crescimento do mercado de produtos orgânicos, faz -se necessário aprofundar os estudos sobre o comportamento dos consumidores, suas reais motivações de compra bem como, as dificuldades e limitações nas estruturas de produção, fornecimento e comercialização. O presente trabalho tem como objetivo principal analisar as motivações de compra dos consumidores e potenciais consumidores de produtos orgânicos. Dessa forma, será possível se aproximar de suas reais necessidades, a partir da compreensão do que mais valorizam ao comprar produtos orgânicos, seja em termos de atributos concretos (preço, aparência dos produtos), abstratos (sabor, qualidade) e ainda, fatores psicológicos (sentimento de segurança ao se alimentar, evitar sensações negativas), valores instrumentais (longevidade, viver bem a vida) e valores terminais (tranquilidade, felicidade). E assim, futuras pesquisas, poderão traçar estratégias de marketing para divulgação de produtos orgânicos, com ações em pontos de venda físico bem como, tendo como recurso, o e-commerce (comércio eletrônico) e as redes sociais. Na fundamentação teórica foi realizada uma análise exploratória da literatura em temas como: agricultura familiar, produtos orgânicos, consumo consciente e redes sociais. Por meio de um levantamento, elaborou-se um questionário, disponibilizado online no Google Forms, tendo sido obtidas 165 respostas válidas, e indicando que os respondentes são, na maioria, dos estados da região sul do Brasil, sendo que a maior parte com a idade entre 18 e 25 anos, prevalecendo o sexo feminino. Os respondentes destacaram que os produtos orgânicos que mais consomem são frutas, hortaliças e ovos. A maior barreira apontada foi o preço, seguida da falta de variedade e regularidade destes produtos nos pontos de venda. Os atributos de maior destaque foram: “não possuir agrotóxicos”, “ter selo, que comprove a origem destes produtos” e; a consequência mais lembrada, após o consumo: “segurança alimentar”; os valores mais importantes foram: “melhorar a qualidade de vida”, “viver bem a vida”. Os participantes são na maioria usuários de redes sociais, mostram-se interessados em ter mais informações sobre valores nutricionais, e locais de pontos de venda de produtos orgânicos. Enfim, acredita-se que, este trabalho contribuiu para novas proposições junto ao setor de alimentos orgânicos e, ainda, pode-se inferir uma reflexão mais ampla, quanto à necessidade de novos padrões de consumo, mais sustentáveis.",
    "Palavras-chave": "Motivações de Compra; Produtos Orgânicos; Teoria da Cadeia Meios e Fins; Redes Sociais;",
    "Introdução": "Em um mercado extremamente competitivo, não são apenas os produtos que são globalizados, mas a preocupação com os grandes desequilíbrios ambientais e seus impactos negativos na vida humana. Portanto, alternativas ecologicamente corretas estão sendo resgatadas. Escolhas estas que tenham um menor impacto no meio ambiente bem como representem possibilidades para melhor qualidade de vida dos consumidores. Diante disso, a fabricação e comercialização de produtos orgânicos ganham visibilidade. Entretanto, muitos são os desafios para entrar no mercado, manter-se e divulgar tais produtos, que geralmente têm um preço superior se comparados aos produtos convencionais. O desafio é o convencimento dos consumidores com base em argumentos ecológicos, rompendo sua resistência em aderir a um consumo mais consciente, que objetiva o ganho, não apenas pelo menor preço, mas pelo seu valor sustentável, alternativa mais saudável, para esta e futuras gerações. Para tanto, as estratégias do marketing, com apoio das redes sociais, podem ser norteadoras de ações junto a potenciais consumidores de produtos orgânicos. Conforme Instrução Normativa 007/99, do Ministério da Agricultura, Pecuária e Abastecimento (MAPA), item 1.1, o sistema orgânico de produção agropecuária e industrial é: “[...] todo aquele em que se adotam tecnologias que otimizem o uso dos recursos naturais e socioeconômicos, respeitando a integridade cultural e tendo por objetivo a auto sustentação no tempo e no espaço, a maximização dos benefícios sociais, a minimização da dependência de energias não-renováveis e a eliminação do emprego de agrotóxicos e outros insumos artificiais tóxicos, organismos geneticamente modificados (OGM)/transgênicos ou radiações ionizantes em qualquer fase do processo de produção, armazenamento e de consumo, e entre os mesmos privilegiando a preservação da saúde ambiental e humana, assegurando a transparência em todos os estágios da produção e da transformação” (ORMOND et al., 2002). Porém, há muitas barreiras quanto ao consumo de produtos orgânicos, devido a “[...] preços elevados, disponibilidade limitada e, em menor grau, falta de confiança na certificação e na qualidade dos produtos” (WIER; ANDERSEN, 2001, p. 15). O sistema de produção orgânica emprega a inovação, que inerentemente tem o desconhecido, o novo, o não convencional, aumentado a resistência à adesão dos produtos orgânicos (SILVA; CAMARA; DALMAS, 2005). Segundo Vilas Boas (2005), conceitos básicos, essenciais ao estabelecimento de estratégias de marketing relacionadas ao comportamento do consumidor, envolvem diversos aspectos referentes à compreensão dos consumidores como indivíduos, considerando aspectos cognitivos, como percepção, aprendizagem, motivação e valores, além da capacidade de estabelecer relacionamento destes aspectos com questões específicas de mercado. O objetivo é criar satisfação na entrega de qualidade, serviço e valor a estes consumidores. Estes aspectos são evidenciados de forma semelhante por diversos autores, como Engel et al. (1995), Kotler (1998) e Solomon (2002). Conforme Solomon (2002, p. 25), uma estratégia de marketing bem-sucedida tem como base o conhecimento sobre os consumidores. Dados sobre os consumidores são instrumentos essenciais para auxiliar as organizações a definir mercados e identificar ameaças e oportunidades para uma marca ou produto. Diante do desenvolvimento de processos de produção, distribuição e comercialização que enfatizem a sustentabilidade e a responsabilidade social e ambiental, a compreensão do comportamento do consumidor bem como a apresentação de novas perspectivas e mudanças para o público, tem se tornado um dos grandes desafios atuais nos estudos de marketing. Este crescimento do mercado que, por um lado abre grandes perspectivas, por outro, evidencia as limitações relacionadas não só às questões de estruturas de produção, fornecimento e comercialização, mas principalmente, a compreensão das reais motivações que determinam o comportamento de compra do consumidor de produtos orgânicos, elemento essencial para que o processo se consolide (VILAS BOAS, 2005). Portanto, é essencial conhecer as características do consumidor, suas necessidades, valores e crenças, avaliando as motivações.",
    "Conclusão": "Por fim, esta pesquisa foi de extrema importância para se compreender as motivações para a compra de produtos orgânicos. Destacando-se, a partir dos resultados, as características determinantes para consumo destes alimentos, permitindo o desenvolvimento de estratégias de marketing mais eficazes para este público. Lembrando que, as estratégias de marketing necessitam ser, constantemente analisadas, em diferentes contextos, econômicos e sociais, pois é sabido que, a recessão econômica influencia o consumo de produtos não convencionais. Afinal, as perdas salariais e, de poder aquisitivo levam os consumidores a optar pelo mais barato e não, necessariamente, pelo mais saudável ou de maior qualidade. Diante disso, o desafio é o convencimento de que o preço superior do produto orgânico corresponde a um “valor” superior, que o consumidor estará comprando não apenas um produto livre de agrotóxicos, mas de maior longevidade e questões de longo prazo. Grande ênfase deste estudo foi dada, ao comportamento de compra do consumidor, levando-se em consideração as relações existentes entre as características dos produtos orgânicos, seus benefícios, valores e, as barreiras para a compra destes, por meio da interpretação dos próprios consumidores. Os resultados obtidos indicaram que, as principais barreiras para compra dos produtos orgânicos foram: o preço alto em relação aos produtos convencionais, a falta de variedade e regularidade destes produtos nos pontos de vendas. Portanto, um dos desafios é o convencimento dos consumidores com base em argumentos ecológicos, não apenas pelo menor preço, mas pelo seu valor sustentável, por ser uma alternativa mais saudável para esta e futuras gerações. As barreiras em relação à variedade e regularidade dos orgânicos espelham a realidade deste tipo de produção no Brasil, que ainda não se mostra suficiente para atender à demanda. Isso indica que, existe um mercado a ser explorado, que com a utilização de estratégias adequadas, na sua comercialização, principalmente no canal varejista, possam conseguir atender, adequadamente, à demanda, por alimentos mais saudáveis. Já que, o marketing verde exigiria uma visão muito mais abrangente e complexa, como mencionado neste TCC, envolvendo toda a cadeia produtiva de orgânicos. Na compreensão da teoria de meios e fins, de Vilas Boas (2005), o consumidor pode conhecer um produto por seus atributos, consequências de seu uso e valores pessoais que o satisfazem. O atributo mais relevante dos produtos orgânicos, na pesquisa deste TCC, foi “não possuir agrotóxicos”, estando ligado, diretamente, à garantida de possuir selo (certificação), que comprova essa origem sem agrotóxicos. Os produtos orgânicos mais consumidos pelos respondentes são, respectivamente, as frutas, hortaliças e, ovos. Como valores mais importantes apontados estão: “melhorar a qualidade de vida”, “ter maior longevidade”, “viver bem a vida”. Com relação ao emprego de recursos tecnológicos para a divulgação de produtos orgânicos, os respondentes afirmaram serem usuários de redes sociais como Facebook, WhatsApp e Instagram. Assim, as informações de produtos orgânicos seriam importantes de serem divulgadas nas redes sociais, tendo como destaque: valores nutricionais, pontos de vendas, certificações e cadeia produtiva de orgânicos. Isso demonstra que, surgem oportunidades de empregar os recursos tecnológicos como forma de divulgação dos valores agregados dos produtos e dos benefícios, que a alimentação orgânica ocasiona à saúde familiar e, pessoal, bem como, à preservação do meio ambiente. Para futuros estudos nesta temática, seria interessante a identificação de estratégias de marketing adequadas, combinadas às redes sociais e, a outros recursos tecnológicos (por exemplo aplicativos para smartphone, desenvolvimento de alternativa de e-commerce como canal de venda para atender melhor ao varejo, agregando valor aos produtos orgânicos e fornecendo um canal de comunicação mais atrativo e personalizado, com o objetivo de romper a última barreira ao consumo de produtos orgânicos, evidenciando que o benefício de seu consumo é maior do que o preço superior, em relação aos produtos convencionais. Enfim, acredita-se que, o objetivo deste trabalho foi alcançado pelo levantamento das motivações de consumo dos atuais e, potenciais consumidores de produtos orgânicos. Sendo assim, este trabalho contribui para novas proposições, junto ao setor de alimentos orgânicos e, ainda, pode-se inferir a uma reflexão mais ampla, quanto à necessidade de novos padrões de consumo, não apenas em benefício do ser humano, o que representaria uma visão restrita e antropocêntrica dos problemas ambientais, mas em função de um benefício maior, a sobrevivência de todas as espécies e a sustentabilidade do planeta."
}