{
    "Autor": "Edmo Guidi e Francisco Lourenço Filho",
    "Título": "Tecnologias da Informação e Comunicação para Gestão de Processos de Análise Clínica Veterinária para Pets",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof a. Dr a. Andréa Cristina Trierweiller",
    "Coorientador(a)": "",
    "Resumo": "Ao observar a crescente preocupação das pessoas em cuidar de seus animais de estimação, estão ocorrendo maiores investimentos em estabelecimentos como hospitais, clínicas e pet shops para atendimento dessa demanda. Porém, não há apenas os médicos veterinários, mas também, profissionais que se habilitam em áreas específicas, como o biomédico, atuante na área de patologia clínica veterinária, ou análise clínica veterinária. Contudo, verificam-se falhas, justamente, pela falta de informação, de um registro detalhado sobre o pet, impedindo o acompanhamento adequado de sua saúde. Na maioria das vezes, não há um histórico sobre o que aconteceu e o que foi prescrito para o animal. Os softwares utilizados hoje, são voltados ao comércio e contem itens como: cadastro de clientes, controle financeiro, controle de estoque, etc. Algumas vezes, quando o tutor tem mais de um animal de estimação o cadastro é duplicado. Assim, apesar de haver no mercado, softwares especialistas, muitos estabelecimentos não utilizam, e nenhum deles é, especificamente, voltado à área de análise clínica veterinária. Diante disso, este trabalho tem como objetivo, realizar o levantamento de requisitos para o desenvolvimento de um protótipo de software para gerenciamento de informações de análises clínicas dos pacientes (pets), de clínicas veterinárias. Este software, com informações de análises clínicas, permite auxiliar a tomada de decisão dos profissionais, envolvidos no tratamento do pet. Afinal, exemplos de falhas no diagnóstico, exames e, consequentemente, tratamento inadequado, estão associados ao pouco controle de informações, desde o cadastro, até o histórico do tratamento. Como resultado, este protótipo de software demonstrou potencial para realizar o gerenciamento de informações de análises clínicas dos pacientes de clínicas veterinárias, com possibilidades de implementação futura e, por conseguinte, de comercialização. Mais uma demonstração do importante papel das TICs como meio, dispondo facilidades e comodidade aos usuários; neste caso, uma importante aplicação, que pode fornecer maior qualidade de vida e segurança para os pets e seus tutores.",
    "Palavras-chave": "Análises Clínicas. Medicina Veterinária. Software.",
    "Introdução": "Ao observar a crescente preocupação das pessoas em cuidar de seus animais de estimação, profissionais da área de medicina veterinária têm investido maciçamente, em estabelecimentos como hospitais, clínicas e pet shops para atenderem a essa nova onda, que vem crescendo significativamente. Todas essas organizações são obrigadas a ter um médico veterinário em tempo integral, com exceção do pet shop, que pode manter este profissional, em certos períodos do dia. Os hospitais mantêm médicos veterinários, que atuam em diversas áreas: cardiologia, endocrinologia, dermatologia, imagenologia, plantonistas, etc., todos com especializações nessas áreas. As clínicas, também têm médicos veterinários, alguns com especialidades e outros não; porém, muitas clínicas atuam como hospitais mantendo confinamentos, tratamentos de longo prazo, exames, dentre outros. Algumas clínicas possuem quase a mesma estrutura que um hospital veterinário, atuam de forma bem semelhante, exceto pelo fato de não haver plantonistas e pessoas 24 horas por dia, cuidando dos pets. Já, as pet shops são apenas lojas de venda de produtos e pequenos serviços que, também, têm um médico veterinário disponível em horário, ou turno, comercial para atender pequenos casos, sendo que, em situações mais complexas, eles são encaminhados a clínicas e hospitais. A partir dessa preocupação crescente com os animais de estimação, esses profissionais, de medicina veterinária, assumem diversas as áreas relacionadas aos animais de estimação, os chamados pets, e executam muitos serviços relacionados. Porém, há profissionais que se habilitam em áreas específicas, voltadas para a veterinária, como o biomédico, por exemplo. Mas o farmacêutico bioquímico e o biólogo, também atuam em patologia clínica – conhecida como análise clínica. No caso do biomédico, há uma habilitação específica para a área de patologia clínica veterinária, ou análise clínica veterinária, que permite atuar, apenas neste âmbito. Isso demonstra que, pouco a pouco, os profissionais da área de saúde estão se voltando para o mercado crescente de pets. Observando essas instituições, que atuam nesse mercado, além da avaliação clínica dos animais de estimação, há a necessidade de uma investigação mais profunda, quando não se identifica o problema durante uma consulta, antes de prescrever um tratamento medicamentoso ou uma operação invasiva. Assim, para executar os procedimentos necessários de avaliação das condições de saúde, são feitos exames clínicos, após a coleta de fluídos corporais como: fezes, urina, sangue, secreções auriculares, nasais ou oculares, entrando em cena o profissional de análises clínicas. Após essa coleta, tais fluídos são encaminhados a um laboratório, interno ou externo, para análise clínica. Os hospitais e algumas clínicas possuem, dentro de sua estrutura, quase todos os equipamentos para executarem a análise desses fluídos e, na maioria das vezes, o próprio médico veterinário é quem faz as análises, mesmo não sendo um especialista na área. Quando o hospital ou a clínica não tem o equipamento necessário para fazer uma análise específica, remete a um laboratório externo, para que faça o exame. E ainda, as clínicas que não possuem o equipamento necessário, muitas vezes, enviam aos hospitais veterinários e esses, fazem os exames relacionados aos fluidos, assim como, outros necessários, como os de imagenologia – radiografias, ecocardiogramas, ultrassom, ressonância, tomografia e eletrocardiogramas. Clínicas que não fazem esse tipo de avaliação e exames em um pet, normalmente, agem de forma empírica e tratam o animal às escuras, sem a real noção do seu estado de saúde, levando em conta, somente, a aparência em que do pet. Como esses cuidados e tratamentos relacionados aos pets são muito recentes, a análise clínica veterinária é relevante à saúde do animal e, uma das grandes falhas encontradas nos hospitais e clínicas veterinárias, é justamente, a falta de informação, de um registro detalhado sobre o pet, impedindo o acompanhamento adequado de sua saúde. Na maioria das vezes, não há um histórico sobre o que aconteceu e o que foi prescrito para o animal. Os softwares utilizados hoje, nesses hospitais e clínicas, são os voltados ao comércio e contem itens como: cadastro de clientes, controle financeiro, controle de estoque, etc. Algumas vezes, quando o tutor tem mais de um animal de estimação o cadastro é duplicado. Apesar de haver no mercado, softwares especialistas, muitas clinicas e hospitais de Criciúma (maior cidade, próxima de Araranguá -SC) não utilizam, e nenhum deles é, especificamente, voltado à área de análise clínica veterinária. Diante deste contexto, o protótipo do software, apresentado neste trabalho, poderá contribuir para a redução da lacuna, que há nesses estabelecimentos. Foi observado que, nenhum dos softwares existentes faz alusão à necessidade de manter uma comunicação constante e permanente, entre o atendimento feito pelo médico veterinário e o laboratório de análises clínicas. É nesse intermeio, que se propõe inserir um recurso para dar manutenção às informações trocadas entre ambos e assim, gerar um histórico para consultas futuras. Ao longo do desenvolvimento dessa ideia, observa-se que, há algumas empresas de software, que possam captar informações sobre a ideia geral: o histórico. Considerando isso, a aplicação desse objeto fornecerá, também, recursos de arquitetura orientada a serviço – SOA, que permite a integração de informações entre qualquer plataforma, independentemente da arquitetura utilizada para gerá-la. Define-se assim, que o pressuposto é a troca de informações, que serão coletadas no momento da necessidade do exame de um pet, para armazenar e transformar tais informações em uma hierarquia de dados, que possa ser consultada no futuro, suprindo, dessa maneira, a dificuldade de comunicação entre o médico veterinário e o analista clínico. Observa-se que, no geral, há preocupação com o registro pelos veterinários – contudo, incompleto – dos pacientes, atendidos nas clínicas veterinárias. Ou seja, muitas vezes, sequer há o registro do nome dos animais; quiçá, da coleta de suas secreções. Mesmo porque, geralmente, nãoDispõem de um software de armazenamento, que os auxilie para tal. Ao se comparar com os hospitais para humanos, em que os fluídos são coletados e identificados, buscando garantir as informações relativas ao paciente e evitando diagnósticos errôneos, que poderiam causar sérios problemas. Porém, em clínicas veterinárias, observa-se o início do nível de preocupação e conscientização sobre a importância de zelar pela saúde e bem-estar do animal de estimação, que ali é tratado. Os veterinários passaram a observar melhor os seus clientes, donos de animais, e perceber que eles têm amor, fidelidade, carinho e, disposição financeira para garantir a saúde de um membro familiar, conforme o provérbio inglês que: “Não pode ser fidalgo quem não ama um cão” (THOMAS, 2001, p. 124). Estudos recentes informam que o cão (canis familiaris) foi o primeiro animal a ser domesticado e tem sido há muitos séculos, objeto de observações e considerações filosóficas e científicas sobre o comportamento animal. (CARVALHO; WAI ZBORT, 2008). Charles Darwin (1809 -1882) criou uma nova ideia de como o homem compreende a relação que tem, com outras espécies, e viveu essa experiência, ao retornar de sua expedição de cinco anos, quando se deparou com seu cão que, mesmo feliz com o retorno de seu dono, não contendo a emoção, morreu subitamente aos seus pés. Também por isso, passou um personagem mitológico, Ulisses, que saiu em uma jornada e a primeira criatura a receber o herói, depois da odisseia, foi seu cão. Animal dotado de tamanha devoção, que aguardou, cinco anos, mesmo tempo que Darwin levou, para morrer nos pés do maltrapilho Ulisses (CARVALHO. WAI ZBORT, 2008). Tamanha é devoção dos animais de estimação, que se apegam aos donos não só por comida e cuidados, mas fundamentalmente pelo carinho que recebem. Tal necessidade é também, latente nos humanos, e de forma muito mais intensa. Necessita-se do amor de outros seres, sejam eles de espécie semelhante ou não. E ainda, a dedicação do amor a seres que retribuem com carinho, sem as cobranças e discussões, são o estímulo para muitas pessoas conviverem com os pets. O apego dos humanos aos seus animais de estimação está em constante ascensão e junto desse aumento, surge uma série de recursos desenvolvidos para melhorar o cuidado desses novos membros familiares (BUSCATO; ZIEMKIEWICZ, 2013). Um dos mais novos recursos são as Análises Clínicas, que a partir da coleta, ser feita por um médico veterinário com o intuito de preparar o paciente para os procedimentos seguintes. Os fluídos dos “pets” são encaminhados para avaliação de suas condições de saúde e dos indicadores de problemas insurgentes. Essa avaliação, torna necessário o agrupamento e controle dos dados do paciente, da clínica veterinária.",
    "Conclusão": "Considera-se que, este TCC atendeu ao objetivo a que se propôs, qual seja: Realizar o levantamento de requisitos para o desenvolvimento de um protótipo de software para gerenciamento de informações de análises clínicas dos pacientes (pets) de clínicas veterinárias. A partir da observação – feita, informalmente, pela Biomédica Dra. Cristina Leal Vieira Lourenço – das dificuldades de comunicação entre a área de análises clínicas e de medicina veterinária, constatou-se uma lacuna de comunicação entre os médicos veterinários e os profissionais de análises clínicas. Ou seja, além da avaliação clínica, feita em uma consulta com o médico veterinário, pode haver a necessidade de investigação mais detalhada, exigindo a coleta de fluídos corporais, a serem avaliados pelos profissionais de análises clínicas. Essa lacuna de comunicação, em parte ocasionada pela ameaça aos limites de uma profissão em relação à outra, ou mesmo, por desconhecimento, desorganização ou descaso, em termos de gestão dos procedimentos de uma clínica veterinária, pode culminar em sofrimento, sequelas irreversíveis ou mesmo, morte do pet. Ou seja, o protótipo do software apresentado, desde que bem administrado, pode apoiar a melhor comunicação entre os profissionais, permitindo o registro das informações em um sistema informatizado, a exemplo do que acontece em muitos hospitais e clínicas para seres humanos. Assim, manter uma comunicação constante e permanente, entre o médico veterinário e os profissionais do laboratório de análises clínicas, com o uso de um software adequado, permite – dentre outras facilidades – manter um histórico para consultas futuras e, consequentemente, maior qualidade no tratamento dos pets e, por conseguinte, maior satisfação de seus tutores. Espera-se que, este software, dê suporte à tomada de decisão dos profissionais envolvidos no tratamento dos pets. Afinal, exemplos de falhas no diagnóstico, exames e, consequentemente, tratamento inadequado, estão também, associados ao pouco controle de informações, desde o cadastro, até o histórico do tratamento. Como oportunidades para trabalhos futuros, para tornar a continuidade desse projeto viável, seria importante fazer novas reuniões e despertar o interesse, dos médicos veterinários e dos profissionais de análises clínicas. Essa preocupação se torna evidente, ao se observar, que hoje, muitas clínicas veterinárias não possuem um software que, além do registro de questões de venda de produto e atendimentos, faça o armazenamento de informações referentes aos tratamentos prescritos (medicamentos, exames, fluidos corporais extraídos) ao longo do tempo, mantendo os dados homogêneos para garantir o acompanhamento da vida deste paciente pet. Esse fato submete a clínica a uma não fidelização do cliente, que acaba se sentindo livre para buscar outras instituições, que tratem adequadamente, seu pet. Enfim, encerra-se este TCC com a seguinte reflexão, com base na Declaração Universal dos Direitos dos Animais, concebida pela Unesco – ONU, Bruxelas – Bélgica, 27 de janeiro de 1978, p. 01: Todos os animais nascem iguais diante da vida e têm o mesmo direito à existência. [...] O homem, enquanto espécie animal, tem o dever de colocar a sua consciência a serviço dos outros animais. Cada animal tem direito à consideração, à cura e à proteção do homem."
}