{
    "Autor": "Luiz Fernando Rosso Perraro",
    "Título": "Aplicação de Jogos Funcionais para Idosos Utilizando o Kinect",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Eliane Pozzebon",
    "Coorientador(a)": "",
    "Resumo": "Neste trabalho foi efetuada uma aplicação de jogos digitais com idosos através do vídeo game XBOX e seu acessório Kinect que permitiu uma interação sem controles remotos utilizando assim somente gestos para realização das tarefas. Este trabalho tem como problemática avaliar se as utilizações de jogos digitais provem uma melhora na condição física e na qualidade de vida do idoso tendo como enfoque as características de capacidade funcional, estado emocional e atividade intelectual. As pessoas de terceira idade foram excluídas automaticamente dos jogos digitais tendo em vista que a maioria dos participantes possuíam aproximadamente 40 (quarenta) anos de idade quando estas tecnologias chegaram ao Brasil não se fazendo presente na realidade dos mesmos, portanto uma das justificativas deste trabalho é permitir a inclusão destes idosos no mundo dos games e como seu objetivo principal agregar estes jogos na rotina dos idosos tentando promover uma melhora em sua qualidade de vida. Para validação do trabalho utilizou-se o método de observação direta e aplicação de um questionário que foi respondido pelos idosos. Após a análise das respostas pode-se observar que os resultados foram positivos e que de fato houve uma melhora na qualidade de vida e nas atividades físicas dos idosos, comprovando assim o impacto positivo na utilização de jogos digitais para os idosos correspondendo às expectativas do trabalho.",
    "Palavras-chave": [
        "Jogos Digitais",
        "Xbox",
        "Kinect",
        "Idosos",
        "Qualidade De Vida",
        "Inclusão Digital"
    ],
    "Introdução": "A evolução dos consoles tem sido cada vez mais constante e esperada pelo público, desde seu primeiro modelo até os atuais, muitas coisas mudaram não só pelo seu sucesso, mas também pelo grande mercado de trabalho que se criou gerando competitividade entre as desenvolvedoras. De acordo com o site HONGKIAT (2011) até os dias de hoje, já foram lançados aproximadamente 70 consoles sendo o primeiro lançado em 1967 por Ralph Henry Baer que ficou conhecido como o pai dos vídeos games devido seu pioneirismo neste ramo no qual consistia em uma caixa marrom que funcionava em televisões de baixa qualidade devido à ausência de requerimento de recursos de seus jogos. Com o passar das décadas os modelos foram se adequando a necessidade de cada vez mais simular os gráficos do mundo real, assim os jogos passaram a cada vez menos ter o aspecto de desenhos e começaram a se focar em gráficos 3Ds com aperfeiçoamento em seus designs até o nível de gráficos que existem nos dias atuais. Neste trabalho foi utilizado o console X-Box juntamente com o seu acessório Kinect no qual permitiu que os idosos pudessem exercer suas todas as atividades através de movimentos corporais, abolindo assim o uso de controle remotos físicos. Segundo previsões do Instituto Brasileiro De Geografia e Estatística (IBGE) em 2015 a população com idade superior aos 65 anos representará 11,46% da nação brasileira, e estes números só aumentarão podendo chegar a até 20% em 2030. Este projeto tem como objetivo inserir os idosos ao mundo virtual com intuito de lhes proporcionar uma melhora emocional e física através de jogos do videogame XBOX da empresa Microsoft. A ideia é utilizar o dispositivo Kinect abolindo assim o uso dos controles remotos e estimulando o idoso a utilizar movimentos corporais para simular os movimentos que os jogos exigirão, proporcionando-lhes uma excelente atividade motora, mental e emocional de uma forma inovadora e divertida para os mesmos. Segundo o site BUSINESSINSIDER (2014) videogames encorajam a prática de exercícios físicos devido ao fato de ser uma alternativa interessante jogar jogos como os do Nintendo Wii e Xbox Kinect por 20 minutos ao invés de praticar atividades aeróbicas tradicionais, sendo assim válido aplicar os mesmos as pessoas idosas em suas casas ou asilo tendo em vista que elas não têm mais condições físicas de enfrentar as dificuldades apresentadas pelo país na qual os meios de transportes para pessoas mais velhas e a sua própria segurança são completamente questionáveis.",
    "Conclusão": "Neste trabalho foi apresentada a aplicação de jogos digitais para idosos da terceira idade, com intuito de observar se os mesmos poderiam lhes trazer uma melhora física em suas atividades diárias e uma melhora em sua qualidade de vida focando os aspectos de capacidade funcional, estado emocional e atividade intelectual. Após a aplicação das 03 (três) atividades com os idosos observou-se os quão interessados por tecnologias é uma realidade. Apesar de a maioria não ter participado ativamente destas evoluções, todos mostraram interesse em aprender e se envolver com os jogos. Uma das questões conversadas com os idosos do lar beneficente São Vicente de Paulo foi o fato de suas atividades físicas serem bastante regradas, limitando-se basicamente a fisioterapia e alguns passeios promovidos pela instituição, no entanto os idosos sugeriram de incluir as atividades efetuadas neste trabalho como sendo um cronograma de visitas semanal, pois todos gostaram dos jogos e se percebeu uma melhora notória no ambiente causado pelo alto índice de aceitação e divertimento das atividades. A aprovação no grupo de terceira idade Estrela do Oriente também foi extremamente positiva, apesar de este grupo ser muito mais ativo do que o do lar beneficente São Vicente de Paulo participando de competições de danças e efetuando viagens frequentes, todos os idosos também pediram para que estas atividades fossem incluídas em seus cronogramas semanais, pois todos gostaram muito e se divertiram com os jogos. Após a avaliação das respostas coletadas e com as conversas que foram realizadas com os idosos, pode-se observar que a resposta para a problemática deste estudo é que as aplicações de jogos podem melhorar consideravelmente suas AIVD e uma melhora de qualidade de vida principalmente nos quesitos capacidade funcional, estado emocional e atividade intelectual."
}