{
    "Autor": "Leonardo Deivid Pierri e Sabrina Pitz Lima",
    "Título": "Desenvolvimento de um experimento remoto baseado em sistema de geração alternativa híbrido",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Professor Dr. Roderval Marcelino",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho retrata o desenvolvimento de um experimento remoto baseado em um sistema de iluminação com geração de energia alternativa híbrido eólico-fotovoltaico. Um grande fator que contribui para a degradação do meio ambiente é o uso acentuado de energia não renovável, devido a este fato, aumentaram-se os estudos na área de energias renováveis na busca por soluções que reduzam os impactos causados pelo consumo de energia. A implantação de sistemas híbridos de energia nas instituições de ensino é deveras importante, tanto pelo fato da sustentabilidade quanto pela possibilidade de experiência prática dos alunos através do acesso ao mesmo, pois a experiência prática reforça o processo de aprendizagem. Porém, o custo de implantação de um sistema deste é alto e nem toda instituição pode adquiri-lo, outro fator de impasse é a distância geográfica entre o sistema e os interessados, pois o acesso ao sistema fica restrito aquela localidade. O experimento remoto desenvolvido possui um sistema de aquisição de dados que é formado por um hardware e um software. O hardware realiza a medição das informações do estado de operação do sistema híbrido, sendo elas, corrente do carregador solar, corrente do carregador eólico, corrente do carregador elétrico, tensão da bateria, carregador elétrico ligado ou desligado e luminária LED acesa ou apagada. O software é responsável por armazenar os dados da medição das informações do estado de operação do sistema híbrido realizada pelo hardware. Esses dados são disponibilizados em uma página web que fora desenvolvida, onde são disponibilizadas também as imagens do sistema híbrido que são capturadas por uma câmera IP. Desta forma qualquer usuário que possuir um dispositivo com navegador web e acesso a internet poderá usufruir das informações do sistema híbrido sempre atualizadas e visualizar as imagens capturadas do mesmo online, através da página web. Sendo assim, o experimento remoto apresentado neste trabalho é considerado uma boa alternativa, pois a experimentação remota possui recursos que permitem o acesso por meio virtual a um experimento real, que ficará disponível 24 horas por dia, 7 dias por semana, onde o usuário pode suprir a necessidade de experiência prática independente da sua localização geográfica, adquirindo e agregando conhecimento.",
    "Palavras-chave": "Experimentação Remota. Sistema Híbrido. Sistema Embarcado. Educação. Desenvolvimento Web.",
    "Introdução": "Com a degradação do meio ambiente e as suas lamentáveis consequências, principalmente pelo uso exacerbado de energia, alavancaram-se os interesses e estudos na área de energias renováveis e limpas, que não agridem o meio ambiente. O objetivo é buscar soluções que aproveitem os recursos naturais para gerar energia sem causar danos ao meio ambiente. Uma das soluções é a criação de sistemas híbridos de energia eólico-fotovoltaico que utilizam como fonte geradora o vento e o sol. Desta forma, é possível utilizar da energia gerada pelas fontes alternativas e ter um sistema para ser utilizado nas experimentações práticas para fins educacionais. Havendo poucos sistemas deste tipo, muitas vezes, os estudantes não têm acesso físico a algum para experimentação prática, pois o custo de aquisição é elevado e nem toda Universidade ou instituição de ensino pode adquiri-lo. Por este motivo, devido à importância dessa área nos dias atuais, seria significativa a disponibilização da experimentação remota baseado em um sistema híbrido de energia, com a finalidade de suprir essa necessidade de experiência. De acordo com os argumentos explicitados acima, este trabalho caracteriza a criação e disponibilização de um experimento remoto baseado em um sistema de iluminação com energia alternativa híbrida eólico-fotovoltaico. Para que possa ser realizado este experimento extraem-se dados do sistema hibrido e disponibiliza-os remotamente por meio de uma página web da qual fora criada no decorrer deste trabalho. Esses dados extraídos do sistema híbrido são informações do estado do mesmo, como, corrente do carregador solar, corrente do carregador eólico, corrente do carregador elétrico, tensão da bateria, carregador elétrico ligado ou desligado e luminária LED acesa ou apagada. Serão disponibilizadas também, através de uma câmera web, imagens capturadas do sistema híbrido. Com o desenvolvimento deste trabalho propõe-se que qualquer pessoa que possuir um dispositivo com acesso à internet possa acessar a página Web onde o experimento estará disponível e realizar suas experiências com dados reais a um custo zero. O sistema ficará disponível 24 horas por dia, 7 dias por semana, sendo que a tecnologia utilizada na experimentação remota é de baixo custo comparado aos benefícios que a mesma proporciona.",
    "Conclusão": "Este trabalho apresentou o desenvolvimento de um experimento remoto baseado em um sistema de iluminação com energia alternativa híbrida eólico-fotovoltaico. No decorrer do desenvolvimento da fundamentação teórica apresentada nos primeiros capítulos, pôde-se perceber que os sistemas híbridos que utilizam da energia eólica e fotovoltaica são primordiais para a redução dos impactos ambientais causados pelo consumo excessivo de energia não renovável. As fontes geradoras desse tipo de sistema híbrido são limpas e abundantes em nosso meio. Devido aos motivos citados acima, os estudos envolvendo sistemas híbridos de energias limpas e renováveis vem crescendo, porém existem poucos sistemas destes disponíveis nas instituições de ensino e Universidades para que os interessados possam ter acesso a fim de realizar suas experiências práticas. Uma alternativa para dar suporte a essa necessidade de experiência é a aplicação da experimentação remota nas instituições. A experimentação remota possui recursos que permitem o usuário ter acesso virtual a um experimento real, possibilitando ao mesmo, êxito na utilização tanto quanto no acesso real ao experimento. Assim, com a base de conhecimento adquirido nos estudos realizados na área de sistemas híbridos e dos recursos necessários para a aplicação da experimentação remota, foi desenvolvido um experimento remoto baseado em um sistema de iluminação com energia alternativa híbrida eólico-fotovoltaico. O experimento remoto possui um sistema de aquisição de dados que foi desenvolvido para realizar a medição das informações de estado do sistema híbrido, informações estas que foram disponibilizadas na página web criada, a qual também disponibiliza imagens do sistema híbrido capturadas em tempo online, adquiridas através da câmera IP que fora instalada em local privilegiado. A experimentação prática é um dos métodos de ensino que reforça o processo de aprendizagem, sendo fundamental nas diversas áreas técnicas, o experimento remoto possibilita que isso aconteça sem impedimentos físicos e geográficos. Sendo assim, a solução aqui descrita é uma grande aliada no que diz respeito a fins educacionais, pois o usuário pode suprir a necessidade de experiência sem estar fisicamente em um laboratório, tendo acesso a informações de estado do sistema híbrido, além de imagens do mesmo disponíveis on-line que podem ser acessadas através de um ambiente web utilizando qualquer dispositivo que possua acesso à internet e um navegador web. Um grande benefício que o experimento desenvolvido traz também, é que as informações disponíveis na página web podem ser utilizadas por outros estudantes e instituições que desejarem aperfeiçoar os resultados obtidos, tendo como base os resultados obtidos na utilização do experimento remoto do sistema de iluminação com energia alternativa híbrida eólico-fotovoltaico. Logo, constata-se que o custo de implantação do experimento remoto desenvolvido é relativamente baixo visto a porção de benefícios que o mesmo proporciona. A partir dessa perspectiva, propõe-se como trabalhos futuros a otimização das possibilidades de utilização do sistema híbrido através do experimento remoto, como, a implementação de um banco de dados para armazenamento das informações acumuladas do estado do sistema híbrido. Atualmente, essas informações encontram-se disponíveis on-line em uma página web, e ter um histórico disponível a fim de consultar essas informações seria bastante relevante para realizar comparações e estudos. É interessante a disponibilização dessas informações em uma base pública para que os alunos e interessados possam usufruir e agregar às suas pesquisas."
}