{
    "Autor": "Jonas da Silva Elias",
    "Título": "Recuperação e Análise de Jurisprudências como Suporte a Elaboração de Defesas em Processos Jurídicos por meio de Modelos de Linguagem",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Alexandre Leopoldo Gonçalves, Dr.",
    "Coorientador(a)": "Rafa e l Cândido, Me.",
    "Resumo": "Jurisprudências são essenciais para a prática jurídica, sendo fundamentadas por uma linguagem técnica que ultrapassa o vocabulário comum. Os desafios técnicos da abordagem jurídica requerem atenção para superar desafios relacionados a sua linguagem peculiar. Neste contexto, este trabalho objetiva a recuperação de jurisprudências e elaboração de defesas jurídicas através de busca semântica com o auxílio de Modelos de Linguagem de Grande Porte (do inglês Large Language Model - LLM). As jurisprudências utilizadas foram adquiridas a partir da técnica de scrapping e armazenadas em um banco de dados relacional. Em seguida, ocorre a sumarização das jurisprudências, transformação em vetores densos (embeddings) e indexação em banco de dados vetorial. Isto permite que o profissional do direito realize buscas nas jurisprudências indexadas e, considerando documentos de sua escolha, efetue a geração de defesa jurídica. Para análise do método, foram estabelecidos cinco cenários específicos. Os quatro primeiros cenários avaliam a ordenação efetuada por profissionais jurídicos em relação a ordenação provida pelo protótipo que instancia o método proposto através do coeficiente de Spearman. Apesar da maioria das correlações serem positivas fracas (<0.3) ou negativa, com discrepâncias consideráveis entre os profissionais, existem correlações positivas com certa relevância, demonstrando potencial de entrega de documentos aderentes à demanda dos profissionais. O quinto cenário específico trata da avaliação de um dos advogados quanto à elaboração de sugestão de defesa, sendo percebida como positiva. Diante dos resultados, o método proposto de recuperação de jurisprudências e elaboração de defesas utilizando LLMs demonstra potencial em servir de suporte a atividades consideradas complexas por profissionais na área do direito.",
    "Palavras-chave": "Jurisprudência. Elaboração de defesa. Busca semântica. Vetores densos.",
    "Introdução": "O cenário jurídico enfrenta desafios significativos ao lidar com um alto volume de informações, especialmente no que se refere às jurisprudências. A transformação digital, promovendo crescente digitalização de documentos legais, resulta em uma elevada quantidade de dados não estruturados (Fernandes et al. 2022). Todavia, este cenário representa oportunidades, bem como uma complexidade adicional ao domínio jurídico, que é responsável por gerenciar um vasto conjunto de jurisprudências. Sansone e Sperlí (2022) indicam que a transição para o digital proporcionou um amplo acesso às informações jurídicas, no entanto, tem promovido um desafio significativo em termos de eficiência na busca e recuperação desses dados. Métodos tradicionais de pesquisa mostram-se insuficientes diante da quantidade informacional presente no ambiente jurídico contemporâneo. A necessidade de ferramentas inovadoras que estejam capacitadas para lidar eficazmente com a complexidade linguística e vastidão de dados torna-se cada vez mais premente (Ma et al., 2024). O domínio jurídico, de forma geral, é um ambiente que se destaca por características linguísticas distintas, envolvidas por terminologias complexas e sutilezas semânticas específicas. Diante deste cenário, as jurisprudências, fundamentais para a prática jurídica, são frequentemente expressas por uma linguagem técnica e jurídica que vai além do vocabulário comum (Sansone; Sperlí, 2022). Esta complexidade linguística, com diversos termos especializados, expressões específicas e construções legais com particularidades, demanda uma compreensão profunda e uma metodologia avançada para a representação eficaz dos documentos jurídicos. Em um contexto computacional recente, a Inteligência Artificial (do inglês Artificial Intelligence - AI) e seus subcampos, Aprendizado de Máquina (do inglês Machine Learning - ML) e de Aprendizado Profundo (do inglês Deep Learning - DL), tem promovido suporte para tal. A abordagem técnica das jurisprudências requer uma maneira cuidadosa para superar os desafios impostos por sua linguagem peculiar. A compreensão completa do contexto legal e a captura precisa das sutilezas semânticas são determinantes para o desenvolvimento de modelos eficazes de DL. Isto se amplia ao lidar com a terminologia específica e também considerar a estrutura única das sentenças legais, a lógica argumentativa e os detalhes interpretativos que são inerentes ao campo jurídico (Jain; Borah; Biswas, 2021). Quanto ao estado da arte em recuperação de jurisprudências, técnicas e tecnologias têm sido adotadas para enfrentar os desafios complexos apresentados pelo cenário jurídico. Predominantemente, a abordagem destaca-se no uso de métodos de AI baseados em DL para lidar com o alto volume de dados não estruturados voltado ao contexto das jurisprudências. Modelos de linguagem pré-treinados, como BERT (Bidirectional Encoder Representations from Transformers) e, outros mais recentes, como o GPT (Generative Pre-trained Transformer), são ferramentas úteis na representação semântica avançada de documentos. Tais modelos, treinados em grandes conjuntos de dados textuais, são capazes de capturar relações específicas e variações semânticas, proporcionando uma base sólida para a compreensão profunda do conteúdo legal (Bhattacharya et al., 2022). Ademais, técnicas específicas de Processamento de Linguagem Natural (do inglês Natural Language Processing - NLP) possibilitam representações textuais adequadas para os mais diversos domínios na forma de vetores densos (do inglês embedding) visando lidar com as características linguísticas distintas do domínio jurídico.",
    "Conclusão": "Nesta pesquisa é enfatizada a importância da jurisprudência, possuindo papel fundamental para assegurar a convicção e previsibilidade nos processos judiciais, promovendo a igualdade entre os jurisdicionados, ao mesmo tempo em que ressalta o respeito, a sabedoria acumulada e a experiência dos magistrados. Porém, a busca de jurisprudências a partir de um contexto específico, servindo de suporte à elaboração de defesa de um processo jurídico por parte de um profissional legal, apresenta limitações quando não abrange o contexto semântico. Para tal, este trabalho teve como objetivo propor e desenvolver um método voltado à recuperação de jurisprudências como suporte à elaboração de defesas em processos jurídicos. Para a construção deste documento, pesquisas bibliográficas foram realizadas voltadas à análise de jurisprudências, precedentes, técnicas de NLP e LLMs. Das pesquisas elencadas na seção de trabalhos correlatos não foram encontrados trabalhos com proposta similar à apresentada neste trabalho. O método proposto consiste em 8 etapas, começando pela coleta, limpeza e sumarização, passando pela transformação de jurisprudências em embeddings. Posteriormente, constitui a base de dados vetorial que possibilita a execução das próximas etapas relacionadas à solicitação e consulta das jurisprudências. Na última etapa, jurisprudências recuperadas devem ser selecionadas, possibilitando assim a geração de uma sugestão de defesa jurídica. Nesta pesquisa, um conjunto de jurisprudências disponíveis no Tribunal de Justiça de Santa Catarina foi coletado para compor a base de dados (Seção 3.3.3.1). Deste conjunto de dados, foram consideradas jurisprudências relacionadas à área de saúde, sendo que cada jurisprudência foi sumarizada pelo modelo t5-portuguese-legal-summarization e, posteriormente, transformada em um vetor denso para armazenamento. Para criação dos vetores densos das jurisprudências utilizou-se o LLM juridics/bertlaw-base-portuguese-sts-scale. Por fim, as jurisprudências recuperadas de acordo com determinado prompt servem de entrada para a geração de proposta de defesa jurídica utilizando-se do LLM GPT-3.5-Turbo®. A partir do conjunto de dados, foram apresentados quatro cenários voltados à avaliação do nível de concordância entre a apresentação de jurisprudências providas pelo protótipo e a determinação da ordem pelos profissionais, ambos analisados na Seção 5.3. Em cada um dos quatro cenários, o método proposto foi avaliado considerando a correlação de ordenação de 10 jurisprudências efetuada tanto pela aplicação (protótipo) quanto pelos especialistas jurídicos. Concentraram-se assim, na identificação de possíveis correlações de ordenações entre o protótipo desenvolvido e os profissionais jurídicos. A avaliação dos profissionais jurídicos foi positiva somente no terceiro prompt, não obtendo concordâncias consistentes nos demais cenários, identificando um entendimento jurídico distinto entre ambos os profissionais. Os resultados destes quatro cenários foram ainda analisados a partir da média das correlações de ordenações. As avaliações realizadas pelo profissional 1, na maioria dos casos obteve valor negativo, enquanto o profissional 2, avaliou positivamente a maioria dos casos, definindo a média como sendo negativa em três dos quatro cenários específicos. Isto pode denotar entendimentos bem distintos das jurisprudências entre os profissionais, mas também possíveis pontos de melhoria no processo executado para a instanciação do método. Vale mencionar ainda que, para análises mais confiáveis, mais profissionais jurídicos deveriam participar da avaliação. Adicionalmente, a etapa de geração de texto para suportar a elaboração de defesas foi avaliada de maneira informal, pois não foram aplicados quaisquer métodos ou questionários. Todavia, o intuito foi coletar a percepção inicial de um dos profissionais sobre a funcionalidade e qualidade do texto produzido. O profissional, após a realização do texto, declarou que o projeto “...tem potencial de se tornar uma ferramenta indispensável no mundo jurídico.” Apesar das limitações das avaliações realizadas, os resultados demonstram potencial para continuidade da pesquisa e desenvolvimento com foco na utilização de AI, DL e LLMs na criação de ferramenta que auxilie profissionais da área jurídica na elaboração de defesas. Neste sentido, outras possibilidades podem ser exploradas para trabalhos futuros. A fim de obter similaridades mais elevadas, é possível utilizar um modelo superior ao juridics/bertlaw-base-portuguese-sts-scale visto que seu treinamento é baseado no projeto SBER T que contêm limitações quanto a quantidade de tokens de entrada quando comparado à LLMs como GPT® e Gemini®. O modelo pode também sofrer o ajuste fino (fine-tuning) a partir do conjunto de jurisprudências coletadas. Mais especificamente, quanto ao banco de dados vetorial, foi utilizado o ranqueamento baseado no cosseno, exemplificado na Etapa 4.6. Porém, com a evolução do trabalho, é possível implementar e testar outras formas de ranqueamento de jurisprudências, por exemplo, baseados em distâncias como a euclidiana ou manhattan. Além disso, no contexto das jurisprudências, é possível viabilizar buscas com escopo delimitado por meio de um método híbrido, ou seja, mesclando a busca semântica e a busca por palavras-chave. O método proposto pode ser entendido como um sistema de Resposta a Perguntas (do inglês Question Answering - QI). Entretanto, com os devidos ajustes, pode ser transformado em um sistema de ChatBot adicionando a capacidade de considerar nos prompts às interações prévias dos profissionais jurídicos. Mostra-se relevante ainda a criação de uma aplicação web ou aplicativo de recuperação de jurisprudências e geração de defesa jurídica, tendo como base o protótipo apresentado na Seção 5.3. Por fim, pensando em termos de empreendedorismo, a disponibilização para o público poderia viabilizar a coleta de diferentes feedbacks pensando nas melhorias e, em momento futuro, na oferta de serviço especializado."
}