{
    "Autor": "Adriano Mota Marcelino e Jaime Henrique Pilon",
    "Título": "Artefato Robótico e Dispositivo Móvel para a Movimentação da Cadeira de Rodas Motorizada",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "No presente trabalho é apresentado o desenvolvimento de um artefato robótico que se enquadra como um produto de tecnologia assistiva. O objetivo geral é permitir ao usuário locomover uma cadeira de rodas motorizada utilizando um dispositivo sem fio. A metodologia utilizada no desenvolvimento do artefato consiste em uma análise bibliográfica sobre deficiência, acessibilidade, tecnologia assistiva e modelos de cadeiras de rodas. Para o desenvolvimento do projeto foram criados dois protótipos, o primeiro com base nos kits Lego MINDSTORM EV3, o segundo foi desenvolvido com uma placa de prototipação Arduino utilizando um dispositivo móvel para controlar a cadeira de rodas motorizada. Para a validação do projeto foi realizada uma análise de desempenho ocupacional do usuário. Para realizar esta avaliação foi necessário o auxílio de um terapeuta ocupacional, que por meio da técnica de entrevista Canadian Occupational Performance Measure - COPM, pontuou o desempenho e a satisfação do usuário antes e depois de utilizar o artefato robótico desenvolvido. Na análise realizada após o término do projeto, conclui-se que o artefato proporcionou maior autonomia, independência e qualidade de vida ao usuário.",
    "Palavras-chave": [
        "Acessibilidade",
        "Cadeira Rodas Motorizada",
        "Tecnologia Assistiva",
        "Artefato Robótico",
        "Deficiência física"
    ],
    "Introdução": "Qualquer parcela da sociedade possui o direito de acesso à educação, saúde, lazer e ao trabalho, inclusive as pessoas que possuem deficiência. O acesso a estas áreas contribui diretamente na inserção social do indivíduo, fazendo com que o mesmo tenha uma melhora na qualidade de vida. (PAGLIUCA et. al, 2007). O brasil instituiu em 2015 a Lei de Inclusão da Pessoa com Deficiência n. 13.146 e conforme seu Artigo 2o: Art. 2o Considera-se pessoa com deficiência aquela que tem impedimento de natureza física, mental, intelectual ou sensorial, o qual, em interação com uma ou mais barreiras, pode obstruir sua participação plena e efetiva na sociedade em igualdade de condições com as demais pessoas. (BRASIL, 2015). No ano 2000, especificamente no dia 19 de dezembro, foi criada a lei Brasileira nº 10.098, estabelecendo critérios básicos e normas gerais para garantir a acessibilidade para todas as pessoas, por intermédio da exclusão de barreiras que impeçam a locomoção, fazendo com que qualquer mudança no ambiente após essa data, tenha que se adequar as regras, seja na construção e reforma de edifícios, locais compartilhados, ruas, mobiliário urbano, meios de comunicação e de transporte (BRASIL, 2000). A dificuldade dessas pessoas com a mobilidade reduzida, principalmente em lugares públicos, ocorre através descumprimento de normas e leis garantidas nos artigos da NBR 9050/2004(ABNT) e do decreto 5296/2004 que regulamentam as leis federais 10.048/2000 e 10.098/2000, que visa acabar com as barreiras na locomoção de todos os grupos que possuem dificuldades físicas, como por exemplo: pessoas com deficiência, mulheres grávidas, idosas (os), obesas (os). Apesar destes descumprimentos gerarem um problema grave, as pessoas com deficiência motora, ainda precisam lidar com outras barreiras, como a do preconceito e discriminação. Portanto a autonomia e o apoio de todos para um deficiente físico, é primordial para o bem estar e convívio na sociedade. A tecnologia assistiva é o termo responsável por definir recursos ou serviços prestados à usuários com deficiência física. O termo Tecnologia Assistiva (TA), ou ainda ajudas técnicas no Brasil, foi definido pelo comitê de ajudas técnicas (CAT) através da portaria nº 142, de 16 de novembro de 2006, onde o seguinte conceito foi estabelecido: Tecnologia Assistiva é uma área do conhecimento, de característica interdisciplinar, que engloba produtos, recursos, metodologias, estratégias, práticas e serviços que objetivam promover a funcionalidade, relacionada à atividade e participação de pessoas com deficiência, incapacidades ou mobilidade reduzida, visando sua autonomia, independência, qualidade de vida e inclusão social (ATA VII - Comitê de Ajudas Técnicas (CAT) - Coordenadoria Nacional para Integração da Pessoa Portadora de Deficiência (CORDE) - Secretaria Especial dos Direitos Humanos - Presidência da República). Dessa forma, o estudo objetiva analisar a robótica voltada para a acessibilidade, tema que vem ganhando uma maior atenção dos pesquisadores. Esta pesquisa é importante, pois sabe-se que embora “a Tecnologia Assistiva não salva vidas, nem reduz morbidade”, possibilita aos seus usuários, e a todos do seu convívio, o direito de uma vida satisfatória e com inúmeras possibilidades (MELLO, 2006, p.7), a TA objetiva: [...] proporcionar à pessoa portadora de deficiência maior independência, qualidade de vida e inclusão social, através da ampliação de sua comunicação, mobilidade, controle de seu ambiente, habilidades de seu aprendizado, competição, trabalho e integração com a família, amigos e sociedade. Podem variar de um par de óculos ou uma simples bengala a um complexo sistema computadorizado. (GALVÃO FILHO; DAMASCENO, 2006a, p.25). No meio dos recursos da tecnologia assistiva a cadeira de rodas é o equipamento que possui a maior representação no quesito de apoio a pessoas com disfunção motora. A cadeira de rodas permite ao usuário uma maior autonomia e independência, portanto, a tecnologia assistiva consiste em criar equipamentos ou serviços que possibilitam a integração dos usuários na comunidade, realizando tarefas jamais executadas sem o auxílio deste tipo de recurso. (MEDOLA, 2013). A cadeira de rodas é classificada como um produto de tecnologia assistiva essencial, pois auxilia na locomoção de pessoas que possuem alguma restrição temporária ou permanente que as impeça de caminhar. A finalidade da mesma é proporcionar maior autonomia, liberdade e mobilidade, melhorando assim a autoestima e a qualidade de vida de seus usuários. (PIMENTEL ET AL., 2014). Existem diversas características que diferenciam uma cadeira de rodas de outra como: peso, tração e os ajustes que proporcionam maior conforto. Alguns modelos se diferenciam pelo tamanho, como as cadeiras pediátricas indicadas para crianças e as cadeiras bariátricas indicadas para obesos. Para cada perfil de usuário há uma cadeira de rodas específica que, na maioria das vezes, é obtida através da customização de modelos convencionais. Algumas cadeiras são projetadas para uso em ambiente interno, já outras para uso externo, a impulsão pode ser realizada de forma manual ou motorizada, alguns modelos podem ser dobrados ou desmontados para facilitar o transporte em espaços relativamente pequenos, como em porta malas de automóveis.",
    "Conclusão": "Dentre todos os produtos que se enquadram como uma tecnologia assistiva, a cadeira de rodas é um item essencial, a mesma tem a finalidade de auxiliar na locomoção de pessoas que possuam restrição temporária ou permanente. Além disso, a cadeira de rodas propicia maior autonomia, autoestima, qualidade de vida e liberdade aos seus usuários. Optou-se pelo desenvolvimento deste artefato robótico com o intuito de facilitar o dia a dia dos cadeirantes e mostrar que é possível criar artefatos de tecnologia assistiva com baixo custo. Durante a realização deste trabalho, aprimoraram-se as habilidades em mecânica, elétrica, eletrônica e programação, além de aprender um pouco sobre as cadeiras de rodas e as dificuldades que seus usuários encaram diariamente. Elaborou-se um artefato robótico utilizando o Kit Lego MINDSTORM EV3 e posteriormente o micro controlador Arduino com aplicativo Android. Um dos pontos importantes para a obtenção de resultados satisfatórios foi a participação do usuário de cadeira de rodas motorizada durante todo o processo de desenvolvimento dos protótipos. Com a participação do Adriano que utiliza a cadeira de rodas, tornou-se mais fácil desenvolver o artefato robótico com desempenho eficaz e um design adequado às necessidades do usuário. Ao analisar os resultados obtidos junto a um terapeuta ocupacional, constatou-se por meio da avaliação COPM, que o usuário obteve maior satisfação e desempenho na realização de suas atividades cotidianas utilizando o artefato, como por exemplo, realizar sua transferência para a cadeira de rodas, sem o auxílio de um terceiro. Trabalhos futuros: Apesar de obter um bom resultado o artefato precisará de outros testes para que possa ser utilizado diariamente. Como o projeto foi desenvolvido em apenas um semestre, não houve tempo hábil para simular a utilização do artefato em ambientes internos e externos, portanto o artefato desenvolvido não pôde ser utilizado por se tratar de uma prototipação que ainda está em aperfeiçoamento. Outras melhorias serão: a inclusão do monitoramento do nível de carga da bateria; ligar a cadeira remotamente não necessitando mais ficar o tempo todo ligada; aprimorar o dispositivo móvel para parear automaticamente com qualquer dispositivo bluetooth que possuir a senha do artefato."
}