{
    "Autor": "Carlos Miguel Carvalho de Souza",
    "Título": "ANÁLISE DE PADRÕES DE PROGRAMAÇÃO EM LOGS COLETADOS A PARTIR DO USO DA PLATAFORMA SCRATCH",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Cristian Cechinel",
    "Coorientador(a)": "Prof. Vilson Gruber, Dr.",
    "Resumo": "Este trabalho visa analisar os padrões dos dados de uma ferramenta de coleta de interações de alunos em projetos da plataforma Scratch realizada pela UFPEL, Universidade Federal de Pelotas, do Rio Grande do Sul, juntamente com o estudante Jorge Nachtigall. Foram estudados para realização deste trabalho métodos da mineração de dados como associação, agrupamento e classificação. Além disso, com os dados, da ferramenta de coleta de interações, disponibilizados em JSON (JavaScript Object Notation) pela UFPEL, foi importado as informações das coletas para o Python a fim de realizar a aplicação do K-means, algoritmo de agrupamento e, além disso, foi utilizada a análise de padrões desses dados com o WEKA, plataforma que permitiu realizar a aplicação de teste do k-means pelo ângulo das médias de coeficientes além de comprovar os dados do código desenvolvido para o algoritmo de clusterização. O objetivo deste estudo é promover o uso e estudo de técnicas de mineração de dados a fim de que futuramente esse projeto possa auxiliar professores que utilizam o Scratch em suas aulas para prever resultados e analisar os dados adquiridos das interações realizadas pela coleta de interações da ferramenta.",
    "Palavras-chave": "Mineração, K-Means, Scratch, Aluno, Agrupamento.",
    "Introdução": "No século XXI, o âmbito educacional, de ensino básico, está sendo composto por alunos que cresceram após o surgimento de tecnologias como: a internet, os computadores modernos e os smartphones. O impacto dessa evolução tecnológica marcou a mudança de perfil no aprendizado dos alunos. Atualmente, o aluno tem características novas como: a capacidade de realizar mais tarefas ao mesmo tempo, postura mais ativa em relação a busca da informação, necessidade de motivação como feedbacks constantes (NAVEAVELA, 2018). Segundo dados levantados pelo fórum econômico mundial, 65% dos empregos dos estudantes de ensino básico, atualmente, ainda não existem (WEF,2018). O ensino de programação, em todo mundo, tem aumentado sua demanda justamente por ser considerada um dos possíveis “empregos do futuro”, mas além disso pela capacidade de desenvolver o aluno em diversos aspectos. A aprendizagem de códigos já faz parte do currículo obrigatório em países como Austrália, Reino Unido, Estados Unidos e Alemanha. Os jovens dos países que utilizam a programação como disciplina obrigatória, já demonstram melhorias em habilidades como organização, compreensão de conceitos matemáticos, hábitos de pesquisa, resolução de problemas, comunicação e uso de tecnologia (IDOCODE, [201-?]). Para auxiliar a aprendizagem de programação do estudante do segmento infantil e adolescente, a plataforma de ensino Scratch contém um modelo mais simplificado e visual de ensino permitindo a criação de jogos e projetos de forma facilitada (CTRLPLAY, [201-?]). O programa é adquirido de forma gratuita e possui uma linguagem baseada em blocos que ativa no jovem o interesse pela resolução dos projetos. Além disso, a ilustração em desenhos faz com que o entendimento dos códigos esteja mais próximo do público alvo. Desta forma, o interesse e a procura pelo conhecimento de programação no jovem iniciante é alcançado. Porém, em determinados casos o ensino de algoritmos pode se tornar complexo por sua cadeia de acontecimentos dentro dos códigos. A complexidade no início da aprendizagem pode desestimular o aluno e fazer com que ele perca o interesse na aprendizagem de programação. No dia a dia pedagógico, utilizando plataformas práticas de ensino, como o Scratch, a coleta dos dados de interações dos alunos pode auxiliar o professor a identificar padrões de desempenho. O estudante Jorge Nachtigall da UFPEL, no seu TCC intitulado “Um Framework para Coleta de Interações em Projetos Scratch” detalhou a criação de uma plataforma de coleta de dados utilizada para minerar as interações dos alunos (VAZ JUNIOR,2019). Dessa forma, caso o padrão de desempenho do discente seja negativo, é possível intervir, como professor, tentando auxiliar o aluno a encontrar, ou estimular, o seu estilo de aprendizagem e converter a situação problema. A computação, no geral, tem esta virtude de transformar dados cotidianos aglomerados em informações que organizadas auxiliam a ter um mapa comportamental sobre as interações ocorrentes. Desta forma, com tecnologias computacionais envolvendo data-mining, big-data e outros, é possível utilizar de dados cotidianos, utilizados em plataformas de ensino, como o Scratch, para auxiliar o professor encontrando os padrões das interações indicando possíveis resultados.",
    "Conclusão": "Este trabalho possibilitou a análise dos padrões das interações dos dados com a plataforma scratch. Os dados disponibilizados pela UFPEL, no framework desenvolvido pelo estudante Jorge, possibilitaram a coleta do histórico de interações de 8 computadores que foram analisadas dentro desse trabalho de conclusão de curso. Com isso, foi possível aplicar o agrupamento das informações geradas, visualmente apresentadas pelo algoritmo k-means, e também detalhar essa clusterização pela plataforma WEKA. Além disso, foi possível entender as construções de bloco de código do Scratch. Foi possível entender diferentes tecnologias de mineração de dados, a fim de compreender como interpretar e analisar os dados das interações disponibilizadas. Ao realizar esse estudo, foi possível escolher a análise de grupos/clusterização com o algoritmo k-means. Entretanto, por conta da pouca quantidade de dados, o trabalho realizado foi limitado, principalmente não havendo a medição da qualidade dos dados por conta da quantidade de dados analisados. Futuramente, este trabalho terá sua continuidade para a ampliação dos dados e também na avaliação da qualidade e quantidade dos dados. Os conceitos apresentados irão contribuir futuramente para inicialização e desenvolvimento de novos integrantes do projeto. Dessa forma, esse material servirá como guia para outros participantes, além de disponibilizar esse estudo, principalmente, para os estudantes do curso de Tecnologias da Informação e Comunicação que não possuem esse material dentro da grade curricular e tem o desejo de estudar essa área."
}