{
    "Autor": "STÉFANI ANTONELLI GOERCK DE FREITAS",
    "Título": "DESENVOLVIMENTO DE UM SISTEMA DE CONTROLE EMBARCADO PARA A EQUIPE DE FUTEBOL DE ROBÔS ARARANGUÁ INTRUDERS",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Anderson Luiz Fernandes Perez",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho descreve o desenvolvimento de um sistema de controle embarcado para a equipe de futebol de robôs Araranguá Intruders. O futebol de robôs possui várias categorias e uma delas é a F180. A sistemática do jogo é baseada em robôs, que estão em campo, e um computador externo que envia os comandos que devem ser executados por cada robô. Nesse caso os robôs são jogadores passivos, tendo o papel apenas de agir de acordo com a ação que lhe foi enviada. Este projeto visa fazer com que os robôs tenham um comportamento mais “inteligente”, fazendo com que estes sejam agentes ativos dentro de campo, participando intensamente do jogo. Para isso foi necessário o desenvolvimento de um sistema embarcado que levasse em consideração não apenas informações vindas do computador técnico, mas também de sensores embarcados nos robôs que os ajudassem na percepção do ambiente. Esse sistema usou técnicas de interrupção e de tempo real. O sistema desenvolvido permite que o robô execute ações, baseadas em dados recebidos do computador técnico e do seu próprio sistema em resposta às ativações dos sensores. O sistema embarcado foi projetado com dois níveis de controle, as tarefas de tempo real estão no primeiro nível formando uma arquitetura hierárquica, enquanto os sensores e o controle dos atuadores estão no segundo nível de controle, formando uma arquitetura reativa. O sistema embarcado foi testado e validado e os resultados demonstram que o número de troca de mensagens entre o computador técnico e o robô diminui, assim tem-se mais tempo computacional para o processamento da estratégia, tornando a equipe mais competitiva.",
    "Palavras-chave": "futebol de robôs, sistema embarcado, robótica móvel, categoria F180, microcontrolador PIC.",
    "Introdução": "O desenvolvimento da tecnologia tem sido apresentado para a sociedade de diversas maneiras e tem se tornando real na vida cotidiana. O uso de robótica tem se popularizado muito, os robôs falam, cantam, dançam e até têm a aparência dos seres humanos. Entretanto, existe uma tecnologia que é ainda mais presente, e que se difunde de maneira discreta, são os sistemas embarcados. Estes já fazem parte do cotidiano das pessoas, em muitos casos, de modo imperceptível. Por crescerem e se difundirem em grande número os sistemas embarcados são um campo da tecnologia que merece a devida atenção. O uso de sistemas embarcados percorre todas as áreas de domínio humano, em atividades simples ou complexas eles têm se apresentado eficientes e importantes, e assim seu desenvolvimento começa a ser mais valorizado e estudado. Os sistemas embarcados têm a capacidade de tornar um equipamento simples na casa de alguém um aparelho tecnológico que irá realizar a tarefa desejada com ainda mais eficiência. Os sistemas embarcados relacionam-se fortemente com a robótica móvel e com a inteligência artificial. Várias entidades criam cenários que são tidos como problemas primários a serem estudados, sendo um destes cenários o futebol de robôs. Este ambiente foi escolhido por lidar com os mais diversos tipos de conhecimento e por contar com uma grande abrangência de informações, é um ambiente desafiador já que todo este escopo deve ser dominado para formar uma equipe adequada e competitiva (ROBOCUP, 1998). No futebol de robôs existem conceitos que vão desde o projeto e a construção do hardware até o projeto e o desenvolvimento do software, e um ponto que une esses dois extremos são os sistemas embarcados, um software que é integrado ao hardware e que usa todos os seus recursos para a realização de uma tarefa. Por isso a robótica móvel, com o foco no futebol de robôs, é uma prática de estudo difundida por todo o mundo, existem muitas inovações que são desenvolvidas nestas competições. Um desafio dentro da categoria F180 do Futebol de Robôs é tornar os robôs, normalmente passivos, agentes ativos em campo. Isso pode ser possível através do desenvolvimento de um novo sistema de controle embarcado para os robôs. Dotar o robô de algum grau de inteligência seria interessante já que aumentaria a competitividade da equipe, equilibrando adequadamente responsabilidades entre os robôs e o computador técnico.",
    "Conclusão": "Neste trabalho foi apresentado o sistema de controle embarcado desenvolvido para a Equipe de Futebol de Robôs Araranguá Intruders. O sistema desenvolvido tinha o objetivo de tornar o robô um agente ativo, ou seja, com mais responsabilidades do que comumente acontece no futebol de robôs. Para tornar o robô um jogador participativo ao invés de apenas reativo foi desenvolvido um sistema de controle embarcado que levasse em consideração não apenas informações advindas do computador técnico, mas também informações internas e externas lidas dos sensores embarcados no robô. O sistema embarcado visa auxiliar o computador técnico no objetivo de vencer o jogo, para isso assumiu maiores responsabilidades, mas qualquer atitude é realizada não pelo bem de um robô, mas sim da equipe. Dessa maneira pode-se perceber, que mesmo dotado de sensores e tendo um papel mais ativo em campo, o sistema embarcado submete-se à estratégia do computador técnico. Pelo fato do futebol de robôs ser um ambiente dinâmico, todas as ações e reações dos robôs ocorrem muito rapidamente, por conta disso, o sistema embarcado deve conciliar a quantidade de informações de entrada com as ações de saídas que devem ser condizentes com a estratégia da equipe. As mensagens recebidas do computador técnico são muito constantes, mesmo assim o sistema embarcado conseguiu gerenciar os comandos e executou cada um deles. Mesmo tratando as informações vindas dos sensores, a capacidade computacional do microcontrolador deu ao robô o tempo suficiente para executar tanto o controle dos sensores e dos atuadores, quanto receber e agir de acordo com as mensagens do computador técnico. As tarefas de tempo real foram imprescindíveis para a adequada recepção das mensagens, percebe-se que a partir dos resultados, o tempo de envio de mensagem do computador técnico é maior do que o período em que a tarefa não está executando. O sistema embarcado cumpriu com os requisitos básicos de controle que se resumiam em executar adequadamente as ações recebidas e superou o que era pretendido quanto ao tratamento de sensores. Dotar o robô de mais fontes de informação fortaleceu o sistema embarcado e também o computador técnico, porque algumas responsabilidades passaram do controle do sistema externo para o interno. O sistema demonstrou interdependência para com o computador técnico ao invés da dependência comum à categoria. E atestou-se que, nesse projeto o único tipo de mensagem que foi trocado entre o computador técnico e o robô foram as ações que compõem a estratégia para fazer o gol, atingindo o objetivo de manter a troca de mensagens no menor nível possível. Assim a capacidade de processamento do computador técnico ficou mais focada na interpretação dos dados provenientes do sistema de visão e consequentemente na geração de estratégias, fazendo com que a equipe se torne mais competitiva."
}