{
    "Autor": "MÁRCIO ELIAS HAHN DO NASCIMENTO",
    "Título": "UMA ARQUITETURA DE SERVIÇOS WEB COMO MEIO DE INTERCÂMBIO DE DADOS ENTRE SISTEMAS HETEROGÊNEOS",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": null,
    "Resumo": "No contexto tecnológico atual, tecnologias emergem cotidianamente e com elas a necessidade de integração visando proporcionar uma maior flexibilidade em qualquer campo atendido por um dado conjunto tecnológico distinto. No âmbito de negócios, informações são consideradas um bem vital para a organização. Por este fato, a centralização das mesmas agiliza e facilita a tomada de decisão, bem como a execução de qualquer processo inerente ao negócio. Diferente do modelo lógico empresarial, onde todas as informações dos diversos setores que compõem a organização são centralizadas, no modelo físico, tais informações estão dispostas em vários sistemas, dispositivos, bases de dados, e outros recursos computacionais, empregando diferentes tecnologias. Com o propósito de interligar de modo transparentes estes componentes heterogêneos surge a necessidade de um meio capaz de atingir tal objetivo. É neste contexto que se torna relevante o emprego da tecnologia de serviços web. A arquitetura de serviços web está em expansão, e tem grande aceitabilidade no meio tecnológico, por proporcionar uma interface padronizada, possibilitando a comunicação entre diferentes plataformas com uma curva de adaptação reduzida. Propõe-se aqui uma arquitetura de software que implementa uma interface de serviços web para promover o intercâmbio de dados entre dispositivos móveis e um sistema ERP. Empregando conceitos de serialização de objetos, protocolo de transporte e servidores de aplicação, a solução tem o propósito de promover a comunicação entre as duas plataformas de modo transparente para os usuários. Busca-se ainda um desempenho satisfatório dentro das restrições de redes móveis e poder de processamento desses dispositivos. A aplicação da arquitetura proposta proporcionou um aumento no desempenho das equipes de vendas a qual utilizam os dispositivos móveis. Em virtude da precariedade das redes móveis, na solução atual, uma simples transferência de um pedido de compras para o sistema ERP da empresa vinculada ao estudo de caso era mensurada em minutos. Com a solução de serviços web, foi possível a redução desta unidade para segundos.",
    "Palavras-chave": "Serviços Web, SOAP, RESTful, XML, JSON",
    "Introdução": "Com o desenvolvimento tecnológico proporcionado nas últimas décadas (anos 70 até os dias atuais), muitas foram às inovações que hoje influenciam de forma direta o dia a dia das pessoas. Destacam-se dentre estas tecnologias aquelas voltadas para o setor de computação móvel. Conforme afirma Lemos (2007), “os dispositivos móveis são a ferramenta mais importante de convergência midiática hoje”, fato este ligado à popularização do acesso à internet por meio destes dispositivos, bem como a constante agregação de funcionalidades antes presentes somente em computadores e notebooks, como: compartilhamento de fotos, acesso às redes sociais, leitura de notícias em tempo real, acesso a serviços de meteorologia, informações sobre o trânsito, entre tantas outras. Na visão de McFaddin et al. (2008) a computação móvel prevê um mundo no qual humanos carregam dispositivos contendo todos os dados de sua vida cotidiana, e, usam estes dispositivos para se comunicar uns com os outros e desempenhar em funções chaves, relacionadas a sua localização e contexto. Os autores comentam ainda que o propósito de comunicação está bem desenvolvido por meio de aplicações de voz, e-mail e mensagens. Contudo, no que diz respeito a localização e contexto dependem fundamentalmente da aplicação de serviços para prover informações. Em termos conceituais de tecnologia, quando mencionado o termo “aplicação de serviços”, está sendo feita uma referência direta a tecnologias de serviços web, por meio das quais os dispositivos móveis (assim como dispositivos de outras plataformas), comunicam-se de forma transparente. Para Pilioura et al. (2005), o paradigma de serviços web é atualmente considerado a mais promissora e rápida evolução tecnológica para o desenvolvimento de aplicações em ambientes abertos, distribuídos e heterogêneos. A proliferação deste paradigma coincide com o significante aumento na capacidade de processamento dos dispositivos móveis, tanto em quesitos de hardware quanto de software. A combinação dos dois mundos é considerada de suma importância para a indústria da computação nos próximos anos. Quanto a conceituação de Serviços web Hamad, Saad e Abed (2010) atingem seu objetivo de forma neutra com relação a tecnologia, provendo interfaces bem definidas para funcionalidades distribuídas, as quais são independentes de plataforma de hardware, sistema operacional ou linguagem de programação. Baseado nestas visões este trabalho se propõe a apresentar o desenvolvimento de um aplicativo baseando-se na tecnologia de serviços web, promovendo ainda um entendimento sobre o macro ambiente envolvido em uma solução desta natureza, voltada para o consumo de serviços por dispositivos móveis. Para tanto, faz-se necessário uma breve conceituação realizada desde o histórico de desenvolvimento da Web, bem como o estudo dos dois principais protocolos e arquiteturas de Serviços Web, SOAP (Simple Object Access Protocol) e RESTful. Segundo Tidwell, Snell e Kulchenko (2001), SOAP se coloca no topo da pilha de tecnologias para serviços web como protocolo padrão para empacotamento de mensagens compartilhadas por aplicações. Baseado em XML (Extensible Marckup Language) provê mecanismos para descrição e descoberta de Serviços (respectivamente WSDL - Web Service Definition Language e UDDI - Universal Description, Discovery and Integration). Trata-se de um meio robusto e seguro de desenvolvimento de aplicações orientadas a serviços, além de ser regulamentado pelo W3C1 (World Wide Web Consortium). Contrariando as afirmações do parágrafo anterior, o Protocolo SOAP não seria a solução ideal para o desenvolvimento uma aplicação capaz de promover o acesso ágil a informação, caso o cliente seja um dispositivo móvel, por este ser menos favorecido em questão de processamento, memória e acesso à internet. Segundo Hamad, Saad e Abed (2010) SOAP mostrou-se muito verboso, devido ao fato principalmente de sua base estar em padronização XML, enquanto que o paradigma RESTful, empregando a serialização de objetos utilizando JSON (Javascript Object Notation) mostrou-se mais eficiente nestes dispositivos.",
    "Conclusão": "O objetivo geral deste trabalho foi apresentar uma arquitetura que sustentasse a comunicação de dados entre sistemas de plataformas distintas de forma transparente, focando em requisitos de segurança, interoperabilidade, baixa suscetibilidade à erros e principalmente, o desempenho. Para atender aos objetivos buscou-se a aplicação da arquitetura de serviços web, devido ao fato de sua abordagem ampla, permitindo uma maior flexibilidade de desenvolvimento. Devido à variedade de soluções encontradas para o desenvolvimento desta arquitetura, foram estudadas as principais tecnologias, SOAP e RESTful. Com base na pesquisa realizada constatou-se um maior apelo pelo paradigma RESTful, devido a sua simplicidade e objetividade se comparado ao SOAP, o que para um dispositivo móvel com recursos limitados, tanto de processamento quanto de conexão, pesou na escolha. Para validar a pesquisa realizada foi elaborado um estudo de caso, em que se criou uma aplicação de serviços web com o objetivo de promover a comunicação entre um sistema de vendas desenvolvido para plataforma móvel, mais especificamente o iPad, e um sistema ERP. A arquitetura proposta contou com a inclusão de algumas particularidades importantes para o cumprimento dos objetivos propostos, e que também valorizaram a solução a ponto de ser adotada em ambiente de produção. Para atender aos requisitos de segurança, foi utilizada uma variável contendo um hash MD5 com dados de acesso do usuário do sistema móvel, bem como seu código de usuário. Estes dados obrigatoriamente são passados a todos os serviços disponibilizados. A aplicação de serviços web, ao receber uma requisição, obtém do banco de dados as credenciais do usuário através do código também passado via URL. Uma vez localizados os dados do usuário é gerado o mesmo hash MD5 e comparado com o informado pelo cliente. O acesso é liberado somente se todos os dados coincidirem. Outra particularidade da arquitetura aqui proposta foi à adoção da paginação de resultados retornados pela consulta aos serviços. Esta funcionalidade permitiu a diminuição dos erros, uma vez que a cada página de dados processada pelo dispositivo móvel os dados são validados evitando assim a inserção de grandes quantidades de informação até que fosse encontrada uma inconsistência. Isto permitiu ainda um ganho de desempenho pela facilidade de carregamento de cada página de dados individualmente, e pelo fato de poder continuar obtendo dados em caso de queda de conexão a partir da página que estava sendo transmitida no momento da queda. A interoperabilidade, ou capacidade de integração de recursos computacionais heterogêneos foi alcançada pelo simples fato da adoção da arquitetura de serviços web na constituição do projeto, já que esta é uma das características da arquitetura, conseguida pelo método de serialização de objetos. Contudo, este trabalho limitou-se apenas na apresentação das tecnologias envolvidas na arquitetura proposta, abordando as características intrínsecas de cada componente envolvido até o ponto relevante para a realização do estudo de caso. Ateve-se também a realidade da empresa na qual o projeto foi desenvolvido, e propôs-se a substituir a solução até então adotada, atendendo aos mesmos requisitos e possibilitando uma expansão facilitada de funcionalidades e plataformas. Visando possíveis melhorias futuras nesta solução, menciona-se a integração de outras plataformas móveis, web, ou qualquer outra capacitada a implementar uma interface cliente de modo que se possa para consumir os serviços web desenvolvidos."
}