{
    "Autor": "Rogério José Bernardo",
    "Título": "Sistema Especialista para Auxiliar na Identificação da Infração de Trânsito",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Dra. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho apresenta o desenvolvimento de um sistema especialista voltado especificamente às infrações cometidas no trânsito. Para tanto, são abordados temas relevantes que fundamentam esta construção, como conceitos gerais do Código de Trânsito Brasileiro, Inteligência Artificial e Sistemas Especialistas. O sistema especialista proposto tem por objetivo de servir como ferramenta de apoio ao profissional da área de segurança pública para confecção de Autos de Infração de Trânsito (AITs). A base de dados utilizada na construção do Sistema Especialista foi elaborada de acordo com os capítulos XV e XVI do Código de Trânsito Brasileiro que apresenta todas as infrações e penalidades que podem ser aplicadas aos condutores de veículo automotor e pela portaria número 59 do Departamento Nacional de Trânsito, desta maneira o Sistema Especialista apresentará como resultado da consulta o tipo da infração, o desdobramento e medida administrativa a ser aplicada ao condutor do veículo em caso de ter sido cometida uma infração trânsito. Com o Sistema Especialista desenvolvido, denominado EXPERT-AIT, obteve-se uma modernização no sistema de consulta para confeccionar os Autos de Infração, onde os policiais podem captar informações sobre um determinado desdobramento rapidamente e seletivamente.",
    "Palavras-chave": "Inteligência Artificial, Sistema Especialista, Código de Trânsito Brasileiro.",
    "Introdução": "Atualmente, as instituições de segurança pública respondem satisfatoriamente à sociedade no combate e prevenção da criminalidade através de eficiência que poderá ser elevado com a otimização dos recursos disponíveis e o uso das tecnologias da informação. A modernização dos órgãos de segurança com o uso intensivo da Tecnologia da Informação é um dos vetores que provê eficiência e eficácia ao trabalho policial. Tal afirmativa pode ser transposta e aplicada integralmente aos problemas enfrentados aos crimes de trânsito, como exemplo temos o Projeto Fronteiras que nasceu de uma parceria entre a Confederação Nacional das Empresas de Seguros Gerais (CNSeg), o Departamento de Polícia Rodoviária Federal (DPRF), a Secretária Nacional de Segurança pública (SENASP), o Ministério da Justiça (MJ), a Receita Federal do Brasil. o Departamento de Polícia Federal (DPF) e Governos Estaduais. O objetivo do projeto Fronteiras é fazer o mapeamento e controle dos principais pontos de fluxo de veículos do país, gerando informações 24 horas por dia, durante os 7 dias da semana, de modo a municiar os órgãos citados acima com informações que permitam agir na redução dos problemas que o Projeto Fronteiras objetiva atacar. O projeto Fronteiras utiliza o software Sistema de Identificação de Modelos de Veículos (Simov), que é um software capaz de identificar o modelo do veículo a partir de imagens digitais obtidas por câmeras comuns. A tecnologia utilizada em sua concepção é o que há de mais moderno em Inteligência Artificial e Reconhecimento de Padrões. Esta tecnologia permite a identificação de dezenas de veículos irregulares (clonados, placas adulteradas e/ou trocadas). Uma vez identificados modelo do veículo e placa, é realizada uma comparação com o registro nacional, verificando a compatibilidade entre o modelo informado na licença e a imagem registrada (MINISTÉRIO DA JUSTIÇA, 2012). As questões referentes ao trânsito vêm sendo discutidas frequentemente entre a população e nos principais veículos de comunicação. O gerenciamento do trânsito esta cada vez mais complexo devido ao crescimento no número de usuários e em razão disso, há um elevado custo de manutenção das cidades. O gerenciamento inadequado do trânsito tem gerado resultados socioeconômicos negativos como: degradação da qualidade de vida; gastos públicos: financeiro, humano e tecnológico. Diversas técnicas e softwares são utilizados para prever o comportamento do trânsito, inclusive técnicas baseadas em Inteligência Artificial (IA), que tem sido uma área muito estudada na atualidade motivada pelo desafio intelectual e pela corrida por alcançar primeiro a criação de programas que realmente imitem a cognição humana. Segundo Russel (2004) a Inteligência Artificial é uma área da Ciência da Computação que tem por objetivo estudar e desenvolver métodos, técnicas e programas que permitam ao computador efetuar tarefas consideradas inteligentes, quando executadas por seres humanos. A IA está dividida em várias áreas de aplicação. Uma das áreas utilizadas é a dos Sistemas Especialistas (SE), que são sistemas utilizados para conter o conhecimento de um especialista humano, com a finalidade de auxiliar e/ou resolver problemas que só seriam solucionados com a presença desse especialista. Um sistema especialista eficiente permite fácil interação com o usuário do sistema, podendo trazer vantagens para as organizações de vários segmentos, proporcionando o aumento de produtividade, preservação e disseminação do conhecimento. A utilização dos sistemas especialistas permite o aumento do conhecimento para os seus usuários, ajudando-os quando precisam através de auxílio a tomada de decisão, treinamentos e conselhos, trazendo benefícios para a organização, podendo reduzir seus custos e funcionários com a adoção desse sistema. Com base nestes elementos, o presente trabalho propõe o desenvolvimento de um Sistema Especialista específico para as leis de trânsito, utilizando as técnicas de IA. Este sistema tem como base de dados às infrações cometidas no trânsito, inferindo assim de acordo com as informações passadas ao software, qual o desdobramento e a respectiva infração a ser aplicada pelo agente de trânsito ao se deparar com uma infração cometida pelo condutor de veículo automotor.",
    "Conclusão": "Neste trabalho foi construído um sistema especialista, denominado EXPERT-AIT, para auxiliar o policial a identificar os códigos e os desdobramentos necessários para o correto preenchimento de um Auto de Infração de Trânsito. Para a modelagem do processo de desenvolvimento do SE foi utilizado a UML e para a implementação foi utilizada a ferramenta Shell Expert SINTA. Observou-se que a ferramenta Shell Expert SINTA utilizada para elaboração das regras de produção se apresentou como sendo de enorme importância, pois facilitou o desenvolvimento do Sistema Especialista, reduzindo assim tempo da elaboração do mesmo. Na avaliação do EXPERT-AIT foram utilizadas as técnicas de observação direta e questionário. A observação direta com o objetivo de medir o tempo do policial na busca de dados para preencher a AIT. E o questionário com objetivo de avaliar se o Sistema Especialista EXPERT-AIT auxiliou o policial na tomada de decisões sobre qual multa aplicar ao constatar uma infração de trânsito. Como resultado deste SE se obteve uma modernização no sistema de consulta para confeccionar os Autos de infrações de trânsito no 19º BPM, onde os policiais podem captar informações sobre um determinado desdobramento rapidamente e seletivamente. Para o efetivo do 19° Batalhão da Policia Militar o EXPERT-AIT apresentou as seguintes vantagens: auxiliou para reduzir as falhas humanas e acelerar tarefas; aumentou o desempenho na emissão dos AITs; apresentou estabilidade; preservou o conhecimento dos especialistas; contemplou hipóteses múltiplas nas perguntas; apresentou maior eficiência e otimização de resultados; possui maior rapidez na resolução de problemas; e soluciona problemas tão bem quanto um especialista humano. Obtiveram-se críticas cem por cento positivas por parte dos usuários. O sistema apresentou-se funcional e atendeu as expectativas esperadas pelos usuários. Todos os usuários foram unânimes em solicitar que fosse acrescida nos resultados do EXPERT-AIT a pontuação que os infratores receberão com os respectivos AITs. Ao final deste trabalho, considera-se que todos os objetivos propostos foram alcançados satisfatoriamente. Como resultado obteve-se, além do aprendizado adquirido com o desenvolvimento do trabalho, um Sistema Especialista considerado pelos policiais como inovador, já que os mesmos até o presente momento não tinham visto nenhum outro com o foco apresentado. Considera-se ainda que, após melhorias e acréscimo de maiores funcionalidades, o sistema especialista proposto neste trabalho, possui grandes chances de aplicação no mercado."
}