{
    "Autor": "Ricardo Pires Maciel",
    "Título": "Desenvolvimento de uma Abordagem Computacional para Detecção Facial e Rastreamento do Sistema Visual da População Infantil",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Cristian Cechinel Dr.",
    "Coorientador(a)": "Prof. Antonio Carlos Sobieranski, Dr.",
    "Resumo": "Este Trabalho Conclusão de Curso foi julgado adequado para obtenção do Título de “Bacharelado em Tecnologias da Informação e Comunicação ” e aprovado em sua forma final pelo Curso de Graduação em Tecnologias da Informação e da Comunicação do Centro de Ciências, Tecnologias e Saúde da Universidade Federal de Santa Catarina – Campus Araranguá. Araranguá, 25 de março de 2022.",
    "Palavras-chave": "Visão computacional. Análise de imagem. Tratamento precoce. Distúrbio infantil.",
    "Introdução": "A visão é o sentido com maior informação sensorial do ser humano, com isso deficiências visuais podem prejudicar o desenvolvimento na infância. Atualmente, os aparelhos para análise da visão possuem altos valores e uma das possibilidades são as tecnologias da informação e comunicação, amplamente utilizadas no avanço da saúde. Objetivos: Este trabalho tem como objetivo desenvolver um software que auxilie na detecção facial e rastreamento visual da população infantil entre 0 e 24 meses, como ferramenta preliminar para um processo computacional de tomada de decisão acerca das atipicidades da visão infantil. Metodologia: Para o desenvolvimento do software foram realizadas três fases: definição do padrão de captura, obtenção das imagens para formação de um banco de imagens da população infantil e o desenvolvimento de um algoritmo de detecção facial e do sistema visual em recém-nascidos. Resultados preliminares: Participaram do estudo 40 crianças. O estudo apresentou como resultado o funcionamento do software de acordo com a proposta inicial e fases desenvolvidas para conseguir alcançar a função final de rastreamento das posições percorridas pela íris. Conclusão e discussões: Com um algoritmo de detecção visual desenvolvido, é possível que se faça o rastreamento de objetos do sistema visual. Com isso, espera-se facilitar e difundir exames de verificação de distúrbios visuais na infância a ser realizado a posteriori por outros processos computacionais, assim facilitando o tratamento precoce.",
    "Conclusão": "Com os avanços recentes na tecnologia, em termos de hardware e de algoritmos de processamento de imagem, cada vez mais a visão computacional é viável nas mais diversas aplicações, sejam elas comerciais, pessoais ou em pesquisa. O presente estudo traz como conclusão a execução eficaz do desenvolvimento de um software que auxilie na detecção facial e rastreamento visual da população infantil, além da aquisição de imagens ou vídeos do protocolo de bateria de testes visuais na população infantil para construção do dataset interno. Com o dataset interno, irá se desenvolver futuramente um modelo computacional para a tomada de decisões sobre possíveis atipicidades visuais na população infantil. Portanto o projeto ainda está sendo executado e possui diversas novas etapas em concepção. Com o rastreamento da movimentação da íris nos estímulos externos realizados, será possível, com a análise das respostas visuais pelos profissionais de saúde especializados na área visual infantil, detectar possíveis alterações visuais e desta forma encaminhar a criança para o tratamento de forma precoce. O estudo, no futuro, pode aprofundar o funcionamento do software com o aumento na quantidade de vídeos no dataset e dessa formar aumentar a robustez nas respostas da íris e também a identificação e rastreamento de outras estruturas oculares, aumentando o número de atipicidades possíveis de serem detectadas. Ademais, o software pode evoluir para a versão mobile, tornando-se viável o seu uso na rotina dos profissionais de saúde, tanto no âmbito hospitalar, como ambulatorial, facilitando o diagnóstico funcional da visão de forma precoce e assim também o seu tratamento. Os pontos limitantes do estudo incluem a dificuldade do software em delimitar o rosto da criança quando em algum momento do vídeo aparecia o rosto de um adulto, como os pais ou o avaliador, visto que os pontos extremos do rosto são diferentes e limitam esta detecção, além da necessidade de um maior tempo viável para robustez do software."
}