{
    "Autor": "Marina Carradore Sérgio",
    "Título": "UMA ARQUITETURA DE DESCOBERTA DE CONHECIMENTO BASEADA NA CORRELAÇÃO E ASSOCIAÇÃO TEMPORAL DE PADRÕES TEXTUAIS",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": "",
    "Resumo": "Atualmente, o volume de informação gerado aumenta em escala exponencial, sendo que grande parte desta informação encontra-se na forma textual. Através deste formato é possível extrair ativos de conhecimento, ou seja, regras, padrões, tendências, redes, capazes de auxiliar no processo de tomada de decisão dentro das organizações com o intuito de gerar vantagem competitiva. Em virtude da grande disponibilidade de documentos textuais, seja na web ou mesmo nas organizações, assim como, a falta de padronização dos mesmos, tal tarefa constitui-se em um desafio computacional. Neste sentido, é necessário o devido pré-processamento e adequação dos dados. Um meio de se extrair tais ativos de conhecimento é através do processo de Descoberta de Conhecimento em Textos. A partir disto, propõem-se neste trabalho uma arquitetura para descoberta de conhecimento em bases textuais que seja capaz de revelar relacionamentos diretos e indiretos entre padrões textuais (termos) e que tenha suporte da Computação Distribuída. A demonstração de viabilidade é realizada através de um protótipo desenvolvido com base na arquitetura proposta. Como principal resultado do trabalho menciona-se a apresentação da interconexão temporal entre termos através do conceito de associação indireta e posteriormente correlação (associação direta). Além disto, pode-se afirmar que, tanto as distribuições de frequência de um termo quanto os mapas de tópicos, ambos baseados na dimensão tempo, auxiliam no entendimento de determinado domínio do problema. Por fim, a aplicação do protótipo em um cenário permitiu demonstrar que a arquitetura proposta neste trabalho é capaz de atingir resultados consistentes e satisfatórios no que se refere ao entendimento de determinado domínio a partir bases textuais.",
    "Palavras-chave": "Descoberta de Conhecimento; Bases Textuais; Relacionamentos Indiretos; Computação Distribuída.",
    "Introdução": "As evoluções decorrentes das tecnologias da informação e comunicação estão produzindo um avanço significativo no número de documentos que são armazenados e processados. O avanço é decorrente principalmente do aumento da capacidade de processamento, conectividade e armazenamento. Este fenômeno torna-se cada vez mais evidente e vem sendo observado por diversos estudiosos da área. Uma expressiva quantidade de informações é produzida a todo momento, através de documentos formais ou até mesmo em sites como: Hotmail™, Gmail™, redes sociais, ou de uma maneira mais geral na internet ou na intranet. Conforme Hilbert e López (2011), até o ano de 2007 fomos capazes de gerar aproximadamente 295 exabytes de informação o que equivale a 1024 x 106. Para chegar a estes dados os pesquisadores analisaram 60 tecnologias analógicas e digitais de armazenamento, comunicação e computação de informação, durante o período de 1986 a 2007, sendo que dos dados gerados, a humanidade produziu 2,9 x 10²º de dados comprimidos, comunicava-se 2 x 10²¹ e realizava 6,4 x 10¹8 instruções por segundo em computadores de uso geral, como por exemplo desktops ou notebooks, sendo que aproximadamente 94% desta informação está contida em meios digitais. Recentemente o mundo produz entre um e dois exabytes de informação nova por ano, ou seja, algo em torno de 250 megabytes para cada habitante na Terra (LYMAN; VARIAN, 2003). Segundo Bohn e Short (2009), os bytes de informações consumidas por indivíduo nos Estados Unidos têm crescido cerca de 5,4% ao ano, desde 1980, sendo consumido cerca de 3600 exabytes de informações em casas americanas. Em estudos mais recentes, Bohn e Short (2009), concluíram que as horas dispendidas com o consumo de informação pelos americanos cresceram 2,6% ao ano, no período entre 1980 e 2008, devido ao crescimento populacional e ao tempo dispendido por cada pessoa à busca por informação. Concluíram também que com o advento dos computadores, um terço da informação e mais da metade dos bytes são recebidos de forma interativa. Gantz e Reinsel (2010), afirmam que até 2020, a quantidade de informações digitais criadas e replicadas no mundo vai crescer aproximadamente 35 trilhões de gigabytes. Os estudos mostraram que em 2009 o universo digital cresceu em torno de 62%, cerca de 800000 petabytes, através desta expressiva quantidade poderíamos fazer uma pilha de DVDs da terra até a lua, ida e volta, afirmam os pesquisadores. No ano de 2010, esse universo alcançaria 1,2 milhões de petabytes, o que equivale a 10¹5. Este crescimento explosivo significa que, em 2020, o universo digital será 44 vezes maior, sendo que a pilha de DVDs chegaria agora a meio caminho de marte. Gantz e Reinsel (2010), ressaltam que embora a quantidade de informações no universo digital vai crescer por um fator de 44, e o número de recipientes ou arquivos vai crescer por um fator de 67, no período entre 2009 a 2020, o número de profissionais de TI no mundo vai crescer apenas por um fator de 1,4. É perceptível o crescente aumento do universo digital. Os documentos impressos, que eram o maior meio de informação textual há algumas décadas, hoje representam apenas 0,003% da informação gerada anualmente (LYMAN; VARIAN, 2003). Segundo Gantz e Reinsel (2010), mais de 70% do universo digital no ano de 2010 foi gerado por usuários que estavam em casa, no trabalho ou até mesmo em movimento, representando cerca de 880 bilhões de gigabytes. Sistemas como o do Facebook™ chegaram a armazenar 1 petabyte de informações no ano de 2008, registrando cerca de 10 bilhões de fotos em seus servidores (WHITE, 2009). O suporte ao aumento da informação é possível graças à evolução dos meios de armazenamento magnéticos. Segundo Hilbert e López (2011), em 2000 os meios de armazenamento magnéticos representavam 5% da capacidade mundial, saltando para 45% em 2007, e a capacidade de armazenamento per capita que era de 2.866 megabytes em 1993, passou a ser de 44.716 megabytes em 2007. Com tanta informação disponível é necessário distinguir o que é dado, o que é informação e a partir de que momento a informação torna-se conhecimento. Os computadores trocam dados que podem ser facilmente capturados, comunicados e armazenados. Checkland e Holwell (1998), afirmam que os dados estão associados ao ponto de partida do processo mental, pois é ele que representa um fato existente no mundo real, independentemente de sua relevância ou interesse, visto não haver até aqui relação de fato com o usuário. Já informação está associada a dados dotados de relevância e propósito. Os seres humanos detêm poder de conferir relevância e propósito, exigindo assim a participação e a análise humana, que pode caracterizar-se como um ponto de vista ou uma forma de representação dos dados em uso (DAVENPORT, 1998; MCGEE e PRUSAK, 1994). McGee e Prusak (1994), comparam o conceito de informação ao conceito de beleza: ambos estão nos olhos do observador. A transformação de dados em informação requer que a pessoa responsável pelo processo decisório receba-os de tal forma que possa relacioná-los e que atue sobre eles. Assim, a informação deve ser discutida no contexto de usuários e responsáveis por decisões específicas. A estrutura de apresentação da informação que será armazenada poderá ocorrer de diferentes formas. Dentre estas estruturas estão à estruturada, a semiestruturada e a não estruturada. Em fontes de dados estruturadas de acordo com Silva (2009), os dados estão normalmente dispostos em tabelas, controladas por software de gerenciamento de banco de dados. As informações em fontes semiestruturadas encontram-se entre marcadores (tag), que podem ser reconhecidos ou processados por máquinas, como exemplos estão às páginas HTML e os documentos XML. Já a estrutura de apresentação dos dados obtida através de textos em linguagem natural é conhecida como não estruturada, ou seja, não segue um padrão. Segundo Silva (2009), a informação não estruturada não contém estrutura tabular e nem marcação. Essa informação advém de textos, por exemplo, que o próprio usuário escreve, como um relatório, ou até mesmo um comentário, um post em um blog, enfatizando que em torno de 80% das informações de uma organização estão contidas em documentos textuais, que são a forma mais natural de armazenamento de informações TAN (1999). A estrutura informacional é um processo de comunicação que visa o conhecimento (BARRETO, 1996; BRAGA, 1996; ZORRINHO, 1995). A distinção entre informação e conhecimento pode se dar no âmbito temporal considerando-se que enquanto a informação é descritiva, isto é, relaciona-se ao passado e ao presente, o conhecimento provê as bases para a previsão do futuro com certo grau de certeza baseado na informação sobre o passado e o presente (KOCK; MCQUEEN; SCOTT, 1997). Ainda na visão de Davenport (1998), o conhecimento é percebido como uma síntese de múltiplas fontes de informação, gerado na mente humana a partir da interpretação ou contextualização de informações externas conjugadas com a própria sabedoria da pessoa. A rapidez e a magnitude com que o conhecimento gerado passou a ser compartilhado provocou o surgimento de técnicas de reaproveitamento e produção de novos conhecimentos, bem como o aparecimento de novas necessidades de tratar a informação. Entre as possibilidades de ferramental, visando identificar conhecimento, a partir das informações geradas em determinado domínio encontram-se os processos de Descoberta de Conhecimento em Bases de Dados (Knowledge Discovery in Database - KDD) e de Descoberta de Conhecimento em Texto ( Knowledge Discovery in Texts - KDT). O processo de KDD é o termo utilizado para promover a descoberta de conhecimento em bases de dados, visando identificar e descobrir relacionamentos implícitos entre as informações armazenadas nos bancos de dados em sistemas organizacionais (SILVA; ROVER, 2011). Quanto ao processo de KDT este é similar ao KDD, porém trabalha com uma coleção de documentos em linguagem natural, buscando padrões e tendências, classificando e comparando documentos (SILVA; ROVER, 2011). Apesar do objetivo em comum, a descoberta de conhecimento, o KDT e o KDD, possuem diferenças importantes. A principal delas refere-se ao tipo de informação, uma vez que KDT trabalha com informações textuais (não estruturadas ou semiestruturadas), enquanto que o KDD trabalha com informações estruturadas, geralmente obtidas a partir de bancos de dados relacionais e/ou orientado a objetos. Passa-se então a analisar a descoberta de conhecimento sob a ótica de um processo que viabiliza a estruturação da informação vinda de textos. Na visão de Trybula (1999), a descoberta do conhecimento é o processo de transformação de dados em relações previamente desconhecidas e insuspeitas, que podem ser empregadas como preditores de futuras ações. Em virtude dos grandes desafios é necessário encontrar tecnologias capazes de recuperar a informação não estruturada e relevante dos documentos, seguindo critérios definidos pelo usuário e assim obter o melhor retorno, a fim de extrair conhecimento suficiente e tirar vantagem competitiva disto. A partir de um contexto no qual essas informações estão inseridas estas podem vir a esconder padrões que se relacionam indiretamente e evoluem ao longo do tempo. Os relacionamentos indiretos ocorrem quando os termos apesar de não coocorrerem no mesmo documento possuem elementos textuais em comum. Uma forma de extrair conhecimento em cima dos relacionamentos indiretos é aplicar a técnica de mapa de conceitos e mapas de tópicos sendo que estas são subáreas dos mapas de conhecimento. Segundo Pacheco et al (2007), recentemente com o crescente volume de informações e com o surgimento da área de gestão do conhecimento, as organizações têm procurado aplicar técnicas de mapas de conhecimento para a gestão do conhecimento. Como citado por Eppler (2001), um mapa de conhecimento fornece a orientação para alcançar um determinado universo, ao ajudar a localizar direções, a avaliar situações ou a planejar recursos, sugerindo analogia com um mapa geográfico afirmando que um mapa de conhecimento responde às mesmas quatro perguntas básicas a que um mapa geográfico procura responder: 1. Qual a minha localização atual? 2. Para onde posso ir? 3. Qual o menor caminho para alcançar o objetivo? 4. Quais os recursos necessários para chegar até o local desejado? A aplicação de gráficos também é utilizada para acompanhar a evolução do relacionamento indireto entre entidades. Os processos de descoberta de conhecimento com base no contexto em que as informações estão inseridas e nos relacionamentos indiretos que estas podem vir a conter, não são triviais, pois exigem grande demanda computacional em virtude dos algoritmos complexos e análises em cima de uma quantidade extensa de documentos, que contêm vasta informação, seja ela estruturada ou não. Com isso, este fato constitui-se em desafio, uma vez que tais processos, quando executados a partir de uma infraestrutura computacional inadequada, podem inviabilizar a obtenção de resultados desejados e esperados. Neste cenário, a computação distribuída desempenha um papel fundamental sendo capaz de trabalhar com grandes volumes de dados. Segundo Tanenbaum e Steen (2007), com a computação distribuída é possível utilizar um conjunto de computadores independentes, que na visão do usuário comportam-se como um sistema único e coerente. A principal motivação para a utilização deste sistema é a possibilidade de compartilhar recursos, tais como: componentes de hardware, discos, arquivos e bancos de dados (COULOURIS; DOLLIMORE; KINDBERG, 2005). Desse modo, o emprego da computação distribuída no processo de extração do conhecimento sobre grandes bases de dados é uma solução plausível que tende a gerar resultados positivos, possibilitando o desenvolvimento de sistemas capazes de analisar grandes fontes de informação com o objetivo de extrair conhecimento que pode a vir a ser utilizado no processo de tomada de decisão.",
    "Conclusão": "O objetivo geral do presente trabalho foi propor uma arquitetura computacional com base na computação distribuída e em técnicas de associação e correlação de elementos textuais que possibilitassem a descoberta de relacionamentos indiretos e temporais entre padrões textuais. A partir da revisão das áreas de descoberta de conhecimento e uma revisão sobre a computação distribuída buscou-se entender o domínio e o contexto ao qual o trabalho aplicava-se. Com base nos conhecimentos adquiridos foi possível realizar estudos e desenvolver um protótipo que suportasse o objetivo geral deste trabalho. O foco central do protótipo foi promover suporte aos processos de correlação e de associação considerando a sua aplicação em uma base de documentos que possibilitasse uma análise temporal. O processo de correlação utilizado é uma simplificação dos processos tradicionais de correlação, baseado no trabalho desenvolvido por Silva (2012), pois ao invés de inspecionar todos os documentos para verificar a quantidade de determinado padrão (termo) dentro destes documentos, considera-se somente a quantidade de documentos que mencionaram o termo. Quanto ao processo de associação o mesmo propõe-se em ser um modelo capaz de descobrir associações entre termos com base nos vetores de contextos dos mesmos. Este processo utiliza-se dos cálculos obtidos com a aplicação do processo de correlação. Com base nos resultados foram geradas análises sobre o domínio desenvolvido, sendo as mesmas expostas através de gráficos temporais que evidenciavam a existência de padrões comportamentais entre os termos em análise. Adicionalmente, foram elaborados mapas de tópicos que vislumbrassem parte do vetor de contexto envolvendo o termo em análise. A arquitetura distribuída do protótipo demonstrou flexibilidade e escalabilidade podendo ser expandida quando necessário por meio de computadores com hardware e sistemas operacionais distintos. Cabe salientar que o modelo para suportar os dados foi desenvolvido considerando o conceito de Data Warehouse. As tabelas que compõem o modelo são representadas por dimensões que fornecem o suporte para os dados e descrições. Têm-se ainda a presença de tabela de fatos, nestas tabelas são armazenadas medidas de valor que relacionem as tabelas de dimensões. Esse modelo pode em princípio representar qualquer domínio de aplicação que se baseie em relacionamentos entre conceitos. Entre as características centrais está a possibilidade de representação de relacionamentos em escala temporal. As limitações encontradas durante o processo envolveram o cenário, pois foi considerado um conjunto restrito de tempos e documentos, visto que não era possível ter acesso à base por completo. Neste sentido, a base de dados foi construída manualmente. Outro ponto de limitação do trabalho se refere à execução do protótipo em que este não foi aplicado de maneira distribuída, ainda que forneça suporte para tal. Durante o desenvolvimento do trabalho outras possibilidades foram vislumbradas como trabalhos futuros. Entre estas possibilidades menciona-se o desenvolvimento de uma interface gráfica que permita a integração com a aplicação e a base de dados, ao qual daria suporte à criação de gráficos e mapas de tópicos em geral para a apresentação das informações. A base de conhecimento gerada pode tornar-se um apoio à colaboração de uma comunidade de práticas. Com isso a mesma caracteriza-se como um repositório de documentos, com base em um domínio, sendo possível fazer diversas buscas à base, por meio de sistemas computacionais. É possível ainda a utilização dos conceitos de análise de redes para uma interpretação mais apurada dos resultados gerados. Pode-se vislumbrar ainda o desenvolvimento de um sistema para suportar a semântica existente entre os documentos, capaz de extrair padrões relevantes de determinado documento (chamados de entidades) e os relacionamentos entre estes. Apesar destes conceitos não terem sido acoplados ao protótipo, o mesmo foi projetado pensando nestas futuras melhorias."
}