{
    "Autor": "Carlos Eduardo Vilarinho",
    "Título": "UM SISTEMA DE RECOMENDAÇÃO BASEADO NO CONCEITO DE INTERNET DAS COISAS",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": null,
    "Resumo": "Atualmente as tecnologias de redes sem fio proporcionam ao cenário da Internet das Coisas um ambiente favorável em que usuários, além de consumirem informações, também são os principais responsáveis para a geração de novos conteúdos, uma vez que com a utilização de sensores inteligentes estas interações ocorrem de maneira despercebida. Desta forma, os avanços da tecnologia de sensores sem fio têm provocado um aumento acelerado no volume de informações disponíveis e a consolidação do conceito de Computação Ubíqua. A partir disto, este trabalho reside na proposição de um sistema de recomendação utilizando-se da tecnologia de sensores sem fio para identificar possíveis interesses de usuários por itens em ambientes físicos, através das abordagens de filtragem colaborativa e baseada em conteúdo. Para permitir a avaliação da proposta deste trabalho foi desenvolvido um protótipo, onde o mesmo é aplicado em alguns cenários de uso viabilizando a coleta de dados de modo que estes dados possam ser utilizados em um processo de recomendação. Através da avaliação das informações processadas e geradas com a utilização do protótipo elaborado para este trabalho é possível sugerir itens de interesse aos usuários. Por fim, pode-se concluir que os resultados obtidos no cenário de identificação de interesse dos usuários são consistentes e permitem prover importantes subsídios para guiar usuários em suas escolhas futuras.",
    "Palavras-chave": "Sistemas de Recomendação ; Near Field Communication; Internet das Coisas.",
    "Introdução": "Cada vez mais a comunicação por meio de tecnologias sem fio e a utilização de dispositivos móveis permitem aos usuários a produção e o consumo de conteúdo de uma maneira mais intuitiva e flexível. Considerando o conceito de rede sem fio, diversos tipos de protocolos e tecnologias foram criados, sendo agrupadas de acordo com a capacidade de seu alcance, com base nos modelos e definições aplicadas nas redes de comunicação cabeadas (FOURTY et al., 2005) : WPAN, Wireless Personal Area Network; WLAN, Wireless Local Area Network; WMAN, Wireless Metropolitan Area Network; WWAN, Wireless Wide Area Network. Entre as tecnologias que permitem a comunicação sem fio alguma vem se destacando, citam-se a Wi-Fi e a Bluetooth. A tecnologia Wi-Fi, está classificada como WLAN e a tecnologia Bluetooth classificada como WPAN. Geralmente, o objetivo da tecnologia Wi-Fi é promover o acesso à Internet, por abranger uma área de centenas de metros, permitindo que se estabeleça uma rede de comunicação. Já a tecnologia Bluetooth, foi desenvolvida pela Ericsson Mobile Communications ®, com objetivo inicial de estabelecer uma comunicação sem fio entre um telefone celular e seus acessórios. Atualmente, já é possível ser utilizada uma comunicação entre dois dispositivos, substituindo ligações ponto a ponto realizadas por cabos (FOURTY et al., 2005). O crescimento dos dispositivos que passaram a integrar o Bluetooth torna-a atualmente uma tecnologia com potencial para interligar dispositivos móveis, acessórios e sensores (SANTOS, 2007). A tecnologia Bluetooth está consolidada no mercado, e é utilizada na conexão de dispositivos, exercendo, por exemplo, funções de transferências de arquivos e coleta de dados. Promove assim, em cada projeto, uma forma de atuar e uma maneira única de uso, estando em constante crescimento (BOUALOUACHE et al., 2015). A partir deste contexto surge o conceito de Internet das Coisas, do inglês Internet of Things ou IoT, que determina uma presença difusa de objetos, sensores, identificação por rádio frequência (Radio-Frequency Identification - RFID), telefones celulares, todos conectados a uma rede de comunicação (CHO; KYUNG; BAEK, 2013). A Internet das Coisas surgiu na década de 90, quando alguns dispositivos começaram a ser conectados à Internet. Em 1999 o MIT (Massachusetts Institute of Technology) dedicava-se ao desenvolvimento da tecnologia RFID, quando o diretor executivo Kevin Ashton definiu o conceito de Internet das Coisas (SURESH; DANIEL; ASWATHY, 2014). A Internet das Coisas é vista como uma tecnologia emergente, pois desde o surgimento da Internet, esta é a primeira evolução real em que aplicações revolucionárias possuem potencial para melhorar consideravelmente a forma como as pessoas interagem com as rotinas sociais (GREENGARD, 2015). Diversas são as tecnologias existentes que podem ser aplicadas no contexto de Internet das Coisas, dificultando a escolha de qual seria a mais adequada em determinado cenário. Segundo Suresh, Daniel e Aswathy (2014), para esta escolha é necessário levar em conta qual o escopo do projeto pretendido, sendo que cada uma das tecnologias tem suas vantagens. A última atualização da tecnologia Bluetooth, chamada de BLE (Bluetooth Low Energy) ou ainda Bluetooth Smart foi elaborada com o intuito de obter melhores resultados em seu uso nos dispositivos com restrição de energia, sensores e controles sem fio (CHANG; CONSULTING, 2014). A implantação da tecnologia Bluetooth em diversos dispositivos eletrônicos vestíveis demonstra um cenário em que a Internet das Coisas pode atuar (SURESH; DANIEL; ASWATHY, 2014). Diante dos avanços das redes sem fio o NFC (Near Field Communication) se destaca por utilizar um padrão de comunicação que se limita em média a uma distância de 10 cm, com o funcionamento baseado no protocolo RFID. Através da aproximação ou um simples toque entre dispositivos uma comunicação rápida e segura é estabelecida, simplificando transações, trocas de informações e a conectividade entre dispositivos (DRAGUSHA; KOSUMI, 2013; KATIYAR; GUPTA; GUPTA, 2014). A utilização de sensores sem fio juntamente com dispositivos móveis promove novos meios de capturar, analisar e prover informações que de alguma maneira possam auxiliar os usuários. Neste cenário, diversas áreas vêem-se desenvolvendo, entre elas, a área de Sistemas de Recomendação. Os Sistemas de Recomendação objetivam o provimento de sugestões aderentes à determinado usuário quando este possui um grande número de opções (RICCI et al., 2011). De modo geral, os Sistemas de Recomendação têm sido desenvolvidos para direcionar usuários a localizar em itens de interesse através da aglomeração da informação coleta da através da interação de diversos usuários (CAZELLA; NUNES; REATEGUI, 2010). Por itens de interesse, entende-se como qualquer produto, serviço ou conteúdo que possa ser de interesse de determinado usuário. Os Sistemas de Recomendação se tornaram uma importante área de pesquisa desde meados de 1990. Para tal, se utilizam de algumas abordagens, entre as principais, a Filtragem Colaborativa (FC) e a Filtragem baseada em Conteúdo (FBC). A Filtragem Colaborativa propõe a seleção de informações ou padrões por meio de técnicas que utilizem a colaboração de múltiplos usuários. Por outro lado, a Filtragem Baseada em Conteúdo baseia-se nas características dos objetos que serão recomendados, sendo que o objetivo é recomendar itens que são semelhantes ao interesse que determinado usuário possui (RESNICK et al. 1994; SHARDANAND; MAES, 1995; CAZELLA; NUNES; REATEGUI, 2010).",
    "Conclusão": "Gradativamente os avanços tecnológicos nas redes de comunicação sem fio estão proporcionando o surgimento de diversas possibilidades para aplicações baseadas no conceito de Internet das Coisas. O objetivo deste trabalho foi propor um sistema de recomendação com base no conceito de Internet das Coisas, onde foram utilizados sensores sem fio para interagir com os usuários através de um aplicativo e coletar o interesse por produtos posicionados próximos aos sensores. Para atingir este objetivo, realizou-se inicialmente o levantamento bibliográfico nas áreas de pesquisa envolvidas no trabalho, citam-se os Sistemas de Recomendação, as Redes de Comunicação sem Fio e a Internet das Coisas. Através dos conhecimentos obtidos nestas etapas, foi possível desenvolver um protótipo para a plataforma Android® que se conecta com os sensores a fim de estabelecer a leitura de dados. O aplicativo desenvolvido neste trabalho para possibilitar a leitura, gravação e visualização das recomendações de um usuário foi batizado de SmartRecomm. Este aplicativo funciona com o auxílio de um dispositivo móvel na plataforma Android®. Além disso, existe a necessidade de TAGs estarem devidamente identificadas com informações de algum produto e posicionadas próximas ao objeto cadastrado. Os sensores são produzidos com a tecnologia NFC que cada vez mais se tornam comuns no mercado e com um baixo custo de aquisição. O sistema de recomendação SmartRecomm apresenta uma classe de serviço Android® que é responsável por gerenciar as funções da API do NFC, realizando a leitura ou a gravação de informações das TAGs quando se aproximam do dispositivo móvel. Para a aplicação da filtragem baseada em conteúdo torna-se necessária a interação dos usuários com os sensores, coletando informações de interesse por determinados itens. A partir destas informações foi possível realizar as recomendações baseadas em conteúdo. Para as recomendações geradas pela filtragem colaborativa foi necessário verificar as interações entre os outros perfis de usuários. Estes dados serviram como insumo para a execução de análises de itens levando em consideração as interações de usuários e assim, possibilitar a geração de recomendações utilizando esta abordagem. O desenvolvimento do aplicativo teve como objetivo a comunicação com sensores sem fio utilizando o conceito de Internet das Coisas, bem como, utilizar dos conceitos de recomendação baseada em filtragem colaborativa e recomendação baseada em conteúdo que pertencem aos Sistemas de Recomendação. Através da apresentação dos resultados foi possível constatar o êxito na geração das recomendações. As recomendações tiveram como insumo as leituras efetuadas pela aplicação móvel a partir das informações registradas nos sensores NFCs. Neste sentido, o objetivo geral do trabalho foi atingido. O desenvolvimento do trabalho levantou possibilidades para trabalhos futuros. Entre estas citam-se a utilização de sensores Bluetooth para a identificação dos usuários assim que se aproximem da entrada do estabelecimento, sem a necessidade da aproximação do dispositivo móvel ao sensor NFC. Isto permitirá que usuários possam entrar no estabelecimento sem a necessidade de uma pausa para a sua identificação. A utilização de uma nova abordagem para recomendar os prováveis itens de interesse com base no perfil de outros usuários, e verificar se o item sugerido por esta recomendação foi realmente identificado como um possível produto de interesse ao usuário. Desta forma, espera-se gerar recomendações mais precisas que a abordagem de filtragem colaborativa aplicada no trabalho. Finalmente, uma versão do aplicativo para outras plataformas de dispositivos móveis disponíveis no mercado como a plataforma iOS® seria adequada. A disponibilização do protótipo em outras plataformas visa aumentar a base de possíveis usuários."
}