{
    "Autor": "Ezequiel Dela Vedova de Matos",
    "Título": "SISTEMA MEU TCC: UMA IMPLEMENTAÇÃO DE FRONT-END WEB COM REACTJS",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.° Cristian Cechinel",
    "Coorientador(a)": null,
    "Resumo": "No presente trabalho realizaremos uma revisão dos termos relacionados ao gerenciamento de projetos e analisaremos a visão geral do Trabalho de conclusão de curso (TCC) como um projeto gerenciável e como a execução do mesmo funciona dentro do curso de TIC da UFSC, posteriormente o trabalho nos mostrará ferramentas que podem ser usadas para o gerenciamento de TCCs, porém não sendo específicas para este fim. Tendo em vista que a opção de ferramentas específicas para este fim são escassas, é realizada a proposta de um sistema Front End específico para gerenciamentos de TCCs, detalhando as etapas de planejamento e levantamento das informações necessárias para desenvolvimento do sistema proposto e as tecnologias atuais utilizadas como ReactJS, JavaScript e NodeJS, na sequencia temos a apresentação do sistema e interfaces produzidas, ao fim do trabalho realizamos a conclusão que busca sintetizar os resultados obtido com o desenvolvimento do sistema proposto e a realização de sugestões e melhorias que podem ser realizadas no sistema, vindo a se tornar temas para desenvolvimento de trabalhos acadêmicos futuros.",
    "Palavras-chave": [
        "Front End",
        "TCC",
        "ReactJS",
        "Gerenciamento de TCCs"
    ],
    "Introdução": "A tecnologia cada vez mais vem cumprindo seu papel de solucionadora de problemas e sendo veículo de mudanças e evoluções extraordinárias em nossa sociedade. A criação de sistemas computacionais para armazenamento e gerenciamento de informações cresce mais e mais a cada ano e atualmente se tornando indispensável para empresas e instituições. Não obstante no âmbito acadêmico temos inúmeras problemáticas que podem ser resolvidas ou amenizadas através do desenvolvimento de soluções computacionais. De acordo com Karadima (1987, p. 28) a importância dos sistemas de gestão nas universidades “justifica-se na medida em que estas apresentam uma grande quantidade e complexidade de dados, bem como pela necessidade de procedimentos de tratamento da informação mais precisos e rápidos”. Um dos principais desafios de cada acadêmico no seu processo de formação está relacionado com a organização, desenvolvimento e entrega, com qualidade e pontualidade, do Trabalho de Conclusão de Curso (TCC), neste caminho encontramos diversos fatores externos que podem comprometer a execução de um TCC, podemos elencar como exemplo a comunicação entre orientando e orientador que por muitas vezes pode ser esparsa e descentralizada, dificuldade de visualizar os prazos e etapas a se realizar a seguir, falta de gerenciamento quanto aos envolvidos no projeto como orientador, banca e convidados. O orientador também pode encontrar problemas durante o processo de elaboração do TCC de seus orientandos, sendo o principal deles o gerenciamento e controle de todos os projetos que está orientando naquele momento, além do fator comunicação já citado acima. Diante de todas as dificuldades e necessidades expostas surge dentro desse contexto o projeto do sistema que falaremos ao longo deste trabalho sendo este chamado de Meu TCC, tendo como principal objetivo agilizar e deixar mais dinâmico a atuação tanto do discente como do docente, buscando centralizar os processos do projeto de TCC em apenas uma plataforma.",
    "Conclusão": "Ao longo do presente trabalho procurou-se apresentar o sistema Front End específico para gerenciamentos de TCCs que possui o nome de Meu TCC. Durante o processo de pesquisa e estudo antes do desenvolvimento do sistema, notou-se que era evidente a falta de softwares especializados para o gerenciamento desses tipos de projetos, havendo apenas softwares de gerenciamento genéricos. Desta forma como um de seus objetivos este trabalho procurou evidenciar as dificuldades enfrentadas pelos envolvidos ao longo do desenvolvimento de um trabalho de conclusão de curso, desde a falta de ferramentas específicas, até mesmo a dificuldade de comunicação entre orientador e aluno fazendo com que todo o processo se torne muitas vezes confuso e lento. O desenvolvimento deste sistema Front End enfrentou inúmeros desafios em sua trajetória, o contato com tecnologias novas usadas no desenvolvimento do sistema, fez com que houvesse uma pequena curva de aprendizagem, necessária para que se pudesse entender melhor o funcionamento do código-fonte e posterior implementação de funcionalidades, experiência essa que foi enriquecedora no que tange os conhecimentos adquiridos e com certeza de grande valor profissional e pessoal. Além dos conhecimentos técnicos obtidos, houve um aprofundamento em metodologias de desenvolvimento e em métodos ágeis de software. procurou-se sempre garantir com que o sistema fosse projetado e entregue de maneira organizada e dinâmica. As boas práticas foram atingidas a partir principalmente, do embasamento teórico na literatura pertinente, e posterior confirmação prática, através da aplicação dessas metodologias no desenvolvimento do projeto. Ressaltamos ainda que esta é apenas a base inicial deste sistema Front End é que seu desenvolvimento poderá ser continuado vindo a ser tema de TCCs futuros. Em síntese neste trabalho procurou-se realizar a aplicação dos conhecimentos práticos e teóricos previamente adquiridos durante todo o curso de TIC, em conjunto com os conhecimentos alcançados ao se realizar a pesquisa, planejamento e desenvolvimento do projeto, com o objetivo de entregar uma ferramenta de grande valor para o meio acadêmico."
}