{
    "Autor": "Arthur Oliveira da Silva",
    "Título": "Pessoas com Deficiência em Empresas de Tecnologia da Informação e Comunicação: Obrigatoriedade ou Inclusão?",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Andréa Cristina Trierweiller",
    "Coorientador(a)": "",
    "Resumo": "A garantia do direito ao trabalho para todos os cidadãos é um aspecto fundamental da vida em sociedade, tendo, assim, relevância mundial. Contudo, há parcelas da população que têm esse direito precarizado, como é o caso das pessoas com deficiência. Sendo assim, este trabalho de conclusão de curso objetiva analisar os processos utilizados na inclusão das pessoas com deficiência no mercado de trabalho de empresas do segmento de Tecnologia da Informação e Comunicação, a fim de identificar as suas características; uma vez que se considera esse segmento de trabalho favorável para aumentar a empregabilidade dessa população. Para tal, recorreu-se ao levantamento de referencial teórico de literatura acerca dos conceitos e classificações acerca das pessoas com deficiência. Também foi analisada a legislação atual, que visa a garantia dos direitos dessa população no Brasil, no que tange ao direito ao trabalho, bem como, discorreu-se sobre o mercado de trabalho do segmento de Tecnologia da Informação e Comunicação. Assim, foi elaborado um questionário de pesquisa - com base em trabalhos semelhantes identificados e uma entrevista semiestruturada realizada com uma especialista da área, para posteriormente, aplicar este instrumento com os responsáveis pelas ações de inclusão nas empresas contatadas. Como resultado da análise dos dados obtidos, viu-se que a Lei de Cotas exerce papel fundamental na contratação de pessoas com deficiência, uma vez que o número de funcionários com deficiência contratados sob o regime de cotas foi maior do que o dobro desses funcionários, não contratados por esse regime. Identificou-se, a deficiência física como maior ocorrência, seguida pela deficiência auditiva e visual. Quanto aos setores e cargos mais comuns em relação a esse público, são as funções relacionadas ao desenvolvimento de software. Quanto ao banco de talentos/currículos das empresas respondentes, quase um quarto alega possuir um único banco, contendo pessoas com e sem deficiência. Em relação à forma que os programas de inclusão ocorreram, a maioria dos respondentes não repassaram informações suficientes para que fosse possível uma análise aprofundada de tais ações. Por fim, a qualificação profissional foi o principal motivo citado pelos respondentes como uma barreira para a inclusão de pessoas com deficiência no mercado de trabalho, enquanto que, como maior estímulo, citou-se o incentivo à inclusão e qualificação dessa população no mercado de trabalho.",
    "Palavras-chave": "Pessoa com Deficiência. Mercado de Trabalho. Tecnologia da Informação e Comunicação. Tecnologia da Informação.",
    "Introdução": "A Declaração Universal dos Direitos Humanos (DUDH) teve o intuito de se estabelecer como uma norma comum a ser alcançada por todos os povos e nações, uma vez que estabeleceu, pela primeira vez, a proteção universal dos direitos humanos (ONU, 2018). Um dos artigos deste documento diz respeito ao direito do trabalho: “toda a pessoa tem direito ao trabalho, à livre escolha do trabalho, a condições equitativas e satisfatórias de trabalho e à proteção contra o desemprego” (ONU, 2009). Outro ponto que merece ser destacado é: “Todo ser humano que trabalha tem direito a uma remuneração justa e satisfatória, que lhe assegure, assim como à sua família, uma existência compatível com a dignidade humana e a que se acrescentarão, se necessário, outros meios de proteção social” (ONU, 2009). Nesse sentido, vê-se que a garantia do direito ao trabalho para todos os cidadãos é um aspecto fundamental da vida em sociedade, tendo relevância mundial. Contudo, há parcelas da população que têm esse direito precarizado, como é o caso das pessoas com deficiência, doravante denominadas PcD1. De acordo com a Lei Brasileira de Inclusão da Pessoa com Deficiência: Considera-se pessoa com deficiência aquela que tem impedimento de longo prazo de natureza física, mental, intelectual ou sensorial, o qual, em interação com uma ou mais barreiras, pode obstruir sua participação plena e efetiva na sociedade em igualdade de condições com as demais pessoas (BRASIL, 2015). Como o próprio conceito explicita, as PcD podem enfrentar barreiras em participar da sociedade em igualdade de condições com as pessoas que não possuem deficiência, seja no acesso à cultura, à educação ou ao trabalho. O foco desta pesquisa, contudo, está contido no panorama da promoção e manutenção ao direito do trabalho, ou seja, em meios de promover oportunidades de emprego e ascensão profissional para as PcD no mercado de trabalho.\n\n1 A sigla PcD é invariável. Por exemplo: a PcD, as PcD, da PcD, das PcD (PORTO ALEGRE, 2011). As expressões “deficiente” ou “portador de necessidades especiais” se tornaram inadequadas frente ao novo paradigma adotado pelo estado brasileiro ao ratificar a Convenção da ONU. A terminologia agora utilizada é “pessoa com deficiência”, no qual adota uma perspectiva mais humanizada e considera estes indivíduos, antes de mais nada, pessoas (CURITIBA, 2019 a). 14\n\nIsto posto, devido ao extenso histórico de desigualdades sociais existentes em nosso país, instituiu-se, como feito em outras nações - tais como Alemanha, Argentina e Bélgica, políticas de ação afirmativa, a fim de retificar as desvantagens históricas acumuladas pelo conjunto de PcD (SANTOS; CARVALHO-FREITAS, 2018). Um dos avanços em relação a essa temática no Brasil – além da Lei Brasileira de Inclusão da Pessoa com Deficiência, foi a incorporação da Convenção da Organização das Nações Unidas (ONU) sobre os direitos das PcD à legislação brasileira, em 2008 (BRASIL, 2010). Nesse momento, foi reconhecido que o limite individual não é determinante para a deficiência, mas sim, as barreiras existentes nos espaços, no transporte, na informação, na comunicação e nos serviços, que são limitadores. Assim, foi assumido a obrigação de garantir a equiparação de oportunidades entre pessoas com e sem deficiência em todo o território nacional (BRASIL, 2010). Corroborando com o exposto, a Cartilha do Censo 2010 - Pessoas com Deficiência é um documento que descreve os tipos de deficiência e características das pessoas que compõem esse segmento da população. Esse levantamento foi produzido pela Secretaria Nacional dos Direitos da Pessoa com Deficiência (SNPD), por meio dos dados coletados pelo Instituto Brasileiro de Geografia e Estatística (IBGE). Sendo que, no Brasil, 23,9% da população possui pelo menos uma das deficiências investigadas no Censo de 2010, sendo estas: visual, auditiva, motora e mental ou intelectual (IBGE, 2012).",
    "Conclusão": "Esta pesquisa, no caráter de um trabalho de conclusão de curso, teve como questão norteadora: quais as características dos processos de inclusão das pessoas com deficiência em empresas de TIC na visão dos responsáveis pela área? Para tanto, inicialmente, procedeu-se ao levantamento de literatura acerca da temática de pessoas com deficiências. Nesse aspecto, viu-se que a legislação brasileira considera pessoa com deficiência, um indivíduo com um impedimento de longo prazo de natureza física, mental, intelectual ou sensorial, que pode ter sua participação na sociedade obstruída por uma ou mais barreiras. Em relação aos tipos de deficiência, nossa legislação considera cinco classificações, sendo elas: física, auditiva, visual, mental e múltipla. Em 2010, no Brasil, havia cerca de 24% de pessoas com alguma deficiência, representando quase um quarto da população residente no país. No que tange à legislação existente para auxiliar esse público a ser inserido no mercado de trabalho, há a Lei 8.213, conhecida como Lei de Cotas, a qual obriga empresas com 100 ou mais funcionários a preencherem de 2% a 5% de seus cargos com beneficiários reabilitados ou pessoas com deficiência. Após esse levantamento, buscou-se instrumentos já utilizados por outros autores para identificar características nos processos de inclusão de pessoas com deficiência com o intuito de adaptá-los ao uso desta pesquisa. Assim, foram utilizados sete trabalhos encontrados no Repositório Institucional da UFSC e uma entrevista, com uma especialista da área de Gestão de Pessoas, para a elaboração do questionário desse trabalho. Assim, o questionário de pesquisa (Apêndice A) foi disponibilizado, de forma online, para diversas empresas do segmento de TIC, obtendo-se um total de 20 respostas, sendo 17 válidas. Com isso, analisou-se os resultados com vistas a identificar o nível de implementação e as características das ações de inclusão dessas empresas. Foi possível identificar características no que tange a: forma de contratação dessa população, as deficiências que estes funcionários possuem, os cargos e setores que atuam, os critérios para sua contratação, a forma que esses processos ocorrem, as parcerias com instituições sem fins lucrativos e contratação de consultorias e, por fim, barreiras e estímulos para a inclusão das PcD nas organizações. Verificou-se, quanto à contratação das PcD, que quase três quartos das organizações contratam essa população não, somente, pelo regime de cotas. Apesar disso, o número de funcionários com deficiência contratados pelo regime de cotas se mostrou maior que o dobro do número desses profissionais não contratados por esse regime. Quanto ao tipo de deficiência dos empregados, a deficiência física se sobressaiu, seguido pela deficiência auditiva e visual, respectivamente. Quanto aos cargos e setores desses indivíduos, viu-se que o trabalho na área de Desenvolvimento de Software, mostrou-se uma opção favorável à empregabilidade da PcD. Em relação aos critérios utilizados para a contratação desse público, o cumprimento da Lei de Cotas foi o principal fundamento citado. Sobre a cultura de inclusão nas empresas, grande parte delas, realiza treinamentos sobre essa temática com seus funcionários. Já, em relação à forma como ocorrem os programas para inclusão dessa população, verificou-se que os responsáveis por essas ações não expuseram detalhes a respeito desses processos. Ressalta-se, ainda, que se atribui isso, em parte, à forma como a questão foi elaborada no questionário, ao utilizar a palavra programa. Assim, viu-se que o objetivo da pesquisa foi obtido parcialmente, pois não foi possível tecer análises acerca de como ocorrem os programas para inclusão das PcD. Faz-se ainda, apontamentos do autor desse trabalho à Lei de Cotas: compreende-se que essa legislação deve ser vista com atenção; já que, por um lado, obriga-se as empresas a inserirem PcD em seu quadro de funcionários, ao passo que, não se avalia os processos envolvidos nessa obrigatoriedade. Ou seja, de que forma ocorre a inclusão dessas pessoas nas organizações. Destaca-se uma preocupação com a empregabilidade de pessoas com deficiência grave, uma vez que, quanto mais grave for a deficiência do indivíduo, mais investimentos serão necessários para empregá-lo, o que pode representar um empecilho para o direito ao trabalho desses cidadãos. Como sugestão para o aprimoramento dos programas voltados à inclusão das PcD no mercado de trabalho, indica-se a parceria com instituições sociais que lidam e objetivam empregar essa parcela da população, uma vez que estas organizações possuem equipes interdisciplinares para lidar com esse público e, o desenvolvimento de tecnologias assistivas apoiadas pelas tecnologias de informação e comunicação para melhorar as atividades de trabalho desses empregados. Como recomendação para o desenvolvimento de trabalhos futuros, têm-se a possibilidade de atuar na elaboração e implementação de programas de qualificação para PcD, visto que, a falta de capacitação foi a principal barreira citada pelos responsáveis para a contratação desse público. Por fim, sugere-se o desenvolvimento de tecnologias assistivas para apoiar o ambiente de trabalho dessa população."
}