{
    "Autor": "Marcela Schiaffino Morales de Franceschi",
    "Título": "O AVANÇO DAS TECNOLOGIAS E O IMPACTO NAS BIBLIOTECAS: Um estudo sobre as bibliotecas convencionais e digitais",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá - SC",
    "Orientador(a)": "Prof. Giovani Mendonça Lunardi",
    "Coorientador(a)": null,
    "Resumo": "A necessidade por informação e conhecimento levou a disseminação do uso das bibliotecas, no mundo em que vivemos, em meio a mudanças e avanços tecnológicos. A biblioteca convencional passa por diversas transformações, gerando novos conceitos conhecidos como: biblioteca híbrida e biblioteca digital. Este trabalho tem como objetivo estudar a evolução e os avanços das bibliotecas e das tecnologias, em especial a internet, examinando os impactos que uma provocou na outra. Como fundamentação teórica foi feito pesquisas bibliográficas abordando o progresso das bibliotecas convencionais até as bibliotecas digitais, também foi feito pesquisas sobre a história da tecnologia no geral, aprendendo um pouco mais como surgiu e onde está presente. Após a compreensão sobre os assuntos estudados, uma análise e coleta de dados da Biblioteca Universitária da Universidade Federal de Santa Catarina foram realizadas, podendo comparar os acessos nas bibliotecas físicas e no acervo digital, assim conseguindo entender qual biblioteca ao longo de 10 anos teve uma maior procura e se as tecnologias interferiram nos trabalhos das bibliotecas convencionais. Junto das análises dos dados, também foi realizada uma análise sobre o desempenho dos alunos dos cursos de Engenharia de Computação, Tecnologias da Informação e Comunicação noturno e diurno, e seus acessos às bibliotecas, buscando descobrir se esses acessos aumentaram ou diminuíram o IA do curso. A internet complementa as bibliotecas tradicionais e não irá substituí-las, mesmo em um mundo digital as bibliotecas digitais são reflexos das convencionais.",
    "Palavras-chave": "Biblioteca convencional, Biblioteca híbrida, Biblioteca digital, Tecnologias.",
    "Introdução": "As primeiras bibliotecas físicas estão presentes desde 668 a.C., a primeira na história era composta por vinte e cinco mil placas de argilas, com textos sobre geografia, astrologia, religião e matemática, junto de suas memórias. A palavra “biblioteca” tem sua origem do grego biblíon (livro) e t ke (caixa, depósito), portanto um depósito de livros (HOUAISS, 2001). O surgimento de livros, de instituições de ensino e, posteriormente, de bibliotecas no Brasil, ocorreram a partir de 1549 com a instalação do Governo Geral, em Salvador (Bahia). A partir dessa data iniciaram as atividades relacionadas ao sistema educacional brasileiro e são, com o estabelecimento dos conventos de diversas ordens religiosas, principalmente da Companhia de Jesus - os Jesuítas - que foram formados os primeiros acervos no país. No Brasil, a história das bibliotecas até o início do século XIX é resumida da seguinte forma: inicia-se a partir das bibliotecas dos Conventos e Artigos Particulares, passa pela fundação da Biblioteca Nacional, que em 1807 com a chegada da Corte portuguesa ao Rio de Janeiro trouxe a Real Biblioteca, mas que somente em 1824 foi aberta ao público. E com a criação da Biblioteca Pública da Bahia, fundada no dia 13 de maio de 1811, iniciando com apenas quatro mil livros. A partir deste momento essas instituições passam a disseminar-se por todo país, formando hoje uma rede de mais de 5.400 bibliotecas no Brasil (FERRAZ, 2014) (SANTOS, 2011). A necessidade por informação e conhecimento levou à disseminação do uso das bibliotecas, gerando conteúdos em inúmeras áreas para que todos tivessem acesso. Outro fato importante, nas últimas décadas foi o surgimento da rede mundial de computadores, a Internet. Com o acesso a diversos tipos de mídias e informações de todos os tipos, passou a fomentar o desejo pelo compartilhamento e acesso das informações de uma forma mais globalizada, permitindo o acesso a qualquer momento e garantindo a mobilidade de seus usuários. A tecnologia está presente constantemente no dia a dia, fazendo parte das rotinas seja para se locomover ou para se comunicar, a Internet surgiu em 1969, quando foi criada a “Arpanet”. Mas se popularizou, no Brasil, somente na década de 90. Mesmo sendo conceitos bem diferentes, ambos têm algo em comum, que é o armazenamento de dados e conteúdos, um sendo na “nuvem” e outro entre paredes. Considerando tecnologia e acervo, tem-se duas modalidades, biblioteca digital e a biblioteca híbrida. A biblioteca digital é uma plataforma online com milhares de exemplares, que abordam diversas áreas. Podendo ser acessada com ou sem Internet através de dispositivos, tais como, computadores, tablets ou smartphones. Já a biblioteca híbrida é uma combinação da biblioteca tradicional com a Internet, sendo através dos sistemas de empréstimos e dos computadores disponibilizados nos estabelecimentos para facilitar nas pesquisas dos livros ou arquivos. Na Universidade Federal de Santa Catarina (UFSC), no Campus de Araranguá, a biblioteca setorial utiliza o modelo de biblioteca híbrida. Disponibilizando três computadores para alunos fazerem suas pesquisas e tendo a plataforma Pergamum como principal agente. Mesmo utilizando esse modelo, a biblioteca se tornou refém da Internet, podendo fazer seus empréstimos e devoluções somente pelo sistema online, pois o sistema está interligado em toda a universidade que abrange a biblioteca central na sede em Florianópolis e as bibliotecas setoriais nas unidades externas ou campis. O presente trabalho pretende pesquisar o tema sobre o uso da biblioteca e avaliar o impacto de recursos tecnológicos frente ao uso do acervo físico. Dois anos de estágio na biblioteca setorial de Araranguá (BSARA) motivaram o desenvolvimento do trabalho, neste período foi acompanhado o acesso dos acadêmicos e o funcionamento da biblioteca e do sistema integrado Pergamum. Considerando a velocidade em que a tecnologia tem evoluído, é possível prever o que acontecerá com as bibliotecas? Nos últimos anos, diminuíram os acessos físicos e aumentaram os digitais? Quais as vantagens e desvantagens presentes em diferentes tipos de bibliotecas?",
    "Conclusão": "Relembrando as perguntas levantadas na introdução deste trabalho, sendo elas: o que devemos esperar do futuro das bibliotecas? Nos últimos anos, diminuíram os físicos e aumentaram os digitais? Quais as vantagens e desvantagens de todos os modelos? Ao longo deste capítulo de conclusão, as perguntas serão respondidas em tópicos. Após o desenvolvimento desse estudo, chegamos à conclusão que em um mundo digital onde quase todo o conhecimento e informação estão armazenados em nuvens online, a biblioteca digital é um reflexo da biblioteca convencional. Segundo Marques (2009), a internet complementa as bibliotecas e não irá substituí-las, apesar das inovações tecnológicas continuarem evoluindo constantemente. Sherman (2007) afirma que, a biblioteca convencional é completamente diferente da internet conhecida como “WWW” e substituir uma com a outra chega a ser um absurdo, também afirma que a sociedade não está pronta para abandonar as bibliotecas físicas. Os resultados das análises do capítulo 3 comprovam esta afirmação. Em 10 anos de biblioteca universitária da Universidade Federal de Santa Catarina, a diferença dos acessos físicos para os acessos online é completamente desproporcional, com um diferencial em média de 297.000 empréstimos. Apesar de o ápice de empréstimos físicos ter ocorrido no ano de 2017 e terem diminuído nos anos seguintes, os empréstimos online acompanharam essa oscilação, não aumentando nesses anos, ou seja, os estudantes da UFSC não trocaram os livros físicos pelos digitais. Atualmente, em torno de 90% das bibliotecas físicas são bibliotecas híbridas, juntando a melhor parte da biblioteca convencional com a tecnologia, que se faz presente constantemente em nosso cotidiano. A tecnologia veio para facilitar nossas vidas, e nas bibliotecas não foi diferente, proporcionando acesso para pessoas em localidades remotas e carentes de educação, além de estimularem a leitura e escrita. As bibliotecas híbridas apresentam diversas vantagens, citando Garcez e Rados (2002), algumas dessas vantagens são: Acesso fácil, pois disponibilizam a informação específica em suas bases; Agilizam as operações, ficando a critério do usuário o tempo de recebimento das informações, graças às facilidades apresentadas pela tecnologia da informação; São mais eficientes, uma vez que flexibilizam suas operações utilizando recursos internos e externos na produção de informações adequadas às necessidades e expectativas de sua clientela; São prestadoras de serviços, porque, em sua função primordial está a de armazenar e disponibilizar a informação, visando atender a um público específico, de forma precisa e rápida, já que a informação só tem valor quando absorvida em tempo hábil. “Juntas, as bibliotecas convencionais e digitais muito poderão contribuir para o aprimoramento cultural dos nossos cidadãos, estudantes e crianças. Elas, portanto, têm enormes compromissos sociais (CUNHA, 2008)”. Ainda com relação aos dados avaliados durante o trabalho, foram verificadas as correlações dos dados de acesso à biblioteca BSARA e o desempenho acadêmico dos cursos de graduação. Os dados de desempenho dos estudantes foram coletados de trabalho de conclusão de curso da Engenharia de Computação (CARDOSO, 2019). Como havia dados, de 2008 a 2018, e apenas dos cursos Engenharia de Computação, Tecnologias de Informação e Comunicação noturno e diurno, foram correlacionados os dados destes cursos e pelos períodos de operações por anos da biblioteca, abrangendo apenas os anos de 2014 a 2018 que coincidiram os dados. Empregou-se as ferramentas disponíveis no Python para a correlação dos dados. Apresentando uma forte relação entre as médias de desempenho acadêmico destes cursos e as operações na biblioteca. Após uma profunda análise e discussão, é possível concluir que as bibliotecas físicas são fundamentais para o desenvolvimento acadêmico, além de ser responsáveis pelos acervos guardados entre paredes, é responsável também pelo acervo digital. Elas fazem parte da vida acadêmica e profissional de diversas pessoas, ajudando e facilitando com o armazenamento de informações. Após as análises de dados, fica evidente que o uso da biblioteca física influencia no desenvolvimento pessoal e profissional de toda a comunidade acadêmica."
}