{
    "Autor": "Iédi Luzia Schefer Hahn",
    "Título": "DESAFIOS QUE OS PROFESSORES DA EDUCAÇÃO INFANTIL ENCONTRAM PARA REALIZAR A FORMAÇÃO CONTINUADA ONLINE DURANTE A PANDEMIA COVID-19",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Patricia Jantsch Fiuza, Drª.",
    "Coorientador(a)": "",
    "Resumo": "Este estudo buscou conhecer a realidade do trabalho dos docentes do ensino infantil na Associação Feminina de Assistência Social de Criciúma SC – AFASC. Para isso, optou-se por uma pesquisa qualitativa, fazendo uma pesquisa de campo através de um formulário digital. Foram coletadas 333 amostras, sendo a grande maioria de professores, seguido por 7 estagiários e 4 diretores. As observações, bem como as entrevistas foram baseadas nos seguintes cenários - características da amostra: gênero, idade, tempo que leciona; formação docente: formação inicial, graduação e experiência em curso online; BNCC: conhecimento e a sua aplicação; e por fim, sentimentos: educação mediada por tecnologia e a Pandemia COVID-19. Foram constatadas variações entre idades e tempo de serviço, contudo, há constância entre a realização de cursos online e o interesse na sua laboração, em especial sobre a nova BNCC. A maioria se diz disponível para realizar uma formação continuada online, apesar das dificuldades existentes.",
    "Palavras-chave": "Educação Infantil, Formação Continuada, BNCC",
    "Introdução": "A pandemia do novo coronavírus, a COVID-19, vem ocasionando grandes transtornos na vida diária de toda população. Desde março de 2020, vários estudantes deixaram de frequentar aulas presenciais em todo território brasileiro. O fechamento das escolas trouxe à tona diversas questões, assim como a preocupação para a criação de novas estratégias para dar continuidade ao ano letivo (GRANDISOLI; JACOBI; MARCHINI, 2020). Algumas medidas foram tomadas pelo Conselho Nacional de Educação (CNE) que valida o ensino remoto como apoio à continuidade do aprendizado e finalização do ano letivo. Tais medidas foram estabelecidas e homologadas pelo Ministério da Educação (MEC) em 1º de junho de 2020. Inúmeras redes de ensino no Brasil precisaram suspender as aulas em combate à Covid-19. O Webinário “A Educação frente à Pandemia” abordou temas relevantes sobre os desafios advindos desse cenário de pandemia, trouxe discussões sobre como garantir que os alunos continuem estudando e a regulamentação de horas letivas. Para Helena Guimarães de Castro, o ensino remoto é necessário e indispensável neste atual momento, e esclarece que o ensino remoto significa um conjunto de atividades de ensino-aprendizagem diversificadas que podem incluir desde vídeo-aulas ou ensino online, como também atividades impressas enviadas aos alunos (WEBINÁRIO, 2020). Tudo isso provoca uma grande mudança na rotina dos docentes, alguns destes que já tinham receio, até mesmo resistência ao uso de novas tecnologias agora se encontram num modelo de educação mediada totalmente por esse meio. Essa medida provoca dúvidas em como dar continuidade às atividades do ensino infantil. Inicialmente, é importante destacar que no Brasil existe uma lei que regulamenta todo o sistema de educação do país, é chamada lei de Diretrizes e Bases da Educação Nacional, (lei n. 9.934, de dezembro de 1996), esta lei trata dos processos de aprendizagem e que devem estar em consonância com a família, trabalho e toda a sociedade. O seu art. 2 trata dos princípios e finalidades que regem a educação, sendo o dever da família e do Estado, e é inspirada nos princípios de liberdade e nos ideais de solidariedade humana, tem por finalidade o pleno desenvolvimento do educando, seu preparo para o exercício da cidadania e sua qualificação no trabalho (BRASIL, 2005, p. 7). Essa regulamentação divide a educação brasileira em duas categorias, que são a Educação Básica e o Ensino Superior. Faz parte da educação básica: - Educação infantil que são creches (de 0 a 3 anos) e pré-escolas (de 4 e 5 anos) sendo gratuita, mas não obrigatória, e de competência dos municípios. - Ensino fundamental que envolve o 1º ao 5º ano e do 6º ao 9º ano, é obrigatório e gratuito. - Ensino médio abrange o 1° ao 3° ano e pode ser técnico profissionalizante, ou não. Já a categoria Ensino Superior, é de competência da União, mas Estados e Municípios também podem ofertar, desde que já tenham estejam de acordo com as normas. Ainda falando em educação, vale mencionar outras modalidades existentes na educação brasileira, tais como: Educação Especial, Educação a Distância, Educação Profissional e Tecnológica, Educação de Jovens e Adultos, e a Educação Indígena (NOVO, 2019). Após a breve descrição dos tipos de ensino e suas fases correspondentes, a presente pesquisa se direciona para o ensino infantil. De acordo com BNCC: Como primeira etapa da Educação Básica, a Educação Infantil é o início e o fundamento do processo educacional. A entrada na creche ou na pré-escola significa, na maioria das vezes, a primeira separação das crianças dos seus vínculos afetivos familiares para se incorporarem a uma situação de socialização estruturada. (BNCC, p. 36). A educação infantil se destaca como a primeira etapa da educação básica, nesta fase ocorre uma importante evolução, é onde crianças de até 5 (cinco) anos de idade desenvolvem os aspectos do desenvolvimento: físico, psicológico, intelectual e social. Logo, essa fase é de grande relevância a toda sociedade, pela sua influência na formação de novas gerações. Nesta fase, de formação de vida social da criança é importante evidenciar a postura, e o intelecto do educador, a sua capacitação e a formação continuada são fundamentais, pois, estes educadores contribuem para o desenvolvimento intelectual e para o potencial das crianças em sociedade (HOLZMEISTER, 2019). As constantes mudanças no cenário da educação, em especial na educação infantil, é um desafio a estes profissionais, e essas mudanças promovem grandes discussões a respeito “das necessidades formativas específicas para o profissional que atua junto à criança pequena, desde a formação inicial oferecida em nível de graduação nos cursos de Pedagogia até a oferta de formação continuada como prática a ser garantida pelas redes de ensino” (CHIARE; RAUSCH, 2012). Há uma demanda de profissionais que atuam na área da educação infantil com dificuldades em se atualizar, os diferentes formatos como palestras, seminários, são ofertados por meio da internet, no formato online e nem sempre este profissional tem acesso e o conhecimento necessário para poder realizar a sua formação. Desse modo, o uso adequado das Tecnologias de Informação e Comunicação (TIC) para a realização da sua formação continuada pode apresentar-se como uma barreira a ser superada pelos professores (SCHUHMACHER; ALVES FILHO; SCHUHMACHER, 2017). Este trabalho de pesquisa é voltado aos profissionais do Ensino Infantil que precisam de uma formação continuada e que demandam de recursos e conhecimento tecnológicos para tal.",
    "Conclusão": "A pandemia tem gerado inúmeros desafios, ao mesmo tempo, tem proporcionado grandes descobertas nos sentidos positivo e negativo. Na educação, garantir a continuidade das aulas tem exigido dos professores e estudantes a se transformarem para uma nova realidade, e, muitos deles, não estão preparados, a palavra é reinvenção e junto dela, superação. Superação, em especial aos educadores do ensino infantil, analisar os desafios que estes encontram para realizarem uma formação continuada, foi o tema desta pesquisa. Um grupo de educadores que, assim como todos, se encontram em meio a uma pandemia, e que precisam dar continuidade ao seu trabalho, mas, mediado por tecnologia, em meio a quarentena, as aulas tiveram que ser online, ou híbridas. Por se tratar de uma pandemia, as logísticas das aulas podem mudar, e isso assombra a todo momento, aulas online em tempos de pandemia apresentam-se como uma nova barreira a ser superada. A relevância desta pesquisa, foi analisar dois pontos importantes pertencentes a esse grupo. Um ponto era avaliar o conhecimento, o entendimento destes educadores em relação às novas normas da educação infantil, a nova BNCC, visto que todas as instituições de ensino do país são obrigadas a aplicar. São exigidos dos educadores, um novo conceito da educação infantil, são competências necessárias: compreender os 6 (seis) direitos de aprendizagem das crianças, estes estão relacionados com as 10 (dez) competências gerais da BNCC. Trabalhar com os 5 (cinco) campos de experiência e os seus objetivos de aprendizagem e desenvolvimento de acordo com seus respectivos grupos: bebês, crianças bem pequenas e crianças pequenas. Frente a essas mudanças e exigências, faz-se necessário uma formação continuada em consonância com a Base Comum Curricular. O segundo ponto deste projeto, contemplava averiguar o conhecimento destes docentes em relação aos recursos tecnológicos, e sua disponibilidade para realizar uma formação continuada online, descobrir os sentimentos destes educadores em relação à nova BNCC, à tecnologia e a pandemia COVID-19. Tudo isso, é importante porque futuramente poderá propiciar melhorias no exercício da docência. Curiosamente, os sentimentos em relação à utilização das TIC em sala de aula, foram positivos, levando em conta os mais citados: aprendizado e inovação. Apesar disso, houve sentimentos de incertezas em relação à sua utilização. Fica claro, o sentimento de positividade, de interesse em usar as TIC em sala de aula, ao mesmo tempo, se sentem inseguros para tal. Por esse motivo, é interessante ressaltar que as instituições de ensino superior que ofereçam cursos de Pedagogia a distância devem promover uma maior capacitação no sentido da utilização das TIC, afinal, são novos tempos e novas necessidades são exigidas. Outro aspecto da presente pesquisa que demanda atenção, é em relação aos sentimentos relacionados à pandemia COVID-19. O sentimento “medo” foi citado 199 vezes e o sentimento “insegurança” 202 vezes. Nessa perspectiva, fica notório a necessidade de desenvolver mecanismos de avaliação para acompanhar a percepção destes educadores, ainda mais em tempos de pandemia. Mesmo diante deste cenário, o sentimento “Fé” foi mencionado 178 vezes e “Esperança” 132 vezes, trazendo um olhar mais otimista e esperançoso relacionado às dificuldades enfrentadas. A partir deste estudo, faz-se a reflexão sobre como contribuir para a melhoria do desenvolvimento de habilidade e de competências dos docentes do ensino infantil para que possam trabalhar com uma educação mediada por tecnologia, bem como, possa realizar uma formação continuada online. Como sugestões para projetos futuros, criação de uma metodologia que ampare estes profissionais, para utilização de tecnologias com fácil acesso em suas aulas. Também buscar formas de oportunizar capacitação no uso de tecnologias educacionais, além de favorecer processos nos quais a formação aconteça como um processo contínuo."
}