{
    "Autor": "Janquiel Pereira",
    "Título": "INTEGRAÇÃO DE DISPOSITIVOS HETEROGÊNEOS VIA TECNOLOGIA DLNA",
    "Ano de publicação": "2014",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Gustavo Medeiros de Araujo",
    "Coorientador(a)": null,
    "Resumo": "Em 2003, foi proposto u m acordo entre os fabricantes de eletrônicos, que teve como objetivo trazer a interoperabilidade entre diferentes equipamentos fabricados. Através deste acordo, o DLNA (Digital Living Network Alliance) surge . Esta  tecnologia utiliza  vários protocolos  como UP nP (Universal Plug and Play), para promover a  integração entre os dispositivos.  Ao longo dos anos, esta tecnologia tem sido disseminada, presente em  muitos dispositivos atualmente vendidos, mas ainda há dispositivos que  não possuem essa tecnologia.  Disposi tivos, como o Arduino, não possuem a  tecnologia DLNA, e  exigem a construção de um middleware  para comunicação entre o  Arduino com outros dispositivos remotos na rede.  Este trabalho propõe uma integração entre dispositivos com  comunicações heterogêneos at ravés da tecnologia DLNA, e esses  dispositivos são extremamente necessários  para a automação  residencial.  A automação residencial é uma realidade hoje. Assim, usando uma  tecnologia como DLNA, para integrar todos os dispositivos presentes  em uma casa, pode proporcionar inteligência para a casa, a fim de trazer  mais conforto e segurança para os seus habitantes. Controles de  ilumi nação, ventilação, alarmes etc, podem ser centralizados em um  único dispositivo capaz de gerenciar os outros e proporcionar a  integr ação através da tecnologia DLNA através de um roteador simples.",
    "Palavras-chave": "Arduíno. DLNA. UPNP. Domótica.",
    "Introdução": "A cada dia diversos dispositivos computacionais vêm  sendo criados, Smartphones, Tablets,  consoles para games, sensores, entre outros.  O desenvolvimento de microcontroladores também  vem crescendo exponencialmente devido à vasta  aplicabilidade.  O Arduíno é uma plataforma que conjuntamente com  sensores, e ou tros dispositivos podem proporcionar o  desenvolvimento de uma SmartHouse ou casa inteligente.  As casas inteligentes podem ser vistas como uma  plataforma que pode ser implementada para diversas  aplicações. Dentre estas aplicações, a casa inteligente pode  realizar o monitoramento de idosos ou pessoas com  deficiências, com intuito de tornar o cotidiano mais seguro e  confortável.  “Na era da tecnologia da informação, os  idosos e deficientes podem ser  monitorados com inúmeros dispositivos  inteligentes. Os sensore s podem ser  implantados em sua casa fornecendo  assistência à mobilidade contínua e  prevenção de doenças não intrusivas.  Casas incorporadas por sensores  modernos, ou casas inteligentes, não só  pode ajudar as pessoas com reduzidas  funções físicas, mas ajudar  a resolver o  isolamento social que enfrentam. Eles são  capazes de fornecer assistência sem  limitar ou perturbar o cotidiano do  morador, dando -lhe maior conforto, prazer  e bem -estar.” (CHAN, Marie, et al. 2008).  Uma barreira para a automação residencial é  a dificuldade em fornecer a interoperabilidade entre os  diferentes dispositivos.  Uma das soluções para tal barreira foi criada em 2003  pela Sony juntamente com outras 23 empresas.  O consórcio  entre estas empresas desenvolveu uma tecnologia baseada  em pa drões para facilitar a vida dos consumidores. Esta  aliança entre as empresas de tecnologia resultou na  tecnologia hoje conhecida como DLNA. Hoje, são mais de 240 membros associados ao DLNA trabalhando para deixar as pessoas cada vez mais conectadas (HAGEDO RN, 2012).  Apesar de o DLNA ter sido criado para a distribuição  multimídia, há uma grande tendência em utilizá -lo para  integrar dispositivos, cujos serviços não se restringem a  distribuição de multimídia e que não possuem a certificação  DLNA. É neste conte xto que se insere o presente projeto.  Com a gama de dispositivos diversos de diferentes  plataformas, faz -se necessário a criação de uma camada de  software que provenha à integração destes dispositivos com  o intuito de aumentar a disponibilização de serviç os em um  ambiente ubíquo, como por exemplo uma Smart House  onde existem diversos dispositivos fornecendo serviços  distintos .  Esta camada de software é também conhecida como  middleware, que no sentido estrito é um software de  transporte usado para mover in formação de um ou mais  programas para outro (Talarian, 2000).  A principal função do middleware  no projeto é trazer  independência da aplicação com o sistema de transmissão  DLNA e fornecer o canal necessário para a troca de dados  entre os dispositivos espalh ados pela casa .  Com o auxilio do middleware  desenvolvido, os  dispositivos heterogêneos utilizados pela Smart House  poderão comunicar -se entre si sem a necessidade de  configuração externa. Quando um dispositivo se conectar a  rede ele se autoconfigura sem a necessidade do usuário  informar portas, IPs e outras configurações até então  necessárias. A única preocupação de um programador será a  implementação do serviço para o qual o dispositivo foi  disponibilizado.  Pode -se utilizar o middleware  proposto através de  um  service broker , que consiste em fazer a tradução entre  requisições nativas DLNA para requisições especificas da  plataforma adotada.  No contexto das casas inteligentes, o Arduíno  pode ser uma das plataformas que torna possível a automatização  de tarefa s. Ele pode agir como atuador, sendo alimentado  por dispositivos sensores, podendo controlar a climatização  de uma casa ou abrir o portão quando o dono da casa chegar  por exemplo.  O Arduíno  é uma plataforma de prototipagem  eletrônica de baixo custo  que é capaz de comunicar -se com  um PC, notebook,  RaspBerrypi  entre outros e  conjuntamente ou individualmente executar tarefas de  automação (WADDINGTON, 2007).  Para a automação das tarefas foi criado um servidor  DLNA genérico que fará conexões com as placas de  prototipagem através do middleware.  As tarefas serão  executadas em uma rede local, e o servidor também será  capaz de receber informações das placas ou sensores,  podendo assim tomar decisões de acordo com o fim para  qual foi programado.  Neste projeto, serão  adotadas as métricas de teste de  exaustão, e teste de velocidade de resposta com a finalidade  de descobrir qual a melhor implementação possível.",
    "Conclusão": "O presente projeto propôs uma arquitetura distribuída que permita fazer a interoperabilidade entre dispositivos heterogêneos po r meio da tecnologia DLNA.  Com base nesta proposição foram realizadas pesquisas a fim de encontrar maneiras de se realizar a interoperabilidade. Depois de um estudo inicial, optou -se  pelo framework  open source Cling.   Após o desenvolvimento da aplicação foram elaborados testes com o propósito de mensurar o  desempenho da mesma, fazendo uma correlação com testes  unidirecionais e bidirecionais. Os resultados foram  satisfatórios em relação ao propósito em que se trata o  presente projeto, porém a arquitetura a inda precisa de  melhorias na comunicação bidirecional, necessitando um  estudo mais aprofundado da comunicação serial.  Ao longo do trabalho surgiram novas possibilidades  de desenvolvimento que não foram abordadas pois  tornariam o projeto muito extenso. Den tre as novas  possibilidades, está a necessidade do desenvolvimento mais  aprofundado do ServiceBroker , um serviço do middleware  responsável por gerenciar as requisições, fazer integração  com diferentes tecnologias e ainda fazer o controle de  acesso ao dispos itivo impedindo a postergação indefinida.  Por fim, o uso da tecnologia DLNA ainda é muito  recente não possuindo muitos estudos na área, ficando  limitada a dispositivos com certificação DLNA. Com a  ajuda do presente projeto, dispositivos que até então não  possuíam a tecnologia poderão se comunicar utilizando o  DLNA aumentando a gama de dispositivos que podem ser  utilizados para uma automação residencial ou industrial."
}