{
    "Autor": "Patrick Napoleão Domingos",
    "Título": "Pesquisa de Satisfação aos Clientes de uma Empresa Atuante no Mercado de Tecnologia da Informação: Um Estudo de Caso Jordram Tecnologia",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Drª. Andréa Cristina Trierweiller",
    "Coorientador(a)": null,
    "Resumo": "Este Trabalho de Conclusão de Curso teve como objetivo, analisar o nível de satisfação dos clientes organizacionais de uma empresa de suporte em TI com vistas a propor melhorias. Sendo fundamental explicitar algumas definições -chave, que pudessem embasar a elaboração das perguntas do questionário, criado para mensurar o nível de satisfação da clientela. São abordadas definições, como: produtos, qualidade, clientes, serviços e suas quatro categorias – intangibilidade, inseparabilidade, variabilidade, perecibilidade –, que estão relacionados ao objetivo deste trabalho e constam na fundamentação teórica, a qual possibilitou interpretar as respostas, dos clientes da Jordram. Além da preocupação com definições relativas à satisfação de clientes, fez-se um embasamento teórico sobre usabilidade, já que, um dos principais produtos comercializados pela empresa é um firewall e assim, considerou-se importante levantar a percepção dos clientes, em função desse sistema específico, utilizando-se o SUMI (SUMI, 2011) e seus cinco fatores de usabilidade: gosto/prazer, eficiência, ajuda, controle, e aprendizagem, abordados nas questões de usabilidade. Dentre os resultados, de modo geral, a percepção foi que o setor de suporte de TI presta serviços com qualidade, mas foram identificadas algumas oportunidades de melhoria, dentre elas: buscar o cumprimento dos prazos de manutenção e de abertura de chamado pelos técnicos; aprimorar a comunicação sobre o progresso das solicitações; e buscar facilitar a operação do Guardian, especificamente, a geração de relatórios.",
    "Palavras-chave": [
        "Satisfação de Clientes",
        "Tecnologias da Informação e Comunicação",
        "Qualidade de Serviços"
    ],
    "Introdução": "A utilização de metodologias, ferramentas e diversos recursos em tecnologias, hoje difundidos no meio empresarial, é fundamental para a melhoria contínua das empresas. Contudo, a gama de recursos de Tecnologia da Informação e Comunicação (TIC), por exemplo, não garante o sucesso dos gestores e a satisfação da clientela. Portanto, o levantamento do desempenho da empresa junto aos clientes é fundamental para a identificação de oportunidades de melhoria. Nesse contexto, de acordo com a International Data Corporation (IDC, 2019) – Brasil, os investimentos em Tecnologia da Informação e Comunicação (TIC) devem crescer 4,9% em 2019 no país, um índice que reflete o otimismo do mercado para o ano. O maior crescimento, de 10,5%, será em TI, ainda por conta de processos de transformação digital, por movimentos de substituição de tecnologias e pela venda de PCs, tablets, smartphones, impressoras e outros dispositivos. Sem os dispositivos, o mercado de TI cresceria 6,8% (IDC RELEASES, 2019). Portanto, o cenário econômico para o segmento de TIC é promissor e assim, não bastam investimentos nas melhores técnicas, processos e equipamentos, ou seja, as pessoas (funcionários) precisam ser continuamente capacitadas com vistas ao melhor atendimento e desempenho junto à clientela. O destaque para a ascensão do segmento de TIC é crucial para compreender a relevância do desenvolvimento deste Trabalho de Conclusão de Curso (TCC), que é o de analisar o nível de satisfação dos clientes organizacionais de uma empresa de suporte em TI com vistas a propor melhorias. Afinal, os clientes são “o alicerce de qualquer empresa”. E, assim conhecer suas expectativas e nível de satisfação são de extrema importância para orientar as ações futuras a serem tomadas pelos gestores. Dessa forma, uma consulta aos clientes, por meio de pesquisa de satisfação, pode traçar o diagnóstico e vislumbrar oportunidades de melhoria na relação com sua clientela. Dessa forma, justifica-se realizar este estudo junto aos clientes organizacionais da prestadora de serviços Jordram Tecnologia Ltda. com base no levantamento do seu perfil e de sua satisfação, a fim de sugerir ações de melhoria para os produtos e serviços.",
    "Conclusão": "Este trabalho teve como objetivo realizar uma análise do nível de satisfação dos clientes da Jordram Tecnologia Ltda., com os serviços prestados pela empresa. E, para alcançar tal finalidade, fez-se necessário realizar a revisão da literatura sobre as temáticas relacionadas à pesquisa, para assim, fundamentar a elaboração do questionário, que serviu de instrumento para coleta dos dados. Dessa forma, foi possível alcançar a compreensão do nível de satisfação dos clientes da Jordram, e propor melhorias à empresa. Para atender a este objetivo foram desenvolvidas 47 (quarenta e sete) questões, sendo 20 delas especificas para avaliar a usabilidade da principal ferramenta desenvolvida pela empresa – o software Guardian, recorrendo às dimensões do SUMI (gosto, eficiência, aprendizagem, ajuda e controle), de forma sucinta, por não ser o principal objetivo deste trabalho. As outras 27 questões buscaram analisar o perfil dos clientes e seu nível de satisfação quanto aos fatores intangíveis, referentes aos serviços prestados pela empresa, e destas 47 questões, 44 eram fechadas e 03 abertas. O questionário foi divulgado por e-mail, diretamente aos responsáveis pelas empresas, que são clientes da Jordram há mais de dois anos e que possuem contrato para prestação de serviço. A partir da análise das respostas, constatou-se que o nível de satisfação dos clientes (tanto na análise de usabilidade do Guardian quanto em relação ao serviço prestado pela empresa), no geral, está entre satisfeito e muito satisfeito. Neste sentido, alguns pontos de melhoria foram identificados, dentre eles: a) o cumprimento dos prazos para atendimento pelo suporte técnico; b) a aprovação dos orçamentos, anterior à realização dos serviços; c) o ajuste de valor dos itens comercializados pela empresa, de acordo com a realidade do mercado; d) geração dos relatórios do Guardian (facilitando a emissão e diversificando o formato de saída), e aperfeiçoamento das mensagens de ajuda dentro do sistema, e respectivamente, em seu manual. Desta forma, os resultados obtidos com a presente pesquisa poderão ser encaminhados aos gestores responsáveis pela Jordram, para que possam atuar nas necessárias melhorias identificadas pela clientela. Como oportunidades para realização de pesquisas futuras, seria interessante extender o questionário aos demais clientes da Jordram, buscando assim, maior representatividade das avaliações, e com isso, proporcionando a melhora continua do serviço prestado. Por fim, percebe-se a importância de se desenvolver pesquisas de satisfação junto à clientela, fortalecendo o processo de avaliação, que deve ser periódico e sistemático, demonstrando que os resultados de um período serão utilizados para melhorias nos pontos identificados como críticos, demonstrando a melhoria contínua. Dessa forma, atribui-se maior credibilidade à empresa e assim, uma adesão, cada vez maior dos clientes à pesquisa, encarando-a como uma oportunidade de manifestar sua opinião, construindo relações mais duradouras entre as partes."
}