{
    "Autor": "Rodolfo Rocha Pirola",
    "Título": "Glossários sobre tecnologia em Libras/Português: Análise de visibilidade",
    "Ano de publicação": 2020,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Mendonça Lunardi",
    "Coorientador(a)": null,
    "Resumo": "Os glossários são importantes ferramentas que auxiliam os estudantes surdos bem como os intérpretes que atuam na área, constituindo também um instrumento de preservação, valorização e ampliação do léxico da Libras. Este trabalho de conclusão de curso visa levantar uma análise de dois glossários e um aplicativo para dispositivo móvel de sinais voltados à área de estudos das novas tecnologias da informação e da comunicação produzidos em Língua Brasileira de sinais - Libras. Esta análise baseia-se na visibilidade, acessibilidade, compreensão e formalidade, apresentando justificativas concretas com o intuito de apontar melhorias para os mesmos. A carência de sinais dentro destes dois glossários e do aplicativo para dispositivo móvel em relação às terminologias no estudo das Tecnologias da Informação e da Comunicação será abordada de forma relevante. Sabe-se que essa terminologia é complexa, e os glossários existentes apresentam muito poucos sinais e raras explicações em relação às terminologias das novas tecnologias da informação e da comunicação, dificultando assim a compreensão dos termos. A apresentação de justificativas concretas para que seja possível a criação de novos glossários com a terminologia adequada em relação às novas tecnologias da informação e da comunicação, visa uma compreensão mais clara em relação a essas terminologias escritas na língua portuguesa sobre as novas tecnologias da informação e da comunicação, garantindo uma melhor compreensão dos estudos pelos acadêmicos surdos.",
    "Palavras-chave": "Libras. Tecnologia. Comunicação. Glossários. Visibilidade.",
    "Introdução": "Em um mundo cada vez mais digital, os estudos e aprendizados muitas vezes estão acessíveis na palma da mão. De acordo com Chaves (2004; p, 27), “a tecnologia possibilita conhecimentos, considerando as diversas formas em que os conteúdos podem ser acessados, incluindo materiais interdisciplinares”. Com o avanço tecnológico em grande escala, a rapidez no processamento de dados nunca visto anteriormente o homem vem cada vez mais se utilizando das novas tecnologias da informação e da comunicação no amplo sentido de facilidade para a vida em escala global, abrangendo todas as esferas. Dentro deste contexto, pontos positivos e negativos existem, mas o que prevalece são os benefícios. Os glossários se utilizam da tecnologia com criatividade para levar informação em Libras por meio de vídeos, legendas, imagens, fotos e animações. Assim, com o uso da tecnologia, o aprendizado fica atrativo e divertido e a aprendizagem é vivida em sala de aula, proporcionando o desenvolvimento das competências e habilidades dos alunos. Isso vai acelerar os processos cognitivos, o domínio da palavra escrita e o uso da Língua Brasileira de Sinais com fluência. Desta forma, a tecnologia se torna um desafio para a inclusão social, porque ajuda a pessoa surda a disseminar sua língua e diminui a grande barreira que existe entre os surdos e a sociedade. As Tecnologias da Informação e da Comunicação - TIC´s hoje desempenham um fundamental e importante papel no ensino e no aprendizado das línguas de sinais, os arquivos de mídia estão disponibilizados em várias plataformas para estudos e aprendizagens. Porém os glossários digitais em línguas de sinais não são completos e precisam de ajustes. A grande dificuldade de encontrar sinais específicos dos conteúdos nos glossários disponíveis na internet e aplicativos móveis, durante a graduação, serviu de motivação para a produção deste trabalho na busca de respostas, isso por que a tecnologia se tornou um meio de acessibilidade relacionada ao estudo e aprendizagem para os surdos. Os recursos tecnológicos tornam os glossários um valioso material para a aprendizagem dos conteúdos. Além disso, os conteúdos digitais se tornam mais acessíveis pois atingem uma quantidade maior de pessoas. Essa é uma forma programada de comunicação, com respeito ao ser humano surdo, que tem a língua de sinais – L1 como sua língua materna, ou seja, sua primeira língua de instrução, em nosso caso a Libras – Língua Brasileira de Sinais e o português escrito -L2 como sua segunda língua. Então, esse trabalho visa mostrar essas carências, propondo estudos para aprimorar o desenvolvimento de glossários de termos técnicos voltados ao estudo da área das novas tecnologias da informação e da comunicação.",
    "Conclusão": "A ideia de unir as novas tecnologias em prol da educação de surdos é satisfatoriamente brilhante. Por muito tempo a educação de surdos esperava por uma ferramenta didático-pedagógica que apresentasse resultados promissores, facilitando de maneira ágil a aprendizagem. Isso vem acontecendo, muita coisa já foi desenvolvida juntamente com as novas tecnologias para a área da educação de Surdos, mas sabe-se que ainda falta muito a evoluir. As TIC´s são mais que uma alternativa de comunicação, são uma ferramenta de aprendizagem em língua de sinais - LS, podendo também exercer aprendizagem da língua portuguesa como segunda língua de instrução. Ao utilizar essa ferramenta como proposta didática deve-se oferecer meios e facilidades para seu uso, priorizar imagens sobre sons, textos simples e diretos devem se sobressair aos complexos, uso de legendas, de tradução para a LS, entre outros recursos que possibilitem o desenvolvimento educacional dos surdos. A partir dessa visão, espera-se que os glossários desenvolvidos futuramente sejam mais amplos, dinâmicos e mais específicos na área da educação voltados aos estudos das novas tecnologias da informação e da comunicação e que fundamentalmente desenvolvam um papel cada vez mais significativo no aprendizado da comunidade surda. A importância de se pesquisar sobre glossários voltados à área do curso de TIC, e mostrar que no momento é inexistente um glossário de termos técnicos específicos que atenda aos estudos científicos do curso de TIC da UFSC, sendo que é uma ferramenta imprescindível para o aprendizado na educação de Surdos. Através da produção dos glossários em Libras pode-se observar que as TIC’s são recursos de grande contribuição para o aprendizado. Essas ferramentas digitais modernizaram o modo de produção de glossários, melhorando a compreensão de conceitos e conteúdo, oportunizando, em especial ao educando surdo, condições necessárias para enriquecer seu vocabulário, pois este se dá de forma visual, auxiliando no desenvolvimento linguístico. Diante do que foi estudado, espera-se que esta pesquisa contribua para que se já desenvolvido um glossário na área de terminologia tecnológica em Libras, no que se refere à criação, ao registro e a organização de verbetes em glossários digitais, voltado aos estudos das novas tecnologias da informação e da comunicação. Como ainda não há um glossário bilíngue de termos e sinais-termo da área de Tecnologias da Informação e da Comunicação do Centro de Ciências, Tecnologias e Saúde da Universidade Federal de Santa Catarina – UFSC, Campus Araranguá, acredita-se que a proposta contempla o desenvolvimento da aprendizagem do acadêmico surdo. Espera-se também que os estudos desenvolvidos nesta pesquisa sejam um estímulo para novas propostas de produção de glossários e que venham desempenhar um importante e fundamental papel na educação e aprendizagem dos alunos surdos, oportunizando e favorecendo um caminhar acadêmico eficiente desses educandos."
}