{
    "Autor": [
        "DEIVID JONATAN DA ROSA",
        "EVERTON NIOTTI FAVARO"
    ],
    "Título": "DESENVOLVIMENTO DE UM APLICATIVO MÓVEL PARA FOOD SERVICE UTILIZANDO A PLATAFORMA ANDROID",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho de conclusão de curso, tem como objetivo a elaboração de um projeto e desenvolvimento de uma aplicação para FoodService em Android, para a empresa Tia Graça salgadinhos. A partir de uma entrevista com a proprietária foram constatadas dificuldades no armazenamento dos dados dos pedidos realizados pelos clientes. A partir disso, foi elaborado um projeto de aplicativo utilizando a ferramenta de desenvolvimento Android Studio com o objetivo de facilitar a organização da empresa em relação aos pedidos de compra de comida por parte dos clientes. Após os testes iniciais com o aplicativo, a proprietária relatou que o aplicativo facilitará o modo de agendar suas encomendas e em função disso será possível aumentar a sua produtividade e diminuir as inconsistências regulares no sistema de agendamento de pedidos atual. Durante o teste do aplicativo com alguns clientes, obteve-se um resultado positivo, devido ao fato de facilitar a realização dos pedidos e fornecer um controle maior para o acompanhamento do mesmo.",
    "Palavras-chave": [
        "Android",
        "FoodService",
        "Aplicativo"
    ],
    "Introdução": "No decorrer dos anos a expansão das Tecnologias da Informação e Comunicação (TICs) estão cada vez mais presentes no nosso cotidiano, um exemplo disso é que em 2016 o Brasil fechou o ano, com 116 milhões de pessoas com acesso à internet, sendo esse número equivalente a 64,7 % da população. Informação obtida por meio da Pesquisa Nacional por Amostragem de Domicílios contínua (Pnad C), e divulgada pelo Instituto Brasileiro de Geografia e Estatística (IBGE) [...]. (G1,2018). Junto a essa expansão tecnológica, outros setores como o da alimentação tiveram um aumento nos últimos anos. No setor da alimentação espera dobrar seu percentual em 2018, no ano de 2017 seu crescimento foi de 2,5%. Em 2018 tem-se como uma estimativa um crescimento de 4,5%, seu aquecimento se dá pelas novas leis trabalhistas e redução de confrontos de empregados e empregadores. (ABRASEL, 2017) No setor de alimentação as empresas que são caracterizadas FoodService, empresas que têm seu objetivo principal a produção de alimentos. Elas focam diretamente no consumidor final, englobam a produção, distribuição de produtos, fabricante de matéria-prima, fornecedores de equipamentos e serviços, e também as empresas que preparam e fornecem refeições e seus transportes. Os principais segmentos do FoodService são: fast foods, restaurantes, padarias e confeitarias, hotéis e motéis, refeições coletivas, catering e vending machines. (ACOM SISTEMAS, 2014). Segundo Content (2017), a partir de dados da Associação Brasileira de Franchising (ABF), o segmento de alimentação abriga a maior parte das empresas de FoodService, seu faturamento atingiu cerca de 9,935 bilhões de reais em 2017. Com um aumento de 6% comparando com o ano anterior. Mantendo o hábito de se alimentar fora do lar, mesmo havendo uma crise econômica, o segmento inova rapidamente, para atender tendências e públicos exigentes. Acompanhando esses avanços tecnológicos, com clientes cada vez mais exigentes e possuem as informações ao seu alcance, na palma de sua mão. Os clientes buscam uma interação maior com as empresas e têm novas maneiras de obter os serviços.",
    "Conclusão": "No desenvolvimento desse trabalho, tivemos a oportunidade de colocar em prática diversos conhecimentos que aprendemos durante o decorrer do nosso curso de graduação. Este trabalho de conclusão de curso nos proporcionou a aplicação de pesquisa e desenvolvimento de sistemas, e também tivemos contatos com tecnologias móveis as quais eram desconhecidas no início da nossa caminhada para conclusão do curso de tecnologia da informação e comunicação. Os estudos das tecnologias móveis no desenvolvimento do projeto do aplicativo resultou em uma demanda de trabalho maior para o grupo, o qual buscou identificar os possíveis problemas. A solução para os problemas encontrados nas etapas de desenvolvimento foram encontradas por meio de buscas na literatura e estudos de novas plataformas de desenvolvimento móvel. O projeto buscou a inovação do mercado na região, respeitando a necessidade da empresa em ter um meio de comunicação inovador com os clientes inovador, buscando atender as necessidades da empresa. A partir das análises dos clientes observamos que o objetivo principal do trabalho foi atingido, fornecendo à empresa uma mobilidade e uma ferramenta que permite um controle maior de seus pedidos facilitando o seu serviço diariamente."
}