{
    "Autor": "Ranieri de Oliveira Baltazar",
    "Título": "Implicações da Implantação de Sistemas ERP em Micro e Pequenas Empresas do Setor Varejista de Calçados: Um Estudo Multicasos",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Dra. Solange Maria da Silva",
    "Coorientador(a)": null,
    "Resumo": "Atualmente, vive-se na era digital, a era da informação, na qual torna-se imprescindível saber valorizar e fazer o bom uso da informação, sobretudo por parte das empresas que desejam obter vantagem competitiva e melhorar os seus resultados. Com o objetivo de aumentar a eficiência, os sistemas ERP (Enterprise Resource Planning) foram desenvolvidos para dar suporte às atividades de uma empresa e integrar diversas funcionalidades em um único sistema, que armazena e distribui informações entre diferentes departamentos, eliminando a fragmentação e a redundância dos dados. Com base nesse pressuposto, o presente trabalho buscou compreender as implicações do uso do ERP nas micro e pequenas empresas do setor varejista de calçados da cidade de Araranguá. Por meio de uma pesquisa survey, quali-quanti, e uso de questões fechadas, buscou-se identificar as implicações da implantação do ERP para as micro e pequenas empresas desse setor. Com uma amostra de 16 participantes, identificou-se que correspondendo a 61,5% da totalidade, foram obtidos os resultados principais: a média geral indica que os respondentes concordam com as utilidades e os benefícios trazidos pela implantação do sistema, tais como a melhoria do controle financeiro e a maior precisão nas informações fiscais. Porém, apenas um benefício foi avaliado ligeiramente abaixo da média, com 2,75, quanto ao uso de todas as ferramentas do ERP e isso demonstra que não está sendo utilizado todo o potencial de integração do sistema. Foi constatado também que 37,5% das empresas não percebem dificuldades e barreiras advindas da implantação, e que a maioria concorda que as implicações são positivas após a implantação dos sistemas ERP.",
    "Palavras-chave": [
        "sistemas ERP",
        "sistemas integrados de gestão",
        "micro e pequenas empresas",
        "setor varejista de calçados",
        "tecnologia da informação"
    ],
    "Introdução": "No atual cenário empresarial, a competição entre as empresas atinge escalas globais, onde as empresas não medem esforços para aumentar a sua competitividade, seja pela redução de custos, pelo desenvolvimento de produtos com qualidade, agregando valor e buscando um diferencial ou se especializando em determinado nicho de mercado (PADILHA; MARINS, 2005). Nesse mercado de concorrência cada vez mais acirrada, muitas empresas investem em sistemas de informação para alcançar um diferencial estratégico. O acesso facilitado à tecnologia diminui o distanciamento entre as empresas, independentemente do seu tamanho e poder aquisitivo. Por isso, é fundamental definir as informações estrategicamente importantes e a forma de obtê-las, antes de seus concorrentes (CAIÇARA JUNIOR, 2015, p. 23). O processo de maturação dos sistemas da informação foi decorrente do avanço tecnológico e do desenvolvimento das telecomunicações, que potencializaram o armazenamento e a organização de dados relacionados ao crescimento dos negócios e à ampliação da comunicação entre os computadores, o que possibilitou um grande avanço nos processos comunicativos, de armazenamento de dados, de busca das informações, entre outros procedimentos. Saber fazer o bom uso da tecnologia da informação (TI) é fundamental para a adoção de uma gestão empresarial ágil e alinhada aos objetivos estratégicos e metas de uma organização. Nesse sentido, a TI tem sido amplamente utilizada nos processos de decisão, controle e coordenação empresarial, proporcionando inúmeros benefícios que contribuem para o alcance de novos patamares de eficiência organizacional (PRADO; PASSANEZI, 2012). Os sistemas de informação trouxeram consigo uma nova maneira de fazer negócios, auxiliando as empresas a atingirem seus objetivos organizacionais, tais como, excelência operacional, criação de novos produtos e modelos de negócio, estreitamento no relacionamento com clientes e fornecedores e melhoria na tomada de decisão. São, portanto, fortes aliados à obtenção de vantagens competitivas (LAUNDON; LAUNDON, 2007). Um estudo feito pelo SEBRAE (2013) mostrou que o índice de sobrevivência das empresas com até dois anos de atividade aumentou em 2%, entre os anos de 2005 e 2007. No entanto, ainda assim, nota-se a grande dificuldade de sobrevivência das empresas, pois mesmo com o aumento desse índice, 58% das empresas fecharam as portas antes de completarem cinco anos de atividade, no ano de 2010 (PORTAL BRASIL, 2015). O mesmo estudo realizado pelo SEBRAE (2013) constatou que o crescimento no número de novas empresas está associado à melhoria na competitividade. Esse fato enaltece a utilização da TI e, mais precisamente, os sistemas ERP (Enterprise Resource Planning), pois esses sistemas têm como um dos principais benefícios decorrentes da sua implantação e utilização o aumento da vantagem competitiva (OLIVEIRA; RAMOS, 2002; ZAMAMI, 2009). Esse ambiente empresarial globalizado e, cada vez mais complexo, exige agilidade de decisão e integração do processamento das informações. Visando suprir essas necessidades, os sistemas ERP, também conhecidos como sistemas integrados de gestão, foram desenvolvidos para proporcionar a integração das informações, reunindo todas as informações vinculadas a diversas áreas de uma empresa em um único banco de dados, eliminando a redundância e a falta de integridade das informações (BORELLI, 2013). É inegável o fato de que o uso de tecnologias da informação está atrelado a inúmeras vantagens e benefícios, tanto em âmbito gerencial quanto operacional, tais como a disponibilização de informações em tempo real para tomada de decisão, a automatização de tarefas rotineiras e o alcance da excelência operacional (DUARTE et al., 2014; MEIRELES, 2006). Por outro lado, percebe-se que as MPE’s ainda encontram dificuldades no processo de implantação e utilização desses sistemas. A falta de capacitação de funcionários e até mesmo de dirigentes, acaba sendo uma barreira nesse processo. Há também muitos casos em que as empresas não conseguem utilizar todo o potencial do sistema e acabam simplesmente incorporando-o como mais um recurso de informática para apoio a tarefas rotineiras (MENDES; ESCRIVÃO FILHO, 2002, ZAMAMI, 2009).",
    "Conclusão": "O presente trabalho teve como objetivo compreender as implicações da implantação de sistemas ERP em micro e pequenas empresas. Assim como, identificar o motivo que leva uma empresa a implantar um ERP, analisar as dificuldades encontradas neste processo e identificar os e as implicações do seu uso após a implantação. O levantamento do referencial teórico contribuiu para o conhecimento da estrutura e das funcionalidades de um sistema ERP. Tal como, auxiliou no entendimento das vantagens e benefício, assim como das dificuldades e barreiras encontradas no processo de implantação de uso do sistema. O uso dos sistemas ERP tem se popularizado cada vez mais entre as micro e pequenas empresas. Pode-se perceber que esse fenômeno tem ocorrido graças ao surgimento de empresas fornecedoras de ERP de pequeno porte. Muitas dessas empresas conseguem oferecer sistemas de qualidade e confiabilidade. Somado a esses fatores, os atrativos preços de implantação e mensalidade, junto à redução dos custos de recursos computacionais ocorrido nos últimos anos, têm incentivado as empresas a buscarem um sistema que atenda a todas as suas necessidades. Com o objetivo de automatizar seus processos e melhorar o controle financeiro a fim de tornar seu negócio mais competitivo. É visto que muitas empresas, principalmente as microempresas não utilizam nenhum sistema de gestão. No entanto, exigências fiscais cada vez mais rigorosas, como a emissão de NF-e (Nota Fiscal eletrônica), os avanços de um mercado cada vez mais competitivo, com clientes mais exigentes e bem informados reivindicam a excelência no exercício empresarial que só pode ser culminado com o auxílio da tecnologia. A partir deste pressuposto, faz-se necessário que as empresas estejam preparadas e com seus processos bem definidos, para atender a seus clientes com o máximo de precisão, agilidade e flexibilidade. Todos esses fatores estimulam, e mais do que isso, \"forçam\" as empresas a adquirirem um sistema integrado de gestão. Visto que quando bem empregados, esses sistemas dão suporte a praticamente todas as atividades de uma empresa. Com o ERP, todas as áreas são informadas e se preparam de forma integrada para o evento, da compra da matéria prima à produção, passando pelo almoxarifado e chegando à área de marketing, que vai utilizar as informações para fazer as mudanças necessárias na campanha publicitária do produto. Este trabalho procurou mostrar tanto os benefícios, quanto as principais dificuldades no processo de implantação e utilização de sistemas ERP. De acordo com os resultados obtidos por meio da pesquisa, conclui-se que as MPE’s do setor de comércio varejista de calçadas instituídas na cidade de Araranguá, mesmo enfrentando aspectos negativos intrínsecos ao seu porte empresarial, fazem um bom uso de sistemas ERP. Sendo que a grande maioria das empresas participantes da pesquisa concorda com os benefícios da implantação e utilização do ERP e têm conseguido superar as barreiras e dificuldades decorrentes desse processo. Observa-se que, não basta somente implantar um ERP, é preciso estar disposto a submeter-se a uma mudança estrutural e comportamental. Para aumentar as chances de sucesso neste processo é indispensável que todos os envolvidos estejam fortemente comprometidos. Para trabalhos futuros, sugere-se analisar a utilização de sistemas ERP de forma integrada a outros sistemas, como o CRM (Customer Relationship) e o BI (Business Intelligence), considerados sistemas complementares ao ERP, mas que não foram estudados nesta pesquisa."
}