{
    "Autor": "Michele da Silva Souza",
    "Título": "As Transformações em Época de Pandemia e o Trabalho Home Office : Um Estudo com Gestores e Trabalhadores de Empresas",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Prof. Dra. Andréa Cristina Trierweiller",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho teve como objetivo analisar a adaptação ao trabalho home office, imposto pela pandemia da COVID-19, na visão de trabalhadores e gestores de empresas. Dentre os objetivos específicos, verificou-se as principais características, vantagens e desvantagens do trabalho nesta modalidade. Para tanto, fez-se uso de dados secundários com o levantamento da literatura em busca de definições, classificações e temas correlatos ao home office, bem como de dados primários por meio de instrumentos de coleta de dados já existentes, para adaptação à realidade do trabalho em tela, e sua aplicação. Como procedimentos metodológicos, a pesquisa apresenta caráter exploratório e descritivo e, dentre os fatores levantados estão os benefícios e dificuldades enfrentados pelos trabalhadores e gestores de empresas. A amostra foi não probabilística, por conveniência, não sendo representativa do universo, e utilizou de análise via estatística descritiva, com a apresentação de percentuais e gráficos. Assim, foi feita uma survey, em que se enviou um convite por e-mail e aplicativo de mensagens, da rede de contatos da autora deste TCC e de sua professora orientadora. Dentre os resultados com os trabalhadores, a maior parte aderiu ao home office; dos 85 respondentes, 48 estão atuando neste formato, o que equivale a 56,5% e, destes, 43,8% indicou ter ensino superior completo; 45,8% das empresas atuavam no segmento de serviços, com destaque para área de Tecnologia da Informação e Comunicação. Os trabalhadores avaliaram seu desempenho no home office como 'muito bom' (41,7%). Dentre os resultados dos três gestores entrevistados, dois gestores das empresas desenvolvedoras de software não formalizaram o contrato ou aditivo contratual referente ao home office, bem como não implantaram sistema para controle de ponto. Já, o gestor da empresa de consultoria, que teve seu boom de crescimento durante a pandemia, iniciou a relação trabalhista via modalidade home office e, portanto, buscou assessoria especializada em direito trabalhista e especificidades desta modalidade laboral. Como oportunidades para trabalhos futuros, uma das sugestões seria aumentar o período de disponibilização do questionário e buscar respostas em maior escala, outra possibilidade seria realizar um levantamento apenas com trabalhadores e gestores que aderiram ao home office, especificamente, no segmento de Tecnologia da Informação e Comunicação.",
    "Palavras-chave": [
        "Home Office",
        "Trabalho Remoto",
        "Pandemia",
        "COVID-19"
    ],
    "Introdução": "O SARS-CoV-2 – vírus responsável pela pandemia da COVID-19, uma doença infecciosa – tem afetado as pessoas de forma diferente, no mundo todo. Alguns doentes desenvolvem sintomas leves e moderados e se recuperam, sem a necessidade de hospitalização (PAHO, 2021). Contudo, trata-se de uma pandemia com alta taxa de transmissão, que pode acontecer pela proximidade com alguém infectado, ou até mesmo, pelo contato com superfícies contaminadas. Ou seja, é um cenário preocupante e, segundo dados da World Health Organization – WHO, em português, Organização Mundial da Saúde – OMS, o número de mortes ocasionado pela COVID-19 alcançou cerca de 3 milhões e 170 mil no mundo e 401 mil no Brasil (WHO, 2021). Portanto, no enfrentamento da pandemia, ainda sem vacinas desenvolvidas, as medidas sanitárias não farmacêuticas se constituem em alternativas, adotadas pelos países, para conter o avanço do vírus; dentre elas, o distanciamento e o isolamento social. As principais medidas não farmacêuticas, conforme as diretrizes da WHO para conter pandemias, são: Restrição de Mobilidade, Medidas de Saúde Pública, Medidas Socioeconômicas, Distanciamento Social e Bloqueio, de acordo com o The Assessment Capacities Project (ACAPS, 2020). Tais medidas forçaram a mudança de rotinas; inclusive, do ambiente de trabalho, pressionando as organizações – em todo o mundo – a buscarem soluções para manutenção da atividade produtiva, dentre elas, vê-se a ascensão do trabalho home office. A dinâmica do trabalho já demonstrava mudanças; contudo, a pandemia funcionou como uma aceleradora do trabalho remoto, da educação a distância, na busca por alternativas sustentáveis, demonstrando a preocupação com que as empresas sejam mais responsáveis, do ponto de vista social. Em vários casos, o home office se evidenciou como uma alternativa viável e até, mais produtiva; diante da lógica digital e por conta da potencialização dos escassos recursos disponíveis. As empresas terão que repensar onde e como produzem e comercializam seus produtos e serviços, pois a psicologia do consumo e do investidor mudarão, transformando também, os negócios (QUEIROGA, 2020).",
    "Conclusão": "Com base na pesquisa conduzida neste TCC, foi possível analisar a adaptação ao home office, imposto pela pandemia da COVID-19, na visão de trabalhadores e gestores de empresas. Tal objetivo foi alcançado, a partir da revisão de literatura, complementada com a aplicação do questionário junto a trabalhadores home office e a três gestores de empresas. A rotina laboral foi alterada, devido às exigências para o afastamento e distanciamento social, como medida de não farmacêutica com vistas à contenção da dispersão do coronavírus. Nesse sentido, o home office, modalidade de trabalho que não era novidade, mas que ganhou ascensão com a pandemia, foi a alternativa adotada por muitas empresas. Dentre os achados desta pesquisa, conforme resultados que merecem destaque, tem-se que a maior parte dos trabalhadores respondentes, aderiu ao home office. Ou seja, dos 85 pesquisados, 48 estão atuando neste formato, o que equivale a 56,5%. Desses, 43,8% têm ensino superior completo; e ainda, 45,8% das empresas atuam no segmento de serviços, com destaque para área de Tecnologia da Informação e Comunicação. Esses trabalhadores avaliaram seu desempenho no home office como sendo 'muito bom' (41,7%). Dessa maneira, é evidente a necessidade do treinamento e incorporação do uso de ferramentas de TIC no cotidiano da atividade laboral, dependendo muito da organização e recursos disponibilizados para que o empregado tenha um desempenho adequado. Dentre os resultados dos três gestores entrevistados, destaca-se que os dois gestores das empresas desenvolvedoras de software não formalizaram o contrato ou aditivo contratual referente ao home office, bem como não implantaram sistema para controle do ponto. Já, a empresa de consultoria, que teve seu boom de crescimento durante a pandemia, tendo contratado todos seus funcionários a partir de 2020, já iniciou a relação trabalhista via modalidade home office e, portanto, buscou uma assessoria especializada em direito trabalhista e especificidades desta modalidade laboral. Queiroga (2020) comenta sobre a avaliação e o desempenho na pesquisa feita pós-pandemia pelo Datafolha, em que um terço dos respondentes estavam dispostos a trabalhar em casa; porém, após um curto período, esse número caiu devido às dificuldades na transição do trabalho presencial para o home office. Entretanto, é relevante retomar dados publicados pelo IBGE, antes da pandemia da COVID-19, em 2018, quando um total de 3,8 milhões de pessoas trabalhavam 'no domicílio de residência'. Na semana de 21 a 27 de junho de 2020, no contexto da pandemia, o IBGE estimou em 8,6 milhões o número de brasileiros que 'trabalhavam remotamente', o que equivale a 12,4% da população ocupada do país. Portanto, o home office é uma realidade nacional e tem se firmado para continuidade no pós-pandemia (OLIVEIRA, 2020). Cabe destacar ainda, que os gestores precisam se preocupar com a saúde do trabalhador, pois as atividades home office também oferecem riscos laborais. A exemplo dos esforços repetitivos requeridos, que podem levar ao desenvolvimento de doenças ocupacionais, lesões pelas atividades de digitação, sedentarismo, e até mesmo, doenças causadas pelo stress. Algumas regras devem estar previstas no contrato, desde quem vai arcar com os custos do empregado (energia, internet e equipamentos), até o termo de responsabilidade da empresa, quanto às providências para a ergonomia e saúde do empregado. Como oportunidades de trabalhos futuros, uma sugestão seria aumentar o período de disponibilização do questionário e buscar respostas em maior escala, já que esta pesquisa contou com a participação de 85 (oitenta e cinco) trabalhadores respondentes e destes, apenas 48 (quarenta e oito) atuavam na modalidade home office. E ainda, ampliar o número de entrevistas com gestores de empresas; podendo inclusive, explorar segmentos específicos, como Tecnologia da Informação e Comunicação, que inerentemente, tem em seu núcleo o uso de tecnologias, o que parece facilitar a migração ao home office."
}