{
    "Autor": "Luan Kenig de Souza",
    "Título": "ANÁLISE DA EXPERIÊNCIA DE USUÁRIO COM REALIDADE VIRTUAL UTILIZANDO OCULUS QUEST 2",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Eliane Pozzebon, Drª",
    "Coorientador(a)": "Prof. Giácomo Antônio Althoff Bolan, Dr",
    "Resumo": "O presente trabalho de conclusão de curso tem como objetivo principal a análise da experiência de usuário ao utilizar o dispositivo de realidade virtual, especificamente, o Oculus Quest 2. Para alcançar este propósito, conduziu-se um estudo que empregou um questionário fundamentado na metodologia GameFlow, a fim de avaliar e validar os resultados. A pesquisa contou com a participação de integrantes do Laboratório de Tecnologias Computacionais (LabTeC) e alunos de graduação da UFSC. Os resultados obtidos a partir dessas interações e avaliações são cruciais para compreender a percepção e reação dos usuários diante do uso da tecnologia de realidade virtual, destacando os desafios, habilidades e imersão envolvidas. As conclusões provenientes deste estudo permitem esclarecer a relação entre os usuários com o Oculus Quest 2, fornecendo informações importantes para melhorias e aprimoramentos tanto na questão de aplicações, como na finalidade do uso do óculos de realidade virtual como um todo.",
    "Palavras-chave": "Oculus Quest 2, realidade virtual, experiência de usuário.",
    "Introdução": "Com o anúncio do óculos Apple Vision Pro na conferência anual da Apple para desenvolvedores, a WWDC2023, veiculou na mídia os termos Realidade Aumentada, Realidade Mista e Realidade Virtual com a imprensa jornalística rotulando o produto entre os três termos citados acima. (ACHILLES, 2023; JUNQUEIRA, 2023) Com o avanço da tecnologia, os óculos de realidade virtual têm se apresentado como uma boa proposta, mas no presente momento em que esta tecnologia se encontra é possível perceber que tanto o mercado, quanto às aplicações desenvolvidas para os óculos de realidade virtual ainda é um nicho, seja com uma modesta parcela de pessoas que possui tal tecnologia, como também os jogos e aplicações ainda serem desenvolvidos dentro das limitações que cada óculos de realidade virtual dispõem.(CAMBOIM,2017;COELHO,2016) Em termos mercadológicos, a tecnologia de realidade virtual tem muito a evoluir, principalmente no que diz respeito às aplicações, como por exemplo criar um teste vocacional dentro de um mundo virtual, este é o propósito do projeto desenvolvido no Laboratório de Tecnologias Computacionais (LabTeC) chamado WorkWise. Outro exemplo que pode ser citado embora fora do aspecto prático, é a obra de Hideo Kojima, Metal Gear Solid, lançada em 1998, onde foi apresentado o modo de jogo VR Missions, cujo conceito dentro do universo do jogo é capacitar soldados em termos de treinamento militar como combate e manuseio de armas. No quesito de utilizar a tecnologia de RV para desenvolver aplicações abrangendo mais áreas além dos jogos eletrônicos, como na educação, medicina, indústria em casos de trabalhos insalubres e militar, simulando situações que podem ocorrer no mundo real.(COSTA e RIBEIRO,2009; NASSAR et al.,2019; NETTO et al.,1998) Expandir o uso da realidade virtual para a simulação de cenários reais também significa expandir o mercado consumidor desta tecnologia para além dos jogos eletrônicos e cinemas 3D interativos, tornando a função da realidade virtual mais nobre, somando esta ideia com a implementação da gamificação, onde o usuário terá um feedback de pontuações, erros e acertos na aplicação de simulação e capacitação, tornando a tarefa mais prazerosa de cumprir. (COSTA e RIBEIRO, 2009; NEMER et al.,2020) Neste trabalho será abordado como a experiência do usuário em sua percepção pode ser útil tanto para dar feedback em uma aplicação, independentese já está disponível no mercado ou ainda em desenvolvimento, para avaliar sua qualidade, como também ter um direcionamento melhor das necessidades do usuário em relação ao produto.",
    "Conclusão": "Para uma melhor compreensão da realidade virtual e de sua importância na atualidade, foi considerado importante a revisão bibliográfica para conceituá-las sobre do que se trata e de seu funcionamento, onde desde os primórdios, foram criadas tecnologias dentro das limitações de hardware e software na década de 50 até meados de 80, que simulasse ambientes virtuais aos usuários, proporcionando uma interação e imersão para os usuários ao interagirem e permanecerem imersos na experiência da realidade virtual. Com essas pesquisas, houve a expansão do uso da tecnologia para a áreas educacionais e da indústria do entretenimento, fomentando pesquisas tanto para descobrir os impactos do uso da realidade virtual aos usuários, como o desenvolvimento de aplicações imersivas, por meio de jogos como Epic Roller Coasters, Gorilla Tag, Pavlov Shack Beta e Ultimechs, assim como por meio de aplicações simulando uma experiência de contato social como ChatVR e o Metaverso. A proposta deste trabalho de conclusão de curso visou aplicar uma experiência de imersão com realidade virtual, em conjunto de questionários a fim de obter resultados e salientar a valor da avaliação de jogos e aplicações a partir da percepção do usuário, nos quais os desenvolvedores de aplicações podem usufruir destes feedbacks, analisando-os de maneira crítica e ponderada, podendo trazer correções e melhorias para a aplicação, estendendo seu ciclo de vida. A criação de um questionário com base na metodologia GameFlow foi fundamental para o desenvolvimento deste trabalho, mesmo utilizando 7 dos 8 elementos utilizados para a avaliação de jogos, os elementos estão relacionados não apenas para avaliar um jogo sendo esse educativo ou não, mas sim, para avaliar uma aplicação na realidade virtual onde critérios, por exemplo: concentração, desafio e habilidades do jogador, estão de acordo com a experiência imersiva e interativa que a realidade virtual tem a oferecer. Abordar sobre os trabalhos relacionados a realidade virtual dá ênfase a relevância do tema para a comunidade acadêmica, seja através de um artigo estudando de que forma a cinetose afeta na experiencia de cada usuário na realidade virtual, para tratamento de fobias e ansiedade social, até mesmo a realidade virtual como forma de auxiliar no aprendizado de alunos de escolas públicas, de forma a apresentar métodos alternativos para a cura de fobias e no estilo de aprendizagem. No que diz respeito à aplicação da proposta e análise dos resultados, foi possível concluir que o jogo Epic Roller Coasters conseguiu cumprir sua proposta para um jogo de realidade virtual referente a maioria dos critérios da metodologia GameFlow. Em termos gerais, conseguiu fazer com que os participantes tivessem foco e concentração durante o jogo, se sentiram desafiados de forma equilibrada, uma grande parcela achou fácil se habituar com as mecânicas do jogo, tanto que os jogadores perceberam a dificuldade aumentar conforme a progressão do jogo. Os controles estavam tranquilos para localizar botões e analógicos, os objetivos estavam definidos e visíveis, o jogo retornou o progresso dos participantes com informações que vão do básico até a alta gama de informações, compensando o jogador com pontuações de forma a estimular uma competição entre os participantes, de forma a quebrar recordes, e por fim, os níveis de imersão foram altos e o jogo foi considerado divertido. No geral, conclui-se que a metodologia GameFlow é válida para avaliar a experiência de usuário na realidade virtual, independente se o jogo ou aplicação for educacional ou de entretenimento. Para futuros trabalhos, fica a ideia de concatenar o uso da metodologia GameFlow na indústria de jogos e aplicações, onde grandes e pequenas desenvolvedoras adaptem a fase de testes de um jogo aplicando um feedback, fazendo com que a relação desenvolvedor-jogador fique estreita, facilitando a vida do desenvolvedor na hora de corrigir erros e atender os pedidos de jogadores, trazendo inovações para a aplicação."
}