{
    "Autor": "Bernardo Dalpiaz Soares",
    "Título": "DIAGNÓSTICO DE MÉTODOS ÁGEIS PARA EMPRESAS DO SEGMENTO DE TECNOLOGIA DA INFORMAÇÃO E COMUNICAÇÃO",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Helio Aisenberg Ferenhof",
    "Coorientador(a)": "",
    "Resumo": "Junto a realidade atual onde existem diversos métodos ágeis com características muitas vezes similares, encontra-se a dúvida de qual destes ser aplicado em uma empresa. Per ante a isso, este trabalho buscou identificar junto a literatura, vantagens e desvantagens dos métodos ágeis a fim de encontrar uma forma de criar um ranking para a escolha de qual destes métodos seria mais adequado para determinada organização. Para a avaliação do perfil da empresa versos método ágil tomou-se base em um survey, por meio de um questionário auto administrável pela internet com perguntas fechadas, onde cada um dos respondentes foi considerado um caso. A analise deste estudo de casos, utilizou-se a métrica desenvolvida advinda da análise da literatura, resultando em uma pontuação individual para cada caso e uma recomendação de método ágil mais alinhado ao perfil da empresa caso. Com a aplicação da ferramenta, mesmo quando resultando em uma pontuação que empate, foi possível identificar os métodos que mais se adaptam ao perfil da empresa caso. Sendo assim, acredita-se que a ferramenta se mostra efetiva e pode auxiliar empresas na escolha de método ágil a ser implantado.",
    "Palavras-chave": "Método Ágil. Ranking. Estudo de Caso. Métrica.",
    "Introdução": "Os Métodos Ágeis estão sendo cada vez mais procurados nas indústrias de software, afim melhorar a qualidade dos sistemas e suprir as necessidades dos clientes (SATO, 2007). A utilização destes métodos, procura entregar um projeto final que satisfaça a necessidade do cliente, pelo fato de que o mesmo participa frequentemente do início até o fim do projeto. Os métodos ágeis, possuem ferramentas e técnicas que envolvem os stakeholders na definição dos requisitos do projeto (ALMEIDA, 2017). Este fato, faz com que se leve em consideração o acompanhamento dos stakeholders, analisando e testando cada etapa. Sendo assim, a chance de ter que mudar algo ao final é mínima, resultando em economia de tempo e redução do risco de inviabilizar o projeto. Mesmo assim, o escopo é passível de mudanças e estas devem ser gerenciadas (PMBOK, 2018). Ao cogitar a ideia de aderir a alguma metodologia ágil, para ser utilizada na empresa, deve antes disso considerar que haverá de serem feitas algumas mudanças culturais e também no estilo de gestão da organização. E, ainda a organização deve proporcionar flexibilidade e responsividade (CAVALERI; OBLOJ, 2003). Nenhum projecto é totalmente previsível, portanto ser ‘ágil’ é ter conhecimento desta realidade e aceitar que os requisitos habitualmente mudam, em suma, estar pronto para acomodar a mudança de forma simples e rápida (TOMÁS, 2009. p.5). Podem ser encontradas diversas metodologias ágeis, dentre as mais populares estão o XP ( Extreme Programming ), FDD ( Feature Driven Development ), Crystal , e o Scrum (SOMMERVILLE, 2007). Cockburn (2002), afirma que para a escolha de alguma das metodologias, deve levar em conta que a metodologia deve ser adequada ao projeto, e não o projeto se adequar a metodologia. Segundo Pressman (2006), antes mesmo da escolha da metodologia, algumas características devem estar presentes nas pessoas da equipe ágil. Sendo elas: competência, foco comum, colaboração, capacidade de tomada de decisão, habilidade de resolver problemas vagos, respeito e confiança mútua, auto-organização. Contendo essas características, o autor afirma que a equipe estará preparada para obter o sucesso e enfrentar as dificuldades que se farão presentes ao longo do projeto. Cohn (2011), defende que para obter sucesso na implementação de uma metodologia ágil, tomando como base o Scrum, não deverá ter resistência na equipe, o ideal seria ter o apoio principalmente da alta gerência, assim, motivando a participação das outras partes. O autor coloca também alguns motivos pelo qual algumas partes não adotam algum novo método, dentre os motivos citados pelo autor, por parte de funcionários, são a falta de conhecimento e o medo do desconhecido. Já por parte da gerência seria a falta de tempo e o medo de perder autoridade. Sendo assim, as metodologias ágeis para desenvolvimento de software procuram dar menor atenção para a documentação e dar enfoque no desenvolvimento do projeto em si, procurando manter frequentemente a comunicação entre os membros da equipe que estão desenvolvendo o projeto e a interação com o cliente. Os desenvolvedores nem sempre executam apenas uma tarefa, estarão sempre atenciosos às opiniões do cliente, e caso necessário, executarem alguma modificação no projeto (ALMEIDA, 2017). Atualmente encontra-se diversas metodologias ágeis, entre elas algumas mais utilizadas devido a características em comum entre a metodologia e o projeto (SOMMERVILLE, 2007). Essas metodologias são comuns em alguns princípios, contudo não há um padrão de definição dos processos (KETTUNEN; LAANTI, 2008). Segundo Silva et al (2011) e Abrahamsson (2000), alguns métodos ágeis, quando aplicados em desenvolvimento de software, buscam atingir objetivos específicos, por exemplo, o XP é frequentemente utilizado em implementação de software, Scrum para gerir o planejamento do projeto e implantação. Além de que há a possibilidade da utilização de mais de uma metodologia. Tendo como exemplo a utilização de um híbrido entre XP e Scrum, no qual vem sendo bastante adotado (SOARES, 2004). Abrahamsson (2000) assume que se deve dar mais importância para analisar e estudar os fatores que implicam na satisfação dos stakeholders, pois o nível da melhoria do processo, utilizando uma metodologia ágil, é o reflexo desta satisfação. Frente ao contexto supracitado o problema deste estudo está relacionado a adequação de qual Metodologia Ágil é mais adequada para aplicar em uma empresa? Haveria a possibilidade de utilizar mais de uma Metodologia? Destaca-se que a literatura denomina de várias formas o conceito ágil de gestão. Sendo estas, framework ágil, metodologia ágil, método ágil, que para este trabalho são tratados de formas iguais, tendo o mesmo sentido e, neste estudo normatizado como método ágil.",
    "Conclusão": "Neste trabalho primeiramente foi apresentado um estudo, baseado na literatura, contendo as características gerais dos métodos e suas vantagens e desvantagens, onde foram identificadas semelhanças e diferenças entre tais. As características de cada método foram inseridas em uma tabela a fim de melhorar a visualização, assim, proporcionando mais facilidade na elaboração do questionário. A proposta do trabalho visa encontrar uma forma de identificar qual método ágil é mais adequado para determinada empresa. Os dados de cada respondente que foram coletados por meio de questionário e analisados. No questionário, foi elaborada uma métrica no qual pôde-se obter uma pontuação para cada método, onde o que estivesse a pontuação maior seria o indicado a ser adotado na empresa caso. Em algumas situações, mesmo com o critério de desempate, os métodos ainda permaneceram com a mesma pontuação, desta forma foi considerado mais viável o respondente escolher algum dos métodos, que obtiveram a mesma pontuação, para utilizar. Sendo assim, pôde-se considerar a métrica efetiva para pontuação dos métodos, permitindo então, ranquear os mesmos para cada caso específico. Dito isto, com base nos dados foi possível perceber as diversas características semelhantes entre os métodos, visto que os mesmos tiveram como base de sua criação, o manifesto ágil. A escolha entre a utilização de métodos ágeis para o desenvolvimento de software, tem sido bastante discutida em vários aspectos, o principal é a presença de alguns critérios que implicam no sucesso ou não do resultado da aplicação do método (ALMEIDA, 2017). O trabalho concede uma visão mais clara das parecenças entre os métodos, bem como as diferenças e suas características. Assim, caso o indivíduo tenha interesse em aplicar algum método ágil em sua empresa, porém possui pouco conhecimento sobre o assunto, a métrica poderá norteá-lo. Utilizando como base as características da sua organização, indicando o método ágil que irá se adaptar melhor, podendo também aplicar de mais de um método de forma híbrida. Desta forma acredita-se que a ferramenta pode se mostrar efetiva nos casos em que membros de determinada empresa têm dúvidas de qual método utilizar. Pois auxiliou no entendimento do perfil da organização, bem como dos métodos ágeis que podem ser adotados. Como proposta para trabalhos futuros foram identificadas as seguintes oportunidades: Aplicação da ferramenta em diversas organizações, a fim de ter um maior número de casos a serem analisados, resultando em uma pesquisa mais ampla; Entrevistar os respondentes, apresentando os resultados obtidos com a aplicação da ferramenta, e verificar se este resultado condiz com a realidade da empresa; Utilizar escala gradual Likert para mensurar as necessidades dos respondentes; Desenvolvimento de um software que automatize a ferramenta, possibilitando que demais pessoas tenham acesso à mesma."
}