{
    "Autor": [
        "Alix Ribeiro da Silva",
        "Guilherme Henrique Teixeira Duarte"
    ],
    "Título": "Educação, Inovação e Tecnologia: Desenvolvimento de um Protótipo para Relação Família e Escola e Segurança de Estudantes",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Olga Yevseyeva",
    "Coorientador(a)": null,
    "Resumo": "O objetivo deste trabalho de conclusão de curso é apresentar um protótipo interativo de um aplicativo para aparelhos móveis que possa relacionar família e escola e promover a segurança de estudantes. Para isso, realizou-se o estudo a partir de uma Revisão Sistemática de Literatura (RSL) e uma pesquisa bibliográfica exploratória a respeito de inovações tecnológicas na educação, bem como entrevista com pais de estudantes e funcionários de diferentes escolas para analisar a viabilidade de tal criação. Por fim, assim como a positividade passada pelos pais de alunos que entendem que a tecnologia é uma inovação para a educação e de grande importância na prevenção de violência e relacionamento entre família e escola. O aplicativo se encontra no momento em fase de desenvolvimento da programação para futuramente ser disponibilizado a usar-se na educação. O artefato mostrase de grande importância tanto para a escola, como para a família, e para toda sociedade. Uma opção para combater a falta de segurança que atinge até mesmo as escolas, local onde educa-se para práticas de segurança e combate à violência. O artefato se mostra inovador com originalidade na ideia e um grande valor social, haja vista que, o mesmo busca combater a violência e promover segurança e bem-estar por meio da prevenção.",
    "Palavras-chave": [
        "TIC",
        "Protótipo",
        "Prevenção de Violência",
        "Segurança Pública",
        "Gestão Tecnológica"
    ],
    "Introdução": "O processo de constituição da história da sociedade humana passou por três grandes revoluções, sendo iniciado pela revolução cognitiva há cerca de 70 mil anos; seguido da revolução agrícola por volta de 12 mil anos atrás; posteriormente segue-se a revolução científica, começada há 500 anos, configurando um novo sentido à história (HARARI, 2015). A história da sociedade humana foi regida por mudanças radicais de valores, princípios, pensamentos e mesmo de tecnologias que causam impactos na forma de vida das sociedades, ressignificando as culturas, proporcionando um novo olhar e uma nova forma de viver. Este processo vem se repetindo a cada século (HARARI, 2015). Pode-se dizer que nos últimos séculos tais mudanças ocorrem de maneira mais rápida, sendo que, em um século são diversas descobertas tecnológicas, bastando um curto tempo para que uma inovação seja coberta por outra mais atual e significativa. Mudanças tecnológicas digitais tiveram seu apogeu pela década de 70 e 90, ocasionando uma revolução no sistema social além de promover o desenvolvimento mundial técnico científico, caracterizado pela aplicação de tecnologias (PEREIRA e SILVA, 2010). O mundo ficou conectado por meio das Tecnologias da Informação e Comunicação (TIC), em especial pela rede de Internet. Pereira e Silva (2010) relatam que o desenvolvimento tecnológico não provocou mudanças apenas nas áreas de tecnologia e de comunicação, mas também, em outras áreas da sociedade, alterando condutas, costumes, valores, práticas de consumo, formas de lazer e interação entre os agentes sociais, configurando uma nova sociedade da informação (PEREIRA e SILVA, 2010). Neste contexto, a escola, bem como a educação sofreram significativas transformações, onde, o processo de ensino e aprendizagem foi convidado a se inovar para assim acompanhar o advento tecnológico. Uma das inovações está no método de ensino híbrido, uma combinação entre ambientes de ensino presencial e virtual (SILVA, 2011). Contudo, como afirma Castells (2016, p. 64) “a tecnologia não determina a sociedade”, ou seja, a tecnologia não determina o percurso no qual a educação escolar deve caminhar. Mas, é importante inovar a educação empregando TIC no auxílio do processo de ensino e aprendizagem. Considerando-se um recurso auxiliar na prática pedagógica do educador, a inclusão das TIC’s em sala de aula, deve ser acompanhado por uma metodologia adequada às necessidades dos estudantes, utilizando-se de maneira apropriada e significativa, questionando o objetivo que se quer atingir, levando-se em consideração o lado positivo e as limitações que apresentam. As TIC como recursos de aprendizagem, ampliam as possibilidades dos educadores em ensinar e do estudante em aprender. Verifica-se que quando utilizadas adequadamente, auxiliam no processo educacional onde “o grande objetivo do campo do saber é a aprendizagem dos alunos, e a organização escolar necessária é a que leva a melhorar a qualidade dessa aprendizagem” (LIBÂNEO, 2007, p. 309). As TIC, além de auxiliarem no processo de ensino e aprendizagem, também podem contribuir com a comunicação e interação entre família e escola, não apenas com os métodos tradicionais de comunicação (telefonemas e mensagens de texto), mas também, com inovações que possam promover uma interação eficiente e satisfatória. O uso de aplicativos em aparelhos móveis pode ser uma saída inovadora, haja vista que, quase 100% dos pais de estudantes, professores e funcionários de escolas possuem um aparelho celular (ou smartphone). Outra questão que preocupa a família de estudantes e a escola é referente a segurança pública, visto que diariamente é possível presenciar casos de violência, seja física ou moral, na sociedade. Logo, a família e a escola devem se unir e buscar soluções que possam combater a violência e assim promover maior segurança aos estudantes.",
    "Conclusão": "Ao finalizar este trabalho de conclusão de curso, percebeu-se que a evolução das TIC provocou mudanças nas relações sociais dos indivíduos, em especial no que se refere ao uso de tecnologias de comunicação; também nos costumes; na prática de consumo; na forma de lazer; e mesmo nas formas como os agentes sociais se comunicam, se relacionam. Outras mudanças adquiridas são nos hábitos sociais, com surgimento de novas formas de interação e conexão por meio da rede de internet, fundamentando a cibersociedade. Analisando as mudanças nos padrões de vida da cibersociedade, dentre essas mudanças, a da interação entre família e escola, cada dia mais distante, haja vista que, por vezes os pais deixam seus filhos cedo na escola para passar o dia em função da carga horária de sua vida profissional. Contudo, a “necessidade” de os pais trabalharem não retira a preocupação com o bem-estar de seus filhos, se estes estão seguros e saudáveis. Nesta era de globalização, inovar e desenvolver ferramentas tecnológicas que promovam o desenvolvimento social, a segurança, a satisfação, o bem-estar, a comunicação e informação é fundamental para a sociedade atual. Buscar desenvolver tecnologias de baixo custo, de fácil acesso, e acessíveis para todos torna-se mais atraente e proporciona autonomia no manuseio. A partir das entrevistas aplicadas com os participantes da pesquisa, ficou mais claro a necessidade de criação de uma ferramenta digital que pudesse promover a interação entre família e escola e que pudesse garantir a segurança pessoal dos estudantes. Para os pais, ainda que eles saibam que seus filhos estão na escola, esses, não têm confiança na real segurança, pois o nível de violência é preocupante, sendo a escola um local alvo de criminosos. Assim, a fim de contribuir com a segurança de estudantes, e inovar na educação com o desenvolvimento de uma ferramenta digital para interação família e escola, foi o que motivou o desenvolvimento de tal aplicativo que teve aprovação total dos participantes envolvidos na pesquisa. O Protótipo interativo demonstrou-se em suas avaliações atender e solucionar a problemática descrita nesse trabalho. Todos os potenciais usuários entrevistados aprovaram a sua usabilidade e futuras funcionalidades. Como o aplicativo em estágio de prototipação, deixou-se para criar futuramente a implementação, acrescentadas de funções que possam ter interação além da família e escola, de órgãos de segurança pública, para casos de emergências."
}