{
    "Autor": "Stela Ronchi Menegon",
    "Título": "SoftGame: Jogo de Tabuleiro como Material de Apoio à Engenharia de Software",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Dra. Luciana Bolan Frigo",
    "Coorientador(a)": null,
    "Resumo": "Jogos educacionais podem ser utilizados como uma ferramenta para auxiliar no processo de ensino-aprendizagem estimulando os alunos no desenvolvimento de habilidades físicas e mentais. Tais jogos fornecem uma maneira de colocar em prática conhecimentos obtidos em áreas que envolvem muitos conceitos, como é o caso da engenharia de software. Dessa maneira, considerando a engenharia de software como uma disciplina consideravelmente teórica, mas de extrema importância para os cursos de computação, este trabalho propõe o desenvolvimento de um jogo de tabuleiro, que auxilie no processo do aprendizado da engenharia de software, estimulando o aluno dentro da sala de aula. O jogo traz uma abordagem teórica sobre conceitos e metodologias de engenharia de software, com perguntas classificadas em três níveis de complexidade divididas em quatro tópicos: introdução à engenharia de software, engenharia de requisitos, produção de software e modelos de processos, planejamento e gerência de projetos e qualidade, incluindo testes, manutenção e evolução de software. Este jogo de tabuleiro possui quatro peões, uma ampulheta, um dado personalizado, uma embalagem, um tabuleiro bem como suas regras. Os resultados obtidos com o jogo SoftGame foram satisfatórios. Ele é um jogo descomplicado de ser jogado possuindo regras simples. A interação experimentada entre os jogadores, organizados em equipes, é um fator que estimula a diversão e a competição saudável entre os mesmos. Através da abordagem de assuntos referentes à engenharia de software, durante a partida os jogadores são estimulados a desafiar seu conhecimento para conseguir realizar as tarefas presentes neste jogo e saírem vencedores.",
    "Palavras-chave": "Jogo de tabuleiro, Engenharia de software, Jogos na Educação, Jogos Analógicos.",
    "Introdução": "A criação de jogos para auxiliar na aprendizagem é uma tarefa desafiadora para os instrutores que não possuem disponibilidade ou conhecimento suficiente para criar seus jogos de forma efetiva. Os alunos de computação precisam adquirir competências em diversas áreas, incluindo algoritmos, programação, engenharia de software, redes de computadores, entre outras, ACM/IEEE (2005 apud WANGENHEIM, 2012, p.13) e isso em diversos níveis de aprendizagem, incluindo o nível de conhecimento em que o aluno aprende a lembrar dos conceitos, o nível de compreensão em que ele aprende a classificar, estruturar e organizar o conhecimento e o nível de aplicação em que o aluno se torna capaz de aplicar o conhecimento em situações concretas. Eles ainda precisam aprender não só o conhecimento, mas também habilidades como trabalhar em equipe e desenvolver atitudes profissionais (WANGENHEIM, 2012, p. 13). No entanto, a tradicional forma de ensino, extremamente centrada no professor, faz com que falte aos estudantes oportunidades para aplicação prática dos conceitos aprendidos em aula. Recentemente, criou-se a expectativa de que jogos e dinâmicas educacionais sejam um meio bastante vantajoso para completar o ensino das competências relacionadas à área de computação. (WANGENHEIM, 2012, p. 16) Dessa forma, o presente trabalho tem como objetivo a criação de um jogo de tabuleiro para ser usado como material de apoio em sala de aula na disciplina de Engenharia de Software. O Jogo de tabuleiro é um meio de interação entre pessoas sem dúvida alguma e ferramenta de apoio para o ensino da computação. Atualmente existem diversos jogos de tabuleiro no mercado e todos, por mais diferentes que sejam, apresentam um objetivo em comum, fazer os jogadores se divertirem e alcançarem um objetivo em comum que é vencer. As pesquisas realizadas foram retiradas de livros, artigos, páginas da Web e jogos de tabuleiro já produzidos, e englobam os principais conceitos da Engenharia de Software, divididos em quatro tópicos, facilitando o entendimento da disciplina e ao mesmo tempo motivando os alunos e fomentando o interesse a esta área.",
    "Conclusão": "O aprendizado de Engenharia de Software é desafiador tanto para alunos quanto para professores. O ensino da E.S enfrenta o desafio de levar conceitos teóricos vistos em sala de aula para experiências práticas. Para suprir tal deficiência, podem ser utilizados jogos de apoio ao ensino, com foco em conceitos específicos. Este artigo relata a experiência de uso do jogo SoftGame em sala de aula na Universidade Federal de Santa Catarina, e esta experiência contribuiu para o aprendizado dos alunos, na medida em que eles combinam a tarefa de aprender com o entretenimento proporcionado por um jogo, além de ser uma alternativa viável para atingir esta meta. Este equilíbrio é capaz de motivar os alunos e melhorar o nível de interesse pela disciplina. O jogo desenvolvido, além de focar no conhecimento através de cartas com perguntas e respostas sobre a Engenharia de Software, reforça em estratégias através das cartas Hacker, dados, ampulheta e peões, tornando o jogo mais dinâmico para tentar despertar o interesse do aluno em jogar e, consequentemente, aprender com o jogo. Após as avaliações, podemos considerar ainda mais os jogos como um grande aliado para o aprendizado, agregando conhecimento no processo de aprendizagem, tornando as aulas divertidas e proporcionando ao aluno o aprendizado através da 'brincadeira'."
}