{
    "Autor": "Mayumi Arimura de Melo",
    "Título": "Marcos Legais de Inovação e a Proteção dos Direitos Autorais no Âmbito da Internet",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho trata dos marcos legais de inovação que ocorre nas tecnologias e da proteção dos direitos autorais no âmbito da internet. Foram estudados os conceitos e exemplos de temáticas vivenciadas no cotidiano, aproximando o leitor a uma compreensão mais facilitada. Através do método dedutivo de pesquisa, delimitando-se pela exploração, foi exposta uma análise sobre a origem da computação e o surgimento da internet, bem como sobre a sociedade da informação, verificando assim a inserção das pessoas no ambiente informático. Deste modo, foi possível seguir analisando a conceitualização da inovação, adentrando melhor ao tema, e, posteriormente, fazendo um estudo sobre a propriedade intelectual, vislumbrando, desta forma, o significado do direito autoral, da propriedade industrial e da proteção sui generis. Após estudar esses temas, bem como a participação do direito na informática, foram vistas as leis que norteiam a inovação, neste caso especificamente em conformidade com sua aplicação às tecnologias informáticas, ou seja, Lei da Propriedade Intelectual, Lei do Software, Lei do Direito Autoral, Lei da Inovação, Lei do Bem e Marco Legal da Ciência, Tecnologia e Inovação. Em vista disso, foi dada continuidade com a observação da proteção dos direitos autorais no âmbito da internet, visualizando assim a sanção penal cabível a quem fere esta proteção, os mecanismos que são utilizados para garantir a proteção na internet, como a criptografia, a assinatura digital, a certificação digital, e a marca d’água digital, e as recomendações para que o usuário não fira referida proteção.",
    "Palavras-chave": "Inovação. Direito Autoral. Internet. Tecnologia.",
    "Introdução": "Com o avanço das tecnologias, o surgimento de novos produtos se tornou cada vez mais rápido e presente no cotidiano, fazendo com que a inovação crescesse de forma acelerada. Diversos foram os meios em que essa inovação se propagou, mas um dos que mais chamam a atenção é o ambiente informático, tendo em vista seu uso demasiado e que continua em constante crescimento. Deste modo, a fim de regularizar esta situação, foram criadas leis que delimitam a inovação, bem como sua incidência na informática, para que seja feito seu uso consciente e devidamente equilibrado. Dito isto, é possível perceber que a inovação abarca diversos temas, sendo que para o presente estudo optou-se pela focalização no direito autoral, eis que seu uso ainda possui significativo desconhecimento da população. Assim, diante desta falta de informação, muitas pessoas acabam, por vezes, ferindo os direitos autorais de outrem sem ter consciência de seus atos. Todavia, obviamente, existem aqueles que ferem dolosamente, buscando se beneficiar através da criação de outros indivíduos, que muitas vezes nem sabem que sua obra está sendo feita de refém do uso indevido pelos agentes. As temáticas aqui mencionadas acabam gerando diversas dúvidas, como o que são, afinal, a inovação e o direito autoral? Quais são as leis que envolvem a inovação do ambiente informático? Como é possível proteger os direitos autorais no âmbito da internet? O que se pode fazer para não violar estes direitos? Desta forma, o presente trabalho tem como objetivo esclarecer estes questionamentos por meio de um estudo minucioso sobre os temas. Através do método dedutivo de pesquisa, delimitando-se pela exploração, este trabalho explicará o que são a inovação e a propriedade intelectual, na qual o direito autoral está inserido, bem como as leis que tratam da inovação no ambiente informático e as proteções que podem ser tomadas no caso do direito autoral no âmbito da internet, além de outros temas que envolvem e facilitam a compreensão destes assuntos chaves. Para isto, o presente estudo foi dividido em capítulos, para observar cada ponto especificamente. Desta maneira, iniciou-se vislumbrando a origem da computação, um breve histórico do surgimento da internet no mundo e no Brasil, e uma percepção sobre as pessoas que fazem uso destes meios informáticos, ou seja, a sociedade da informação. Posteriormente, foram analisadas conceitualmente a inovação, assim como a propriedade intelectual, visualizando assim os direitos autorais, a propriedade industrial e a proteção sui generis, finalizando-se com a compreensão do direito na informática.",
    "Conclusão": "A inovação é a criação de novos produtos, serviços ou processos, ou a agregação de novas características ou funcionalidades àqueles, através da introdução de novidade ou aperfeiçoamento no ambiente social e produtivo. Deste modo, é possível perceber que existe a inovação de produto, de processo, de marketing, organizacional e tecnológica. Quando a inovação é aplicada na informática, acaba sendo regida por diversas leis do sistema jurídico brasileiro. A Lei da Propriedade Industrial (Lei n.º 9.279/1996) é aquela que regulamenta os direitos e obrigações referentes à propriedade industrial, que trata da proteção aos sinais distintivos (signos de identificação de produtos, serviços, empresas e estabelecimentos). A Lei do Software (Lei n.º 9.609/1998) dispõe sobre a regulamentação da proteção intelectual nos programas de computadores, bem como sua comercialização e demais providências. Já a Lei do Direito Autoral (Lei n.º 9.610/ 1998) tem como objetivo proteger o criador de uma obra intelectual, garantindo a exposição, disposição e exploração econômica da sua obra. A Lei da Inovação (Lei n.º 10.973/2004) diz respeito ao estabelecimento de medidas de incentivo à inovação e à pesquisa científica e tecnológica no ambiente produtivo para que ocorra a capacitação tecnológica. Com relação à Lei do Bem (Lei n.º 11.196/2005), a mesma tem o objetivo de conceder incentivos fiscais para as empresas que realizam pesquisa e desenvolvimento de inovação tecnológica. A última lei vislumbrada foi o Marco Legal da Ciência, Tecnologia e Inovação (Lei n.º 13.243/2016), que delibera acerca dos estímulos à pesquisa, à inovação, à capacitação científica e ao desenvolvimento científico, modificando assim diversos diplomas legais relacionados a estes temas. Após o estudo da legislação que se refere à aplicação da inovação no ambiente informático foi verificada a proteção dos direitos autorais no âmbito da internet, observando primeiramente o art. 184 do Código Penal Brasileiro, que delimita as penas cabíveis no caso de violação destes direitos. Ainda, foram verificados os mecanismos utilizados na internet para proteção dos direitos supracitados, ou seja, criptografia, assinatura digital, certificado digital e marca d’água digital. A criptografia é utilizada para transformar um texto claro em um texto cifrado, fazendo uso de um sistema computacional que implementa uma cifra. Existem dois tipos de criptografia, a simétrica e a assimétrica. A primeira diz respeito a quando a cifragem e a decifragem são realizadas por meio do uso da mesma chave. Já a segunda, também conhecida como “criptografia de chave pública” é aquela que utiliza um par de chaves (uma pública e uma privada) para realizar suas operações. A assinatura digital é o resultado de uma operação matemática que utiliza algoritmos de criptografia assimétrica para analisar, de forma segura, a origem e a integridade do documento que é analisado. A certificação digital associa uma entidade ou pessoa a uma chave pública mediante documento eletrônico assinado digitalmente. Deste modo, traz dados de forma mais completa, apresentando o nome da pessoa ou entidade associada, período de validade do certificado, chave pública utilizada, assinatura e nome da entidade que assinou o certificado, assim como o número de série. O último mecanismo analisado foi a marca d’água digital, que é o ato de omitir uma mensagem dentro de um sinal digital (como uma imagem ou um vídeo), fazendo, deste modo, um relacionamento com o conteúdo atual deste sinal. Por fim, foram destacadas algumas recomendações que podem ser realizadas a fim de evitar a violação dos direitos autorais no âmbito da internet, tais como: inserção de marcas d’água digitais, bloqueio de documentos PDF, utilização de alguns tipos de serviço específicos, pedir autorização ao autor da obra, entre outros."
}