{
    "Autor": "Henrique de Quevedo Franco",
    "Título": "PROPOSTA DE DESENVOLVIMENTO DE SOFTWARE PARA GESTÃO DA BATERIA UNIVERSITÁRIA DA UFSC - BATERAAACA",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Vinicius Faria Culmant Ramos",
    "Coorientador(a)": "Tatiana Nilson dos Santos",
    "Resumo": "Este trabalho tem como objetivo analisar e desenvolver um software que seja capaz de gerenciar o fluxo de uma Bateria Universitária, no qual há a necessidade de ter informações seguras e centralizadas, além do acesso por todos os membros ser imprescindível. Este trabalho traz uma proposta de software para a gestão da bateria universitária da UFSC – BaterAAACA. Para atingir esse objetivo, o trabalho foi divido entre as etapas de: levantamento da bibliografia e trabalhos relacionados. Foi utilizado a metodologia de desenvolvimento de software em cascata que consiste em análise, implementação, testes, implantação e manutenção, e por fim, foi decidido desenvolver para um ambiente web, utilizando Php como linguagem de programação, a arquitetura de projeto MVC (Model, View, Controller), banco de dados MySQL, além de linguagem de HTML, CSS e JavaScript. O sistema tem como função oferecer uma interface amigável para que o usuário possa ter acesso a avisos e compromissos com a bateria, que possa fazer pesquisas e inserir informações de maneira fácil, rápida, estável e confiável. Procurou, através dos procedimentos e das rotinas diárias, a melhor maneira para desenvolver uma solução específica para baterias universitárias, que pudesse auxiliar no dia a dia, bem como nas tomadas de decisões dentro da mesma. Como resultado, foi entregue uma ferramenta digital capaz de gerir por completo as atividades de gestão da BaterAAACA, atender as necessidades do dia a dia. Os trabalhos futuros são para implantação do sistema na BaterAAACA e testes com usuários finais, integração do sistema com um Blog e com um aplicativo para o controle de presença em ensaio, e por fim consumir uma API de notificações para melhorar a comunicação de novos eventos com os ritmistas.",
    "Palavras-chave": [
        "Bateria",
        "Software",
        "Gestão",
        "Web",
        "Php"
    ],
    "Introdução": "É comum hoje em dia percebermos que as tecnologias estão quase sempre presentes no nosso cotidiano, e cada vez mais tarefas, desde ler notícias até o pagamento de contas, podem ser realizadas utilizando apenas um dispositivo com conexão à Internet. Os softwares são ferramentas que estão sempre em constante evolução, buscando atender as mais diversas necessidades. Neste contexto, e com o mercado cada vez mais competitivo, faz-se necessária a implantação do maior número possível de práticas para elevarem a produtividade e buscar uma maior otimização dos processos, para que as tarefas sejam realizadas de maneiras cada vez mais simples e informatizadas, ou seja, de modo que seja exigido o menor esforço possível por parte das pessoas. Na Universidade Federal de Santa Catarina Campus Araranguá, cada vez mais os alunos procuram projetos extraclasses durante a graduação, seja como hobbies ou para complementar o aprendizado. Na UFSC, contamos com vários projetos complementares, como laboratórios, monitorias, atlética, cheerleading e também a bateria universitária. Esta última nasceu com o intuito de acompanhar a atlética do campus (AAACA) durante os campeonatos como forma de torcida, mas com o tempo, o samba dos momentos de torcida passou por diversas transformações e por um forte aprimoramento técnico desde sua origem. Assim, nos últimos anos, pode ser escutado também em competições próprias de baterias e apresentações em contextos externos à universidade. Deste modo, a Bateria Universitária da Associação Atlética Acadêmica Campus Araranguá (BaterAAACA) é responsável pela seleção, montagem e manutenção dos membros, agendamento de ensaio e treino com músicos especialistas de cada modalidade, inscrição em campeonatos de baterias universitárias (BU’s) e ações sociais. E todas essas tarefas, hoje em dia, são geridas de maneira manual ou por meio de planilhas eletrônicas, deixando os dados descentralizados e pouco confiáveis. O objetivo deste trabalho é o desenvolvimento de um sistema da informação para a gestão do projeto da bateria universitária. Em vista disso, busca-se um ganho significativo na manutenção e eficácia dos processos, do controle interno das rotinas, permitindo que as informações fiquem centralizadas e seguras, auxiliando para que o presidente e a diretoria tenham conhecimento de quem realmente está se dedicando, informações do caixa, do património, da agenda, entre outros. Este sistema visa trabalhar de forma autônoma para que a diretoria e os restantes dos ritmistas tenham mais tempo para se dedicar às melhorias técnicas e musicais da bateria, e também detenham mais tempo livre para se dedicarem a seus cursos de graduação e outras tarefas da universidade e cada vez menos tenham que se preocupar com o controle administrativo, sabendo que terão toda a informação estará segura e centralizada em um sistema desenvolvido para as suas necessidades.",
    "Conclusão": "Este projeto teve como seu objetivo principal desenvolver um software que elimine o uso de interfaces manuais e pessoais das informações, criando padrões dentro da BaterAAACA. Portanto, visou-se suprir as necessidades da organização, principalmente, em relação as suas atividades e seus membros, por meio de cadastros de todos seus dados no sistema, mantendo atualizado e salvo todas as informações necessárias para a gestão. De acordo com o que foi levantado em entrevistas com os membros da bateria em relação aos seus processos e rotinas, juntamente com o conhecimento adquirido durante o curso de Tecnologia da Informação e Comunicação e o conhecimento em experiências vivenciadas no mercado de trabalho, o desenvolvimento de uma versão inicial do projeto pode ser dada como concluída com sucesso. As disciplinas de engenharia de software, linguagens de programação, banco de dados, empreendedorismo, entre outras que foram estudadas durante a graduação foram essenciais para o desenvolvimento do projeto, juntamente com o auxílio dos professores durante o processo de realização do trabalho de conclusão de curso. Alinhado a tudo o que já foi citado anteriormente, o estudo feito para a elaboração do referencial teórico complementou conceitos vistos durante a graduação e como eles devem ser implementados em um projeto de software. Este projeto deu a oportunidade de explorar outras áreas e obter mais conhecimento de como facilitar a gestão de um projeto que já está em andamento. Também traz a experiência de aprender uma linguagem que é uma das mais cobiçadas no mercado de trabalho, ainda agregando a experiência de tela aplicada em um projeto e conhecido as dificuldades e imprevistos em que o trabalho nesta linguagem pode trazer, aumentando a visibilidade no mercado e o conhecimento obtido, este último que é um meio indestrutível para qualquer ser humano."
}