{
    "Autor": "Maria Aparecida Jeremias",
    "Título": "ESTUDO SOBRE APLICATIVOS PARA AUXILIAR CRIANÇAS COM AUTISMO NAS TAREFAS DO COTIDIANO",
    "Ano de publicação": 2020,
    "Local de publicação": "Araranguá SC",
    "Orientador(a)": "Prof ª Drª Eliane Pozzebon",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho apresenta um estudo com uma análise comparativa de cinco aplicativos existentes no mercado, essas ferramentas têm como principal objetivo auxiliar no processo de desenvolvimento das crianças com autismo e com o intuito de que esses aplicativos possam colaborar em suas tarefas do cotidiano. A metodologia foi uma pesquisa aplicada com propósito de identificar as características dos aplicativos. Durante a pesquisa foram abordadas dez características e apresentadas os gráficos para cada aplicativo estudado. Também se analisou os métodos tradicionais de educação para autista e foi elaborada uma tabela de comparação entre os aplicativos com esses métodos e obteve-se um resultado demonstrando que as crianças autistas têm interesse pelos aplicativos. Na utilização dos aplicativos foi confirmado que o resultado é satisfatório e que os aplicativos realmente fazem a diferença no cotidiano dessas crianças.",
    "Palavras-chave": "Autismo, Tecnologias Educacionais, Aplicativos.",
    "Introdução": "De acordo com estudos publicados, há duas vertentes que descrevem o termo autismo. Uma delas foi no ano de 1943, descrita pelo psiquiatra norte-americano Leo Kanner, como sendo um distúrbio de contato afetivo (ASSUMPCAO JR; PIMENTEL, 2000), que, em diagnóstico realizado em crianças, estas apresentavam “incapacidade de se relacionar com outras pessoas, severos distúrbios de linguagem e uma preocupação obsessiva pelo que é imutável.” (BOSA, 2000). Na época, Kanner relacionou o autismo a “fenômenos esquizofrênicos” (ALVES et al., 2010). A outra foi em 1944, por Hans Asperger, da Áustria, que escreveu sobre os sintomas de autismo de modo muito semelhante à descrição de Kanner (MELLO et al., 2005). Contudo, esses precursores não se conheciam. ALVES et al. (2010) destacam que, em 1949, Kanner, após algumas observações e reflexões a partir de estudos de casos clínicos, denominou de autismo infantil precoce, o qual caracterizou o transtorno como uma dificuldade profunda no contato com as pessoas, um desejo obsessivo de preservar as coisas e as situações, uma ligação especial aos objetos e a presença de uma fisionomia inteligente, além das alterações de linguagem que se estendiam do mutismo a uma linguagem sem função comunicacional, revelando inversão pronominal, neologismos e metáforas. As tecnologias evoluíram e contribuem para melhorar a vida de um indivíduo com Transtorno Espectro Autista (TEA). Neste trabalho será realizada uma pesquisa dos aplicativos existentes no mercado. Depois serão classificados cinco aplicativos para testar a usabilidade. O objetivo geral deste trabalho é analisar os aplicativos existentes no mercado para dispositivos móveis que possam auxiliar crianças com autismo nas tarefas do seu dia a dia. Os aplicativos para crianças com autismo leve e moderado. A presente pesquisa se justifica pelo desejo de saber como estão sendo utilizados esses aplicativos e quais as suas dificuldades aparentes. Neste contexto, vão ser pesquisados vários tipos de aplicativos e no final vão ser testados cinco aplicativos para verificar suas funcionalidades. Os dispositivos móveis são capazes de exercer grande atratividade sobre indivíduos com TEA. Segundo Krause (2016), os autistas têm especial interesse em interagir com dispositivos como smartphones e tablets porque parte da hipótese de que estas tecnologias podem ser utilizadas para se encontrar estratégias no sentido de superar as dificuldades sofridas por pessoas com TEA, ajudando-as em sua inclusão e afirmação como indivíduos na sociedade. O tema autismo vem sendo discutido no contexto social e educacional por se tratar de uma síndrome que possui características que podem variar de criança para criança. Um fator importante é que sua ocorrência acontece independente da classe social, raça ou etnia, sendo que a maioria dos casos está associada à deficiência mental. Outro fator é que a incidência desta síndrome é maior em meninos do que meninas e observa-se que as crianças com autismo, aos 3 anos de vida, apresentam dificuldades nas suas atividades cotidianas de relacionamento e interação com as pessoas, especialmente as mais próximas.",
    "Conclusão": "Neste trabalho foi realizada uma investigação com um estudo de cinco aplicativos já existentes no mercado que possam contribuir de uma forma positiva na vida de crianças autistas e auxiliando nas suas tarefas do cotidiano, no primeiro momento foram testados os cinco aplicativos com crianças autistas. Também foi feito um teste de usabilidades onde foram respondidas 10 perguntas sobre a usabilidades dos aplicativos e a diferenças entre eles, foram feitos gráficos comparativos onde se compara suas usabilidades e foi feito uma tabela comparativa com o ensino tradicional já ensinado para autista. No teste com aplicativo em tabletes observou-se o interesse da crianças autistas pelos aplicativos e notou-se a vontade de concluir cada tarefa que aparecia na tela dos tabletes, já nas dez perguntas respondidas nota-se uma vasta diferenças entre os aplicativos, pois nos testes de usabilidades foram percebidas diferenças entre um aplicativo e outro e isso pode fazer a diferença no processo de aprendizado do mesmo. A tecnologia quando utilizada como uma ferramenta educativa que auxilia na metodologia de ensino usada por autista, famílias e professores o objetivo é trazer somente mudanças positivas para os autistas. Tendo em vista os aspectos observados conclui-se que as tecnologias são muito importantes na vida de uma criança autista pois auxilia no seu cognitivo como um método transformador na vida das crianças autistas. Como trabalho futuro poderão ser avaliados outros aplicativos e com mais crianças."
}