{
    "Autor": "Érica de Souza Pires",
    "Título": "Análise do uso da plataforma KnowBe4 para conscientização da segurança da informação em uma instituição financeira: um estudo de caso",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Paulo César Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "A presente pesquisa tem por objetivo analisar a eficácia da plataforma KnowBe4 para promover a conscientização da segurança da informação aos colaboradores de uma Cooperativa de Crédito. No atual cenário, as instituições financeiras enfrentam constantemente ameaças de ataques cibernéticos, phishing, malware e engenharia social, para tanto, os colaboradores precisam estar preparados para se protegerem e proteger a instituição. Quanto à metodologia, a pesquisa caracteriza-se como qualitativa, descritiva, sendo desenvolvida por meio de um estudo de caso. A coleta de dados foi realizada por meio de um questionário. Os resultados obtidos revelaram que a avaliação da ferramenta pelos próprios colaboradores foi muito positiva, demonstrando que é uma boa forma de compartilhar conhecimento e mudar comportamentos usando uma ferramenta de treinamento. Observou-se também as atitudes que os colaboradores seguiam a respeito das normas de Segurança da Informação, a maior parte mostrou seguir corretamente, entretanto uma pequena parcela não seguiu de forma rigorosa. A conscientização da Segurança da Informação deve ser contínua, e com o uso de ferramentas que enfatizem e tornem mais engajado para proteger seus ativos digitais e mitigar os riscos associados às ameaças cibernéticas.",
    "Palavras-chave": "KnowBe4; segurança da informação; conscientização.",
    "Introdução": "Levando em consideração o atual cenário das instituições financeiras em relação ao uso de dados e o cuidado com a proteção de ativos de informação partindo primeiramente dos seus colaboradores, esse estudo tem por motivação os elevados índices de golpes e ataques de engenheiros sociais a instituições financeiras que tem por intuito coletar informações e dados confidenciais para práticas de crimes. Um levantamento feito pela (FEBRABAN,2021), percebeu um aumento significativo de 165% nos ataques de engenharia social no primeiro semestre de 2021, em comparação ao segundo semestre de 2020. São identificados uma sequência de riscos que a instituição pode sofrer caso seus colaboradores não estejam bem instruídos sobre os procedimentos para assegurar o uso e manuseio correto dos dados e informações da empresa e de seus clientes. Alguns deles são: vazamento de informações sensíveis, perda de dados, ataques cibernéticos, prejuízos financeiros, reputação negativa na credibilidade e imagem da empresa e até mesmo multas e sanções judiciais. Neste contexto, o uso de plataformas de conscientização da segurança da informação se torna uma estratégia muito bem avaliada e eficaz para melhorar a cultura sobre esse assunto entre colaboradores de uma instituição bancária. Neste tipo de plataforma, são oferecidos treinamentos, teste de conhecimento, simuladores de ataques de phishing, entre outras funções, que ajudam os colaboradores a compreenderem a importância de adotarem boas práticas em seu dia a dia e também auxiliar a equipe de TI da empresa a avaliar, monitorar e impulsionar os conhecimentos dos funcionários a partir da ferramenta. Portanto, este trabalho tem como objetivo investigar os benefícios do uso da plataforma KnowBe4 de conscientização em segurança da informação para os colaboradores de uma instituição financeira. Serão avaliados aspectos como a eficácia da plataforma na melhoria da cultura de proteção de dados, a satisfação dos colaboradores com o treinamento oferecido e propor recomendações para utilizar essas ferramentas de forma que estimule o usuário a pôr em prática seus aprendizados. Pergunta da pesquisa: O uso da ferramenta KnowBe4 contribui para a conscientização dos colaboradores sobre segurança da informação em uma instituição financeira? Espera-se que os resultados deste estudo contribuam para a compreensão dos benefícios das plataformas de conscientização para as instituições financeiras e incentivem a adoção dessas plataformas como uma estratégia para melhorar a segurança da informação e proteger os dados sensíveis dos clientes.",
    "Conclusão": "O objetivo desta pesquisa, foi analisar a efetividade do uso da plataforma KnowBe4 em uma Cooperativa de Crédito situada no sul de Santa Catarina. Observou-se a avaliação dos usuários sobre os conhecimentos adquiridos, a didática apresentada e juntamente uma análise das atitudes dos colaboradores sobre situações que envolviam cuidado e manuseio de ativos de informação. Podendo-se afirmar que o propósito foi atingido por meio dos objetivos, coleta de dados e metodologia aplicada. Primeiramente, foram apresentados alguns elementos que compõem o 'universo' da segurança da informação, como conceitos, leis e normas, além de abordar as principais ameaças e a relevância significativa de possuir colaboradores bem conscientes sobre o tema. Depois, foi abordado a plataforma KnowBe4, sua origem, estratégias de conquista do usuário para aumento da efetividade e continuação dos treinamentos, uso de relatórios e indicadores para melhor gestão dos riscos da empresa. Desta maneira, foi apresentado que as empresas precisam se adaptar à nova era da informação e inovação, e também com seus pontos positivos e negativos. E precisam saber preparar seus colaboradores para que não sejam mais vistos como o elo fraco da organização e sim elementos cruciais na proteção contra ameaças. Com o diagnóstico da pesquisa com os usuários, foi possível constatar que a maioria dos colaboradores adotaram hábitos corretos sobre segurança de forma mais confiante após os treinamentos da KnowBe4, entretanto é visto que ainda há pontos a serem melhorados e que a conscientização deve ser um processo contínuo. Alguns pontos a serem melhorados se referem ao compartilhamento e utilização de senha de terceiros, anotações de senhas em locais inadequados, repasse de informações por telefone e falta de bloqueio da área de trabalho ao se ausentar da frente do computador. Essas ações tiveram percentuais pequenos de funcionários com atitudes erradas, mas com apenas um clique ou uma informação repassada sem segurança pode gerar inúmeras consequências. Quanto às limitações da pesquisa, reforça-se a necessidade de mais estudos sobre a problematicidade das ações de colaboradores mal informados sobre a segurança da informação e as atitudes certas no dia a dia e sobre o impacto que isso pode gerar no ponto de vista não somente de instituições financeiras, mas também de qualquer tipo de empresa. Todos os segmentos do mercado fazem uso de informações, dados de funcionários, de clientes, produtos e de serviços e todos têm a necessidade de serem bem assegurados. Sugere-se então, com base nessa pesquisa, que sejam aplicados estudos de forma comparativa entre outras plataformas de treinamento sobre segurança da informação disponíveis no mercado, visando identificar qual delas oferece os melhores recursos e resultados para a conscientização dos colaboradores sobre segurança da informação em instituições financeiras ou, até mesmo, em organizações de outros segmentos."
}