{
    "Autor": "Guilherme Paraol de Matos",
    "Título": "FUNDAÇÃO DE AMPARO À PESQUISA E INOVAÇÃO DE SANTA CATARINA (FAPESC) COMO AGENTE DE FOMENTO DO SISTEMA REGIONAL DE CIÊNCIA TECNOLOGIA E INOVAÇÃO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leites Esteves",
    "Coorientador(a)": null,
    "Resumo": "O objetivo do presente trabalho é apresentar a Fundação de Amparo à Pesquisa de Santa Catarina (FAPESC), buscando analisar sua atuação como agente de estruturação do Sistema Regional de Inovação. Os conceitos apresentados são referentes à importância da inovação para o crescimento econômico nacional; ao desenvolvimento científico e tecnológico; ao Sistema de Inovação Nacional e os Sistemas Regionais de Inovação. Assim como a função do poder público em apoiar a CT&I por meio de seus mecanismos de descentralização. Nesse entendimento, entram as FAPS como agentes fomentadoras nos estados brasileiros e as instituições que compõe o Sistema Regional de Inovação no estado catarinense. Então, o trabalho ressalta a história da Fundação em forma de uma linha do tempo. Desde o início do apoio à Ciência e Tecnologia, em Santa Catarina, na década de 80. São explanadas as principais características da Fundação. Ressalta-se a importância que os parceiros da FAPESC possuem para que ela possa operar com recursos expressivos, como a FINEP, CNPq CAPES, e Ministério da Saúde por meio da Secretária de Ciência, Tecnologia e Insumos Estratégicos (SCTIE), que contribuem para o repasse de recursos. Os recursos não reembolsáveis para CT&I são apoiados por meio de editais, eventos e concessões de bolsas. Também são apresentados dados de seu orçamento referentes aos anos de 2012 e 2013, que foram repassados para programas, projetos eventos e afins. A metodologia utilizada nesta pesquisa foi bibliográfica, documental e qualitativa. Conclui-se que a FAPESC é uma das FAPs mais atuantes dentre as 27 existentes. Porque este setor corresponde como principal meio de repasse de dinheiro público para Ciência Tecnologia e Inovação no estado. Isso fica evidente quando analisamos seu orçamento total que chegou a quase 60 milhões de reais no ano de 2012 e superou esse valor em 2013.",
    "Palavras-chave": "FAPESC. Inovação. Tecnologia.",
    "Introdução": "A economia nacional vive um momento importante de desenvolvimento e expansão, buscando competitividade e visibilidade no cenário mundial. Nesse processo entra o papel da inovação para elevar o crescimento econômico das empresas, e principalmente desenvolver o crescimento cientifico e tecnológico. Assim, governo e empresas direcionam cada vez mais seus esforços e recursos para apoiar a inovação internamente e buscar posição de destaque no mercado. A inovação dentro de uma empresa ou instituição faz com que haja um crescimento diferencial e potencial dessas instituições em relação aos seus concorrentes e ao mercado, fazendo respectivamente a economia nacional crescer e se fortificar, por meio de uma maior competitividade entre suas industrias. Segundo Schumpeter (1942), a inovação ocasiona um impulso interno no capitalismo sendo transformador economicamente, gerando desenvolvimento, o capitalismo é renovado, sendo a inovação o gerador da economia. Segundo ele: O impulso fundamental que inicia e mantém o movimento da máquina capitalista decorre dos novos bens de consumo, novos mercados, métodos de produção ou transporte, formas de organização industrial, que a empresa capitalista cria. (SCHUMPETER, 1942, APUD SANTOS, 2010, p.17). Segundo economista Joseph Alois Schumpeter (1883-1950) apud Santos (2010), a expansão econômica é responsável pelo crescimento que não pode ser explicado pelo crescimento do capital e do trabalho. Uma economia normal e saudável não é a que está em equilíbrio, mas a que está constantemente sendo 'rompida' por inovações tecnológicas. Longos períodos de crescimento encerram-se quando a tecnologia está madura e o retorno dos investidores declina. Segundo glossário da FINEP (Financiadora de Estudos e Projetos) (2012), a inovação de produtos e processos tecnológicos (PPT), compreende as implantações de produtos e processos tecnologicamente novos e substanciais melhorias tecnológicas em produtos e processos. Uma inovação PPT é considerada implantada se tiver sido introduzida no mercado (inovação de produto) ou usada no processo de produção (inovação de processo). Esse tipo de inovação envolve uma série de atividades científicas, tecnológicas, organizacionais, financeiras e comerciais. Uma empresa inovadora em Produtos e Processos Tecnológicos, é uma empresa que tenha implantado produtos ou processos tecnologicamente novos ou com substancial tecnologia durante o período em análise. A exigência mínima é que o produto ou processo deve ser novo (ou substancialmente melhorado) para a empresa (não precisa ser novo no mundo). Estão incluídas inovações relacionadas com atividades primárias e secundárias, bem como inovações de processos em atividades similares. É importante conhecer aspectos gerais relevantes sobre como saber e implantar uma inovação, preparando-se melhor para lidar com essas políticas dentro de empresas e instituições. Há muito interesse para que a inovação seja cada vez mais crescente no país, e esse interesse parte principalmente do poder público. É ele que cada vez mais está apoiando a pesquisa em Ciência, Tecnologia e Inovação (CT&I), porque isso influência fortemente no crescimento da economia de uma nação e a sua capacidade de criar e inovar é elemento chave para o seu desenvolvimento. Pode-se então, destacar o papel da inovação como sendo de suma importância estrategicamente para o crescimento econômico. Inovar é preciso e segundo Ieis (2013) uma das autoras do artigo Sistema Nacional de Ciência, Tecnologia e Inovação no Brasil: o Resultado da Cooperação nas Empresas Privadas e Estatais a partir de 2000, revela que empresas públicas inovam cerca de 66% a mais que as privadas, sendo assim pode-se notar um interesse expressivo do poder público em incentivar e alavancar esse processo nas estatais, e apoiando a inovação nas empresas privadas. Vê-se como é importante o papel de inovação para o desenvolvimento econômico nacional, por isso, existem os sistemas de inovação, que buscam integrar instituições de diferentes características que agindo sinergicamente contribuem para que esse processo de inovação seja alcançado de forma a trazer contribuições para a comunidade, assim como para empresas privadas e estatais, fomentando o desenvolvimento nacional. O Brasil, como um país de grande extensão territorial, e com regiões bem peculiares e distintas quanto a cultura, economia e desenvolvimento, faz com que haja sistemas de inovação diversificados , formando os Sistemas Regionais de Inovação com características próprias derivadas da natureza das suas economias e sociedades com forte conotação regional. Segundo Cooke (1992) apud Junior (2012), o conceito de Sistema Regional de Inovação, determina uma série de políticas regionais que alavanquem a inovação e a competitividade econômica e social regional. Esta pesquisa então visa contemplar com uma visão mais detalhada umas das fundações públicas que formam o Sistema Regional de Inovação (SRI) de Santa Catarina, que dá apoio à pesquisa e inovação, ligada ao poder público estadual, chamada Fundação de Amparo à Pesquisa e Inovação do Estado de Santa Catarina (FAPESC). Detalhando sua história ao longo do tempo, pode-se esboçar o seu apoio às empresas e instituições que participam de seus programas, assim como conhecer o início do fomento à CT&I no estado catarinense, mostrando as formas de apoio e seu papel no Sistema Regional de Inovação. Neste cenário apresentado tem-se a seguinte indagação: como acontece a política de apoio à CT&I no estado de Santa Catarina realizado pela FAPESC e como seus recursos fomentam a pesquisa e inovação na área de tecnologia pelas regiões do estado?",
    "Conclusão": "Como visto, a FAPESC é uma fundação pública estadual, que faz parte do Sistema Regional de Inovação de Santa Catarina, que compõe o Sistema Nacional Brasileiro juntamente com outros órgãos e demais FAPS, contribuindo para o processo de descentralização do fomento à pesquisa e inovação no país. Cabe destacar seu papel no cenário regional e a autonomia do estado em dirigi-la, sendo esta sem fins lucrativos, com patrimônio próprio, personalidade jurídica de direito privado e dotada de autonomia administrativa. A pesquisa possibilitou descrever sua história iniciada com o apoio público à C&T e pesquisa no estado na década de 80, dentro do movimento que levou à criação da rede de fundações de amparo à pesquisa no país. O modelo das FAPs teve inspiração no trabalho desenvolvido pela FAPESP fundação do estado de São Paulo criada no ano de 1962. Merece destaque a estruturação e consolidação do CONFAP criado em 2006 para articular a ação das FAPs e que hoje reúne 27 Fundações. A pesquisa mostrou ser de grande relevância a ação do Sistema Regional de Inovação no desenvolvimento descentralizado de apoio à CT&I, contribuindo para a diminuição da desigualdade regional em um país de grande extensão territorial e realidades ambientais e sócio econômicas muito distintas. O papel das FAPS, nesse contexto, é de suma importância pois elas dão capilaridade à CT&I, aproximando e adequando as políticas nacionais às demandas locais. Cabe ressaltar as parcerias da FAPESC como importantes para a consolidação de um fundo estável e concreto para realização das atividades de apoio a CT&I em Santa Catarina. Nesse aspecto, merece citação em especial a FINEP, por meio dos Fundos Setoriais, CNPq e CAPES, assim como também, o apoio de fundos oriundos de recursos próprios do estado, garantidos por meio da Constituição Estadual. Pesquisa e inovação correspondem ao foco principal do governo para o desenvolvimento econômico do país. Ele procura a redução da defasagem de CT&I frente aos países desenvolvidos, o crescimento sustentável com desenvolvimento de produtos e serviços de alto valor agregado, não apenas de commodities. Para isso fomenta a P&D, principalmente a inovação, fatores críticos para que o Brasil se desenvolva tecnologicamente, de maneira sustentável e consiga competir com os países avançados em relação a CT&I. Assim a FAPESC é um importante agente ativo governamental desse processo. É possível notar seu papel no desenvolvimento econômico e científico do estado catarinense, sua função de destaque para o fomento à pesquisa, inovação e formação e capacitação de recursos humanos. Além de uma articulação entre empresas e estado, o apoio ao crescimento econômico de modo sustentável, respeitando áreas prioritárias definidas pelo MCTI e investimento em projetos individuais. Como visto a FAPESC vem aumentando sua contribuição para CT&I em Santa Catarina, se constituindo em uma instituição única para esse tipo de apoio no estado, permitindo investimentos consideráveis que alavancam a economia e o conhecimento do estado. No ano de 2012 o montante total chegou quase aos 60 milhões de reais, enquanto que em 2013 esse valor foi superado, chegando a quase 63 milhões de reais. A pesquisa informou e dimensionou o papel da FAPESC como uma Fundação de suma importância para a inovação estadual, conhecendo o que ela representa para o estado de Santa Catarina num período onde o governo federal procura fortalecer o SNI, o apoio à infraestrutura da CT&I, a formação de pessoas capacitadas para elevarem o patamar do país, para que o Brasil possa a vir futuramente a ser uma referência e uma potência econômica baseada em CT&I. A FAPESC, tem papel de destaque para descentralizar e apoiar a elevação de conhecimento, apoiar a pesquisa e inovação e fortalecer o Sistema Regional de Inovação de Santa Catarina. Sendo assim, os objetivos deste trabalho foram alcançados, sendo representada na pesquisa a estruturação do SRI, o histórico e formação da CT&I catarinense e da FAPESC, a importância que ela possui como fomentadora da CT&I no estado e sua forma de atuação. Porém, não foi possível responder a pergunta de pesquisa no que se refere a distribui ção de seus recursos pelo estado, assim não se pode analisar se ela cumpre esse papel conforme sua legislação. Fica a importância da pesquisa, também pelo fato de não ser encontrado em nenhum portal de periódicos e artigos, trabalhos estruturados desta forma sobre o tema. Por fim, fica a relevância de realização de um estudo futuro sobre a FAPESC, a partir de uma pesquisa com os principais idealizadores e formadores da fundação para que se tenha uma visão mais completa sobre a sua operacionalização, visão de futuro e impacto que ela proporciona para o estado catarinense."
}