{
    "Autor": "Katrine de Melo",
    "Título": "UM ESTUDO VOLTADO À TRANSPARÊNCIA PÚBLICA ATRAVÉS DA ANÁLISE DE DADOS ABERTOS BRASILEIROS",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Alexandre Leopoldo Gonçalves",
    "Coorientador(a)": null,
    "Resumo": "Atualmente, as tecnologias têm desempenhado um papel importante no desenvolvimento da sociedade. Essas tecnologias vêm sendo incorporadas nas organizações para auxiliar os gestores nos processos decisórios. A administração pública tem recebido grandes contribuições dessas tecnologias, fortalecendo o conceito de governo eletrônico, que consiste no uso de sistemas que armazenam e disponibilizam dados a fim de promover a transparência pública. Todavia, a disponibilização desses dados nem sempre ocorre de forma apropriada, padronizada e de fácil acesso. Muitas vezes são disponibilizados pelas instituições públicas de maneira que dificultam tanto o acesso quanto o entendimento, não atendendo as finalidades esperadas. Este trabalho buscou identificar nos portais brasileiros como os dados estão sendo disponibilizados. Após isso foram obtidos conjuntos de dados em formato aberto e padronizado com o intuito de promover uma análise sobre os mesmos. Para tal, utilizou-se uma ferramenta de Inteligência de Negócios (Business Intelligence). Foi também necessário o estabelecimento de um fluxo de atividades que permitiu coletar e armazenar alguns conjuntos de dados, bem como, a extração e análise de informações relevantes. Assim, este trabalho analisou dados de quatro cenários educacionais, sendo eles PROUNI, PRONATEC, ENEM e PNAE. A partir disto, foi possível verificar a importância da utilização dos dados abertos voltados à promoção da transparência pública. Mediante a análise de gráficos e tabelas foram exploradas as interconexões com outros fatores que justificaram as informações apresentadas. Por fim, conclui-se que os dados disponibilizados atualmente nem sempre são adequados para a reutilização ou de fácil acesso para a sociedade. Por outro lado, uma vez que se tenha integrado os dados abertos, a utilização de ferramentas de Inteligência de Negócios pode prover meios que permitam impactar positivamente nos processos de tomada de decisão.",
    "Palavras-chave": [
        "Transparência Pública",
        "Inteligência de Negócios",
        "Dados Abertos",
        "Análise de Dados"
    ],
    "Introdução": "Com o passar dos anos, as Tecnologias da Informação e Comunicação (TIC) estão se tornando cada vez mais importante no dia a dia das pessoas. A evolução tecnológica vem permitindo às pessoas terem acesso a dados e informações através de sistemas de governo eletrônico, e mesmo, através de dados abertos. A partir deste contexto se faz necessário o uso de tecnologias que possibilitem a utilização dessas informações, que são de grande importância para os cidadãos. A transparência pública tem conquistado relevância na gestão pública, pois propicia aos cidadãos acesso às ações governamentais, possibilitando a contribuição para o fortalecimento da democracia através de uma administração pública transparente (ORIGLIA et al., 2016). Segundo Prado (2004), o conceito da transparência está relacionado ao compartilhamento de informações, tornando as pessoas mais capacitadas a fazerem suas próprias escolhas. Com a prática da transparência pública surge o conceito de Governo Eletrônico, caracterizado pela transparência na gestão pública e pela motivação de reforma dos estados, bem como, viabilizado através do surgimento de novas tecnologias que possibilitaram o desenvolvimento de sistemas de informações mais abrangentes (PRADO, 2004). Para Brito et al. (2014) as Tecnologias Web podem ser consideradas um fator promissor para o desenvolvimento da transparência, pois fornece uma forma rápida, interativa, de fácil acesso e reutilização das informações (ORIGLIA et al., 2016). Algumas iniciativas já foram lançadas baseadas neste conceito, e através de portais de dados abertos os dados são disponibilizados. Os Estados Unidos da América (EUA), por exemplo, em fevereiro de 2014 já havia publicado 88.372 conjuntos de dados em seu portal www.data.gov, assim, como o Reino Unido, na mesma data lançava seu portal data.gov.uk, e disponibilizava 13.274 conjuntos de dados. O Brasil por sua vez, também já havia disponibilizado seu portal dados.gov.br com 187 conjuntos disponíveis (BRITO et al, 2014). Composto pela administração eletrônica e os serviços eletrônicos, o Governo Eletrônico utiliza na administração eletrônica as tecnologias para criar um repositório de dados e armazenar os serviços realizados em sistemas de gerenciamento. Já os serviços eletrônicos representam o fornecimento de serviços públicos online (MELLO, SLOMSKI, 2010). De acordo com a LEI nº 12.527/11, é obrigatória a disponibilização de dados em formato aberto, em linguagem compreensível, para todas as pessoas acessarem e utilizarem tais dados (BRASIL, 2011). Os dados abertos são compreendidos como a disponibilização das informações para qualquer pessoa sem restrição de acesso, ou uso desta, devendo ser disponibilizado em formato padronizado para que a análise e o entendimento sejam facilitados (LINARDI, 2013). De maneira geral, os sites de órgãos e entidades públicas possuem um espaço voltado à transparência com o intuito de demonstrar as execuções orçamentárias da administração, licitações e contratos de aquisições realizadas, as receitas obtidas, entre outras ações praticadas com recursos públicos. Alguns portais como o OSB – Observatório Social do Brasil e o Meu Município, já utilizam essa política de dados abertos. Buscam através da transparência pública, acompanhar a administração pública e promover a divulgação de informações por meio de relatórios anuais que visam informar aos cidadãos as práticas realizadas pelos órgãos públicos. Porém, a transparência praticada pelos órgãos públicos não tem demonstrado a verdadeira finalidade exigida nessa prática (TOSIN et al., 2016). As informações são disponibilizadas assim como a lei exige, mas, o acesso aos dados é confuso e sua apresentação não é adequadamente estruturada em alguns portais, dificultando a obtenção das informações, devido à complexidade da divulgação. Mediante essa dificuldade, é fundamental a existência de mecanismos que, considerando a demanda por informações específicas, essas possam ser encontradas facilmente e que sejam úteis, tal que, os resultados permitam realizar escolhas e tomar decisões (TOSIN et al., 2016). As ferramentas de Inteligência de Negócios (Business Intelligence - BI), providas pelas Tecnologias da Informação e Comunicação podem auxiliar no processo de armazenamento e análise das informações, proporcionando o agrupamento de informações úteis e confiáveis, promovendo a tomada de decisão (REGINATO, NASCIMENTO, 2007; PETERS et al., 2016). Segundo PRIMAK (2008), as ferramentas de BI possibilitam, às organizações e aos gestores, acesso rápido e facilitado às informações colaborando para uma análise dos dados adequada (TRIEU, 2017). Deste modo, é possível selecionar e organizar os dados de forma apropriada ao tratamento necessário, permitindo que esses estejam disponíveis com informações consistentes para apoiar as decisões.",
    "Conclusão": "As tecnologias têm proporcionado grandes mudanças no dia a dia das pessoas. Agregar essas tecnologias aos negócios possibilita a obtenção de eficiência nas tomadas de decisão, sendo as ferramentas de Business Intelligence um exemplo que expressa esses benefícios. O intuito desse trabalho foi demonstrar que a Inteligência de Negócios, por meio de uma ferramenta, em um contexto de transparência pública e utilizando dados abertos pode potencializar a análise e a obtenção de informações relevantes. Através da análise e busca em portais de dados brasileiros, foi constatada a dificuldade na localização e compreensão dos dados que estão disponíveis. O mesmo ocorreu com a definição dos cenários, pois inicialmente, havia a intenção de utilizar e analisar dados que descrevessem informações sobre a saúde, tais como, recursos disponibilizados para as despesas administrativas, tratamentos de saúde oferecidos para a população, bem como o custo dos tratamentos, entre outras informações dos municípios e estados. Todavia, alguns problemas foram encontrados, entre eles, informações desatualizadas com dados de períodos antigos, falta de informações ou informações incompletas, e a falta de arquivo com dados em formato padrão para serem utilizados por outras ferramentas, apenas relatórios prontos. Portanto, optou-se pela exploração dos dados educacionais, pois havia mais dados disponíveis, com períodos recentes e atualizados, e em formato aberto. Com a finalidade de estudar uma ferramenta com tecnologias atuais e que fosse de acesso gratuito, definiu-se a ferramenta QlikView® para realizar a análise dos dados, e constatou-se que esta possui uma linguagem simples de utilização e de fácil compreensão. Através da documentação disponível no site da Qlik®, foi possível estudar a ferramenta e criar as análises necessárias para avaliar o desempenho da ferramenta, bem como, a obtenção de informações relevantes para cada um dos cenários deste trabalho. Durante a análise dos cenários foi necessário estabelecer um fluxo de atividades que foram essenciais para encontrar os resultados desejados. Pode-se afirmar que a definição desse fluxo proporcionou um planejamento das ações que garantiram resultados pertinentes. Esse fluxo resultou em gráficos e tabelas que descreveram dados encontrados nos quatros cenários (PROUNI, PRONATEC, ENEM e PNAE), e distribuídos no período de três anos. No cenário PROUNI, observou-se que houve um decréscimo de concessão de bolsas durante os períodos analisados. Avaliar esses dados possibilitou identificar as regiões que são mais beneficiadas com o programa e, portanto, possibilitariam ao tomador de decisão a análise e a definição de uma melhor distribuição dos recursos conforme a necessidade de cada região. A análise do PRONATEC possibilitou uma avaliação das desistências dos participantes no programa em alguns municípios catarinenses. Essas análises permitiriam aos gestores públicos analisar o interesse da população a fim de identificar se os cursos ofertados condizem com as atividades da região. Para a sociedade, viabilizaria o reconhecimento dos incentivos propostos pelo governo para estimular o desenvolvimento do perfil profissional dos cidadãos. Já no cenário ENEM, as análises oportunizaram identificar a distribuição das escolas em todas as regiões brasileiras que aplicam o exame, bem como, analisar uma comparação entre os alunos que estão matriculados nas escolas em relação aos que realizam o exame. Essas análises propiciariam uma análise mais clara do rendimento das escolas, a fim de estimular os alunos a realizarem o exame. Observou-se também, que entre os cinco municípios catarinenses, Araranguá apresentou a melhor média de notas entre eles e conforme a análise realizada da Tabela 9, as escolas privadas têm maior adesão na realização do exame, pois aproximadamente 90% realizam o exame, enquanto que nas públicas somente 66,5% realizam. A análise também demonstrou uma diferença de aproximadamente 50 pontos (550 de média para as escolhas privadas e 505 para as escolas públicas). Sob o ponto de vista educacional tem-se a percepção de que este valor seja significativo. Ou seja, parecem demonstrar que para se atingir uma média com incremento de 10% exigiria das instituições públicas políticas mais focadas na qualidade do ensino. Por fim no cenário PNAE, as contribuições das análises estão voltadas para a avaliação dos recursos de alimentação disponibilizados às instituições. Através da identificação dos recursos ofertados pelos municípios às instituições, é possível mensurar se esses estão adequados com os disponibilizados. Possibilita ainda a criação de questionamentos sobre os dados apresentados, conforme analisados na Tabela 13 e Gráfico 16, onde a estimativa populacional cresce entre os anos, mas o valor do recurso decresce anualmente. Dessa forma, foi possível identificar o quanto é necessário disponibilizar os dados em formato aberto para permitir a reutilização desses dados em outras aplicações. Ou seja, que além de abertos, não apresentem qualquer restrição de acesso, que não modifiquem a realidade, ou tenham algum mecanismo de controle, a fim de evitar que sejam realizadas quaisquer ocultações das informações. Quanto à prática de transparência pública, identificou-se que essa ocorre conforme a legislação exige, mas que não satisfaz o interesse e as necessidades da sociedade. Enfim, através da análise dos dados ressaltou-se a importância de realizar um cruzamento das informações apresentadas, analisando o contexto inserido e identificando justificativas que comprovam as informações apresentadas. Quanto ao uso das ferramentas de Inteligência de Negócio, foi possível verificar os benefícios que essas podem proporcionar às instituições, e o quanto facilitariam a tomada de decisão pelos gestores. Suas funcionalidades permitem uma visão mais ampla dos dados armazenados, uma vez que é possível explorá-los em diferentes dimensões e com diferentes perspectivas tendo o objetivo de impactar positivamente na tomada de decisão."
}