{
    "Autor": "LEONARDO PEREIRA RECCO",
    "Título": "ASSOCIAÇÃO CATARINENSE DE EMPRESAS DE TECNOLOGIA (ACATE) COMO AGENTE DO SISTEMA REGIONAL DE INOVAÇÃO EM SANTA CATARINA",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Paulo Cesar Leite Esteves",
    "Coorientador(a)": "",
    "Resumo": "A Tecnologia está ao alcance de muitas empresas hoje em dia, com a competição por fatias de mercado cada vez mais acirradas, as empresas tem a necessidade de se destacar, onde entra o uso da inovação que torna um caminho de sucesso. O Presente trabalho visa apresentar a Associação de Empresas Catarinense de Tecnologia (ACATE) ao longo de sua história, desde sua criação até o presente, buscando avaliar sua atuação como colaboradora na criação de inovação em empresas de cunho tecnológico. A metodologia aplicada na elaboração do presente trabalho foi bibliográfica, documental e qualitativa. Os conceitos apresentados são em referência a importância da inovação para o crescimento econômico no estado de Santa Catarina; ao desenvolvimento das empresas por meios de incubadoras; ao sistema de inovação utilizado pelo MIDI Tecnológico; a utilização das TICs; e aos métodos utilizados para poder promover a inovação. Serão explicados os principais pontos ao longo de sua história como fomentadora de inovação tecnológica. A ACATE se tornou uma das principais empresas representativas do setor catarinense e possui grande área de atuação, sendo reconhecida além do estado de Santa Catarina. Incluíndo o MIDI Tecnológico atuante na criação de empresas tecnológicas inovadoras. A ACATE tornou sua atuação em prol do associativismo motivo de desenvolvimento para o setor tecnológico em suas 459 associadas e demais empresas de Santa Catarina.",
    "Palavras-chave": [
        "ACATE",
        "Inovação",
        "Incubadora",
        "TIC"
    ],
    "Introdução": "A economia brasileira ainda está sofrendo uma grande expansão e se desenvolveu num período recente da trajetória econômica. Esse fato gerou grandes desafios para as empresas, como a busca por tecnologias e fatias de mercado. Com o nivel de competitividade aumentando, os desafios tornaram-se ainda maiores. Conjunturalmente, deve-se ainda considerar a queda no desempenho do país que afeta toda a cadeia produtiva. Neste cenário o papel da inovação ganha uma dimensão fundamental como elemento de incorporação de valor e competitividade das empresas, procurando meios de tornar os produtos e serviços disponíveis mais eficiente e com melhor utilização dos recursos necessários a sua oferta. A inovação contribui para elevar o grau de produtividade das empresas, principalmente no que concerne na evolução tecnológica dos produtos e serviços. A inovação permite que sejam feitas mudanças dentro das empresas cujos efeitos podem ser visualizados, rapidamente, em comparação com empresas que não optam por essa estratégia. A inovação pode ser implementada em todos os tipos de empresas, contribuindo para um crescimento diferenciado e aumentando o potencial de valor de seus produtos e serviços. Em última instância é crítica para o crescimento da economia nacional. Segundo Tigre (2006), a inovação é uma ferramenta de extrema importância para competir no mercado atual, impulsionando o desenvolvimento econômico de regiões e de países: O desenvolvimento não deriva de um mero crescimento das atividades econômicas existentes, mas reside fundamentalmente em um processo qualitativo de transformação da estrutura produtiva no sentido de incorporar novos produtos e processos e agregar valor à produção por meio da intensificação do uso da informação e do conhecimento (TIGRE,2006. p. 13) Como pode-se observar, a inovação para ser usada em benefício de uma empresa, necessita, principalmente, ter como insumo, a informação. Hoje em dia a informação está acessível a todos que possuem um computador conectado à rede mundial (INTERNET). Porém, é a utilização dessas informações de forma adequada que pode fazer a diferença no âmbito empresarial. Ela serve para estabelecer uma diferença na geração de produtos e processos, fundamentais para a competitividade das empresas. Segundo o Manual de Oslo (2005), existem muitas razões para que as empresas busquem a inovação, com destaque para o grau de competitividade do seu desempenho. Segundo o Manual: A razão última é a melhoria de seu desempenho, por exemplo, pelo aumento da demanda ou a redução dos custos. Um novo produto ou processo pode ser uma fonte de vantagem mercadológica para o inovador. No caso de inovações de processo que aumentam a produtividade, a empresa adquire uma vantagem de custo sobre seus competidores permitindo uma margem sobre custos mais elevado para o preço de mercado prevalecente ou, dependendo da elasticidade da demanda, o uso de uma combinação de preço menor e margem sobre custos maior em relação a seus competidores, para ganhar fatias de mercado e aumentar os lucros. No caso da inovação de produto, a empresa pode ganhar uma vantagem competitiva por meio da introdução de um novo produto, o que lhe confere a possibilidade de maior demanda e maiores margens sobre custos (OSLO, 2005, p. 36-37). Será visto mais à frente que existem 4 tipos de inovação de acordo com o Manual de Oslo (2005). Dentre os quatro tipos, existem as inovações de produtos e processos tecnológicos, frutos de produtos ou processos que são de origem tecnologicamente novos, ou que possuem melhorias significativas. Pode ser considerada uma inovação tecnológica implantada quando um produto ou serviço novo ou significativamente melhorado tem aceitação pelo mercado. Para que essa inovação seja criada e implantada com sucesso, ela deve passar por uma gama de atividades tecnológicas, organizacionais, financeira, científica e comerciais (OSLO, 2015). Segundo Pelaez e Szmrecsányi (2006) apud Ieis (2013), a inovação não acontece de forma isolada, sendo ela influenciada, pode ocorrer por instituições, empresas e políticas regionais e nacionais. Onde somente conta como inovação o fruto de um processo que pode apenas ser analisado pelo seu caráter interativo, sendo ainda necessário que os atores envolvidos desempenhem papéis ativos no desenvolvimento da inovação que possa resultar em benefício mútuo. O Brasil vem desenvolvendo um trabalho de construção de políticas públicas para incentivar a implantação da inovação nas empresas. De acordo com Ieis (2013), as empresas públicas inovam 68% mais que as privadas. Permite-se constatar que o poder público tem interesse em apoiar a implantação da inovação nas empresas. Adiante nessa pesquisa, é demonstrado que o poder público é o que mais investe em Ciência, Tecnologia e Inovação (CT&I). Cita-se também detalhadamente como de fato o governo implementa inovações nas empresas, seja através de programas e políticas públicas de interesse na área de inovação tecnológica, havendo o discurso da relação do empreendedorismo com a inovação. Sendo o empreendedor citado nesse meio como um profissional capaz de unir a inovação às empresas de forma inteligente, assumindo riscos calculados e com muito estudo na área de pesquisa e desenvolvimento. Foi com o objetivo de colaborar neste processo de criação e incentivo ao desenvolvimento tecnológico e à inovação que foi criada a ACATE. A ACATE (2015), tem como um de seus objetivos principais atuar em benefício do desenvolvimento do setor tecnológico no estado de Santa Catarina. Ao longo de sua existência atuou como uma das principais interlocutoras das empresas tecnológicas catarinenses. Para cumprir seus objetivos a ACATE desenvolve um conjunto de processos e ações que incluem a gestão de incubadoras, apoio a novos empreendimentos de base tecnológica, workshops e outros tipos de ações para aumentar a socialização entre empresas, entidades e universidades, permitindo que as mesmas possam trocar informações importantes de forma mútua para o melhor desenvolvimento de seus negócios. A ACATE (2015), desenvolve um trabalho sistemático de apoio às empresas de base tecnológica nas diversas etapas do ciclo de vida da empresa. Para isso oferece cursos de formação na área de tecnologia, ministrando workshops nas mais diferentes áreas, como por exemplo, gestão de empresas, empreendedorismo e motivação. Apoia o desenvolvimento de empresas com conteúdo empreendedor e inovador utilizando uma incubadora em parceria com o SEBRAE/SC chamada de MIDI Tecnológico. Ela atua oferecendo apoio às empresas nascentes, dando amplo suporte às atividades tecnológicas e administrativas colaborando de forma ativa na estruturação e maturidade da empresa. Possui atuação junto com empresas maduras, promovendo projetos e ações que incluem desde a pesquisa sobre o perfil, necessidades de recursos humanos adequados e estruturação de verticais de negócios que propiciem integração e construção de oportunidades de mercado. Essa pesquisa busca entender qual é a participação da ACATE como fomentadora de empresas de base tecnológica, ou seja, como a ACATE promove o desenvolvimento de empresas de base tecnológica em Santa Catarina, descrevendo de forma detalhada como incentiva às instituições privadas a elevar seu nível de pesquisa e desenvolvimento na busca pelas inovações. Mostra como a ACATE faz uso destes benefícios fiscais e outros apoios governamentais para ajudar nesta construção. Inclui também a ACATE na criação de leis em conjunto com o poder público visando favorecer a implantação e desenvolvimento da inovação nos mais variados setores. Detalhar a história da ACATE ao longo do tempo, sua participação na criação e implantação da inovação nas empresas, desenvolvendo um papel relevante no sistema regional de inovação. Com estes objetivos, têm-se as seguintes indagações: Qual o benefício em criar empresas de base tecnológicas que utilizam inovações para o estado de Santa Catarina? Como a ACATE fomenta a pesquisa e inovação no estado de Santa Catarina?",
    "Conclusão": "O presente trabalho teve como principal objetivo mostrar o papel da ACATE atua como agente fomentadora de empresas de base tecnológica em Santa Catarina. Para cumprimento desse objetivo o trabalho apresentou a importância crescente do investimento em inovação para que as empresas alcancem uma posição competitiva em seus mercados de atuação. Os  investimentos  em  inovação,  no  Brasil,  decorrem  das  políticas  e  programas  públicos definidos pelos órgãos estruturantes do Sistema Nacional de Ciência, Tecnologia e Inovação, que tem como documento central a  Estratégia Nacional de Ciência, Tecnologia e  Inovação 2012 – 2015. Da mesma forma, as ações de C,T&I são operadas nos diversos estados brasileiros pela ação de organizações de atuação local, que estruturam o SRCTI. Apresentar o conceito e os objetivos do SRCTI se constituiu em um dos objetivos desse estudo, devidamente atendido na referência bibliográfica apresentada sobre o tema. Para apresentar a atuação da ACAFE a pesquisa desenvolveu uma linha do tempo apresentando os programas, projetos e ações desenvolvidos pela Associação no processo de fomento à tecnologia e inovação no estado catarinense, ao longo da sua história. O trabalho desenvolveu também, uma análise dos principais programas, projetos e ações desenvolvidas pela ACATE e sua contribuição para o fortalecimento do Sistema Regional de Inovação em Santa Catarina. Atuando nos seus vinte e nove anos de existência em prol do desenvolvimento do setor da ciência, tecnologia e inovação no estado de Santa Catarina, a ACATE, por meio de suas diversas ações vem contribuindo para a criação de empresas inovadoras que se tornaram em seus segmentos, uma referência nacional. Toda essa atividade no setor de tecnologia levou Florianópolis a ser considerada pela Endeavor a melhor capital para se empreender no Brasil no ano de 2014 (ENDEAVO, 2014). Em 2015 a cidade ficou em segundo lugar, atrás apenas de São Paulo, apresentando entre seus pontos fortes o capital humano. Especificamente, no que se refere ao estado de Santa Catarina, a Associação Catarinense de Empresas de Tecnologia – ACATE, tem um papel fundamental no SRCTI catarinense. Cerca de 60% dos universitários de Florianópolis são formados em cursos de excelência (a média das cidades analisadas é 23%), 36% da população adulta tem ensino superior e, mesmo com menor porcentagem de investimentos em relação a São Paulo, tem proporcionalmente mais gente qualificada para inovar - a cada 100 empresas, há 18 mestres e doutores na área de Ciência e Tecnologia (ENDEAVO, 2015). Além de Florianópolis, Joinville também está entre as 10 melhores cidades para se empreender na pesquisa Endeavor de 2015. Esses resultados decorrem de uma atuação dinâmica dos agentes que conformam o Sistema Regional de Ciência, Tecnologia e Inovação catarinense, com destaque para a sistemática e eficaz atuação da ACATE."
}