{
    "Autor": "Gidian Franco",
    "Título": "Qualidade dos serviços prestados pelo setor de suporte de TI: Estudo de caso em uma empresa líder no segmento de desenvolvimento de software no Brasil",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª Drª Andréa Cristina Trierweiller",
    "Coorientador(a)": null,
    "Resumo": "Este Trabalho de Conclusão de Curso tem por objetivo analisar a qualidade dos serviços prestados pelo setor de suporte de TI de uma empresa líder em desenvolvimento de software no Brasil. Para isto, realizou-se o levantamento de referencial teórico para explorar o tema de pesquisa. São apresentados os conceitos e ferramentas da qualidade, da prestação de serviços e suas características, e também, modelos para gerenciamento dos serviços de TI, em especial as melhores práticas ITIL®. Para realizar o levantamento dos dados, optou-se por realizar entrevistas em profundidade, semiestruturadas com perguntas abertas, para avaliar a qualidade percebida com base nas cinco dimensões da qualidade, são elas: tangibilidade, confiabilidade, responsividade, segurança, empatia. Com base nos resultados da pesquisa, verificou-se que, de modo geral, o setor de suporte de TI presta seus serviços com qualidade, segundo a percepção dos entrevistados; contudo, pode-se citar alguns pontos de atenção, como por exemplo, melhorar a comunicação sobre o progresso das solicitações; realizar treinamentos com os colaboradores; ser proativo na identificação de manutenções, antes dos problemas ocorrerem.",
    "Palavras-chave": "Qualidade em Serviços. Gerenciamento dos serviços de TI. Tecnologia da Informação. ITIL®.",
    "Introdução": "A infraestrutura brasileira, naqueles considerados como serviços básicos, tem se mostrado incapaz de atender todos os cidadãos. A carência por serviços na educação, segurança e administração pública, justiça são evidentes. Nesse cenário, o que deveria ser assegurado como essencial para dignidade, muitas vezes, não acontece. Por este motivo, tem-se buscado desenvolver softwares para auxiliar os órgãos da administração pública a melhorar a qualidade dos serviços prestados à população. Uma organização que tem como principais clientes, softwares para administração pública, pode ser utilizada como estudo de boas práticas, na qualidade do atendimento e isso, tem como um dos pontos de análise, o pessoal de suporte de Tecnologia da Informação (TI), do qual, diversos setores dessa organização dependem. Com a globalização, o maior acesso à informação e os referenciais de qualidade mundial, o aumento da competitividade entre as empresas é crescente, em todos os segmentos do mercado. Clientes têm conhecimento de seus direitos e exigem qualidade nos produtos e serviços prestados pelas inúmeras organizações com as quais interagem, ao adquirir seus produtos e serviços. Fitzsimmons e Fitzsimmons (2010) reforçam o crescimento no setor de serviços, relatando que o mesmo é líder em nações industrializadas, promovendo empregos e movimentando grandemente a economia. Devido à grande concorrência do setor, a qualidade é muito importante no atendimento ao cliente e na prestação dos serviços. A evolução tecnológica tem se consolidado como uma aliada na implantação de facilidades às instituições, ferramentas que disponibilizam estrutura de apoio, em maior qualidade das informações, monitoramento dos processos e assim, suporte para a tomada de decisões da equipe técnica, de desenvolvimento e gestores da empresa. São inúmeras as facilidades que a Tecnologia da Informação (TI) possibilita para a prestação de serviços, considerando-se desde o setor financeiro, que conta com os recursos do internet banking, mais recentemente, do mobile banking, até a compreensão do cenário da administração pública. Nas últimas décadas do século XX, a última reforma administrativa fez emergir novos modelos com ênfase gerencial e controle dos resultados. Um dos principais objetivos foi a melhoria da governança pública e ainda, o processo de redemocratização, estimulado pela Constituição de 1988, aumentou a pressão da sociedade por maior transparência e qualidade nos serviços prestados. Portanto, o uso das Tecnologias da Informação na Administração Pública se mostra essencial para melhoria de sua eficiência, eficácia e, por conseguinte, transparência em seus processos (NASCIMENTO, FREIRE e DIAS, 2012). Desta forma, cria-se novas oportunidades de negócio e formas de satisfazer os desejos e necessidades dos clientes (FITZSIMMONS; FITZSIMMONS, 2010). Diante deste contexto, o objetivo deste TCC é analisar a qualidade dos serviços prestados pelo setor de suporte de TI sob a ótica de pessoas-chave de uma empresa líder no segmento de desenvolvimento de software, que tem como principais clientes, órgãos do governo, nas esferas municipal, estadual e federal. A pesquisa foi realizada em uma organização do Estado de Santa Catarina, de 13 a 31 de outubro de 2017, em que os respondentes (usuários, colaboradores da empresa), avaliaram os serviços do setor de suporte de TI. A relevância desta pesquisa está expressa na necessária busca de melhoria dos serviços prestados pelo setor de suporte de TI, que diante de tantas dificuldades, tem o papel de auxiliar seus clientes internos para que usufruam dos recursos, já que um erro pode ser irreparável.",
    "Conclusão": "Este trabalho teve por objetivo geral: analisar a qualidade dos serviços prestados pelo suporte de TI de uma organização líder em desenvolvimento de software no Brasil. Para atender a este objetivo foram realizadas entrevistas semiestruturadas com perguntas abertas junto a pessoas-chave da organização, com base nas cinco dimensões da qualidade, são elas: tangibilidade, confiabilidade, responsividade, segurança e empatia. Para que com base nessas informações, fosse possível analisar o nível de percepção dos usuários quanto à qualidade dos serviços prestados pelo setor de suporte de TI da organização. Para atingir o objetivo principal da pesquisa foram propostos objetivos secundários: a) Realizar levantamento de literaturas sobre o assunto, dentre eles: qualidade, serviços, gestão de Tecnologia da Informação e temas correlatos; b) Elaborar questões semiestruturadas para entrevista em profundidade, com pessoas-chave da organização para verificação da qualidade dos serviços de TI; c) Realizar o tratamento e análise dos dados sobre a qualidade percebida; d) Traçar sugestões aos serviços prestados pelo setor de suporte de TI da empresa de desenvolvimento de software, a partir de pontos identificados como oportunidades de melhoria. O objetivo de realizar o levantamento da literatura para a realização deste TCC foi de grande importância, pois possibilitou aprofundar os conhecimentos sobre os temas relacionados à pesquisa. Para que, a partir da literatura, fosse possível elaborar um questionário para entrevista com os colaboradores, com vistas a obter sua percepção quanto aos serviços prestados pelo setor de suporte de TI. A partir da pesquisa realizada, desenvolveu-se o tratamento dos dados obtidos, para que estes se tornassem informações consistentes e confiáveis para apresentação e análise, neste trabalho. Pode-se apresentar, algumas dimensões de qualidade, percebidas positivamente pelos entrevistados, destaca-se a dimensão de confiabilidade, abordada nas perguntas de números dois e três, em que a maior parte dos colaboradores, afirmou que o setor de suporte de TI é prestativo e que entrega as solicitações no prazo determinado. Também, em relação à dimensão de empatia, referente às questões de número nove ao onze, os entrevistados relataram que, receberam atendimento de forma personalizada e que, na maioria dos casos, o suporte de TI sabe quais são suas necessidades. Percebem ainda que, há preocupação do setor quanto ao seu bem-estar em relação aos serviços prestados. Como intuito de atingir o último objetivo específico proposto, apresentam-se algumas sugestões ao suporte de TI, em pontos de melhoria, que foram identificados na pesquisa, são elas: 1. Proporcionar campanhas de divulgação sobre os meios de comunicação com o suporte de TI, pois alguns colaboradores relataram não conhecer a existência do portal para abertura de chamados. 2. Informar, claramente, como está o progresso do serviço e também, sua data de conclusão. 3. Realizar treinamentos com os colaboradores sobre as ferramentas de trabalho disponibilizadas. 4. Melhorar a classificação da fila de atendimento de chamados. 5. Atender as solicitações urgentes, com maior agilidade. 6. Criar um padrão de liberações de ferramentas de trabalho e acessos, conforme a função exercida por cada colaborador. 7. Atuar com visão inovadora, e estar atento às novidades no mercado tecnológico. 8. Ser uma equipe com maior pró-atividade. 9. Sugerir novas soluções e ferramentas de trabalho para a utilização dos clientes internos. 10. Demonstrar domínio sobre as ferramentas que dão suporte; ou seja, demonstrar que conhecem o que estão fazendo, isto aumenta a confiança do solicitante do serviço. 11. Adequar a linguagem utilizada, conforme cada pessoa, pois nem todos os colaboradores conhecem termos técnicos de TI. 12. Tornar o portal mais intuitivo para abertura de chamados. Neste sentido, os dados obtidos na presente pesquisa poderão ser encaminhados para a equipe de suporte de TI da empresa, para que assim, possam planejar novos projetos e buscar melhorias para seus clientes internos, a fim de elevar o nível de qualidade dos serviços prestados por este setor. Retomando o objetivo principal deste trabalho, com base no tratamento e análise de informações, verificou-se que, de modo geral, os colaboradores da organização percebem que há qualidade nos serviços prestados pelo setor de suporte de TI, pontos estes, que foram apresentados nos tópicos anteriores. Colaboradores mais experientes da organização como o R6 e o R14, relataram melhora na prestação de serviço do setor de suporte de TI nos últimos 5 anos, presume-se que a utilização das melhores práticas ITIL® tem contribuído para aumentar a qualidade percebida sob a ótica dos colaboradores da empresa. Contudo, deve-se ressaltar, que o setor de suporte de TI tem algumas oportunidades de melhoria para implementação, que sendo implementas poderão levar a percepção dos usuários, em relação à prestação de serviços do setor."
}