{
    "Autor": "Maycon Antônio Daniel",
    "Título": "A EVOLUÇÃO E APLICAÇÃO DA SEGURANÇA DA INFORMAÇÃO POR MEIO DA LEI GERAL DE PROTEÇÃO DE DADOS PESSOAIS (LGPD): UM ESTUDO DE CASO EM UMA INSTITUIÇÃO FINANCEIRA",
    "Ano de publicação": "2022",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Mendonça Lunardi",
    "Coorientador(a)": "Prof. Vilson Gruber Dr.",
    "Resumo": "Este trabalho objetivou tratar sobre o impacto da Lei Geral de Proteção de Dados no meio bancário, no tocante a proteção de dados dos usuários de uma instituição financeira privada e como esta atua no quesito segurança da informação. O tema proteção de dados é importante por serem estas informações únicas de um sujeito, levando -o ao reconhecimento e/ou ao uso indevido por terceiros. Por conta disso o país promulgou a Marco Civil da Internet, mas se preocupou apenas com as informações dos sites, não tratando sobre as questões do acesso/cliente, vindo a tratar de forma muito superficial a questão da proteção de dados pessoais. E a LGPD trata as informações bancárias como dados sensíveis. Portanto, seja o ramo de negócio, ter-se-á que ditas informações apenas podem ser tratadas pelas empresas se tiverem o consentimento do usuário. Frente ao exposto a questão problema a ser tratada nesta pesquisa é a seguinte: as Instituições Financeiras, por tratarem dos dados sensíveis de seus clientes, se encontram preparadas para cumprir as exigências da LGPD? A justificativa para esta pesquisa fundamenta-se no fato de que a adequação dos bancos a LGPD demanda esforço conjunto de diversas áreas que são produtoras e consumidoras de dados pessoais nas instituições. A metodologia adotada foi a estudo de caso, sendo estudada uma Instituição Financeira a fim de analisar quais meios adotados por no que se refere a segurança da informação de seus clientes, antes e depois da promulgação da LGPD, em particular no quesito proteção de dados dos mesmos.",
    "Palavras-chave": "LGPD. Segurança da Informação. Instituições Financeiras.",
    "Introdução": "O homem é um ser sociável por natureza e, por conta disso, criou os mais variados meios de comunicação, a fim de melhorar a vida em sociedade. A evolução tecnológica foi a responsável por auxiliar na passagem da era industrial para a da sociedade da informação, chegando-se à criação da internet que, dentre várias funções, também promove virtualização das relações pessoais. Deste modo, pessoas são informadas e informam de maneira simples e dinâmica na rede, podendo vir a comprar via internet, assim como realizar operações financeiras através de aplicativos e sites bancários. Por conta disso a questão da proteção de dados passou a ser assunto sensível e constantemente debatido no meio jurídico. O tema proteção de dados é importante por serem estas informações únicas de um sujeito, levando -o ao reconhecimento e/ou ao uso indevido por terceiros. Por conta disso o país promulgou o Marco Civil da Internet, mas se preocupou apenas com as informações dos sites, não tratando sobre as questões do acesso/cliente, vindo a tratar de forma muito superficial a questão da proteção de dados pessoais. Eis então que o legislador viu a necessidade de criar a Lei Geral de Proteção de Dados (LGPD), por força da Lei de n. 13.709/2018, visando à proteção das informações privadas quando do tratamento, uso, manutenção, guarda e compartilhamento realizado buscando algum fim, seja econômico ou não. É cediço que o setor financeiro brasileiro já se mostra robusto em relação ao seu ambiente protetivo de informações, sendo que a LGPD trouxe uma visão mais específica, quiçá, diferente para o cenário regulatório existente no setor. Isso porque a regra geral do sistema financeiro é pautada na conservação do sigilo dos dados pessoais e bancários do cliente, em particular aqueles que interferem diretamente na economia e na vida do cidadão, como por exemplo, seu perfil de crédito, ativos e dívidas. E a LGPD trata as informações bancárias como dados sensíveis. Portanto, seja o ramo de negócio, ter-se-á que ditas informações apenas podem ser tratadas pelas empresas se tiverem o consentimento do usuário. Frente ao exposto a questão problema a ser tratada nesta pesquisa é a seguinte: Qual o impacto da Lei Geral de Proteção de Dados em uma instituição financeira privada no quesito Segurança da Informação.",
    "Conclusão": "Na era da informação, é a internet a disseminadora de dados, que são compartilhados de maneira instantânea neste ciberespaço, mas a acentuada difusão dessas informações acaba por comprometer a privacidade das pessoas que tiveram fatos expostos em na rede. O advento da internet constitui em um dos mais importantes marcos da humanidade, ocasionando mudanças nas relações econômicas, sociais e culturais existentes, beneficiando o consumo, que passou a ter mais comodidade para que os clientes adquirissem seus produtos e/ou serviços de maneira online. Entretanto, essa modalidade trouxe consigo sérias fragilidades no tocante a segurança, indo desde fraudes a coleta indevida de dados pessoais. Deste modo, os diversos casos de vazamentos de dados pessoais colocam em evidência a segurança no meio digital, haja vista o consumidor não possuir noção do procedimento realizado em face do tratamento dos seus dados fornecidos. Esse problema demandou a necessidade de criação de regulamentação a fim de coibir essas violações, a fim de trazer segurança jurídica para todos, já que a inserção diária de dados em páginas eletrônicas passou a ser algo comum e necessário. Desta maneira, a Lei Geral de Proteção de Dados, que entrou em vigor em agosto de 2021 protege o titular de dados, oferecendo controle acerca destes, pois o consentimento e a transparência são os pilares da lei. Portanto, pode -se concluir que o estudo da proteção de dados pessoais no Brasil torna-se cada vez mais importante, devido aos diversos riscos que podem advir do tratamento de dados. Dita análise é ainda mais gritante no comércio eletrônico, por conta da vulnerabilidade do consumidor, sendo necessário das empresas a adoção de compliance para evitar irregularidades e as consequentes sanções impostas pela lei. Por certo que a LGPD pode ser considerada um avanço para o país, pois a sociedade está em constante mutação e o direito visa acompanhar e regular estas mudanças. No que se refere às instituições financeiras elas lidam com consultas e análises de dados o tempo todo. Parte dessas análises é solicitada por outras empresas, e a outra parte pelos próprios clientes. Naturalmente, essas informações ficam registradas na base das instituições e podem ser utilizadas no futuro para a oferta de serviços e produtos, Com vigência da LGPD, o cliente passa a ter o direito de solicitar a retirada de suas informações das bases de dados das financeiras. Se a empresa não tiver uma justificativa válida para manter os dados, é o direito do cliente que prevalece. Por conta disso a adequação à nova legislação exige que a empresa tenha uma forma segura de armazenamento e tratamento dos dados dos clientes. Caso contrário, as informações podem ser colocadas em risco, prejudicando o consumidor e a empresa. Em relação ao banco estudado acredita-se que ele vem atuando de maneira satisfatória ao cumprimento da Lei e segurança da informação e quesito proteção de dados de seus clientes. Porém, a segurança cibernética é fator que precisa estar sempre em constância, mutação e evolução, sob pena de ficar defasada. À medida que as empresas de serviços financeiros precisam evoluir para garantir a prestação de serviços de qualidade ao cliente, também precisam assegurar que suas soluções de segurança da informação sejam realmente capazes de proteger os dados confidenciais que capturam e transmitem. Assim, é por meio do uso de tecnologias de segurança que as instituições asseguram que os dados trafegados nas transações não corram riscos durante as operações. E os bancos são os mais adiantados na corrida para o cumprimento da LGPD. O principal motivo está no fato de ser um setor muito regulamentado. Tendo em vista esta pesquisa, acredito como a lei começou a vigorar há pouco tempo, muitas empresas nem se quer se movimentaram com tanta ênfase neste assunto, neste caso novas pesquisas em outros nichos empresariais levando em conta todos aspectos explorados em torno desse conteúdo devem ser feitas, ficando aberto para novos estudos a LGPD visando identificar pontos invulneráveis e até mesmo pontos fortes a serem seguidos e tomados como exemplo quais forem áreas e segmentos, de forma a tornar e propor métodos de conscientização voltados a segurança dos dados pessoais."
}