{
    "Autor": "Samara Tomé Correa de Souza",
    "Título": "Estudo do uso e impacto do Moodle no campus da UFSC em Araranguá",
    "Ano de publicação": 2012,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Juarez Bento da Silva",
    "Coorientador(a)": null,
    "Resumo": "O presente estudo apresenta a percepção dos professores e alunos do campus da Universidade Federal de Santa Catarina (UFSC) em Araranguá frente ao uso da s Tecnologias da Informação e Comunicação (TICs) no processo de ensino e aprendizagem, com ênfase na plataforma Moodle como apoio as disciplinas dos cursos ofertados no campus. A pesquisa fundamentou-se no levantamento de aspectos referentes as novas tecnologias da informação e comunicação no ambiente acadêmico e propriedades do Moodle para apoiar os professores e alunos neste contexto. Metodologicamente neste trabalho de conclusão de curso foi adotada a pesquisa qualitativa, uma combinação de estudo de caso com pesquisa-ação. A técnica utilizada para coleta de dados foi a aplicação de questionários disponibilizados no ambiente Moodle do Laboratório de Experimentação Remota (rexlab) da UFSC. Por fim, apresentam-se os resultados da opinião dos docentes e discentes sobre a utilização das Novas Tecnologias da Informação e Comunicação (NTICs) na educação e análises através da Escala de Likert, que varia de 1 a 5, de ambas as opiniões. Como resultado dessas análises pode-se observar que a percepção dos docentes e discentes, participantes da pesquisa, em relação as tecnologias, embora diferencie em alguns itens, é uniforme em quase todos os itens avaliados. Com base na amostra inquirida, o Moodle pode facilitar o processo de transmissão do conhecimento, pois possibilita a compreensão e um maior e melhor acesso aos conteúdos, porém, certos conteúdos continuarão sendo difíceis de explicar de maneira não presencial.",
    "Palavras-chave": "Tecnologias de ensino, NTICs, Moodle, Ambiente Virtual de aprendizagem.",
    "Introdução": "Este capítulo introdutório é composto pela contextualização, pela descrição dos objetivos, divididos em geral e específicos, pela justificativa para realização da pesquisa e o roteiro do documento, ou seja, como está estruturado o trabalho. A figura 1 representa o mapa conceitual de apresentação deste capítulo.",
    "Conclusão": "Neste trabalho são apresentadas algumas conclusões da pesquisa realizada. Também se busca mostrar respostas as questões em estudo para atender os objetivos desta pesquisa. A proposta inserida neste trabalho foi apresentar um estudo sobre o uso do Moodle pelos docentes do campus da UFSC em Araranguá como ferramenta didática. A análise da revisão bibliográfica para dar fundamentação ao trabalho proporcionou o conhecimento sobre as características do Ambiente Virtual de Aprendizagem Moodle. O conhecimento destas características são itens necessários, pois conduzem ao domínio e amplitude da ferramenta. Na fundamentação também se buscou a identificação dos aspectos referentes à utilização das TICs na Educação Superior. Os projetos de expansão do ensino superior e a inclusão das TICs no ambiente acadêmico são ações governamentais frente à demanda do mercado de trabalho. Dentre estes projetos vale salientar o REUNI que motivou a interiorização da UFSC e implantação do campus Araranguá, ambiente em que a pesquisa foi realizada. Para realização da pesquisa e coleta dos dados foram disponibilizados questionários aos docentes e discentes para instigar a verificação de como é a utilização da ferramenta pelos professores e alunos e se o processo de transmissão do conhecimento é facilitado com o uso do Moodle. Para análise dos dados foi utilizada a Escala de Likert, com valores que variam de 1 a 5, para mediar as respostas obtidas. A participação dos estudantes na pesquisa foi baixa. Alguns porque estavam realizando trabalhos e estudando para as provas e não considerou interessante a sua colaboração para realização da pesquisa. Pode-se perceber que poucos verificam seus emails, pois num primeiro momento foi enviado o convite por email e muitos só participaram após a postagem na rede social Facebook reforçando a participação na pesquisa. Com base nos resultados do primeiro questionário pode-se observar que todos os docentes participantes da pesquisa utilizam o Moodle em suas disciplinas. Da amostra inquirida, a maioria dos docentes respondentes é do sexo masculino, apenas 10% possui mais de 16 anos de experiência na UFSC e 83% são efetivos da universidade. Com relação à utilização do Moodle em suas disciplinas 97% dos professores afirmam que utilizam em mais de duas disciplinas e os recursos mais utilizados são fóruns, envio de mensagens, diário, disponibilização de conteúdos e matérias de aula e envio de tarefas. Outros recursos citados pelos participantes foram HotPotatoes, Sloodle, Voki, Repositório de arquivos e Notas. Os docentes participantes da amostra, geralmente, utilizam o Moodle várias vezes por semana, e se dedicam um tempo médio de uma a quatro horas semanalmente ao AVA para trabalhar em suas disciplinas. As conexões ao Moodle são comumente durante a semana, no período vespertino /noturno e raramente duram mais de uma hora. Os resultados do segundo questionário apontam que a maioria dos discentes participantes da amostra é do sexo masculino e que 47% dos alunos são menores de 20 anos. Da amostra investigada as fases em que possuem maior número de estudantes matriculados são a primeira, segunda e terceira. Com relação à utilização do Moodle, 82% dos respondentes afirmam utilizar o Moodle em mais de quatro disciplinas e as atividades mais utilizadas por eles são: download de conteúdos didáticos, leitura de avisos e comunicados do professor e/ou colegas, envio de tarefas e/ou atividades e realização de testes, questionários, etc. Quando questionados sobre sua percepção quanto à utilização pelos colegas ao AVA da UFSC 82% dos estudantes acreditam que mais de 50% dos seus colegas acessam o Moodle. Um número expressivo de alunos afirma possuir internet em casa, sendo possível conforme observado nos resultados o lugar de maior conexão ao Moodle ser realizado em seus lares e em segundo da própria universidade. A frequência de acesso dos estudantes ao AVA é quase todos os dias, geralmente durante a semana e no período noturno. A dedicação dos discentes ao ambiente na semana é em média de uma a três horas e a duração das conexões geralmente é em torno de meia hora. Pode-se perceber que a satisfação com os recursos NTIC do Moodle é diferente entre os professores e alunos. 69% dos docentes afirmam que o Moodle atende de maneira satisfatória suas necessidades para a disciplina, já 47% dos discentes se mostram satisfeitos com os recursos utilizados nas disciplinas cursadas. Nos questionários três e quatro se observa a percepção dos docentes e discentes com relação às consequências causais a partir da utilização das NTICs no ensino. Com base na amostra pesquisada, pode-se perceber que o Moodle pode facilitar o processo de transmissão do conhecimento, porque de forma expressiva os participantes da pesquisa afirmam que a inserção das TICs no ensino facilitará a compreensão dos conteúdos e um maior e melhor acesso aos conteúdos, por outro lado, ambos também enfatizam que certos conteúdos continuarão sendo difíceis de explicar de maneira não presencial. Para trabalhos futuros pode-se incluir a implementação de cursos preparatórios ou tutoriais para auxiliar os docentes na inserção das NTICs em suas disciplinas. Com base nos resultados nos fundamentamos que conforme a percepção dos estudantes e professores é necessária a preparação dos docentes para as novas estratégias de ensino. Uma análise por curso ou correlacionar os professores do TIC e os alunos do TIC também são sugestões para futuros trabalhos de conclusão de curso."
}