{
    "Autor": "Josué José Trombim",
    "Título": "Home Office e o suporte a sistemas",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Mendonça Lunardi",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho de revisão bibliográfica de literatura visa relembrar como era o trabalho desde os primórdios do mundo, a evolução do trabalho e como o mesmo está sendo tratado atualmente e por fim demonstrar a rotina para quem presta suporte a sistemas no modelo de Home Office em uma empresa de desenvolvimento de software e avaliar quais são as melhores ferramentas para o trabalho a partir da minha opinião como trabalhador que utiliza esse modelo de teletrabalho. Este tema justifica-se de tal maneira que possa demonstrar o funcionamento do trabalho remoto com as ferramentas necessárias para o seu funcionamento e conjuntamente o suporte a sistemas, a qual é uma função muito importante, em todos os seus níveis numa organização. Com a chegada da pandemia de COVID-19, a sociedade se viu no dilema de trabalhar e se proteger em simultâneo, certos setores industriais tiveram que parar por completo, já outros, puderam se adaptar adotando o home office, essa modalidade de trabalho já vinha sendo muito utilizada fora do Brasil, mas muito pouco conhecida em nosso país, ela vem sendo difundida e estudada para que se torne tão comum quanto o serviço presencial ao qual estávamos tão acostumados, por isso esperamos que esse trabalho sirva como uma base de estudos para a implementação dessa modalidade de teletrabalho.",
    "Palavras-chave": [
        "Home Office",
        "Suporte a Sistemas",
        "Ferramentas"
    ],
    "Introdução": "Em março de 2020 a Organização Mundial da Saúde (OMS) decretou o surto do coronavírus como uma pandemia global, mesmo já havendo sido declarado emergência de saúde pública pelo mesmo órgão no dia 30 de janeiro de 2020. A mudança de classificação não se deve à gravidade da doença, e sim a disseminação geográfica rápida que o COVID-19 tem apresentado. (OMS,2020). De prontidão, a maioria dos governos de diversos países criaram restrições de acesso a lugares fechados, o fechamento de estabelecimentos não considerados como “essenciais”, regras de distanciamento mínimo entre pessoas, utilização de máscaras protetoras, álcool em gel para higienização das mãos entre várias outras medidas com o intuito de mitigar e diminuir a contaminação em massa da doença. Uma das maneiras encontradas pelas empresas para que a sua produção não parasse por total, foi adotar o teletrabalho, na modalidade de trabalho home office. Traduzindo para o português, home office significa escritório em casa, assim como o tema sugere, home office é exatamente ter uma estrutura de trabalho no ambiente doméstico (PUCPR, 2021). Esse modelo de trabalho é uma tendência mundial que a cada ano ganha mais adeptos, tanto por parte dos candidatos quanto dos empregadores. O teletrabalho na modalidade home office já existia fora do Brasil em maior escala, no Brasil já existia, porém era muito menos utilizado, tanto que o termo home office não era muito conhecido no meio corporativo, a maneira abrupta em que fomos inseridos nesse meio, fez com que o processo para adaptação fosse mais complicado do que deveria, sem quaisquer treinamentos e normas para a sua aplicação, pessoas precisaram aprender a trabalhar de forma remota para que pudessem continuar com suas atividades laborais e que as empresas cujo os funcionários trabalham, não fechassem as portas por completo. Nesta revisão bibliográfica de literatura, objetiva trazer à tona, pontos positivos e pontos negativos dessa modalidade e fazer uma análise das ferramentas necessárias para que seja possível laborar remotamente e também servir de base para que o teletrabalho seja implementado em outras atividades que não sejam ligadas somente a área de tecnologia, assim como será demonstrado a rotina de um colaborador que trabalha home office, prestando suporte de nível 2 a uma empresa de desenvolvimento de software.",
    "Conclusão": "Devido ao presente momento em que vivemos devido a pandemia de Covid-19 e a oportunidade oferecida pelas empresas, para que os funcionários pudessem trabalhar no modelo home office, veio então a inspiração para a escolha do tema deste trabalho de conclusão de curso. Embora no Brasil, a modalidade de trabalho remoto tenha sido abruptamente inserida devido a pandemia e as medidas protetivas, salvo guardo os casos que já existiam no país, o trabalho home office, com certeza, foi uma ótima maneira de conter a disseminação da doença e de certa maneira ajudou a salvar empregos e vidas, mesmo enfrentando dificuldades para implantação o home office foi necessário e muito utilizado, esperamos que com o passar dos anos essa modalidade continue sendo ofertada, difundida, estudada e melhorada, para que mais pessoas possam usufruir e se beneficiar disso. No capítulo 4 vimos que com a ajuda das ferramentas tecnológicas necessárias o home office pode ser amplamente ofertado aos colaboradores, visto que há vantagens para os dois lados, seja funcionário ou empregadores, para os funcionários a maior vantagem é não ter que se deslocar da casa até a sede da empresa, ganhando mais tempo para si e para sua qualidade de vida e consequentemente poder ter mais tempo com sua família, já para o empregador, os custos para manter a empresa diminuem, visto que se gasta menos com o funcionário em casa. Espera-se que este trabalho venha a contribuir para que mais empresas passem a utilizar do teletrabalho como uma maneira de manter talentos, se modernizar, diferenciar no mercado de trabalho e cortar custos e que o teletrabalho não fique apenas como uma utopia devido às necessidades atuais e sim seja utilizado em grande escala, tornando o Brasil um país mais atrativo e tecnológico. Em profunda análise pessoal, posso afirmar que com os ensinamentos que aprendi durante o período da graduação, especialmente com matérias que foram lecionadas a distância e outras que demonstravam ambientes virtuais de aprendizagem (AVA) me senti mais preparado para fazer o uso do home office, de certa forma, também passamos por dificuldades pois todos precisam se adaptar a essa nova modalidade de trabalho, anteriormente tudo que era dito frente a frente passou a ser de tela para tela, em certas circunstâncias isso prejudica no desempenho de um profissional, pois para tirar uma dúvida, por exemplo, pessoalmente você tem mais chances de que isso aconteça rapidamente, já no home office você depende da vontade e da disponibilidade de seu chefe ou colega, mas isso é apenas um ponto que de atenção, depende muito de cada pessoa entender o que é melhor para si e para sua carreira. Como trabalhos futuros sugiro a tentativa de implementação do teletrabalho na modalidade home office em alguma empresa que não seja da área de tecnologia respeitando a possibilidade e complexidade das funções exercidas, pois dessa maneira surgiriam novos aprendizados e novos desafios, ocasionando em uma experiência enriquecedora ao indivíduo que fará esse projeto e também irá ao trabalhador que for experimentar esta modalidade de teletrabalho."
}