{
    "Autor": "Natália Mattiola da Silva",
    "Título": "ESTUDO SOBRE USABILIDADE DE AMBIENTE VIRTUAL DE APRENDIZAGEM NO ENSINO MÉDIO TÉCNICO INTEGRADO DA REDE FEDERAL",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Juarez Bento da Silva",
    "Coorientador(a)": "Simone Meister Sommer Bilessimo",
    "Resumo": "Este trabalho tem o objetivo de verificar a usabilidade de um Ambiente Virtual de Aprendizagem, quando aplicado como uma ferramenta de apoio às aulas presenciais, no cotidiano escolar de uma turma matutina de 4º ano do Ensino Médio Técnico Integrado do Instituto Federal de Santa Catarina, no município de Araranguá - SC. Pretende-se verificar também a motivação e interesse dos alunos quando estudado com o auxílio desta tecnologia em suas rotinas de estudos, identificando a importância do uso do Ambiente Virtual de Aprendizagem, juntamente de suas vantagens e benefícios direcionados aos estudantes. Inicialmente, foi realizada uma pesquisa bibliográfica para desenvolver este trabalho. Para seu desenvolvimento, foi realizada uma Aula Expositiva e posteriormente, uma aula com a metodologia de Sala de Aula Invertida, utilizando o Ambiente Virtual de Aprendizagem. Em sequência, foi aplicado aos estudantes, o Questionário de Avaliação da Utilização do Ambiente Virtual de Aprendizagem, onde foi possível coletar e analisar os resultados obtidos referente à experiência dos mesmos ao utilizarem esta tecnologia em sala de aula. As tecnologias utilizadas para a realização deste trabalho, foi o Ambiente Virtual de Aprendizagem, onde pôde-se realizar a criação de um curso online disponível para acesso dos alunos, constituído por materiais e conteúdos relacionado a disciplina de Biologia, onde a pesquisa foi aplicada. Por fim, pode-se obter os resultados desta pesquisa, juntamente de suas considerações finais, alcançando seus objetivos e proposta principal. A pesquisa permitiu incentivar trabalhos futuros envolvendo os resultados obtidos através da mesma.",
    "Palavras-chave": "Usabilidade. Ambiente Virtual de Aprendizagem. Ensino Médio.",
    "Introdução": "De acordo com Ozório (2002): Todos querem uma educação de qualidade, com isso várias teorias da aprendizagem são estudadas e ensinadas aos professores, mas muitos que ensinam estas teorias não tocam em um ponto muito importante que influencia grandemente na qualidade da educação, que é o excesso de alunos em sala de aula, problema este enfrentado por vários professores. Com a fala da autora, pode-se perceber que os alunos estão estudando em salas de aulas lotadas, com mais da capacidade máxima permitida. Isso pode fazer com que muitos alunos se distraiam durante as aulas, ou simplesmente não sintam-se motivados e incentivados a estudar e aprender conteúdos novos. Segundo a lei nº 9.394, vigente no Brasil (Brasil, 1996), o Ensino Médio é a última etapa da Educação Básica, tendo como um dos principais objetivos “a preparação básica para o trabalho e a cidadania do educando, para continuar aprendendo, de modo a ser capaz de se adaptar com flexibilidade a novas condições de ocupação ou aperfeiçoamento posteriores”. Por tanto, integrando e utilizando uma nova tecnologia no cotidiano de estudos dos alunos de Ensino Médio, pode-se obter um aumento no incentivo e motivação em estudar e aprender por parte dos mesmos. Por esses motivos, este trabalho teve o intuito inicial de integrar um Ambiente Virtual de Aprendizagem, como uma ferramenta de apoio e complemento às aulas presenciais, em uma turma de 4º ano do Ensino Médio Técnico Integrado do Instituto Federal de Santa Catarina, no município de Araranguá - SC. A integração do Ambiente Virtual de Aprendizagem auxiliou o professor em suas aulas e os alunos puderam realizar suas atividades em computadores, tablets e/ou smartphones, tornando o cotidiano de estudos deles, mais diversificado. Os participantes desta pesquisa lidaram com tecnologias em suas rotinas, remetendo à uma atividade convidativa e não somente obrigatória. Sendo assim, este estudo pretendeu verificar a utilização do Ambiente Virtual de Aprendizagem, como um auxílio na rotina escolar de alunos do Ensino Médio. Juntamente com a motivação e interesse dos mesmos em sala de aula, quando utilizado esta tecnologia. Esses fatores foram analisados através de coleta de dados do Questionário de Avaliação da Utilização do Ambiente Virtual de Aprendizagem que foi aplicado aos estudantes no final da pesquisa.",
    "Conclusão": "Esta pesquisa pretendeu verificar a usabilidade de um Ambiente Virtual de Aprendizagem, utilizado como ferramenta de apoio no cotidiano de estudos de alunos do Ensino Médio Técnico Integrado do Instituto Federal de Santa Catarina. Juntamente com a motivação e interesse dos mesmos em sala de aula diante desta tecnologia. No decorrer deste trabalho, foram realizados todos os objetivos propostos inicialmente. Foi desenvolvido o curso online no Ambiente Virtual de Aprendizagem, sendo, posteriormente, aplicado aos alunos em sala de aula. E foi realizada a análise dos resultados, obtida a partir da coleta de dados do Questionário de Avaliação da Utilização do Ambiente Virtual de Aprendizagem aplicado aos estudantes. Para obter os resultados desta pesquisa, foram apresentadas e aplicadas aos estudantes, duas metodologias de ensino, a Aula Expositiva e a Sala de Aula Invertida. Na metodologia de Sala de Aula Invertida, foi utilizado o Ambiente Virtual de Aprendizagem como uma ferramenta de apoio às aulas presenciais, na rotina de estudos dos estudantes. Em sequência, foi aplicado o Questionário de Avaliação da Utilização do Ambiente Virtual de Aprendizagem, com o objetivo de verificar a experiência dos estudantes em relação a utilização do A V A. Com os resultados obtidos através deste Questionário, foi possível verificar usabilidade do A mbiente Virtual de Aprendizagem a partir da experiência dos alunos, em conjunto com a motivação e interesse em estudar dos mesmos. Foi possível também compreender a importância do uso desta tecnologia integrada aos métodos de ensino e suas vantagens de utilização. Também surgiram críticas e sugestões a serem analisadas referente a esta pesquisa, mostrando que pode-se obter em um trabalho futuro, melhorias e correções a respeito delas. Por fim, concluiu-se que o uso do Ambiente Virtual de Aprendizagem como uma ferramenta de auxílio às aulas presenciais foi de grande importância, gerando vantagens para os estudantes, incentivando-os e motivando-os em suas rotinas de estudos. Com isso, a presente pesquisa alcançou seus objetivos, juntamente com sua proposta principal, incentivando trabalhos futuros envolvendo os resultados obtidos através da mesma."
}