{
    "Autor": "Vitor Rodrigo Machado",
    "Título": "Desenvolvimento de um Sistema de Gerenciamento de Pedidos para Marketplaces",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof(a) Dra. Marina Carradore Sérgio",
    "Coorientador(a)": "",
    "Resumo": "O comércio eletrônico tem crescido significativamente nos últimos anos, e os marketplaces se tornaram uma opção popular para vendedores e consumidores. No entanto, a gestão eficiente de pedidos em marketplaces é um desafio, envolvendo questões como confiança, prontidão e segurança. Um sistema de gerenciamento de pedidos eficiente é crucial para garantir a satisfação do cliente e a otimização dos procedimentos internos. Este trabalho de conclusão de curso aborda o desenvolvimento de um sistema de gerenciamento de pedidos para marketplaces, com o objetivo de atender às demandas específicas desse ambiente de comércio eletrônico. O sistema proposto visa incorporar funcionalidades essenciais, tais como registro detalhado de pedidos, integração com diferentes plataformas, notificações em tempo real, análise e relatórios de vendas, automação de processos, segurança e controle de acesso. A metodologia empregada incluiu o levantamento de requisitos por meio de entrevistas com vendedores e consumidores ativos em marketplaces, resultando em insights valiosos para a concepção do projeto. O sistema foi desenvolvido utilizando ferramentas e tecnologias como MongoDB Atlas, Visual Studio Code, Node.js e Selenium. Os resultados obtidos com o desenvolvimento do protótipo do sistema foram apresentados, destacando a visão geral do sistema e as ferramentas utilizadas. Conclui-se que o sistema desenvolvido atende às necessidades do mercado, proporcionando uma gestão de pedidos mais ágil, segura e adaptada às nuances do ambiente dinâmico dos marketplaces. Além disso, são apontadas possíveis direções para pesquisas futuras, refletindo a ênfase do curso na inovação e aplicação prática de tecnologias em diferentes contextos do e-commerce e gerenciamento de sistemas.",
    "Palavras-chave": "Marketplace; Sistema de Gerenciamento de Pedidos; Comércio Eletrônico.",
    "Introdução": "O dinamismo crescente no mercado não apenas intensifica a concorrência e a incerteza nos setores econômicos, mas também apresenta novos desafios de gestão, demandando práticas inovadoras na concepção e administração das cadeias de suprimentos (Simão; Gonçalves, 2015). As empresas, cada vez mais dependentes da capacidade gerencial, buscam elevar sua competitividade, reduzir custos e aprimorar a qualidade em comparação com os concorrentes (Guissoni; Farinha, 2019). Nesse contexto, torna-se imperativo que as empresas desenvolvam novos modelos de gestão, visando atender e, se possível, superar as expectativas dos clientes (Durski, 2003). Com o objetivo de aprimorar seu desempenho, empresas de diversos setores têm implementado novas estratégias logísticas. A excelência nessas atividades não apenas resulta em melhorias significativas no atendimento ao cliente, na eficiência e na confiabilidade dos processos logísticos, mas também contribui para a redução de custos (Leuschner; Charvet; Rogers, 2013). As novas tecnologias de comunicação têm proporcionado facilidades que transformaram os relacionamentos no mundo dos negócios, principalmente entre empresas e consumidores. Nesse contexto, uma das estratégias em voga é a entrada no mercado virtual. Logo, é notável que no século XXI, os avanços tecnológicos exponenciais foram impulsionados pela disseminação generalizada do acesso à internet. Nesse cenário, as operações comerciais e o comércio eletrônico desempenharam papéis fundamentais, contribuindo de maneira decisiva para transformações organizacionais (Franco; Maia; Souza Filho, 2020). No Brasil, em 2017, o faturamento do e-commerce atingiu aproximadamente 60 bilhões de reais (Ebit, 2018). Assim como no mundo físico, esse mercado abriga grandes empresas, geralmente líderes em seus segmentos, com uma significativa participação nas vendas. Além delas, há a presença de pequenas e médias empresas engajadas em vendas online. Esse modelo, conhecido como marketplace, é um ambiente virtual onde compradores e vendedores se encontram para realizar transações comerciais. Esse mercado desempenha três funções principais: facilitar o encontro entre compradores e vendedores, simplificar a troca de informações, bens, serviços e pagamentos relacionados à transação, e oferecer uma infraestrutura que viabilize o funcionamento eficiente desse ambiente (Cheah; Phau; Liang, 2015; Turban; Lee; King; Liang; Turban, 2009). Em um mundo cada vez mais conectado e digital, os marketplaces surgem como plataformas essenciais para os negócios online. Segundo Pasquali (2023), o comércio eletrônico tem apresentado crescimento contínuo nos últimos anos, principalmente após as restrições causadas pela pandemia do Covid-19. O período de pandemia ocasionou um aumento significativo das vendas através de marketplaces. Contudo, gerir pedidos em diversos marketplaces pode ser uma tarefa complexa e trabalhosa. Considerando essas necessidades, é imperativo ter sistemas eficazes de gerenciamento de pedidos. Lovelock, Wirtz e Hemzo (2011, p. 143) afirmam que a utilização de vários canais para entregar o mesmo serviço não tem somente várias implicações de custo para a empresa fornecedora, mas também afetam em muito a natureza da experiência do serviço para o cliente pelas diferentes velocidades, ambientes, interação, e graus de praticidade oferecidos. Gerando uma necessidade para garantir a satisfação do cliente, que depende da eficiência com que suas ordens são processadas e entregues. Os vendedores, por sua vez, estão sob constante pressão para otimizar seus processos. Em um ambiente altamente competitivo como o dos marketplaces, pequenos deslizes podem resultar em perdas significativas. Um sistema eficiente não só garante a satisfação do cliente, mas também proporciona aos vendedores uma vantagem competitiva, facilitando a gestão de pedidos de múltiplas fontes com precisão. Tendo em vista estes desafios, a implementação de um sistema capaz de auxiliar e gerenciar essas tarefas se torna essencial. Esse sistema deve ser capaz de consolidar pedidos de diferentes plataformas, garantir atualizações em tempo real e permitir a automação de processos. Isso não apenas melhora a eficiência operacional, mas também ajuda os vendedores a se adaptarem rapidamente às mudanças no comportamento do consumidor ou às tendências do mercado.",
    "Conclusão": "O desenvolvimento do protótipo do sistema de gerenciamento de pedidos para marketplaces alcançou resultados significativos, atendendo aos objetivos propostos. O levantamento de requisitos, conduzido em colaboração com usuários e vendedores, estabeleceu parâmetros iniciais fundamentais para a concepção da aplicação. A análise de requisitos, inserida na primeira iteração do modelo iterativo e incremental, guiou o formato e as funcionalidades do sistema. A escolha estratégica de tecnologias e ferramentas, como MongoDB Atlas, Visual Studio Code e Node.js, destacou-se na implementação das funcionalidades essenciais. O MongoDB Atlas desempenhou um papel crucial no armazenamento e gerenciamento eficiente de dados, oferecendo flexibilidade de esquema, escalabilidade e robustos recursos de segurança. A visão geral do sistema, abrangendo funcionalidades como login, gestão de anúncios, pedidos, dados, configurações e contato, reflete uma abordagem centrada na experiência do usuário. A integração do Selenium para coleta de dados de diferentes marketplaces contribuiu significativamente para a atualização automática e precisa das informações, ampliando a funcionalidade do sistema. As páginas funcionais apresentaram uma interface intuitiva e eficiente. A análise detalhada dessas páginas evidenciou a importância de cada uma na eficiência operacional e na melhoria da satisfação do cliente. Durante o desenvolvimento do sistema, vários obstáculos foram enfrentados. Um dos principais desafios foi a integração com diversas plataformas de e-commerce, exigindo a análise individual entre as escolhidas para conseguir fazer as conexões sem erros. Este projeto proporcionou uma solução unificada para o gerenciamento de pedidos de múltiplas plataformas, ele simplifica e otimiza os processos para os comerciantes, uma vez que a automatização de várias tarefas reduz o tempo e o esforço necessários para gerenciar operações de e-commerce. O sistema demonstrou ser capaz de coletar informações de pedidos e anúncios de múltiplos marketplaces de forma eficaz, garantindo a precisão dos dados e uma experiência de usuário contínua e sem interrupções. As tecnologias escolhidas para o desenvolvimento, como o MongoDB Atlas e Node.js, provaram ser adequadas para as necessidades do projeto, oferecendo escalabilidade e desempenho. Olhando para o futuro, sugestões para aprimoramento incluem a integração com plataformas de mídias sociais e marketing, a automação de marketing, funcionalidades de personalização para usuários, suporte multilíngue e análises preditivas. Essas adições planejadas visam ampliar as capacidades do sistema, tornando-o ainda mais adaptável e eficiente para enfrentar os desafios dinâmicos do comércio eletrônico. Em síntese, o sistema de gerenciamento de pedidos demonstrou estar alinhado com as necessidades específicas de marketplaces, contribuindo para uma gestão ágil, segura e adaptada às nuances do dinâmico cenário do comércio eletrônico. O compromisso com a inovação e o uso de tecnologias modernas destacaram-se como pilares do sucesso na consecução dos objetivos propostos."
}