{
    "Autor": "Laila da Silva Scheffer",
    "Título": "Avaliação da Usabilidade e elementos de Gamificação de E -commerces sob a ótica de usuários e especialista",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Profa. Dra. Andréa Cristina Trierweiller",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho tem como objetivo avaliar a usabilidade e gamificação de E-commerces sob a ótica de usuários e especialista. Dentre os objetivos específicos, está a realização de pesquisa de campo com usuários e pesquisa com checklist de elementos de gamificação em E-commerces com especialista, verificando-se, dentre vários aspectos, as vantagens e desvantagens da compra online. Os procedimentos metodológicos consistem em uma pesquisa classificada como exploratória, descritiva e qualitativa composta por etapas como análise de professores especialistas, grupo foco, pré-teste e levantamento em larga escala através de questionário, captando 91 (noventa e uma) respostas válidas junto aos usuários de E-commerce. Evidenciam-se, como resultados, a satisfação dos usuários acerca da usabilidade dos E-commerces avaliados, além da percepção positiva sobre o envolvimento que elementos de gamificação poderiam gerar neste contexto. Destaca-se a baixa utilização de elementos de gamificação nos E-commerces analisados, o que demonstra um potencial a ser explorado, em trabalhos futuros. Dentre os E-commerces com mais elementos de gamificação destacam-se Mercado Livre e Adidas.",
    "Palavras-chave": "E-commerce. Gamificação. Usabilidade. Compra online.",
    "Introdução": "Com a popularização da Internet muitas interações foram modificadas, dentre elas as relações de comércio. No primeiro semestre de 2020 os E-commerces tiveram recorde de faturamento em 20 anos, chegando ao número de R$38,8 Bilhões (E-BIT, 2020). Identificado o potencial desse meio, faz-se necessário aplicar as Tecnologias de Informação e Comunicação para melhoria e desenvolvimento deste canal, que tem crescido e se tornado parte de diversos segmentos de negócios. A gamificação é uma aplicação, relativamente recente, que aliada à tecnologia está ganhando espaço com as mais variadas finalidades. Segundo Hamari (2013) serviços que necessitam de um comportamento mais racional para utilização, como o E-commerce, são propensos a serem gamificados o que indica um grande potencial para utilizar a gamificação para fidelização, construção de confiança e conversão em E-commerces. Entretanto, Nielsen e Loranger (2006) identificam que a usabilidade de uma plataforma é um fator de qualidade, que demonstra a facilidade de uso da mesma. Winckler (2001) complementa que problemas relacionados à usabilidade em sites de E-commerce podem acarretar em redução de vendas significativas e, até mesmo venda alguma. Neste cenário, o estudo de várias características e recursos tecnológicos disponíveis para aumentar o engajamento de clientes e, consequentemente, o aumento das vendas nos sites de E-commerce são temáticas em ascensão nos negócios online. E, portanto, o TCC (Trabalho de Conclusão de Curso) buscará explorar questões como usabilidade, gamificação, vantagens e desvantagens na compra online, dentre outras que surgiram no aprofundamento da revisão de literatura. Para tanto, declara-se os seguintes objetivos.",
    "Conclusão": "Ao retomar o objetivo principal deste trabalho: avaliar a usabilidade e gamificação de E-commerces sob a ótica de usuários e especialista, verifica-se que o mesmo foi alcançado bem como os objetivos específicos. Inicialmente, houve o levantamento de dados secundários referente às temáticas de estudo. A partir do levantamento de literatura ocorreu a identificação e a melhoria de questionários sobre usabilidade e gamificação. Com os questionários aprimorados então, procedeu-se à pesquisa de campo com os usuários e a criação e aplicação da checklist de elementos de gamificação em E-commerces, realizada pela especialista. A pesquisa com os usuários proporcionou verificar as vantagens e desvantagens das compras online, assim como das compras em lojas físicas, através do retorno dos respondentes. Quanto à usabilidade, os usuários se mostraram, em sua grande maioria, satisfeitos com os fatores pesquisados referentes a: Gosto, Aprendizagem, Ajuda, Controle e Eficiência. Em relação à gamificação, os usuários se mostraram propensos a ter um maior envolvimento com E-commerces que possuíssem elementos de gamificação pesquisados, e relacionando com os dados levantados pela análise da especialista, apresentam potencial a ser explorado em E-commerces, já que a maioria, apresentou poucos elementos de gamificação. Evidenciam-se, como resultados, a satisfação dos usuários acerca da usabilidade dos E-commerces avaliados, além da percepção positiva sobre o envolvimento que elementos de gamificação poderiam gerar neste contexto. Destaca-se a baixa utilização de elementos de gamificação nos E-commerces analisados, o que demonstra um potencial a ser explorado, em trabalhos futuros. Dentre os E-commerces com mais elementos de gamificação destacam-se Mercado Livre e Adidas. Assim, há inúmeras possibilidades de estudos futuros. Como sugestão tem-se: a criação de um framework de E-commerce, baseado em gamificação; novas pesquisas com uma amostragem maior buscando representatividade; entrevistas com profissionais de E-commerce de empresas, que apresentam preocupação em inserir elementos de gamificação para aumento da fidelização e recompra."
}