{
    "Autor": "Paula Casagrande Bristot",
    "Título": "A Representação das Personagens Femininas nos Games",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho abrange a área de jogos eletrônicos com foco na forma como a mulher é representada dentro do game. O objetivo desse trabalho é apresentar como os games se consolidaram como indústria, mostrando que ela possui um público alvo que é o público masculino. A partir desse pré suposto será discutido como isso e outros fatores acarretam na falta de representação feminina nos games. Serão apresentados também alguns games e personagens que evidenciam os estereótipos negativos presentes, mas também serão mostradas personagens que representam como é possível haver diversidade na representação da mulher. Ainda serão apresentados alguns elementos que contribuem para a construção do game dando um foco maior na construção das personagens femininas.",
    "Palavras-chave": [
        "Mulheres",
        "Games",
        "Personagens",
        "Estereótipos",
        "Representatividade"
    ],
    "Introdução": "Os jogos eletrônicos nunca estiveram tão presente na vida das pessoas como estão desde a última década. A resposta para este fato está ligada ao avanço tecnológico e massificação da tecnologia e internet. Contudo, o início do estudo e primeiro protótipo de jogo eletrônico datam de 1940 quando alguns jogos clássicos eram implementados em algum sistema mecânico (PARRY, 2012). Em 1958, surgiu aquele que foi considerado o primeiro game (LEITE, 2006). Desde então os games passaram a evoluir juntamente com computadores e novas tecnologias de hardware e software, o que possibilitou que os mais diversos mundos de fantasia ou realidade sejam representados com qualidade estando disponíveis em diferentes plataformas (LEITE, 2006). Os games são produtos que estão voltados para o entretenimento e seus desenvolvedores buscam sempre inovar, pois seus consumidores são exigentes e prezam por qualidade e criatividade. A mulher é pouco reconhecida como jogadora, ainda busca por representatividade (IZUKAWA, 2015). A indústria de games já a maior no ramo do entretenimento, movimentando bilhões de dólares anualmente e atrai como público ambos os gêneros de todas as faixas etárias. Porém, seu público alvo ainda é o gênero masculino que é visto pela indústria como seu maior consumidor (IZUKAWA, 2015). Esse fator acaba influenciando na forma como a mulher é representada nos games. Os estereótipos negativos impregnados a imagem da mulher comprovam como os games são produzidos para esse público excluindo a mulher como jogadora. Nesse trabalho os termos mais utilizados serão jogos eletrônicos e games, pois estes abrangem os jogos de todas as plataformas.",
    "Conclusão": "Este trabalho analisou a representação das personagens femininas nos games. Bem como, questionou a forma como a mulher é apresentada nesse universo, apresentando sugestões e propostas para a representação da figura feminina nos games. De acordo ao que foi apresentado referente e sugestões e propostas, uma personagem feminina é representativa quando é livre de estereótipos, sejam eles estéticos ou narrativos, e quando a ela não é a versão feminina do homem. Ela deve possuir movimentos, expressões corporais e vestimentas bem desenvolvidas e apropriadas às condições e situação a qual enfrenta, bem como uma personalidade e características próprias que não estejam vinculadas a um personagem masculino. Ao olharmos para a trajetória dos jogos eletrônicos e todas as transformações pela qual passou, podemos perceber como ela se tornou umas das líderes em entretenimento. Contudo, o fato do game ainda ser visto culturalmente como atividade masculina, influencia na forma como a mulher é representada nesse meio e como ela é vista como jogadora. Essa forma de retratar a mulher de modo estereotipado acaba reforçando que existe um único modelo a ser seguido, não possibilitando a representação da diversidade existente e acaba por excluir a mulher como consumidora de games. Por esse fato é importante haver mais personagens femininas como forma de mostrar que os games não são exclusivos para público masculino e como uma forma de acabar com os preconceitos existentes com a figura da mulher e a mulher como gamer. Devido ao que foi apresentado nesse trabalho, fica visível que os estereótipos podem se manifestar de diversas formas nos diferentes gêneros de games e diferentes personagens. O fato de haverem personagens que não apresentam estereótipos negativos, nos mostra que há a possibilidade de construir personagens femininas de forma diferentes, sem que elas percam em desenvolvimento narrativo, podendo se tornar reconhecida pelas suas habilidades, personalidade e até mesmo pela aparência. Porém, esse tipo de personagem ainda é pouco vista nos games se comparado às inúmeras outras que são estereotipadas. Nesse trabalho não cabe taxar os games que apresentam mulheres de forma estereotipada de erros, pois querendo ou não eles fazem parte da diversidade e vão continuar vendendo pelo fato de existirem pessoas que gostam e apreciam esses games. Podemos apreciar e gostar deles, porém é importante um olhar crítico sobre como se dá a representação feminina e como é importante que haja mudanças. A forma como a mulher é apresentada visualmente e os clichês narrativos também são reflexos culturais de como a mulher é vista na sociedade. A luta das mulheres por igualdade e a quebra do paradigma do sexo frágil vem acontecendo há anos. Aos games, por serem uma mídia grandiosa e influenciadora tem como dever incluir, apresentar a diversidade existente, assim como aceitar a existência da mulher como gamer. As pesquisas em relação à representação das minorias nos games é um tema pouco explorado. Por tudo o que foi mostrado e discutido espera-se que este trabalho tenha contribuído e apresentado novos olhares quanto a representação da mulher nos games. Para trabalhos futuros fica como sugestão a exploração a temas como a própria estereotipação dos personagens masculinos que também está presente nos games e a necessidade da inclusão de personagens afrodescendentes, homossexuais, transexuais e pessoas com necessidades especiais."
}