{
    "Autor": "Matheus Schramm Aragonez",
    "Título": "Predisposição quanto ao uso do mobile banking : motivadores e barreiras apontadas pelos usuários",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Andréa Cristina Trierweiller",
    "Coorientador(a)": "",
    "Resumo": "Este TCC teve o objetivo de analisar fatores de resistência e motivações de usuários e potenciais usuários quanto à utilização do mobile banking. Foi realizado o estudo que pretende analisar a predisposição, barreiras e motivações quanto ao uso do mobile banking por meio de aparelhos móveis, como celular e tablet, de usuários ou não, dos serviços oferecidos pelos bancos. No que se refere aos participantes, 93,2% dos respondentes afirmaram utilizar o m-banking do seu banco. Contudo, alguns pontos se apresentam contraditórios, como o fato de haver tantos registros quanto ao aumento de smartphones pela população, e ainda, ser constatada resistência quanto ao uso das suas funcionalidades, que poderiam trazer melhorias no dia a dia dos clientes, como ganho de tempo e praticidade em operações financeiras pelo aplicativo.\n\nPalavras -chave: Mobile banking, Resistência, Motivações.",
    "Palavras-chave": [
        "Mobile banking",
        "Resistência",
        "Motivações"
    ],
    "Introdução": "Neste capítulo serão apresentados o contexto em que o estudo é desenvolvido, a justificativa e a relevância do trabalho bem como o objetivo geral e objetivos específicos. Neste TCC, optou-se por apresentar a justificativa e a relevância da temática, nesta seção de Introdução, utilizando como base os Relatórios da FEBRABAN – Federação Brasileira de Bancos, a qual publica tais relatórios, periodicamente, com informações sobre o segmento bancário. Há mais de 20 anos, que a FEBRABAN realiza pesquisa junto às instituições bancárias mais importantes, a fim de acompanhar o seu desenvolvimento e investimentos nas Tecnologias da Informação e Comunicação (TICs). Essas pesquisas mostram que, de 2009 a 2013, os acessos a esses canais já eram considerados relevantes, uma vez que os bancos têm investido pesado nas novas tecnologias (FEBRABAN, 2018). Sendo assim, por diversos anos, internet e mobile banking (m-banking) têm sido percebidos como os canais do futuro (FEBRABAN, 2013). Os investimentos resultaram em um crescimento significativo, tanto no meio físico (Agências Bancárias, ATMs e Correspondentes) quanto no digital (Internet e mobile banking). Em 2016, o Mobile Banking se destacou, com um crescimento de 140% em transações com movimentação financeira (FEBRABAN, 2017). Em 2017 houve um aumento de 1,6 milhão de contas abertas por mobile banking no Brasil – três vezes mais do que no ano anterior, isso é reflexo da preocupação das instituições em melhorar os atendimentos aos pontos físicos, como as agências, ATMs (Automatic Teller Machine, ATM, sigla em inglês, que significa Caixas Eletrônicos), PVC (Pontos de Venda no Comércio), PAE (Posto de Atendimento Eletrônico), PAB (Posto de Atendimento Bancário); atendendo assim, às necessidades de toda a clientela (FEBRABAN, 2018). Em 2013 foi registrado aumento da aceitação do uso das novas tecnologias por parte da população, em 2017 o mobile banking se firmou como o canal preferido para transações bancárias. Dessa forma, parece que, os clientes demonstraram confiança nos aplicativos e reconheceram os investimentos dos bancos em segurança, chegando a 59 milhões de contas ativas no m-banking (FEBRABAN, 2018). Porém, os altos investimentos das instituições bancárias em novas tecnologias, de modo a oferecer segurança, conforto e maior acesso aos seus clientes não está restrito apenas aos meios digitais, mas incluem os meios físicos (FEBRABAN, 2017). Em relação ao avanço dos canais digitais, o Relatório da FEBRABAN (2018, p. 26) coloca que: Com um número maior de transações com movimentação financeira – aquelas mais sujeitas à percepção de riscos –, os canais digitais registraram aumento dessas transações, de 4,4 bilhões, em 2016, para 5,3 bilhões, em 2017. Comparando-se com canais como POS (que opera exclusivamente transações financeiras) e o grupo formado por agências, ATMs, contact center e correspondentes, os canais digitais ainda ocupam a menor participação nas transações financeiras – 21% em 2017, ante, respectivamente, 37% e 42% dos demais canais. O ritmo de aumento, no entanto, sinaliza o quanto os consumidores voltam-se ao digital para operar recursos financeiros, percebendo os resultados dos altos investimentos que os bancos também fazem em segurança da informação. Essa afirmação, pode ser constatada a partir de análise junto aos dados da pesquisa FEBRABAN (2018, p. 26), que registra os canais mais usados nas transações com movimentações financeiras entre 2011 e 2017. Segundo o relatório da FEBRABAN (2019, p. 3), as transações bancárias com movimentação financeira cresceram 33% nos canais digitais, no mobile banking, esse crescimento foi de 80%.",
    "Conclusão": "No momento em que a concorrência das empresas está relacionada àquela que apresentar maior comodidade, facilidade de acesso ao seus serviços e produtos e respostas que satisfaçam as necessidades de seus consumidores, faz-se cada vez mais urgente que as mesmas se interessem em conhecer os seus usuários, saber quais são os seus desejos e buscar atender à demanda. Sendo assim, o foco não se trata apenas de manter a clientela, mas ampliá-la. Com base na pesquisa realizada ficou evidente alguns pontos que se apresentam contraditórios como o fato de haver tantos registros quanto ao aumento de smartphones pela população, e ainda, ser constatada resistência quanto ao uso das suas funcionalidades, que poderiam trazer melhorias no dia a dia dos clientes, como ganho de tempo e praticidade em operações financeiras, via aplicativo. Por outro lado, a pesquisa deste TCC corrobora com os estudos feitos pela FEBRABAN (2019), que demonstram que as tecnologias estão na sociedade para serem estudadas, compreendidas e utilizadas por fazerem parte da cultura do povo. Assim, cedo ou tarde, acabam alcançando maior adesão e acabam por entrarem no cotidiano dos clientes, facilitando sua relação com as inúmeras organizações que consomem produtos e serviços, como é o caso do mobile banking. Como oportunidade de estudos futuros está ampliar o levantamento, via survey, com um maior número de usuários e potenciais usuários do m-banking para assim, obter resultados mais consistentes. E ainda, outras metodologias, métodos e técnicas para levantamento e tratamento de dados podem ser utilizadas. Conforme identificado na literatura, há muitos estudos que utilizam teste de hipóteses, o que parece retornar resultados robustos com reflexões interessantes e confiáveis. Em relação ao objetivo geral: Analisar os fatores de motivação e resistência de usuários e potenciais usuários quanto à utilização do mobile banking, considera-se que este objetivo foi alcançado com a realização da pesquisa survey e análise dos resultados, apresentados no capítulo anterior. Quanto aos objetivos específicos, considera-se que os mesmos foram atendidos, tendo sido feito o levantamento de literatura dos principais temas relacionados ao estudo, com foco nos relatórios da FEBRABAN; foi apresentado, de forma breve, o histórico e evolução do sistema financeiro brasileiro e o uso do mobile-banking; foi realizada a pesquisa survey com 118 respondentes. Enfim, foram traçadas possíveis recomendações, com base nos resultados da pesquisa junto aos usuários. Enfim, o cenário é promissor, em que o mobile banking se consolida como um canal eficaz para a prestação de serviços bancários aos seus clientes, desde consulta de saldos bem como transações financeiras. Portanto, mesmo diante da resistência verificada por muitos clientes, as instituições devem continuar investindo em soluções e facilitando o acesso para seus clientes."
}