{
    "Autor": "Gabriela da Silva Cândido; Henrique Lopez Blanck",
    "Título": "Capital de Risco no Brasil: Programas Públicos Voltados a Empresas de Base Tecnológica",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Paulo Cesar Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "Modelos econômicos mais flexíveis são fundamentais para a economia do país, uma vez que para sobreviver a crises econômicas e mercados voláteis é preciso estar em constante adaptação. Diante deste cenário, o desenvolvimento e criação de empresas jovens e inovadoras são essenciais para o fortalecimento da economia devido à sua facilidade de adaptação. No entanto, devido ao alto custo, risco e incerteza atribuídos aos investimentos em projetos de inovação em empresas jovens, incentivos governamentais se fazem necessários. Com isso, o presente trabalho tem como principal objetivo, apresentar como o Capital de Risco aliado a políticas públicas pode ser uma ferramenta essencial no desenvolvimento tecnológico e inovativo do país. Pretende-se alcançar esse objetivo apresentando um histórico internacional e nacional sobre Capital de Risco, explicando algumas de suas principais características e também destacando as principais políticas de incentivo à inovação no Brasil, e finalmente retratando a importância das instituições públicas de fomento para o desenvolvimento da inovação em empresas brasileiras de base tecnológica. Assim, o presente trabalho de conclusão de curso pode ser categorizado como uma pesquisa de objetivo exploratório, com abordagem qualitativa, a qual utilizou procedimentos de pesquisa bibliográfica e documental.",
    "Palavras-chave": "Capital de Risco, Inovação, Instituições Públicas de Fomento, Pesquisa e Desenvolvimento",
    "Introdução": "A política econômica, por diversos anos, foi direcionada aos grandes grupos econômicos e grandes empresas, uma vez que eles eram considerados essenciais para a estabilidade econômica. Porém, diante da realidade e crises econômicas é possível encontrar deficiências neste modelo, pois este não possui impacto suficiente no âmbito regional, além de não ser um modelo flexível, ou seja, ele não possui uma facilidade de adaptação à mercados voláteis não tendo, portanto, capacidade de reagir com rapidez às mudanças, comprovando que para obter um modelo econômico sustentável e flexível é fundamental o desenvolvimento e criação de empresas jovens e inovadoras, devido à sua facilidade de adaptação e capacidade em colaborar com a atenuação da taxa de desemprego regional. Desta forma pode-se relacionar o empreendedorismo como uma oportunidade de ajudar no crescimento econômico do país, melhorando o bem-estar social e regional. No entanto, para que uma pequena ou média nova empresa (PME), com propostas tecnológicas e inovadoras, consiga se destacar no mercado, se fazem necessárias políticas públicas que incentivem um modelo de investimento onde essas empresas consigam financiamento e recursos para se desenvolverem. Uma vez que realizar investimentos a longo prazo em uma PME é altamente arriscado devido às incertezas atribuídas a ela. Por este motivo, existe um desinteresse nesse estilo de investimento. Além da dificuldade em obter investimento, realizar empréstimos também é algo inviável para as PMEs, devido às taxas de juros, que costumam ser elevadas e com curto prazo. Consequentemente, o pagamento de juros, resgates e amortizações se tornam encargos onerosos às empresas jovens, por conta das mesmas necessitarem de consideráveis quantidades de capital no seu período de crescimento. Portanto, levando em consideração as peculiaridades de risco e incertezas das PMEs, pode-se concluir que, elas precisam de uma forma de financiamento especial. Dentro deste cenário, surge o conceito de Capital de Risco. Ou seja, uma forma de financiamento com regulamentações específicas para incentivar geração de inovação em PMEs. Sua importância, no entanto, vai além de ajudar uma PME, pois esse método de investimento contribui para o fortalecimento da indústria do conhecimento e de inovação. Uma vez que o crescimento e o surgimento de empresas voltadas para a inovação também são essenciais para a manutenção, diversidade e constante evolução tecnológica, as quais são fundamentais para o desenvolvimento econômico. Dado que as organizações mais aptas terão mais oportunidades de sobreviver no mercado. Quando as organizações inovam, elas não só processam informações, de fora para dentro, com o intuito de resolver os problemas existentes e se adaptar ao ambiente em transformação. Elas criam novos conhecimentos e informações, de dentro para fora, a fim de redefinir tanto os problemas quanto as soluções e, nesse processo, recriar seu meio. (NONAKA; TAKEUCHI, 2004) Dessa forma, as inovações tecnológicas exercem um importante papel para o desenvolvimento dos países, com intuito de alcançar uma posição relevante frente às potências mundiais. No Brasil, em conjunto com o Capital de Risco, também é importante destacar a função das instituições públicas de fomento nesse processo de desenvolvimento industrial e melhoria da condição tecnológica do país, os quais possuem altos custos de realização e riscos elevados. Pode-se destacar o BNDES (Banco Nacional de Desenvolvimento Econômico e Social) e a FINEP (Financiadora de Estudos e Projetos) como principais instituições públicas no apoio do desenvolvimento de inovação e tecnologia do país. Assim, o presente trabalho de conclusão de curso foi realizado almejando responder a seguinte pergunta: qual a importância do Capital de Risco operado pelas principais instituições públicas de fomento como mecanismo de financiamento às empresas de base tecnológica e incentivos à inovação do país?",
    "Conclusão": "A inovação é um importante fator para o desenvolvimento econômico do país, contudo dados os riscos e as incertezas atribuídos ao processo de inovação, é necessário um aperfeiçoamento de políticas públicas que incentivem diferentes formas de financiamentos. Com isso, ao longo deste trabalho, foram apresentados conceitos de Capital de Risco e Inovação e discutido como o Capital de Risco aliado a políticas públicas pode ser uma ferramenta essencial no desenvolvimento tecnológico e inovativo do país. Neste sentido, buscou-se apresentar um histórico internacional e nacional sobre Capital de Risco, explicando algumas de suas principais características e também, destacar as principais políticas de incentivo à inovação no Brasil, discutindo sobre as legislações que incentivam o avanço da ciência e tecnologia do país, e também apresentando a importância das instituições públicas de fomento para o desenvolvimento da inovação em empresas brasileiras de base tecnológica. As leis em destaque nesse trabalho foram a Lei de Inovação, que busca incentivar parcerias entre o público e o privado com intuito de estimular a inovação, desenvolvimento de pesquisa científica e tecnológica no ambiente produtivo; a Lei do Bem, cujo objetivo é encorajar o setor privado a realizar investimentos no desenvolvimento de novas tecnologias, através de incentivos fiscais, e também uma maior aproximação entre universidades e centros de pesquisa; e o Novo Marco Legal, o qual visa estimular o desenvolvimento científico, tecnológico e inovativo com pesquisas e capacitação científica. Também abordou-se a importância das instituições públicas de fomento, FINEP e BNDES, as quais apresentaram uma enorme variedade de programas voltados para o financiamento de inovação em Micro, Pequenas e Médias Empresas (MPMEs), em especial os programas de apoio por renda variável como o INOVAR da FINEP e o CRIATEC do BNDES. Foram citadas algumas regulamentações de fundos de Capital de Risco, como também a nova lei que muda a regulamentação para investidores anjos, o que mostra que o mercado nacional de Capital de Risco está em constante adaptação para que ambos, investidores e investidos, sejam favorecidos. Ao final, foi apresentada uma análise sobre as empresas investidas com Capital de Risco e Private Equity no Brasil, mostrando que a área de Tecnologia e Informação tem recebido bastante investimento, porém com um baixo valor se comparado com as outras áreas. Dentro dessa discussão, nota-se que a política industrial brasileira ainda possui algumas questões a serem revistas, uma vez que o avanço tecnológico e inovativo não ocorre de forma homogênea no setor industrial do país. Portanto, uma melhoria na política industrial, afim de torná-la melhor distribuída para os diversos segmentos industriais, é algo que poderia trazer mais investimentos para o país. Uma das maiores dificuldades do presente trabalho foi encontrar pesquisas do setor de Venture Capital no Brasil onde pudesse ser analisado o setor como um todo, incluindo desde pequenos investidores anjo até grandes fundos. Apesar da “Consolidação de Dados da Indústria de Private Equity e Venture Capital no Brasil” desenvolvido pela Associação Brasileira de Private Equity & Venture Capital, ser o estudo mais recente e atual sobre o tema, nele os dados de Venture Capital e Private Equity estão unidos e o estudo também não levou em consideração as atividades de aceleradoras, incubadoras e investidores anjos. Enfim, o governo brasileiro possui um importante papel no fomento das novas tecnologias no Brasil, com um importante objetivo de melhorar a competitividade dos produtos brasileiros em relação ao comércio internacional, afim de alcançar uma boa posição dentro da economia mundial. No entanto, é possível observar, que ainda existe uma insuficiência de recursos para estimular o apoio em empresas de base tecnológica que estão em fase inicial, uma vez que muitos fundos de renda variável são voltados para empresas que já estão melhor consolidadas no mercado, e este recurso seria essencial para alavancagem dessas empresas. Por isso, para o avanço e valorização da indústria brasileira, a continuação dos programas que incentivam a inovação é de suma importância, bem como o incentivo ao financiamento privado, com a intenção de fazer com que o Brasil consolide a cultura de inovação."
}