{
    "Autor": "Natalia Maldaner",
    "Título": "Computação afetiva aplicada à educação: uma proposta ao Sistema Tutor Inteligente MAZK",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "A Inteligência Artificial está inserindo-se no ambiente educacional de forma acelerada, e com isso, culminando em tecnologias facilitadoras, como é o caso dos sistemas tutores inteligentes. Paralelamente, teorias sugerem que a afetividade do comportamento humano possui ligação com o processo cognitivo, e com isso, torna-se fundamentalmente importante conciliarmos as emoções com o processo de aprendizagem no ambiente educacional. Os professores são capazes de usar-se da empatia para compreender estados emocionais do aluno e intervir quando necessário, contudo, ao considerarmos tutores inteligentes, ainda enfrentam-se desafios. Tendo em vista isso, a Computação Afetiva é a área de estudo que se dedica a encontrar mecanismos para inferir emoções em máquinas, e neste trabalho, o objetivo é realizar um estudo a partir dela, visando elaborar uma proposta para dotar o Sistema Tutor Inteligente MAZK de capacidades afetivas. Para tanto, a abordagem metodológica utilizada deu-se através da pesquisa qualitativa e exploratória. A partir disso, observou-se que é possível inserir um módulo reconhecimento afetivo no MAZK, e permitir que o sistema intervenha de maneira empática em situações que sugerem que o aluno está desmotivado e com maiores dificuldades, ao passo que fornece feedbacks positivos aos alunos com bom desempenho. Este reconhecimento é possível utilizando-se de técnicas como análise de expressões faciais, comportamento observável e análise avaliativa.",
    "Palavras-chave": [
        "Computação Afetiva",
        "Sistema Tutores Inteligentes",
        "MAZK",
        "Tecnologias Educacionais"
    ],
    "Introdução": "A Inteligência Artificial (IA) abrange diversas áreas da computação, incluindo-se a educação, onde seu potencial é desmedido. A IA na Educação (IAED) caracteriza-se em termos pela tecnologia IA aplicada a educação, e agrega duas grandes áreas: a Ciência da Computação e a Ciências da Aprendizagem - uma área ainda pouco difundida no Brasil, que reúne diferentes campos do conhecimento, tais como psicologia, ciência cognitiva, antropologia, linguística, neurociência (entre outras). (CIEB, 2019). Nessa perspectiva, a IAED tem por objetivo compreender de forma aprofundada como os processos de aprendizagem ocorrem, e estudar mecanismos tecnológicos nesta mesma linha (CIEB, 2019). Em meio a este contexto, os Sistemas Tutores Inteligentes (STI) são casos reais de aplicação da IAED com o intuito de melhoria do ensino e aprendizagem, uma vez que são capazes de fornecer uma assistência individual especializada (JAQUES, 2019). Embora os STIs sejam atualmente muito eficientes, ainda precisa-se explorar outros campos que podem melhorar a experiência por parte dos alunos. Vários pesquisadores da área de IAED dirigem seus esforços a desenvolver tutores computacionais que sejam tão eficazes quanto tutores humanos (VANLEHN, 2011). Todavia, um dos entraves para que pesquisadores desenvolvam a tecnologia nesse aspecto, é a necessidade dos tutores inteligentes serem capazes de examinar sistematicamente o estado afetivo do aluno e suas relações com seu aprendizado, conforme apresentado por Picard (2009). Nesse sentido, aborda-se o papel das emoções do estudante em seu processo de aprendizado, uma vez que as emoções do aluno estão diretamente associadas ao processo de aprendizagem dele (JAQUES, 2019). Segundo Bercht (2001) levar em conta as características do aluno de maneira a explorar os conteúdos, com comportamentos cada vez mais inteligentes, instigando-o no processo de aprender, tem sido uma das principais linhas de pesquisa na área. Dessa forma, a preocupação com o estado afetivo do estudante mostrou-se fundamental para os sistemas de ensino, haja vista que os professores reconhecem o papel central da emoção na aprendizagem e como as perturbações emocionais podem interferir (WOOLF et al. 2009). Todavia, apesar desta vantagem, Elbeh (2012) se atém ao fato de que nosso sistema educacional não nos prepara para lidar com situações de estresse e frustração causadas durante o processo de aprendizagem. Portanto, faz-se fundamentalmente importante estudar não tão somente estes aspectos de forma separada, mas também o modo como se relacionam. Segundo Picard (2000), estudantes aprendem menos se eles estão ansiosos, zangados ou deprimidos; estudantes nesses estados não aceitam a informação de maneira adequada. Nesta linha, a área da computação que vem sendo responsável por estudos no que tange o desenvolvimento de reconhecimento de emoções humanas aplicadas a agentes inteligentes chama-se Computação Afetiva. Segundo Jaques, (2019), a Computação Afetiva trata-se de uma área multidisciplinar de pesquisa que investiga como dotar os computadores de várias características sociais, tais como reconhecer emoções e responder apropriadamente a elas, expressar emoções, mostrar empatia, identificar personalidade, entre outros. Atualmente, os STIs que não abstraem as emoções dos alunos e as desconsideram em suas aplicações, enfrentam alguns problemas, como a evasão e falta de engajamento. Um dos fatores que levam a isso é a carência de presença social (cognitiva e de ensino), um importante agente na promoção da aprendizagem. Os alunos lamentam o fato de não terem suficiente assistência inteligente e individualizada e de se sentirem isolados, sem o contato social e humano que existe na educação presencial (GARRISON, 2007 apud JAQUES, 2019). Em conformidade com estes fatos, os pesquisadores interessados nos aspectos afetivos inseridos na IA aplicada à Educação, estão especialmente interessados em reconhecer emoções dos alunos e fazer uso destas na interação entre o sistema tutor e o estudante. Dessa forma, o STI torna-se apto a se adaptar à afetividade do estudante. Mediante a isto, o presente trabalho apresenta estudos quanto a Computação Afetiva aplicada a educação, e empenha-se em formular uma proposta utilizando-se dessas tecnologias no Sistema Tutor Inteligente MAZK. O STI MAZK, que servirá como arcabouço para este trabalho, se define por um STI que tem por objetivo facilitar a obtenção de conhecimento por parte de seus usuários, estes, estudantes em geral (CANAL et al. 2017). Esta ferramenta é capaz de traçar o perfil do usuário, e dessa forma, sugerir materiais, analisar desempenho por cada área, e ainda, pontos fortes e fracos dos estudantes desafiando-os a se aprimorarem onde há necessidade.",
    "Conclusão": "O presente trabalho foi desenvolvido buscando-se atender a seus objetivos expostos. Dentre eles, salienta-se o de buscar compreender os conceitos que circundam as tecnologias relacionadas a Computação Afetiva e IAED, e formular uma proposta de aplicação ao Sistema Tutor Inteligente MAZK. Partiu-se do pressuposto de que a mesma possa ser usada como arcabouço teórico no que tange os recursos necessários para tal aplicação, atendendo a trabalhos futuros. Ao longo desse estudo, constatou-se por diversos autores das áreas de computação, psicologia, dentre outras, que, de fato a afetividade interfere até certo ponto nas atividades cognitivas do ser humano. Com isso, ao se tratar de novas tecnologias, como é o caso do Sistema MAZK, direcionar o foco em integrar essas duas esferas faz-se fundamental para um desempenho mais robusto do tutor. Considerando-se o que compreende o objetivo principal, quanto a ser capaz de formular uma proposta ao Sistema Tutor Inteligente MAZK a partir dos conhecimentos obtidos, foi possível vislumbrar que este objetivo foi alcançado. Para que isso fosse possível, verificou-se num primeiro momento, diferentes métodos de captura de dados que seriam viáveis para o ambiente, seguido dos indicadores necessários para validação de estado afetivos e suas inferências sobre o processo de ensino-aprendizagem. Ainda, elencou-se algumas possíveis metodologias para intervenções inteligentes a serem utilizadas no tutor, com o intuito de estabelecer uma relação afetiva entre STI e aluno, propondo um módulo responsável por tal. Mediante o exposto, foram constatadas algumas técnicas que se mostraram mais adequadas ao contexto do MAZK. Nesse sentido, para detecção dos dados necessários para análise, observou-se que um conjunto de três metodologias podem atender melhor aos critérios estabelecidos. Desse modo, a primeira metodologia escolhida foi a de detecção de expressões faciais, observada como uma das mais importantes formas de captura de dados afetivos. O segundo método escolhido foi o de auto avaliação, cujo o qual o próprio aluno insere informações acerca de seus sentimentos em determinado instante. Por fim, também foi avaliado e proposto o método de observação comportamental, cujo qual se refere aos dados quanto às interações do usuário com a interface. Têm-se que esses três métodos combinados devem ser capazes de fornecer uma boa base para estudo de captura de dados afetivos, uma vez que se complementam em seus objetivos, e validam-se entre si. Ou seja, é possível verificar através das informações do aluno, se de fato ele estava sentindo emoções positivas ou negativas de acordo com o que o sistema inferiu, e assim, tornando o resultado mais consistente. Quanto a segunda etapa da proposta, verificou-se que é de suma importância tratar os dados de forma adequada, uma vez que é essa etapa que interferirá diretamente no objetivo final de estabelecer a relação afetiva no tutor, e que valida o uso dos dados cooptados. Portanto, inferiu-se que, neste caso, a forma adequada de validação dá-se por meio da combinação de indicadores afetivo-cognitivos, ou seja, validação através de valências positivas e negativas. Por fim, na terceira etapa desta proposta, foi possível observar que primordialmente é preciso estabelecer as circunstâncias corretas para intervenção do tutor, a fim de se chegar ao resultado esperado. Não obstante, tão importante quanto, é usar-se da abordagem correta, a fim de não obter-se o resultado oposto ao desejado. Neste trabalho, optou-se por se utilizar de técnicas de incentivos, feedbacks, e indicação de conteúdo. Desta forma, o STI terá o papel de auxiliar aqueles que apresentarem mais dificuldades, sugerindo dicas e materiais, ao passo que avalia positivamente o bom desempenho daqueles que não apresentarem sinais de maiores dificuldades e dados emocionais negativos. Uma vez apresentados estes aspectos, espera-se ser possível que o presente trabalho contribua como apoio e base para desenvolvimento das funcionalidades na plataforma. Se continuados, estes trabalhos podem contribuir, sobretudo, para uma pedagogia virtual mais avançada e próxima da tutoria humana, beneficiando inúmeros estudantes. Outrossim, deverão colaborar para o avanço desta área de pesquisa que, no Brasil é relativamente nova, carecendo de resultados concretos. Portanto, vê-se em trabalhos futuros uma vasta jornada em direção a um tutor mais adaptável e incisivo, no que tange compreender de fato todas as esferas do que engloba a aprendizagem humana. Vislumbrando-se estes trabalhos, é importante destacar que atualmente já existe uma equipe, composta por alunos participantes do LabTeC, cuja qual está trabalhando no processo de reconhecimento facial, com pretensões futuras de ser capaz de abstrair sentimentos de seus usuários. Segundo Silva (2018), está sendo elaborado um dataset próprio de faces capturadas de diferentes pessoas, e com a ajuda de redes neurais convolutivas, será possível reconhecer expressões apresentadas. Com este escopo teórico, almeja-se contribuir com a base necessária para implementar funcionalidades correlatas a Computação Afetiva em trabalhos futuros no Sistema Tutor MAZK. Ainda, sugere-se aqui que, ao aplicar-se a Computação Afetiva, também seja estudada a colaboração dos professores no processo de formulação do método pedagógico a ser utilizado. Isso porque, como exposto neste trabalho, os professores já possuem as capacidades de discernimento no que tange este aspecto da interatividade humana. Ademais, sugere-se ser de suma relevância estudar fatores de acessibilidade, buscando compreender as mais variadas formas de expressões afetivas cognitivas, como pessoas autistas, com síndrome de down, dentre outras. Com isso, pode-se tornar o sistema mais inclusivo e assertivo em seus métodos pedagógicos."
}