{
    "Autor": "Malena de Souza Ramos",
    "Título": "Motivação dos usuários das redes sociais para o engajamento em ações solidárias",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Profª. Drª. Andréa Cristina Trierweiller",
    "Coorientador(a)": "",
    "Resumo": "A inclusão social vem sendo tema bastante debatido, tanto no meio acadêmico, empresarial, quanto pela sociedade como um todo; porém, pouco se faz para que esta inclusão, de fato, aconteça. Assim, o presente trabalho tem como objetivo principal analisar a predisposição dos usuários de redes sociais à participação em ações solidárias, especificamente, doação de roupas, como ferramenta de inclusão social da população de Araranguá -SC, que se encontra em condição de vulnerabilidade socioeconômica. Na fundamentação teórica foi realizada uma análise exploratória da literatura em temas como: políticas de inclusão social no Brasil; programas e serviços de inclusão social à pessoa em situação de rua de Araranguá; Tecnologia da Informação e Comunicação como ferramenta de inclusão social e moda. Ademais, realizou-se levantamento de dados, por meio de um questionário, disponibilizado no Google Forms, obtendo-se 198 respostas válidas, e indicando que, os respondentes são, na maioria, dos Estados da região sul do Brasil, a maior parte com a idade entre 18 e 25 anos, prevalecendo o sexo feminino. A análise de dados da pesquisa, possibilitou identificar a viabilidade de projetos sociais na região de Araranguá, especificamente, de doação de roupas com ações de oficinas para inclusão social, podendo, desta forma, como perspectiva para trabalhos futuros, realizar um bazar / feira, em local público, com as peças arrecadadas por meio das redes sociais, destinadas às pessoas em condição de vulnerabilidade socioeconômica. Enfim, através de ações simples e já incorporadas pela sociedade, como a doação de roupas, pode-se consolidar um espaço de inclusão, em que as redes sociais são o meio a partir do qual, as pessoas geram um grande espaço de divulgação de produtos, ideias e causas. Elas são cada vez mais populares e se traduzem em uma forma de transposição de barreiras, ponto de encontro de diversas classes, etnias, religiões, ideais políticos, em que pese a busca pela redução das desigualdades sociais.",
    "Palavras-chave": "Engajamento em ações solidárias. Projetos Sociais. Moda compartilhada. Redes sociais. Tecnologias da Informação e Comunicação.",
    "Introdução": "No atual contexto, uma significativa parcela da população mundial vive em condições de pobreza, que consequentemente, acabam por afetar sua dignidade bem como sua qualidade de vida. De acordo com o Programa das Nações Unidas para o Desenvolvimento (PNUD), as pessoas em situação de pobreza extrema sobrevivem com menos de 1,25 dólares por dia; sendo que, 2,5 bilhões da população mundial, vivem com menos de dois dólares por dia. Isso inclusive, reflete-se na desigualdade de distribuição de renda no mundo, ou seja, 1% da população mais rica do planeta se apropria de 48% da riqueza mundial (PNUD, 2015). O Brasil é um país com número elevado de pessoas vivendo em condições de miséria, em 2016, a pobreza extrema no país havia sido calculada em 3,4%, da população em situação de desamparo, resultado da prolongada crise econômica, que se refletiu em desigualdade social. O cenário mais pessimista, prevê que a pobreza alcançará 10,3% da população (sendo 20,8 milhões de brasileiros) e em situação de pobreza extrema 4,6% da população, o que corresponde a 9,3 milhões de brasileiros desamparados (ONUBR, 2017). A desigualdade se tornou um grave problema, tanto para a eficiência econômica quanto para a estabilidade social, são inúmeros, os cidadãos brasileiros vivendo abaixo da linha da pobreza, em condições deprimentes, que ferem o que poderia se considerar como digno ao ser humano. Com isso, cada vez mais, a população tem se preocupado em encontrar alternativas para solucionar problemas sociais, em especial, os problemas relacionados à comunidade em situação de vulnerabilidade socioeconômica as quais se expõem, diariamente, a preconceitos, déficit educacional e cultural, além de conviver com a falta de segurança. Diante disso, alternativas são necessárias, pois o Estado já não consegue prover o bem comum a todos, relegando à iniciativa privada e Organizações Não Governamentais (ONGs), o papel que originalmente lhe competia. Pode-se notar, contudo, que as movimentações de ações solidárias têm aumentado, partindo também, de instituições privadas. Além disso, observa-se o maior interesse da sociedade em desenvolver ações, capazes de melhorar as condições de vida das comunidades excluídas (SANTOS, 2012). Neste cenário, faz-se importante o envolvimento e participação da sociedade para alcançar alternativas de inclusão à população em situação vulnerável. Assim, muitas pessoas atuam por um ideal de mudança social, contudo, muitas vezes, desconhecem mecanismos para que suas ações tenham maior repercussão, não sendo apenas iniciativas isoladas. Uma opção seria a atuação em grupo, ligando-se a pessoas que lutam por uma mesma causa/ideal. Esse movimento se reflete na formação de agrupamento de pessoas, que partilham o mesmo espaço e que tenham interesses comuns, podendo se tornar um grupo. A passagem de um agrupamento a um grupo propriamente dito, resultaria da transformação de interesses comuns em interesses em comum. Ou seja, os integrantes de um grupo se reúnem em torno de uma tarefa e de um objetivo comum, ao interesse de todos (ZIMMERMAN, 1997). Essa união, em função de uma causa, já existia antes mesmo das facilidades da vida moderna. Rodríguez e Hera (1998), fazem um resgate histórico de movimentos que discutem a questão da realidade dos grupos. O primeiro movimento defende a noção de grupo enquanto “mente”, em que há uma mente grupal independente, possuidora de características e leis próprias e que atua sobre os membros, que compõem o grupo. Esta leitura do grupo supõe que o mero fato de estarem reunidos configura uma espécie de “alma coletiva”, que induz os sujeitos a sentir, pensar e agir, como não fariam em separado. A psicologia dos grupos, desenvolvida na década de trinta e quarenta, por autores como Muzafer Sherif, Kurt Lewin e Solomon Asch (RODRÍGUEZ e HERA, 1998), que afirmavam que o grupo passa a ser visto como totalidade, possuidora de realidade própria, produto da interação de suas partes componentes e que não se equivale à soma das mesmas. Carlos (1998) analisa essa teoria como uma busca da essência do que seja um grupo e, deste modo, este aparece como um ser que transcende as pessoas que o compõem. Ou seja, ao se unir a um grupo o indivíduo (ou usuário ao se considerar as redes sociais) passa a agir em função de um coletivo e não mais, apenas em função de sua vontade, necessitando, muitas vezes, rever seus conceitos e ceder em prol de um projeto maior, em grupo. Ao se considerar as redes sociais e os inúmeros recursos que as Tecnologias da Informação e Comunicação (TICs) fornecem para a junção de pessoas e formação de grupos, inúmeras possibilidades se tornam viáveis de serem implementadas, conectando pessoas ao redor do mundo em função de uma causa. Assim, ao se promover a formação de grupos e comunidades, a exemplo do que se observa nas redes sociais, abre-se um recurso poderoso de interação e inclusão, que pode aproximar os cidadãos, mesmo pertencendo a classes sociais, localidades e formações diferentes, seja um debate ou mais pontualmente, ações como doação de roupas, acessórios e objetos de uso pessoal. Diante deste cenário, este Trabalho de Conclusão de Curso tem como objetivo analisar a predisposição dos usuários de redes sociais à participação em ações solidárias, especificamente, doação de roupas, como ferramenta de inclusão social da população de Araranguá, que se encontra em condição de vulnerabilidade socioeconômica. Portanto, além de abordar discussões relativas à desigualdade social, redes sociais; é necessário explicitar a inovação social e seu alcance no segmento da moda, já que, essas ações solidárias têm como foco, a doação de roupas e objetos pessoais.",
    "Conclusão": "Por fim, esta pesquisa foi de extrema importância para se compreender a predisposição dos usuários de redes sociais à participação em ações solidárias, tendo alcançado o objetivo a que se propôs. Por meio da coleta de dados coletados, também foi possível traçar o perfil dos recursos humanos, ditos voluntários. Dos 52 respondentes que afirmaram realizar algum trabalho voluntário 23 são da cidade de Araranguá. Sendo possível identificar a viabilidade de desenvolvimento do Projeto de Iniciação Científica (PIBIC) – no qual tanto a autora quanto a orientadora deste TCC estão atreladas – na cidade, por meio da questão, por exemplo: “Se ocorresse um projeto social envolvendo a inclusão de pessoas necessitadas em sua cidade, você estaria disposto a contribuir? De que forma?”, analisando as respostas foi possível identificar que dos 80 respondentes da cidade, 76 apresentaram-se dispostos a contribuir, seja doando roupas ou até mesmo, contribuindo na organização do projeto. Assim, como oportunidade para trabalhos futuros, como inúmeras vezes mencionado neste TCC, há um contexto maior de pesquisa, o desenvolvimento do PIBIC, intitulado: O uso das redes sociais como ferramenta de inclusão de moradores de rua e pessoas de baixa renda. Portanto, as próximas fases, apresentam-se como oportunidades de trabalho. Dentre elas, está a condução de as ações de inovação social, inserindo a moda no contexto da sustentabilidade e do compartilhamento, culminando na promoção de um evento em praça pública, com um “bazar/ feira” de roupas, a partir de campanhas de doação de roupas, as quais passarão por um processo de triagem e recuperação, o que envolverá o desenvolvimento e oferta de oficinas. Dessa forma, a perspectiva de trabalhos futuros envolverá os demais integrantes do LABeGIS e outros laboratórios da UFSC bem como, especificamente, a aluna de mestra do, que tem trabalhado a temática do Do it yourself e técnicas de upcycling, tendo como objetivo, transformar peças/tecidos antigos ou descartados em novas roupas. Essa dissertação também terá desenvolvimento junto ao projeto PIBIC, envolvendo professores e alunos do curso de moda do Instituto Federal Catarinense (IFSC), Campus Araranguá. O objetivo é que, através de ações simples e já incorporadas pela sociedade, como a doação de roupas, as ações avancem para um espaço de inclusão, com o desenvolvimento de oficinas, com vistas a inclusão da população em condição social e econômica vulnerável; afinal, é fundamental que as ações sociais tenham continuidade e, realmente sejam inclusivas, não apenas, assistencialistas. Enfim, as redes sociais são formadoras de opinião, meio a partir do qual, as pessoas produzem e consomem informações, gerando uma grande rede de divulgação de produtos, ideias e causas. Elas são cada vez mais populares e acessíveis e se traduzem em uma forma fácil, barata e rápida de aproximação das pessoas e assim, de transposição de barreiras. Convertendo-se em ponto de encontro de diversas classes, etnias, religiões, ideais políticos, em que pese a busca pela redução das desigualdades sociais."
}