{
    "Autor": "Gabriel dos Reis Pereira",
    "Título": "Proposta de Lei de Inovação para o Município de Sombrio/SC",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": "",
    "Resumo": "O objetivo deste trabalho é propor um modelo de lei de inovação para o município de Sombrio/SC. O estudo analisa práticas de incentivo à inovação e adapta mecanismos para a realidade do município. Teve como base as leis de inovação nacional, estadual e de municípios vizinhos como Criciúma e Araranguá. A proposta destaca a criação de um Conselho Municipal de Inovação, um Fundo Municipal de Inovação e um Programa de Incentivo à Inovação, além de prever incentivos fiscais e diretrizes para a gestão pública. A metodologia qualitativa, de natureza aplicada e procedimento bibliográfico e documental, permitiu identificar desafios e oportunidades do município de Sombrio, visando estabelecer um ecossistema propício à inovação. Com esta lei, o município poderá atrair investimentos, apoiar startups, gerar empregos e fortalecer parcerias entre setor público, privado e acadêmico, contribuindo para um futuro inovador.",
    "Palavras-chave": "inovação, lei, tecnologia, políticas públicas.",
    "Introdução": "A inovação é um motor essencial para o desenvolvimento socioeconômico e competitivo de qualquer região. Em um cenário global cada vez mais dinâmico, municípios que investem em políticas públicas de inovação conseguem atrair investimentos e gerar oportunidades. A inovação tem ocupado um lugar de destaque na agenda nacional de ciência e tecnologia, levando o governo brasileiro a implementar diversas políticas e incentivos (LUZ et al., 2014). No contexto nacional, a Lei n 10.973/2004, chamada inicialmente como Lei de Inovação, é o primeiro marco regulatório do Brasil, que trata de estabelecer diretrizes para o fomento à inovação e à pesquisa científica e tecnológica em ambientes produtivos, com foco na autonomia tecnológica e o desenvolvimento industrial do país (Brasil, 2004). Em 2016, com a publicação da Lei 13.243/2016, conhecida como Marco Legal da Ciência, Tecnologia e Inovação (CT&I), o Governo Federal revisou a Lei de Inovação, visando simplificar os processos relacionados à pesquisa e à inovação no Brasil. Esse marco buscou promover uma maior colaboração entre as instituições científicas e tecnológicas (ICTs), universidades, setor produtivo e o governo. Posteriormente, em fevereiro de 2018, o Decreto 9.283/2018 foi promulgado para regulamentar tanto a Lei de Inovação quanto o Marco Legal de CT&I (BRASIL, 2018). Na esfera estadual, Santa Catarina implantou sua lei de inovação no ano de 2008 com a promulgação da Lei 14.328/2008 (SANTA CATARINA, 2008). Em nível municipal, municípios vizinhos de Sombrio, local dessa pesquisa, como Araranguá e Criciúma, tiverem leis municipais de inovação estabelecidas respectivamente em 2015, através da Lei Complementar 168/2015, e 2018 através da lei ordinária 7375/2018. Em nível federal, estadual e municipal, as leis visam promover parcerias estratégicas entre ICTs, universidades e empresas. Essas parcerias são essenciais para o desenvolvimento regional, o empreendedorismo e a atração de investimentos em tecnologia, incentivando a prática da inovação (CAVALCANTE; FAGUNDES, 2007; MOREIRA et al., 2007). Para alcançar esses objetivos, é fundamental criar ambientes e instrumentos que facilitem a interação entre esses agentes de inovação. Nesse sentido, o presente trabalho visa a criação de uma proposta de Lei de Inovação para o município de Sombrio, Santa Catarina. A proposta de lei será elaborada com base numa pesquisa que abrangerá o Marco Legal de CT&I, a legislação do estado de Santa Catarina, assim como as leis vigentes de municípios vizinhos como Araranguá e Criciúma.",
    "Conclusão": "A proposta de criação de uma Lei de Inovação para o município de Sombrio foi desenvolvida com base nas análises das legislações existentes no Estado de Santa Catarina e nos municípios de Araranguá e Criciúma. A pesquisa buscou identificar as melhores práticas e adaptar os mecanismos de incentivo e promoção da inovação para a realidade de Sombrio, de modo a impulsionar o desenvolvimento econômico, social e sustentável do município. A proposta final visa a criar um ecossistema de inovação que permita o surgimento de startups e o fortalecimento de empresas de base tecnológica, além de incentivar a colaboração entre o setor público, privado e instituições de ensino e pesquisa. O Fundo Municipal de Inovação e os incentivos fiscais são alguns dos principais instrumentos previstos para fomentar o crescimento tecnológico local. A adaptação da lei para Sombrio reflete a importância de se construir políticas públicas de inovação que estejam alinhadas com as particularidades econômicas e sociais do município. Por meio desta lei, espera-se gerar um ambiente mais favorável à inovação, à criação de empregos qualificados e ao desenvolvimento sustentável. A proposta de criação da Lei de Inovação para Sombrio abre diversas possibilidades de trabalhos futuros que podem ser explorados por outros alunos e pesquisadores. Um estudo pode avaliar o impacto da lei no desenvolvimento local, medindo o crescimento de empresas inovadoras e a criação de empregos qualificados ao longo do tempo. Além disso, uma pesquisa pode ser dedicada a identificar os setores estratégicos da economia de Sombrio, como a agricultura e o turismo, e como a inovação tecnológica pode ser aplicada para impulsionar esses setores. Outro possível tema de pesquisa seria o desenvolvimento de um ecossistema de inovação na região da AMESC, com foco na criação de incubadoras de empresas e parques tecnológicos."
}