{
    "Autor": "Tai Chin Lu",
    "Título": "Avaliação dos Aplicativos de Tradução de Português Para Chinês (Mandarim) no Contexto de Situações de Risco",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Olga Yevseyeva",
    "Coorientador(a)": "Prof. Dr. Fernando Spanhol",
    "Resumo": "A tecnologia tem evoluído cada vez mais e consequentemente passou a estar mais presente na vida das pessoas favorecendo suas rotinas, principalmente após a vinda dos smartphones. Em um mundo bastante globalizado e acessível a informações, houve um desenvolvimento dos nichos de mercado, como setores relacionados ao Lazer e Turismo. Durante uma viagem podem haver ocorrências de imprevistos emergenciais ou que envolvem risco de vida. Nessas situações, é de extrema importância o estrangeiro possuir o entendimento dos eventos naturais e os devidos protocolos de segurança. Esse trabalho tem como objetivo fazer um estudo sobre a disponibilidade e usabilidade dos aplicativos de tradução de mandarim para português e vice-versa. Este tema tem relevância para turistas ou imigrantes que se localizem em uma área de risco aumentado para emergências, como de desastres naturais ou epidemia de COVID-19. A metodologia utilizada foi um levantamento de aplicativos de tradução que estão disponíveis no mercado que são gratuitos e não exigem capacidade de processamento elevada. Os autores realizaram testes de funcionalidade e precisão da tradução, comparando os textos dos aplicativos com os de especialistas em tradução (nativos). Os resultados da avaliação da tradução foram bastante interessantes, em que a maioria dos casos em que havia problemas com as traduções das palavras, estes geralmente eram associados aos contextos culturais. Foi observado que os aplicativos de tradução gratuitos disponíveis no mercado atendem parcialmente a s necessidades das pessoas que podem precisar deste serviço nas mais diversas situações, principalmente em situações de risco. Os autores sugerem mais estudos e maior investimento nos aplicativos de tradução para melhor comodidade aos turistas e imigrantes em áreas de risco.",
    "Palavras-chave": "Tecnologia, Turismo, Smartphone, Aplicativos, Tradução.",
    "Introdução": "Desde o início da Humanidade, o ser humano sempre buscou aperfeiçoar os materiais e equipamentos disponíveis para um melhor aproveitamento de tempo e função. Isso começou com a Agricultura, seguido da Pecuária, Escrita, Ciências e culminou na Era da Informação. A tecnologia tem evoluído cada vez mais (MOORE, 1965), e consequentemente passou a estar mais presente na vida das pessoas favorecendo para a rotina delas, principalmente após a vinda dos smartphones. Com eles, vieram os seus aplicativos móveis, e o alcance da informação nos dias de hoje está na palma da mão, o que facilita resolver diversos tipos de problemas do cotidiano. Estes dispositivos móveis têm se transformado em itens essenciais. De acordo com Rakestraw, Eunni e Kasuganti (2013), não é mais necessário carregar um computador ou algum outro aparelho de grande porte para qualquer canto. Essa comodidade leva o mercado a apresentar produtos melhores cada vez mais velozes, um princípio chamado de “Obsolescência programada” (BULOW, 1986). Conforme Tao e Edmunds (2018) os smartphones apresentam aplicativos com interfaces bastante interativas e descomplicadas, evitando a ocorrência de grandes dificuldades quanto ao uso. Em um mundo bastante globalizado e acessível a informações, houve um desenvolvimento das mídias, criando nichos de mercado como setores relacionados a o Lazer e Turismo, isto despertou o interesse das pessoas de viajar para destinos diferentes. De acordo com dados da Organização Mundial do Turismo (2018), as regiões que tiveram um maior crescimento de turistas foram a região da Ásia e a região do Pacífico, com recebimento de turistas atingindo valores próximos de 25%, e uma elevação perto de 7% comparada aos anos anteriores. No entanto, dependendo do destino escolhido podem aparecer barreiras culturais ou linguísticas do país local. Na atualidade é possível utilizar os aplicativos de tradução de idioma para auxiliar o entendimento. Araujo, Junior e Lisboa (2002), mencionam que nesses processos de tradução é comum haver problemas, não sendo capazes de traduzir as palavras com precisão através destes aplicativos. Segundo Dweik e Suleiman (2013), também podem ser causadas pelo contexto cultural e limitações de expressões locais dos países. Durante uma viagem, principalmente com destinos internacionais, podem haver ocorrências de imprevistos emergenciais ou que envolvem risco de vida, desde desastres naturais até riscos de saúde sanitária. Nessas situações, é de extrema importância o estrangeiro possuir o entendimento dos eventos naturais e os devidos protocolos de segurança.",
    "Conclusão": "De acordo com os dados levantados sobre a quantidade de pessoas que estão viajando, conclui-se que várias destas pessoas não possuem fluência no idioma para o país ao qual estão indo viajar. Durante a viagem existe a possibilidade de ocorrer situações imprevistas com riscos diversos. Em alguns países, como é o caso do Japão, já existe esforço governamental para facilitar a comunicação com os estrangeiros. No caso do Brasil, o único meio encontrado foi voltado para atual pandemia do novo coronavírus (Sars-CoV-2). Em outras situações o estrangeiro irá depender exclusivamente dos aplicativos de tradução. Não foram encontrados trabalhos acadêmicos que tratam sobre este assunto. O mais próximo foi relacionado a área de saúde e educação. Foi feita a busca por aplicativos de tradução que fossem gratuitos, de fácil instalação e uso, que não exigiam um hardware aprimorado com grande capacidade de processamento, e que pudessem ser instalados em praticamente qualquer smartphone. Foram selecionados os seguintes aplicativos que atendiam estes requisitos: Google Tradutor, Microsoft Translate, Reverso Tradutor e Babylon. Para avaliar o desempenho dos aplicativos para mensagens específicas relacionadas a situação de risco foram coletadas algumas mensagens padrão da Defesa Civil de Santa Catarina. As traduções feitas por estes aplicativos foram então encaminhadas para especialistas fluentes em mandarim. O resultado da avaliação da tradução foi bastante interessante: os casos em que haviam problemas com as traduções das palavras geralmente eram associadas aos contextos culturais. Foi observado que os aplicativos de tradução gratuitos disponíveis no mercado atendem parcialmente as necessidades das pessoas em diversas situações, principalmente em situações de risco. Para algo de imediato recomenda-se que as entidades que lidam com viajantes contratem ou recorram ao serviço de um especialista para preparar uma tradução adequada e padronizada para não depender exclusivamente dos aplicativos."
}