{
    "Autor": "Daniel Gerardi Pagani",
    "Título": "Atualização da arquitetura utilizada nos laboratórios remotos do RExLab",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Juarez Bento da Silva, Dr.",
    "Coorientador(a)": null,
    "Resumo": "Os laboratórios remotos oportunizam alunos das áreas de tecnologias a colocarem em prática seus conhecimentos, aliando teoria e prática. Permitindo estarem em contato com diversas áreas, materiais e desafios, que os fazem crescer em aprendizados. O Rexlab (Remote Experimentation Laboratory) vem desenvolvendo e aperfeiçoando os laboratórios remotos de forma contínua, com empenho e comprometimento, de seus alunos e professores responsáveis. Acompanhando o avanço da tecnologia e seguindo a ideia de ser um projeto open source (código disponibilizado de forma gratuita para usar, estudar, modificar e distribuir), o seguinte trabalho busca facilitar a manutenção dos laboratórios já existentes e tornar mais acessível a construção de novos laboratórios, tendo em vista o momento de escassez de equipamentos eletrônicos, visando a proposta de implementar uma placa de baixo custo aquisitivo e fácil manutenção.",
    "Palavras-chave": [
        "Laboratórios Remotos",
        "Arduino",
        "Raspberry PI",
        "Código Aberto"
    ],
    "Introdução": "Em 1997 surgiu o RExLab, na Universidade Federal de Santa Catarina, trazendo consigo a ideia de ampliar e disponibilizar a área de experimentação remota utilizando recursos da internet e outros meios tecnológicos para a disponibilização do acesso remoto dos recursos de um modo geral. Durante esses anos com o funcionamento e inúmeros projetos concluídos, a construção dos laboratórios obteve êxito evoluindo e trazendo consigo, novas funcionalidades. Deixando cada vez mais fácil a implementação e também o uso desses equipamentos. Atualmente, a grande maioria dos laboratórios presentes estão utilizando uma placa, com uma linguagem de um nível mais baixo. E, para a manutenção é encontrado algumas dificuldades impostas por ser um hardware que precisa de revisão. Juntamente com a dificuldade de se encontrar equipamentos eletrônicos por empecilhos advindos da pandemia Covid-19 e atualmente em virtude de conflitos entre países, que vem agravando ainda mais a escassez de eletrônicos. Como foi possível observar, além da pandemia e demais fatores, atrapalharem o enfrentamento seguro à pandemia, também pode-se ver, que devido às mudanças na rotina houve, enorme aumento no consumo de produtos que utilizam chips, tais como computadores e smartphones. Deste modo, com a disputa pelos semicondutores, o Brasil foi impactado, ficando no fim da fila, à espera da produção. (PEREIRA, 2021) Em busca de alternativas, foram pesquisadas novas formas de disponibilizar os materiais com placas de fácil acesso e com um custo reduzido. Trazendo consigo, tecnologias atualizadas, juntamente com uma linha de aprendizado alta e manutenção simples. Entendeu-se, de que o melhor caminho seria a busca por alternativas viáveis e benefícios de tecnologias open source. Os benefícios normalmente associados ao software open source são, por exemplo, o custo do software, requisitos em termos de hardware, fiabilidade e transparência. Glynn et al. (2005) consideram fatores como os benefícios tecnológico do software open source, a possibilidade de uma qualidade superior no software, as possíveis vantagens em ter acesso ao código fonte. Com a pesquisa, ficou decidido usar a placa Arduino, uma placa open source, que pode ser facilmente adquirida por qualquer pessoa, possuindo um valor de aquisição bem baixo podendo ser encontrado por valores inferiores a cinquenta reais com inúmeros tutoriais na internet de seu uso, tornando-a de fácil acesso. Para a conexão dela com a Raspberry foi escolhido o protocolo Johnny Five, um protocolo baseado na linguagem de javascript, a segunda linguagem mais utilizada no mundo, e que também é aprendida no curso de Tecnologias da Informação (TIC) e Comunicação, da Universidade Federal de Santa Catarina (UFSC). Com as placas escolhidas foram montados novos circuitos para dois LRs (laboratórios remotos), Microscópio Remoto e o Banco Óptico que serviram de base de teste para a posterior aplicação nos demais projetos. Foi desenvolvido um novo algoritmo de programação para os laboratórios utilizando a linguagem escolhida onde vimos que a estruturação e configuração dos LRs ficou consideravelmente mais fácil e mais simples. Colocando no ar de novo os aparelhos, que estavam com constantes quedas por motivos de estarem defasados e com uma dificuldade na manutenção de ambos.",
    "Conclusão": "A deste projetos, utilizando os componentes e a linguagem contribuíram muito para a formação pessoal e profissional, deste acadêmico. Instigando uma nova maneira de pensar sobre o desenvolvimento de projetos e criar novos softwares, fazendo-o seguir a carreira de desenvolvimento de software. Com grande apreço por projetos open source, pretendendo ser um membro ativo nesta comunidade. A escolha pelo arduino foi essencial para o bom andamento do projeto, o baixo custo e a facilidade de aquisição torna a replicação dos LRs mais fácil, em conjunto com a facilidade na configuração da placa para a comunicação com a Raspberry, o protocolo Firmata faz isso de uma maneira muito simplificada. A raspberry já era um componente presente no LRs, e fez-se questão, neste projeto, de continuar com o uso dela por ser um micro computador muito potente, a forma de desenvolver-la com o sistema operacional baseado em Linux torna uma configuração fácil, juntamente com diversos materiais disponíveis na internet, juntando com o protocolo Johnny Five que também é código aberto, simplificando a conexão com a placa arduino, algo que fazia-se difìcil na montagem e manutenção dos LRs com a placa antiga. A alteração do código de C++ para a utilização do Javascript se mostrou uma ótima escolha, sendo uma linguagem de alta qualidade e performance, tendo uma conexão com o websocket.io muito boa, tornando um LR estável e de fácil manutenção. O problema que havia com esses LRs de indisponibilidade e a demora para conseguir consertar os defeitos que apresentavam não existem mais, se tornaram LRs que dificilmente estão fora do ar por questões técnicas e quando necessitam de manutenção tornou-se algo simples e rápido de resolver. Devido a essa facilidade encontrada com a nova arquitetura desenvolvida, é esperado que mais desenvolvedores, principalmente alunos, tenham a oportunidade de criar novos LRs, podendo disponibilizar no RELLE, e que continuem com a atualização de outros LRs presentes no RExLab. Assim, trazendo mais possibilidades de práticas em laboratórios remotos."
}