{
    "Autor": "Lilian de Bittencourt Comicioli",
    "Título": "Uso da Plataforma Moodle como ferramenta de apoio para a criação de uma monitoria virtual de Física",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Simone Meister Sommer Bilessimo",
    "Coorientador(a)": "",
    "Resumo": "O presente trabalho tem como objetivo principal a criação de uma monitoria virtual no ambiente virtual de aprendizagem Moodle, que permita ao professor de Física “C” da Universidade Federal de Santa Catarina (UFSC), Campus Araranguá, trabalhar de forma conjunta com seus monitores. Elaborou-se uma proposta de ações a serem realizadas em parceria com o professor e a monitora da disciplina, a fim de minimizar os índices de reprovação ou evasão dos alunos da disciplina de Física C decorrentes da falta de conhecimento de conteúdos. Para tanto, a pesquisa explora sobre a educação a distância, o uso das tecnologias de informação e comunicação na educação, ambiente virtual de aprendizagem, bem como levanta aspectos gerais sobre o Moodle. A proposta foi aplicada no semestre de 2012/2, com uma turma de 56 alunos dos cursos de engenharia de energia e engenharia da computação. Nesta pesquisa foi adotada uma abordagem qualitativa. A técnica utilizada para coleta de dados foi a aplicação de questionários disponibilizados uma parte no Moodle do Laboratório de Experimentação Remota (RExLab) e outra parte encaminhados por email. Por fim, os resultados da pesquisa demonstraram que a criação de uma Monitoria Virtual como apoio ao estudo complementar a disciplina de Física C, apresentou algumas dificuldades na sua aplicação, pelo fato de ter sido implementada parcialmente ao longo do semestre, devido a greve dos docentes e servidores, muitos alunos não acreditaram na proposta e não frequentaram a monitoria virtual.",
    "Palavras-chave": [
        "Educação a Distância",
        "Ambiente Virtual de Aprendizagem",
        "TIC",
        "Moodle"
    ],
    "Introdução": "Em um mundo globalizado, sofrem-se mudanças constantes na sociedade. A partir do surgimento das novas Tecnologias de Informação e Comunicação (TIC) e da mudança do perfil dos discentes na última década, percebe-se a importância da implantação de práticas inovadoras no ambiente universitário, objetivando-se uma educação mais efetiva. Esta pesquisa procura efetivar este conceito que novas alternativas de ensino podem ser utilizadas em um ambiente acadêmico, principalmente com disciplinas consideradas difíceis e complexas, como é o caso da disciplina de Física C, oferecida aos cursos de Engenharia de Energia e Engenharia de computação da Universidade Federal de Santa Catarina (UFSC) – Campus Araranguá. No Ensino Superior, não só na UFSC como em outras universidades públicas e privadas, utiliza-se normalmente a figura do monitor, o qual também é um aluno do curso, como elemento de ligação entre o professor titular da disciplina e seus alunos. O apoio acontece presencialmente e com horário estabelecido pela universidade. No entanto, no Ensino Superior, alguns discentes trabalham e não dispõe de tempo para buscar esse recurso dentro da universidade. Logo, conclui-se que mesmo que se organize todo um aparato pedagógico para auxiliar o aluno em seu estudo, muitas vezes, ele não pode usufruir esta oportunidade devido às restrições de tempo e deslocamento físico. Nos últimos anos, as Tecnologias de Informação e Comunicação (TIC), foram responsáveis por várias transformações na vida das pessoas, na vida pessoal, profissional e educacional. Simões e Gouveia (2008) afirmam que o uso destas TIC está permitindo o surgimento de novas práticas e hábitos relacionados com as novas gerações. Para acompanhar o perfil desta nova geração, conhecida como Geração Z, as instituições de ensino devem avaliar como estão sendo organizadas e administradas. Segundo Messias (2010) as gerações são caracterizadas pelo período em que nasceram os indivíduos, conforme mostra o Quadro 1.",
    "Conclusão": "Como objetivo geral deste trabalho, criou-se uma monitoria virtual, baseada em atividades construídas no ambiente para suporte à aprendizagem Moodle, que permita ao professor de Física “C” da Universidade Federal de Santa Catarina (UFSC), Campus Araranguá, trabalhar de forma conjunta com seus monitores. Este objetivo foi plenamente atingido. A introdução das TIC tem contribuído de forma significativa na criação de novos métodos de ensino, como a monitoria virtual, proporcionando vários benefícios tanto para os discentes como para a universidade. No caso dos discentes pode-se citar: facilidade de acesso ao conteúdo; flexibilidade em termos de horários e locais, evitando o deslocamento dos alunos até a universidade; promove maior interação entre monitor e alunos; compartilhamento de informação e melhora no aprendizado. Bem como para a universidade que consegue atender um número maior de alunos, independente de tempo e espaço, minimizando o índice de reprovações e evasões nas disciplinas. A experiência da autora em relação a este trabalho foi positiva em vários aspectos como: ter colocado em prática vários conhecimentos teóricos adquiridos ao longo do curso; a interação com o professor, com a monitora e com os alunos de outros cursos da universidade; a interação com outros alunos e professores do curso de tecnologia da informação e comunicação; e o mais importante de tudo, ter realizado um trabalho que de certa forma contribuiu para o benefício de outras pessoas. Quanto à criação da monitoria virtual, apesar de ser implementada parcialmente ao longo do semestre, a ideia foi bem aceita pelo professor e pela monitora da disciplina, motivo que os levaram a colaborar e participar ativamente no processo de elaboração dos materiais (resolução de exercícios). Os vídeos foram gravados na própria sala de aula da universidade, o ideal seria ter um espaço próprio para a gravação, com iluminação correta, isto melhoraria consideravelmente a qualidade do material. No que se refere à utilização da monitoria virtual pelos discentes de Física C pode-se dizer que não aconteceu como esperado, alguns fatores dificultaram o uso da ferramenta como: o semestre de 2012/2 foi atípico devido à greve dos servidores e docentes, iniciando com um atraso considerável, o semestre era pra ser iniciado dia 6 de agosto de 2012 e só foi iniciado dia 10 de setembro de 2012; a dificuldade de acesso ao ambiente, visto que foi utilizado o Moodle (Rexlab) e não o que eles estão habituados a utilizar, tendo que acessar outro link com novo usuário e senha; a ausência de treinamento dos alunos, por ser um recurso já utilizado acreditava-se que eles teriam facilidade para acessar o novo ambiente e por último houve também falta de interesse por parte dos discentes em conhecer melhor a proposta, muitos alunos nunca acessaram o ambiente, mesmo depois da visita realizada pessoalmente na sala de aula explicando do que se tratava o projeto. No que diz respeito aos professores que atuam no século XXI, Torres (2007, p.76) afirma que o maior desafio é “transpor as ideias cristalizadas do conceito tradicional de professor e de universidade para o conceito mais atual e amplificado”, ou seja, os professores têm que se adequar as novas mudanças do ensino. Diante deste contexto, trabalhar o ensino de Física em uma universidade, uma disciplina considerada pelos alunos de difícil compreensão, requer algumas mudanças como: propostas curriculares que valorizem a construção e troca do conhecimento; uma estrutura equipada com mais recursos (laboratórios, televisão, computadores, softwares, dentre outros) e acima de tudo procurar novas soluções que auxiliem no processo de ensino e aprendizagem do aluno. Toda metodologia educacional apresenta obstáculos na sua aplicação. Dos resultados obtidos neste primeiro experimento, as dificuldades mais evidentes a serem superadas não são as de ordem tecnológica, mas sim as de ordem comportamental. Na aplicação deste estudo, ficou explícito o quanto é difícil propor mudanças de hábitos e crenças, principalmente nos alunos. Talvez estes alunos de engenharia não tenham como característica forte “ser internauta” ou tenha um perfil mais resistente a aceitar mudanças em métodos de ensino. Como sugestão para trabalhos futuros pode-se implantar uma monitoria virtual desde o início do semestre letivo, que contemple todo o conteúdo, efetuando um treinamento com os alunos e a monitora da disciplina. Pode-se também utilizar dispositivos móveis como mecanismo de acesso para esta monitoria. Outra sugestão pode-se possibilitar o compartilhamento de conhecimento entre os cursos da universidade que oferte uma determinada disciplina com seus pré-requisitos, ou até mesmo com outras instituições de ensino. Por exemplo: o aluno de programação II poderia ter acesso ao conteúdo e aos recursos (materiais, monitor) oferecidos pela universidade na disciplina de programação I e assim sucessivamente. Desta forma, facilitaria o acesso aos conteúdos e os alunos poderiam sanar suas dúvidas com maior agilidade. Enfim, espera-se que seja dada continuidade a este projeto, tornando a monitoria virtual parte da proposta curricular dos cursos oferecidos pela UFSC e que outros docentes sigam o exemplo do professor Bernardo, contribuindo para a construção de uma nova educação atendendo às demandas da sociedade moderna."
}