{
    "Autor": "Andrei Cardozo Zanatta",
    "Título": "Programação de Computadores para Crianças: Metodologia do CODE CLUB Brasil",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª Drª Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Neste trabalho é apresentado um estudo sobre a metodologia utilizada no projeto CODE CLUB que visa o aprendizado de programação para as crianças a partir de 09 anos. Durante este trabalho foram acompanhadas a concepção dos clubes, as oficinas de capacitações, as equipes de apoio e os instrutores voluntários. Foram aplicados questionários e realizadas algumas entrevistas com participantes do projeto com o objetivo de avaliar a importância para os alunos nos clubes de programação. Durante o acompanhamento das atividades, notou-se que há muita heterogeneidade de níveis de conhecimento, ou seja, uma metodologia aplicada para uma pessoa, no caso criança, pode não surtir o mesmo efeito para outra criança, esta afirmação, no entanto apenas foi confirmada com a realização desse trabalho. A metodologia traz o uso de apostilas pelos voluntários, onde são apresentadas as lições com o objetivo de criar o jogo proposto em cada aula. Uma linguagem lúdica é utilizada, chamada Scratch, que é baseada em blocos de instruções encaixáveis, tornando mais visual e intuitivo o ensino da lógica de programação. Como resultado final o desempenho foi satisfatório, onde os alunos se mostraram bastante participativos, e sua motivação para continuar o curso foi muito grande.",
    "Palavras-chave": [
        "Programação de computadores",
        "ensino fundamental",
        "lógica"
    ],
    "Introdução": "A arte de programar consiste na arte de organizar e dominar a complexidade – Dijkstra. Talvez, começando com essa frase, parece que complexidade e crianças não se encaixam. Porém, aprendemos durante toda a vida, com os pais, irmãos, tios, amigos, enfim, quem quer que seja. O que diferencia o ensinamento em cada idade é a maneira com que ensinamos. Crianças de hoje, ou a geração “Y”, ou ainda nativos digitais, enfim, os nascidos em meio a essa explosão de informação, estão acostumados a receber informações muito rapidamente. Como diz PRENSKY (2001) os alunos dessa geração são os primeiros a crescerem com essa tecnologia. Eles passaram toda a vida cercados por celulares, videogames, computadores, e outras ferramentas da era digital. Um aluno graduado atualmente passa cerca de 5000 horas lendo, e o dobro de horas jogando videogame. Os computadores, telefones celulares, internet já fazem parte integral de suas vidas. Digamos que, com a metodologia certa, crianças podem aprender a programar. Segundo a organização CODE CLUB BRASIL (2015) \"Saber programar é uma habilidade importante em um mundo digital. Hoje em dia não basta saber usar computadores, criar textos, planilhas, usar internet. As crianças também devem saber como as coisas funcionam\". A mesma ainda afirma que \"aprender a programar não é útil apenas se você quiser ser um programador no futuro. Programar ajuda em outras habilidades, como resolver problemas, desenvolve o raciocínio lógico e contribui em outras matérias como ciências e matemática\". Mitchel Resnick é diretor do grupo Lifelong Kindergarten, do MIT Media Lab, afirma que \"aprender a codificar é importante não só pelas oportunidades no mercado de trabalho, mas pela possibilidade de ver o mundo de outra maneira.\" Exame (2015). O mercado de trabalho para a área de TI cresce a cada ano, de janeiro a junho de 2015, aumentou em 44,2% o número de vagas no setor de tecnologia. Só em junho foram abertas 10.105 vagas. Segundo Alves (2015), \"Uma pesquisa recente da Associação Brasileira de Empresas de Tecnologia da Informação e Comunicação mostrou que o mercado de TI no Brasil está a mil: o segmento, que no país emprega mais de 1,3 milhão de pessoas, apresenta tendência de crescimento de oferta de até 30% até 2016.\". A mesma ainda cita que para este ano o Brasil tem previsão de crescimento em torno de 5%, e que a função de programador vive um verdadeiro apagão de mão de obra. Sabendo disso, já é um bom argumento para começar a incentivar as crianças a buscar em o conhecimento na programação de computadores. Mas independente se o destino vai colocá-los na área da tecnologia, ou que não pareça que a programação é útil apenas para programadores, \"todo mundo nesse país deveria aprender a programar computadores, porque programar ensina a pensar\" – Steve Jobs. Neste trabalho, é realizado um estudo sobre a metodologia para ensinar programação de computadores utilizadas nos clubes CODE, o qual é um projeto mundialmente conhecido, criado em 2012 com o objetivo de ensinar programação para crianças.",
    "Conclusão": "Aprender a programar não é uma tarefa simples. Para uma parte dos alunos que começa uma atividade como essa, se torna algo desafiador. Embora as crianças ainda não tenham a visão do tamanho da importância que tem qualquer atividade para o futuro, nesse caso a programação, o papel da sociedade é buscar formas de tornar o aprendizado cada vez mais atrativo para elas. Existem vários tipos de ferramentas que buscam auxiliar o ensino da programação para crianças. Porém, existe quem não concorde com isso, acreditam que o ensino de programação para crianças prejudicaria a sua infância, fazendo-a pensar de uma forma que não é recomendado para a idade. Aqueles que pensam o contrário relatam que melhora no desenvolvimento, na capacidade de resolver problemas, enfim, ambos os lados tem seus argumentos. O CODE CLUB UFSC mostrou que a metodologia recomendada pelo CODE CLUB BRASIL é adequada e a motivação dos voluntários é muito importante para o ensino/aprendizado de lógica de programação. O material de ensino com vídeos e explicações facilita aos instrutores repassar o conteúdo. O apoio dos pais das crianças e dos professores das escolas também é fundamental neste processo de aprendizagem. Outro fator importante neste processo foi a criação de uma equipe de apoio, que são voluntários com experiência para auxiliar os outros voluntários em caso de dúvidas com relação às aulas, com a ferramenta do Scratch, material didático (apostilas), enfim, pessoas disponíveis para que se tenha o melhor rendimento possível nas oficinas. Durante o acompanhamento das atividades, notou-se que há muita heterogeneidade de níveis de conhecimento, ou seja, uma metodologia aplicada para uma pessoa, no caso criança, pode não surtir o mesmo efeito para outra criança. Segundo o psicólogo americano Howard Gardner, pessoas diferentes têm capacidades cognitivas diferentes. Gardner definiu isso como Inteligências Múltiplas (GARDNER, CHEN, MORAN 2010). Isto significa que alguns indivíduos possuirão uma facilidade natural para aprender certas habilidades e conhecimentos, enquanto outro grupo de pessoas para outras formas de inteligência. É um equívoco, então, concluir que um mesmo método de ensino será eficiente para todos os alunos. As vantagens para as crianças que participam destes grupos de estudos passam a ser algo muito grande, a partir do momento em que a criança coloca o pensamento total, ou seja, se dedica ao máximo aquelas atividades, ela já muda seu comportamento, pois de acordo com o conteúdo apresentado a motivação vai aumentando, elas vão conseguindo interagir cada vez mais com o personagem e esse fato os faz querer cada vez mais. Uma prova de que a programação ajuda em diversas áreas é observando os resultados dos questionários, onde em todas as perguntas a maioria dos alunos acertou, e elas abordavam diferentes áreas, como matemática, português, gramática, etc. Comparando os dois questionários, cerca de 1,2% menos erros do segundo para o primeiro. Sendo assim, nota-se a importância pela busca de novas práticas educacionais tornarem as aulas mais motivadoras e empolgantes, uma busca por desafios constante do aluno, já que é uma geração totalmente conectada as aulas monótonas já não despertam mais o interesse deles. A liberdade que as crianças têm ao programar para criar contribui para a construção de seu próprio mundo, e através disso os alunos desenvolvem sua capacidade de pensar, sua criatividade, a sua lógica e capacidade de planejamento, de pensar antes de fazer. Dificilmente antes do início do curso do CODE CLUB, alguma das crianças responderia positivamente a uma pergunta se gostaria de ser programador de computadores quando crescer, passado o curso, talvez essa realidade possa ter mudado, e com isso traria benefícios para a comunidade de programadores formando profissionais mais bem preparados para o mercado de trabalho. Como trabalho futuro, a continuidade da aplicação do questionários num período maior seria interessante para fazer outras comparações e observações."
}