{
    "Autor": "Karen Schmidt Lotthammer",
    "Título": "CRIAÇÃO DE UM CURSO ONLINE ABERTO E MASSIVO PARA CAPACITAÇÃO DE PROFESSORES EM RELAÇÃO À INTEGRAÇÃO DE TECNOLOGIA NA EDUCAÇÃO",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Juarez Bento da Silva",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho aborda o desenvolvimento de um curso aberto online e massivo como ferramenta para a capacitação docente quanto à integração de tecnologias na educação. Para a criação do curso, foi utilizada a plataforma EdX, a qual foi instalada em um servidor próprio e que após configurada adequadamente para hospedar o curso. O curso denominado Integração de Tecnologias Digitais na Educação foi elaborado utilizando a metodologia ADDIE, possuindo seis unidades que apresentam detalhadamente a utilização do ambiente virtual de aprendizagem Moodle como ferramenta para a integração de tecnologias da informação e comunicação às práticas dos docentes. O presente trabalho foi elaborado em nove etapas: levantamento bibliográfico, escolha do público alvo, escolha do tema, escolha da plataforma, instalação e configuração da plataforma, estudo do manual técnico da plataforma, adequação do conteúdo didático já existente à proposta do curso, abertura do curso para período de inscrições e disponibilização do curso online aberto e massivo. Após desenvolvido, este curso piloto foi oferecido pelo prazo de três meses contanto com cerca de cinquenta inscritos e dez concluintes, dos quais a maioria eram docentes que buscavam formação continuada.",
    "Palavras-chave": "Curso Online Aberto e Massivo, EdX, Capacitação Docente.",
    "Introdução": "A disseminação das Tecnologias da Informação e Comunicação tem transformado a sociedade, visto que são visíveis seus impactos nas mais diversas áreas. À vista disso, é crescente o interesse em integrar à tecnologia nos sistemas educacionais. Entretanto, para que haja a efetiva inclusão das tecnologias às práticas docentes, é necessário que os docentes possuam instrução para tal, uma vez que a tecnologia não deve ser usada como um fim em si mesmo e sim, como um meio do qual os professores possam estimular o protagonismo dos alunos na construção do conhecimento (GESSINGER et al., 2013). Dados publicados no ano de 2016 pelo Centro Regional de Estudos para o Desenvolvimento da Sociedade da Informação (CETIC.br) em relação à crianças e adolescentes de 9 a 17 anos, 68% dos entrevistados acessam a internet mais de uma vez por dia e 85% acessam a internet via dispositivos móveis. À vista disso, pode-se perceber que a tecnologia está presente de forma constante na vida das crianças e jovens e por isso, pode ser sim utilizada a favor da aprendizagem deles. Para tal, é necessário que os docentes estejam preparados para manusear os equipamentos, lidar com informações e desenvolver estratégias que despertem o interesse dos alunos nas atividades propostas (OLIVEIRA; FRANCO JUNIOR, 2016). Assim, uma vez que, em geral as escolas não oferecem instruções de como utilizar os recursos tecnológicos em sala de aula e devido à grande carga horária de docência exercida pela maioria dos professores, é necessário que os próprios docentes busquem alternativas para se atualizarem e integrarem as tecnologias às suas práticas. Neste contexto, a Educação a Distância é considerada uma aliada na formação complementar dos docentes, pois substitui os espaços físicos por espaços virtuais, os quais fornecem ferramentas na mediação do processo educacional (MÜLBERT et al., 2011). Dentre as diversas modalidades de EaD, os MOOCs - Cursos Online Aberto e Massivos estão em evidência atualmente pelo fato de diferentemente dos cursos tradicionais, são abertos e podem ser acessados por qualquer pessoa conectada à internet, em geral são gratuitos e não requerem conhecimento prévio para a realização dos cursos disponíveis (FORNO; KNOLL, 2013). Assim, a utilização de MOOCs pode ser considerada uma boa opção para que docentes possam atualizar seus currículos e práticas.",
    "Conclusão": "Este trabalho apresentou a criação de um curso piloto no formato de curso online aberto e massivo com o intuito de proporcionar aos docentes, instruções de como integrar a tecnologia em suas práticas por meio da utilização do Ambiente Virtual de Aprendizagem Moodle. Ao longo do trabalho, foram apresentadas as etapas realizadas para o desenvolvimento do curso proposto, estas executadas com base no modelo ADDIE (abreviatura em inglês de Analysis, Design, Development, Implementation e Evaluation). Posteriormente, o trabalho exibe as páginas que constituem a plataforma EdX e após, cada uma das unidades que compõem o curso Integração de Tecnologias Digitais na Educação. O curso apresentado pode contribuir para a capacitação de professores quanto à integração de tecnologias em suas práticas, uma vez que proporciona ao participante conhecer as principais ferramentas de um dos mais conhecidos Ambientes Virtuais de Aprendizagem, o Moodle. O Moodle permite que simulações, links, vídeos, textos, questionários, espaços de comunicação entre outros recursos, sejam disponibilizados aos discentes permitindo assim, a realização de atividades diferenciadas e consulta a materiais complementares aos conteúdos expostos em sala de aula. A disponibilização deste curso visa atender a diversos docentes de Escolas de Educação Básica da região do município de Araranguá, os quais já fazem parte das ações de integração de tecnologia na educação desenvolvidas pelo Laboratório de Experimentação Remota assim como demais docentes e pesquisadores interessados nessa temática. Assim, a disponibilização de um curso aberto online e massivo é uma boa opção para os que os docentes e demais interessados possam atualizar seu currículo por meio de um curso gratuito, de qualidade, com aprendizado autônomo e sem estar associado a uma turma específica para tal. Quanto as dificuldades encontradas, estas estão relacionadas a manipulação de uma plataforma nova, onde foi necessário um intenso estudo em relação à sua estrutura e como utilizar as ferramentas disponíveis. Outro obstáculo encontrado foi quanto à disponibilização do EdX no servidor, pois ocorreram erros de disponibilização da página, os quais, não haviam relatos que pudessem ajudar a solucioná-los. Em relação à trabalhos futuros, se destacam: melhorias neste piloto apresentado com vistas à maior abrangência do curso, maiores números de inscritos e concluintes; a análise de perfil dos usuários de cursos abertos online e massivos; a elaboração de um modelo educacional para os próximos cursos que pelo Laboratório de Experimentação Remota serão desenvolvidos e por fim, o estudo do impacto que a realização deste curso proporcionou nas práticas educacionais dos participantes."
}