{
    "Autor": "Ellen Larissa de Carvalho Aquino",
    "Título": "Da participação ao ativismo: as tecnologias da informação e comunicação aliadas ao feminismo.",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Giovani M. Lunardi",
    "Coorientador(a)": null,
    "Resumo": "A evolução proporcionada pelas Tecnologias da Informação e Comunicação contribuíram para o nascimento de novas maneiras de pensar e interpretar a trajetória humana. Esta expansão deu-se, também, por meio da participação da mulher no desenvolvimento da ciência e da tecnologia. Com o passar do tempo, essa participação das mulheres tornou-se instrumento favorável, por meio das TIC´s, ao feminismo (movimento que luta pelos direitos das mulheres). A partir disso, o presente trabalho apresenta, através de uma pesquisa teórica e documental, o envolvimento das mulheres no avanço das TIC´s, visando o empoderamento feminino através desta contribuição. Além do mais, deseja refletir sobre a apropriação do uso dos artefatos tecnológicos em favor das mulheres, via ativismo político e a articulação das causas feministas.",
    "Palavras-chave": [
        "TIC´s",
        "Gênero",
        "Feminismo",
        "Ativismo",
        "Mulheres",
        "Tecnociência"
    ],
    "Introdução": "Em praticamente toda a história da humanidade as mulheres foram consideradas inferiores aos homens. Diante disso, passaram a se unir na defesa de um interesse em comum: o de garantir igualdade entre os gêneros. Nesse contexto, o movimento, conhecido como 'feminista', surge em meio às reivindicações das mulheres por melhores condições de trabalho, ainda no século XIX. Ao longo de todo século XX e na atualidade, as reivindicações feministas expandiram. A luta pela igualdade de gênero alcançou amplitude e passou a agregar, por exemplo, temáticas da violência sexual, física e psicológica contra a mulher, e questionamentos do poder social, econômico e político sobre as mulheres. Paralelamente aos acontecimentos históricos das lutas das mulheres. A evolução tecnológica começou a se deparar com um novo caminho a ser traçado. O afunilamento entre o técnico e o intelectual permitiu, com auxílio da automação, que informações fossem tratadas com grande eficácia. A partir daí, a narrativa da tecnologia dá abertura para sucessivos passos que darão surgimento as chamadas Tecnologias da Informação e Comunicação. Ambos os acontecimentos, feminismo e TIC´s, se cruzam ao longo de suas trajetórias. Dentro desta relação existe o questionamento da possibilidade das TIC´s contribuírem para igualdade, e reforço do movimento feminista.",
    "Conclusão": "Quando olhamos para o surgimento do feminismo, notamos que passos gigantescos foram dados. O caminho não foi simples. Houveram mudanças, dilemas, enfrentamentos, ajustes, derrotas e também vitórias. Sem esquecer o reconhecimento da sua relevância passada e atual. Mais que isso, a percepção de que o feminismo é um movimento contínuo pela igualdade na diferença, pois quer se firmar na coexistência recíproca das diferenças existentes entre homens e mulheres. Além disso, tanto para Hall (2001, p. 44-46) quanto para Haraway (1984, p.57-66), dentre tantos processos e movimentos sociais, os movimentos feministas foram basais para a criação de um novo pensamento e de uma nova forma de reconhecimento. As mulheres são fundadoras de questões importantes porque passam, a partir dos anos 1960, a terem um status quo na sociedade e no pensamento científico. Esse papel, ao longo do tempo, ocupa diferentes âmbitos e lugares e, dentre eles, de relevante importância, os espaços das artes, das mídias, e da tecnologia. Passa-se a relevar não só a participação da mulher no desenvolvimento. Mas, a sua articulação, usando o desenvolvimento, em favor as suas lutas."
}