{
    "Autor": "Christian Miranda da Costa",
    "Título": "APLICAÇÕES DE REALIDADE AUMENTADA NO ENSINO DE ASTRONOMIA NAS ESCOLAS DE ENSINO FUNDAMENTAL",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profa. Dra. Eliane Pozzebon",
    "Coorientador(a)": "Prof. Dr. Marlon Oliveira",
    "Resumo": "A astronomia é uma das áreas das ciências da natureza quem tem como objetivo estudar corpos celestiais, com o ﬁm de situá-los no espaço e no tempo e explicar sua origem e seu movimento. Sendo uma matéria aplicada no ensino fundamental nos anos inicias, os docentes vêm procurando formas mais interativas de aplicar, buscando novas formas de ensinar um conteúdo tão abstrato. Assim, o presente trabalho tem como objetivo buscar aproximar a ciências da natureza com o aluno através da tecnologia, trazendo Realidade Aumentada como meio facilitador para a compreensão de conteúdos abstratos como a astronomia. Desta forma, será mostrado a aplicação e elaboração de um projeto que utiliza um aplicativo móvel com realidade aumentada para ensinar alunos dos anos iniciais do ensino fundamental, visando aumentar a interação e motivação dos alunos, contribuindo para o processo de aprendizagem. Esta pesquisa aplicada é de caráter exploratório, tendo como análise de dados qualitativa, aplicado com 14 alunos na escola Rio dos Anjos e 20 alunos na escola Nova Divinéia, ambas sediadas no município de Araranguá no estado de Santa Catarina. Os resultados obtidos foram positivos e promissores de acordo com a avaliação do autor-pesquisador, comprovado por questionários aplicados antes e depois da aplicação e depoimentos dos alunos. Estes resultados demostram que 99% dos alu- nos concordam que é mais interessante e divertido aprender astronomia com realidade aumentada.",
    "Palavras-chave": [
        "Astronomia",
        "Realidade Aumentada",
        "Tecnologias da Informação e Comunicação",
        "Educação",
        "Zappar"
    ],
    "Introdução": "As Tecnologias da Informação e Comunicação (TIC) estão cada vez mais frequentes no cotidiano das pessoas, seja no trabalho ou em casa, tornando imprescindível a inclusão e utilização no contexto escolar. Hoje as crianças têm a tecnologia em suas vidas, pois desde quando bebês interagem com tablets e smartphones para usos diversos, como jogar, assistir vídeos, navegar na internet, trocar mensagens, etc. Estas modalidades entre as crianças e os jovens na atual circunstância, são hábitos que os acompanham até a vida adulta (LOPES et al., 2019). A quarta edição da pesquisa retratos da leitura no Brasil, relatou que o brasileiro usa seu tempo livre para atividades como uso da internet e computador ou smartphone para de redes sociais tais como WhatsApp e Facebook (PRÓ-LIVRO, 2016). Com as TICs em alta no mercado, o hábito da leitura vem sofrendo mudanças. O modo como as novas gerações se comportam para ler está sob frequente influência da tecnologia. O mesmo ocorre para as bibliotecas que tem que manter-se atualizadas no que diz respeito à incorporação das TICs em seus produtos e serviços (LOPES et al., 2019). Na busca por novos métodos de ensino na educação, onde o ensino deve ser motivo de desejo e curiosidade, torna-se cada vez mais necessário interligar os saberes, contextualizar os conteúdos ensinados em sala de aula com a realidade do aluno e fazer com que aprender seja algo estimulante e prazeroso (DUARTE, 2018). Nesse cenário de transformações no modo de pensar das práticas de ensino e aprendizagem, a Realidade Aumentada (RA) tem se demonstrado uma tecnologia enriquecedora em diversas áreas principalmente em ambientes educacionais, no que tange um ensino integrado de diferentes disciplinas.",
    "Conclusão": "Em vista dos argumentos apresentados foi identificado que o emprego da realidade aumentada em ambientes educacionais não é apenas uma importante ferramenta no auxílio da aprendizagem e sim necessária no atual quadro de avanços tecnológicos em que a sociedade se encontra. Pode-se identificar a presença da tecnologia da informação em nossos cotidianos, se tornando uma prática cultural extremamente enraizada nas crianças desta nova geração denominada geração Z e Alpha. A RA vem com a intenção de complementar o mundo real e não substituí-lo, pois suporta uma interação direta entre ambiente real e virtual, promovendo a imersão e a navegação do envolvimento do aluno na atividade de aprendizagem. Toma-se conhecimento sobre estas novas gerações Z e Alpha, esses indivíduos, segundo especialistas totalmente familiarizados com as últimas tecnologias digitais não encontrando dificuldade em aprender a lidar com as novidades constantes deste mercado. Tendo mais familiaridade e agilidade para assimilação das novas tecnologias do que qualquer outro membro de gerações anteriores. A tecnologia e a educação sempre andaram juntas. A ciência se tornou um meio de inovação, trazendo para a comunidade a interação com o desenvolvimento, a fim de despertar afeição por novas fontes de conhecimento e interatividade. Tendo em vista que a aplicação da realidade aumentada nos alunos despertou o interesse pela forma de aprendizado interativa. Teve como propósito impactar as escolas de forma que a tecnologia precisa sim ser incentivada e vivenciada desde o início, trazendo a cada década mais aperfeiçoamento para este meio, algo que realmente cause impacto positivo na sociedade. Andando sempre paralelamente, as tecnologias se completam e se unem umas com as outras surgindo mecanismos cada vez mais práticos e completos, atraindo o nosso interesse pela área. A internet, sem dúvidas é uma indispensável ferramenta na educação, desde sua criação os conteúdos estão mais acessíveis aos estudantes o que facilita a pesquisa sobre um determinado assunto, o contato do aluno com a informação e a descoberta científica. A realidade aumentada é uma nova invenção que permite que o mundo virtual se misture com o mundo real, vivenciar cenários, interagir com objetos e descobrir o novo. O resultado da aplicação dessa tecnologia é a geração de um novo meio de aprendizado, que torna o estudo mais divertido e interessante. Com isso, os alunos se engajam mais nos estudos e, além disso, memorizam e entendem melhor o conteúdo aplicado. Ao mesmo tempo, tudo isso volta positivamente para a escola, que melhora seu relacionamento com os alunos, alcança melhores resultados e se torna uma opção vantajosa para a comunidade. Um dos grandes desafios ao aplicar esse tipo de tecnologia é preparar professores para a utilização deste recurso, para quem não nasceu ou se adaptou a era digital, o contato com as inovações pode ser mais difícil e assustador. Por isso, o uso da Realidade Aumentada também requer do professor uma nova maneira de ver a pedagogia e ministrar esse novo conceito, a educação passa a ser mais colaborativa. Principalmente na rede pública a infraestrutura é precária, em contato direto com a realidade da escola e relato dos professores, a rede de sinal Wi-Fi é fraca, não tendo alcance em todas as salas de aprendizado, falta de laboratórios também é um problema persistente na rede pública, falta de equipamentos ou insuficiência deles para atender as turmas é constante. A crítica persistente dos educadores é que quando a instituição dispõe do equipamento ou da tecnologia surge a falta de manutenção, como computadores que não funcionam, lousas inutilizadas por falta de técnicos, defeito nos aparelhos entre outros problemas que surgem. Sendo assim horas de aulas são perdidas devido as inconsistências nas infraestruturas causando desânimo por parte dos professores de aplicar qualquer conteúdo inovador e tecnológico. A proposta de incluir RA é promissora e grandiosa, o impacto foi revolucionário dentro da aprendizagem, a aceitação dos professores referente a prática aplicada é difícil, por falta de capacitação profissional referente as novas tecnologias e consequentemente não estarem aptos. Diante das dificuldades apresentadas por falta de infraestrutura é uma discussão a ser tratada dentro da sociedade sobre a qualidade dos nossos ensinos, de como ele deve ser aplicado e como anda a estrutura das escolas. Como trabalhos futuros pode-se indicar o uso do aplicativo Zappar para outras áreas de ensino, como física, química, matemática, português e até outras matérias da área de ciência, expandindo ainda mais o conhecimento e a interação dos alunos da Realidade Aumentada. Outro trabalho que poderá ser desenvolvido é o uso da Realidade Virtual para essas matérias citadas, pois, esses conteúdos, com a tecnologia se tornam ainda mais atraentes e melhoram o conhecimento dos alunos. Para finalizar, quando é utilizado o termo futuro não se refere que está distante. Com certeza essas tecnologias estarão presentes no dia a dia e nas instituições de ensino bem antes do que se pode imaginar."
}