{
    "Autor": [
        "Alexsandro Daminelli Júnior",
        "Gabriel Lúcio Gonçalves"
    ],
    "Título": "O IMPACTO DA EXECUÇÃO FISCAL MUNICIPAL NO TRIBUNAL DE JUSTIÇA DE SANTA CATARINA: UM ESTUDO DE CASO UTILIZANDO INTELIGÊNCIA DE NEGÓCIOS",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "A administração pública tem buscado se atualizar conforme a evolução das Tecnologias da Informação e Comunicação (TIC), e com isto, estreitar sua relação com o cidadão, fornecendo -o as informações sobre suas atividades. Através da aplicação das Leis e conceitos referentes a governo eletrônico, dados abertos e transparência pública, fazendo um contraponto ao seu tradicional sistema burocrático. As ações de execuções fiscais têm impacto significativo no âmbito do Tribunal de Justiça de Santa Catarina (TJSC). E este trabalho buscou analisar se as informações e dados referentes a este tipo de ação, estão disponíveis de forma clara e objetiva ao cidadão no portal TJSC, demonstrando seu impacto financeiro para o tribunal do estado. O trabalho consiste em uma pesquisa bibliográfica, científica e aplicada, uma vez que inicialmente, pesquisou-se os conceitos de transparência pública, dados abertos, governo eletrônico e inteligência de negócios. Logo após buscou-se informações no portal do TJSC, no portal do Conselho Nacional de Justiça (CNJ), bem como do Instituto de Pesquisas Aplicadas (IPEA), e ainda, contato com algumas prefeituras do estado. As informações necessárias foram reunidas e tabuladas em um banco de dados. Foi selecionada uma ferramenta de inteligência de negócios (BI), para análise dos dados obtidos. Ao final de todo este processo, foi possível observar quantitativamente o impacto financeiro das ações de execução fiscal municipal, no Tribunal de Justiça de Santa Catarina. As execuções fiscais pendentes em 2017 (por exemplo), no TJSC têm custo de resolução de quase cinco bilhões de reais. Nos municípios raramente as execuções fiscais compensam sob o ponto de vista econômico. Ao concluir o trabalho é possível verificar que as execuções fiscais atualmente são apontadas como um grande problema, pois com base nos resultados apresentados verifica-se que estas ações são financeiramente deficitárias, já que os custos ultrapassaram os valores que podem efetivamente serem recuperados. Destacamos a importância das políticas de dados abertos com fácil acesso que permitam que a sociedade possa entender, estudar e avaliar esses dados. Através do entendimento das informações disponibilizadas pelo órgão público e da utilização de ferramentas de inteligência de negócios o trabalho conseguiu apresentar um cenário de impacto das ações execuções fiscais em Santa Catarina, que não é possível de ser visualizado utilizando apenas as informações fornecidas pelos órgãos públicos.",
    "Palavras-chave": [
        "Transparência Pública",
        "Dados Abertos",
        "Governo Eletrônico",
        "Inteligência de Negócios",
        "Análise de Dados"
    ],
    "Introdução": "As Tecnologias da Informação e Comunicação (TIC’s) estão cada vez mais presentes na vida das pessoas em todas as esferas. Na medicina já existe a possibilidade de um cidadão ser operado por um robô cirurgião com o médico controlando a operação de outro país, na educação o ensino a distância sendo possível realizar o aprendizado de um novo idioma ou realizar uma graduação inteiramente pela internet, no ambiente bancário os chatbots (programas de atendimento ao consumidor que utilizam inteligência artificial) vem substituindo o atendimento físico nas agências e principalmente no governo as TIC’s vem fazendo uma grande revolução. Através dessa evolução nas TIC’s a circulação de informação na sociedade vem crescendo de maneira exponencial e se integrando no cotidiano da sociedade e permitindo que com pouco esforço e sem sair de casa o cidadão encontre informações sobre os mais variados temas. Com essa nova realidade da disponibilização e do acesso à informação incorporada ao dia a dia dos cidadãos temos um contraponto no âmbito da administração pública tradicionalmente administrada de maneira burocrática (KURTZ, 2015). A administração pública tem buscado maneiras de adequar as políticas públicas as novas demandas tecnológicas e sociais que evolução das TIC’s têm apresentado. Essas novas políticas visam utilizar as novas tecnologias para aproximar o governo da sociedade e do cidadão, através de conceitos como governo eletrônico e transparência pública (KURTZ, 2015). Com a informatização dos serviços e a da prestação das informações o Estado busca garantir ao cidadão o direito à informação, garantido constitucionalmente através da Constituição Federal de 1988. Dentro da gama de serviços públicos que utilizam as TIC’s para conseguir uma melhor prestação de serviços, o Poder Judiciário foi um dos poderes pioneiros na utilização das tecnologias como maneira de melhorar a prestação de serviços ao cidadão com a utilização do processo eletrônico e promover a transparência pública na atuação dos Tribunais de Justiça. Em Santa Catarina, o Tribunal de Justiça Estadual, iniciou a utilização do Processo Eletrônico em 2006 e concluiu sua implantação em 2014. Neste trabalho de conclusão de curso serão investigadas se as informações abertas fornecidas pelo Tribunal de Justiça de Santa Catarina em relação as ações de execução fiscal municipal, respeitam as leis de dados abertos, transparência pública e governo eletrônico e o conceito de inteligência de negócios. Se as informações existem, se são claras, objetivas, de fácil compreensão e se são suficientes para o entendimento por parte do usuário final (cidadão), da realidade e do impacto desse tipo de processo na justiça estadual.",
    "Conclusão": "O intento do trabalho foi analisar o impacto que as execuções fiscais municipais apresentam no Tribunal de Justiça de Santa Catarina, utilizando os conceitos de transparência, dados abertos e inteligência de negócios para analisar as informações disponibilizadas pelo Poder Judiciário Catarinense. Através da busca das informações necessárias para elaboração do trabalho no site do Tribunal de Justiça de Santa Catarina foi constatado o primeiro problema relevante, apesar do órgão público contar com um portal de acesso à informação e transparência, não estavam disponíveis lá as informações necessárias para elaboração do trabalho. A construção dos cenários necessários ao trabalho só foi possível por que a iniciativa Justiça em Números, mantida pelo Conselho Nacional de Justiça possuía os dados necessários à continuidade do trabalho. Para construção dos cenários e análise dos dados foi estudada e utilizada a ferramenta Tableau® considerada uma ferramenta que possui uma estrutura simples e de fácil assimilação. O conjunto de visualizações, layout da interface para o usuário, possibilidade de compartilhamento dos resultados e formas intuitivas de análise dos dados, se mostram muito interessantes na utilização desta ferramenta e na construção e análise dos cenários necessários. No primeiro cenário apresentado temos a situação atual de execuções fiscais no Tribunal de Justiça de Santa Catarina onde foi possível identificar que em 2017 o Estado possuía 3.247.550 processos pendentes, sendo 2.792.696 processos pendentes de 1º grau. Dentro dos processos pendentes existentes no 1º grau tem-se 1.142.607 processos de execução fiscal. Essas são as principais informações disponíveis na ferramenta disponibilizada pelo CNJ, não sendo possível realizar um aprofundamento na análise das informações das execuções fiscais. No segundo cenário apresentado tem-se as informações levantadas no primeiro cenário complementadas com informações relevantes de fontes externas. Através do estudo realizado pelo IPEA foi possível definir o custo médio de uma execução fiscal em R$ 4.368,00 e a taxa média de recuperação do crédito utilizando a execução fiscal é de 25,8%. Por meio de consulta a seis municípios catarinenses foram levantadas as informações de processos de execução fiscal que cada município encaminhou nos anos de 2015, 2016 e 2017, e qual o valor total que cada município tentou recuperar através da execução fiscal nos anos de 2015, 2016 e 2017. Ao realizar a análise do segundo cenário uma série de novas informações ficam disponíveis. Ao compararmos o total de execuções fiscais pendentes no Tribunal de Justiça de Santa Catarina com seu custo médio unitário verificamos que o custo para resolver todas as execuções seria de quase cinco bilhões de reais. Ao realizar a análise da quantidade de execuções fiscais encaminhadas pelos municípios por ano e o valor que buscam recuperar com essas ações comparando com o custo médio da execução fiscal é possível verificar que raramente essas execuções fiscais compensam sob o ponto de vista econômico e da boa utilização do aparato do Poder Judiciário. É possível perceber que mesmo que todo o valor que município esteja tentando recuperar seja pago pelos devedores executados, na maioria das vezes esse valor é inferior ao custo médio de uma execução fiscal. Quando adicionamos a informação da taxa média de recuperação de valores através da execução fiscal, que segundo o IPEA é de 25,8%, não existe cenário nos seis municípios pesquisados em que a execução fiscal seja financeiramente viável já que os custos sempre ultrapassaram os valores que podem efetivamente serem recuperados."
}