{
    "Autor": "Kamily Marcon Marcelino Texeira",
    "Título": "Provadores Virtuais com Realidade Aumentada no E-commerce: fatores que influenciam a aceitação do usuário",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profa. Dra. Eliane Pozzebon",
    "Coorientador(a)": "Profa. Paula Zambiasi",
    "Resumo": "O avanço das tecnologias imersivas transformou o comércio eletrônico apresentando soluções inovadoras como os provadores virtuais baseados em Realidade Aumentada (RA), que permitem aos consumidores experimentar produtos de forma interativa e prática. Este trabalho explora como as dimensões de engajamento, imersão, motivação e usabilidade influenciam a aceitação dessa tecnologia. Para isso, conduziu-se um estudo de caso com 33 participantes que interagiram com os provadores virtuais da marca Oakley e DeepAR. Para coleta de dados, foram elaborados um questionário estruturado e uma questão aberta, analisados seguindo uma abordagem mista. Os resultados revelaram alto engajamento e satisfação dos usuários, ressaltando a importância de elementos como o design intuitivo e de interatividade. Na imersão, foram observadas variações individuais, enquanto a motivação foi influenciada pela curiosidade e pela utilidade percebida. Em termos de usabilidade, os resultados demonstraram ampla acessibilidade das ferramentas, mas demandando aprimoramento na precisão das simulações e na prevenção de erros. Nessa perspectiva, evidenciou-se que essas tecnologias foram bem aceitas pelos usuários e possuem grande potencial para enriquecer a experiência do consumidor, embora desafios relacionados à precisão, à prevenção de erros e à diversidade de produtos ainda precisem ser superados.",
    "Palavras-chave": [
        "realidade aumentada",
        "provadores virtuais",
        "experiência do usuário",
        "comércio eletrônico"
    ],
    "Introdução": "Nos últimos anos, as tecnologias digitais têm transformado os processos de consumo e a oferta de produtos e serviços, especialmente no comércio eletrônico (e-commerce). A conveniência, a economia de tempo e os preços competitivos se tornaram fatores chave para o crescimento contínuo desse setor (Sriram et al., 2019). Esse movimento se intensificou com a pandemia de COVID-19, que forçou as empresas de varejo a migrarem para o digital, atendendo à demanda por alternativas de compra seguras e práticas (Guthrie; Fosso-Wamba; Arnaud, 2021). A grande varejista Inditex, por exemplo, registrou um crescimento de 52% nas vendas online no final de 2020, comparado com 29% no ano anterior (Bilińska-Reformat; Dewalka-Opitek, 2021). Embora as restrições pandêmicas tenham chegado ao fim, o uso contínuo dessas plataformas indica que novos hábitos digitais e de consumo foram consolidados. Segundo Pantano et al. (2020), os hábitos de consumo adquiridos na pandemia transformaram permanentemente a maneira como os consumidores compram, uma vez que, além de adotarem novos comportamentos de compra, também revisaram os antigos, priorizando um acesso mais conveniente a produtos e serviços sem a necessidade de presença física. Nesse contexto, as tecnologias imersivas, como a Realidade Aumentada (RA) e a Realidade Virtual (RV), surgiram como soluções promissoras para o e-commerce. A RV é definida na literatura associada ao uso de dispositivos específicos para criar um ambiente totalmente imersivo, no qual o usuário interage com um mundo tridimensional gerando uma sensação de presença espacial (Bryson, 2013; Steuer, 1992). Em contraste, a RA sobrepõe elementos virtuais ao mundo real, criando uma experiência interativa em tempo real (Azuma, 1997; Jarvonik, 2016; Simpkins; Allen; Dematt, 2020; Tan; Chandukala; Reddy, 2021). A RA tem se destacado no e-commerce devido à sua capacidade de integrar elementos virtuais ao ambiente físico do usuário de forma simples e acessível. Ao contrário da RV, que exige dispositivos específicos e um ambiente controlado para uma experiência imersiva satisfatória, a RA pode ser facilmente acessada por meio de dispositivos comuns, como smartphones e tablets (Boletsis; Karahasanovic, 2020). Essa escalabilidade e custo reduzido de implementação a torna mais viável para o varejo, permitindo aos consumidores realizar provas de produtos em tempo real diretamente de suas casas. Entre as aplicações de RA no comércio eletrônico, os provadores virtuais vêm ganhando força nos últimos anos, permitindo que os consumidores visualizem e 'experimentem' roupas e acessórios e sobreponham imagens desses itens ao ambiente físico do usuário (Javornik et al., 2016). Essa tecnologia imersiva tem crescido cada vez mais no ambiente digital varejista por reduzir a diferença entre a experiência de compra online e offline (Wagner, 2007 apud Kim; Forsythe, 2009). Contudo, a literatura ainda é incerta quanto à eficácia da experiência de prova virtual e ao impacto dessa tecnologia sobre os consumidores (Yoo, 2023), evidenciando a necessidade de uma compreensão mais profunda sobre como esses dispositivos influenciam a percepção do usuário. Para aprofundar o entendimento da experiência de prova virtual e de como ela é interpretada pelos usuários, é essencial explorar as dimensões que influenciam a percepção desses indivíduos. Estudos indicam que a usabilidade (Hartson, 1997; ISO, 2002), imersão (Milgram; Kishino, 1994; Rudd et al., 2012; Csikszentmihalyi, 1990), motivação (Deci; Ryan, 2000; Keller, 1987; Childers et al., 2000) e engajamento (Park; Kim, 2021) impactam diretamente a compreensão dos consumidores em relação aos provadores virtuais. Embora outras dimensões sejam abordadas na literatura, este trabalho destaca essas por seu impacto direto na experiência com sistemas imersivos. A usabilidade afeta diretamente a facilidade de uso e o aprendizado do sistema (NBR, 2002), enquanto a imersão está ligada à percepção de presença no ambiente virtual, aumentando a confiança nas decisões de compra (Milgram; Kishino, 1994). Já a motivação e o engajamento influenciam a intenção de uso contínuo da tecnologia, sendo fundamentais para sua aceitação no longo prazo (Deci; Ryan, 2000). Diante da crescente necessidade de aprofundamento sobre a experiência dos consumidores com provadores virtuais de RA, este estudo tem como objetivo investigar a percepção dos usuários em relação às dimensões de engajamento, imersão, motivação e usabilidade. Para tanto, foi adotada uma metodologia experimental com delineamento de estudo de caso, integrando análises qualitativas e quantitativas, a fim de observar a interação dos usuários com a tecnologia dos provadores virtuais e entender como essas inovações impactam a experiência do consumidor e sua percepção sobre a tecnologia.",
    "Conclusão": "Este trabalho investigou a experiência do usuário com provadores virtuais de Realidade Aumentada no comércio eletrônico para produtos vestíveis de moda, explorando como as dimensões de engajamento, imersão, motivação e usabilidade influenciam a percepção dessa tecnologia pelos usuários. Especificamente, buscou-se realizar um estudo avaliativo do desempenho de diferentes provadores virtuais de RA, selecionando duas ferramentas com base nos critérios de eficácia, eficiência e satisfação. A análise inclui a aplicação de um questionário, permitindo avaliar como cada dimensão impacta a percepção dos usuários e influencia a aceitação dessa tecnologia. Os objetivos gerais e específicos foram atingidos. Por meio de uma análise mista das respostas dos participantes, constatou-se que as dimensões definidas se inter-relacionam para criar uma experiência de compra mais interativa e satisfatória, influenciando positivamente o olhar do usuário sobre as tecnologias. O estudo prático com provadores virtuais distintos permitiu avaliar as dimensões centrais da experiência do usuário e identificar de que forma cada uma delas influencia a percepção das ferramentas de RA. Este estudo, entretanto, possui limitações que afetam a generalização dos resultados. A amostra de 33 participantes, apesar de ideal para um trabalho exploratório de conclusão de curso, não é representativa da população geral de usuários de provadores virtuais, e as ferramentas de RA aplicadas, específicas para óculos e tênis, sendo a de tênis não especificada para o e-commerce. A coleta de dados em ambiente controlado pode não refletir completamente as condições reais de uso dos provadores virtuais, o que abre espaço para futuras pesquisas em cenários mais próximos ao cotidiano dos consumidores, como uma pesquisa online onde os participantes ficariam em suas próprias casas. Também se sugere o emprego de uma abordagem focada em entrevistas dos participantes, o que captaria ainda mais as nuances subjetivas das experiências do usuário. O problema de pesquisa, centrado em como as dimensões de experiência influenciam a percepção dos participantes sobre os provadores virtuais de RA, teve suas respostas fundamentadas a partir dos dados coletados. As dimensões de engajamento, imersão, motivação e usabilidade demonstraram um impacto direto na aceitação e disposição dos participantes para utilizar os provadores no e-commerce. O alto nível de engajamento e imersão alcançado contribuiu para um interesse contínuo, enquanto a motivação intrínseca, evidenciada pela curiosidade e prazer em explorar produtos, indicou que o uso da tecnologia gerava um envolvimento positivo. A usabilidade intuitiva das ferramentas, por sua vez, aumentou a confiança dos consumidores na tecnologia. Em conjunto, essas dimensões produziram um ciclo positivo: quanto mais imersiva e interessante era a experiência, maior o nível de engajamento e motivação para continuar usando o provador virtual. Isso, aliado à facilidade de uso, reforçou a percepção positiva da ferramenta e ajudou a estabelecer uma relação de confiança, essencial para a aceitação e uso contínuo da tecnologia. Embora algumas respostas não tenham sido inteiramente positivas, as contribuições dos participantes não indicaram rejeição, mas sim sugestões construtivas para melhorias. As críticas focaram principalmente na precisão do mapeamento de certos produtos, na ferramenta de calçados, e na adaptação da ferramenta a diferentes dispositivos, o que demonstra um posicionamento de aceitação com expectativas de aprimoramento. Essas sugestões indicam que os participantes estão dispostos a adotar a tecnologia, desde que ela seja aprimorada em certos aspectos, reforçando a conclusão de que o problema de pesquisa foi efetivamente respondido. Este estudo forneceu resultados relevantes para o desenvolvimento e aplicação de tecnologias imersivas no comércio eletrônico, ao oferecer uma análise prática das interações dos consumidores com provadores virtuais e ao propor caminhos para melhorar a experiência do usuário. Como continuidade desta pesquisa, recomenda-se a utilização de ferramentas de RA mais especializadas, voltadas especificamente ao e-commerce, e a ampliação da base amostral para uma melhor generalização dos resultados, incluindo a aplicação para diversos públicos. Além disso, futuras pesquisas poderiam incorporar análises estatísticas avançadas para explorar de forma mais detalhada a relação entre as dimensões de experiência e a intenção de uso da RA, oferecendo uma compreensão mais sólida para aprimorar o design e a funcionalidade dessas ferramentas."
}