{
    "Autor": "Dieﬀerson Koderer Môro",
    "Título": "RECONHECIMENTO DE ENTIDADES NOMEADAS EM DOCUMENTOS DE LÍNGUA PORTUGUESA",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Vinicius Faria Culmant Ramos",
    "Coorientador(a)": null,
    "Resumo": "Atualmente existe um grande volume de documentos pessoais e oficiais, que trafegam na internet em diversos formatos, tais como doc, pdf, txt, que podem ter seus conteúdos analisados computacionalmente e assim agilizar diversos processos executados com tais informações. Desta forma faz-se necessário a existência de procedimentos para realizar a análise destes documentos, e uma das ferramentas para esta tarefa é o Reconhecimento de Entidades Nomeadas (REN). Este trabalho tem como objetivo realizar um estudo sobre a aplicação e resultados que se pode obter em documentos redigidos de acordo com a norma culta da língua portuguesa. Para tal estudou-se os conceitos fundamentais relacionados ao Processamento de Linguagem Natural (PLN) e o tratamento de documentos em formato PDF. Foi feito um estudo de algumas ferramentas e corpus existentes, para textos escritos em português. Utilizou-se o framework spaCy, juntamente com o corpus HAREM e alguns documentos oficiais. A automatização na detecção de entidades nomeadas e seus vínculos em documentos escritos em língua portuguesa, pode ser viável utilizando-se as ferramentas e bases de dados já existentes. Entretanto, a dificuldade ainda são grandes e resultados que podem ser melhorados, visto que a identificação correta dessas entidades ainda não superou os 90% de acurácia.",
    "Palavras-chave": [
        "Reconhecimento de Entidades Nomeadas",
        "Língua Portuguesa",
        "Processamento de Linguagem Natural",
        "Aprendizado de Máquina"
    ],
    "Introdução": "A informatização tem sido uma constante e prevê-se que mantenha tal tendência. A informação nas últimas décadas, que antes era guardada em papel ou em outro meio físico, passou a estar no suporte digital. Fotografias, documentos, música, filmes e jogos são exemplos de informações armazenadas e distribuídas digitalmente [MORAIS, 2016]. Segundo Fred [2018], cerca de 90% dos dados existentes hoje em dia foram gerados nos últimos 2 anos. Em torno de 80% destes dados têm forma não estruturada ou semi-estruturada, sendo estas informações vindas de e-mails, publicações de blog, redes sociais, textos gerados em sistemas de suporte ao cliente, sensores, imagens digitais, vídeos, etc [FRED, 2018]. Nesse caso, um usuário do sistema que utiliza esse tipo de dado é obrigado a interpretar os dados para poder compreender as informações contidas neles. Segundo um estudo da DOMO [2018] estima-se que até 2020 cada pessoa no planeta esteja gerando 1,7 MB (MegaBytes) de dados por segundo. Com essa grande quantidade de informações disponibilizadas na web, é necessário a existência de métodos para realizar a filtragem dos dados relevantes e apresentá-los aos leitores. O Processamento de Linguagem Natural (PLN) é um campo da Inteligência Artificial (IA) voltado para tornar a linguagem humana compreensível para os computadores. Isso permite obter informações estruturadas de forma que elas possam ser indexadas e usadas por uma máquina para tarefas orientadas por conhecimento, como resposta a perguntas [PIRES, 2017]. Dados em formato de texto são dados desestruturados que, normalmente, pertencem a uma linguagem específica que possui uma sintaxe e uma semântica associada. Qualquer extrato de texto, como documentos, palavras ou frases, estão relacionados diretamente às linguagens naturais na maioria das vezes, portanto, uma linguagem “natural” é uma linguagem usada por seres humanos de forma natural para se comunicar ao invés de construída ou criada artificialmente, como são as linguagens de programação de computadores. Os idiomas português, inglês ou chinês são exemplos de linguagens naturais. Elas são utilizadas para que humanos possam se manifestar de diferentes maneiras, como numa comunicação oral, um discurso, por escrito ou até por sinais. Apesar da estrutura sintática e gramatical existentes nas linguagens naturais, o processamento e análise de textos são um grande desafio computacional, especialmente para a IA. Isso porque essas linguagens são especialmente diferentes das linguagens de programação computacionais, como é possível observar nos códigos 1.1 e 1.2, pois estas são estruturadas e possuem sintaxe e padrões regulares, portanto, é muito difícil aplicarmos, diretamente, modelos matemáticos ou estatísticos diretamente às linguagens naturais.",
    "Conclusão": "Compreendemos que a proposta de automatização de detecção de entidades nomeadas e seus vínculos em documentos escritos na norma culta da língua portuguesa é viável utilizando-se as ferramentas e bases de dados existentes. Entretanto, ainda não temos bons resultados com eles, visto que a identificação correta dessas entidades ainda não superou os 90% de acurácia, o que é um grande problema para a análise de documentos de caráter jurídico por parte das instituições envolvidas, como por exemplo documentos da Polícia Federal. Os modelos treinados, apesar de um melhor desempenho, também não são satisfatórios. Sabemos que é necessário identificar mais entidades em outros documentos para aumentar a qualidade do treinamento. Isto deve levar ao REN com maior precisão, em especial as entidades do tipo Pessoa. Como trabalhos futuros, sugerimos a adaptação das outras bases de dados anotadas (FLORESTA, AMAZÔNIA e BOSQUE) para serem utilizadas como treinamento das principais ferramentas de NER: NERP-CRF, OpenNLP, spaCy e NLTK. Após os testes com todas as bases e ferramentas, buscaremos melhorias nos algoritmos para conseguirmos uma acurácia acima dos 95%, e uma cobertura mais alta, conforme já é apresentado na literatura para o idioma inglês."
}