{
    "Autor": "Arthur Warmling, Rodrigo Darabas Zanatta",
    "Título": "Avaliação de Usabilidade em E-commerce: Análise sob a Ótica de um Usuário Convencional",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Dr. Professor Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "O número de sites de E-commerce cresce demasiadamente nos últimos anos, cada vez mais as pessoas migram da loja física para o ambiente virtual de comércio eletrônico. Neste estudo procura-se investigar e avaliar a usabilidade em sites de E-commerce no Brasil. Para tal, este trabalho tem como objetivo investigar a qualidade de experiência do usuário convencional através de técnicas de avaliação de usabilidade encontradas na área de pesquisa de Interação Humano Computador de sites de compras em lojas virtuais, como Mercado Livre, Saraiva e Americanas. A partir de uma revisão da literatura, com o objetivo de identificar os possíveis problemas de usabilidade que os usuários com conhecimento básico, ou seja, usuários convencionais, enfrentam no dia-a-dia em sites de E-commerce foi elaborado um questionário de satisfação e organizado estudos de casos com grupos de usuários para realizar uma avaliação de usabilidade em sites de E-commerce no Brasil. Para a análise dos resultados foi realizada uma análise descritiva. A qualidade de um site é baseada em fatores de usabilidade, os quais foram avaliados através de um questionário de satisfação com um grupo de usuários convencionais, foi observado o comportamento através de ações e executadas em três sites conhecidos no âmbito brasileiro. Atualmente, cada site apresenta atrativos e especialidades, dentre os resultados, tivemos o site das Americanas como uma das lojas virtuais mais utilizadas e com melhores índices de usabilidade comparado aos outros concorrentes.",
    "Palavras-chave": "Avaliação de Usabilidade, E-commerce, Tecnologias da Informação e Comunicação.",
    "Introdução": "Os usuários gastam muito tempo e dinheiro em sites de comércio eletrônico (em inglês, E-commerce ). No presente trabalho procurou-se investigar a usabilidade encontrada em sites de E-commerce no Brasil. Buscou-se medir a qualidade de experiência do usuário convencional através de questionários com diversos usuários para saber a opinião da usabilidade dos sites de E-commerce mais atuantes no Brasil, tais como Mercado Livre, Saraiva e Americanas. A pesquisa foi realizada em sites de E-commerce durante o período de 30 dias, foram elaborados relatórios relacionados a usabilidade e melhoramento da usabilidade e entrevistas com especialistas em usabilidade de sites de comércio eletrônico. Foi desenvolvido um questionário de satisfação direcionado a usuários sem experiência, ou seja, convencional, e um levantamento das principais dificuldades encontradas pelos usuários nos sites supracitados. Os sites de E-commerce multiplicaram-se no cenário atual, tornou-se uma prática comum migração da loja física para o ambiente virtual. Assumindo esse fato, o desenvolvimento de um E-commerce bem estruturado é essencial e o diferencial na experiência de compra, pois um site que confiável tem organização estrutural lógica e a usabilidade autoexplicativa, de forma que o cliente sinta-se seguro ao concretizar a sua compra.",
    "Conclusão": "Ao final deste trabalho considera-se que um site bem desenvolvido e estruturado faz toda a diferença na hora de fazer uma avaliação de usabilidade, pois um site que não investir em SEO deixa espaço para seus concorrentes nos mecanismos busca, deixando brechas para seus concorrentes potenciais. O objetivo de ter um site é converter acessos em vendas, para tal é importante que o site transmita clareza na usabilidade, confiabilidade, fidelidade e aparência, para ter um grau elevado de chances de deixar seu cliente satisfeito, sendo que muitos usuários enfrentam problemas na hora de comprar, e procurar o produto ideal para sua compra, pois alguns sites não estão totalmente adequados para isso. Fatores como confiabilidade e usabilidade são o diferencial determinante para o usuário convencional. As lojas e varejistas brasileiros têm migrado cada vez mais para o comércio eletrônico, devido à globalização que interage com uma grande variedade de produtos e preços de seus concorrentes, a loja que não possui este recurso fica em desvantagem perante os seus concorrentes. A qualidade de um site é baseada em fatores de usabilidade. Neste trabalho, esses fatores foram avaliados através de um questionário de satisfação com um grupo de usuários convencionais. Foi observado seu comportamento através de ações e executadas em três sites conhecidos no âmbito brasileiro, são eles Mercado Livre, Saraiva e Americanas. Atualmente, cada site com seus atrativos e especialidades, dentre os resultados, tem-se a Americanas como uma das lojas mais utilizadas e com melhores índices de usabilidade comparado aos outros concorrentes. Como trabalhos futuros pretende-se explorar formas mais intuitivas de se realizar os testes de usabilidade para atingir um número maior de usuários e investigar outros possíveis fatores que levam os clientes e usuários a comprarem no comércio eletrônico e não em lojas físicas."
}