{
    "Autor": "Aruan Cuenca Carrara",
    "Título": "BLOCO FÓRUNS NÃO RESPONDIDOS: DESENVOLVIMENTO E IMPLEMENTAÇÃO DE UM PLUGIN DA PLATAFORMA MOODLE",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Cristian Cechinel",
    "Coorientador(a)": "Prof. Me. Emanuel Marques Queiroga",
    "Resumo": "Buscando exibir informações de difícil acesso para o usuário, um plugin do tipo bloco foi planejado e desenvolvido para o Moodle. Com essas informações, o usuário tem mais controle sobre o ambiente e suas atividades. O desenvolvimento deu-se utilizando PHP, HTML e SQL, além dos padrões de desenvolvimento da plataforma. Para validar o mesmo, foi criado e aplicado um questionário baseado no modelo TAM nos usuários. O questionário apontou alta aprovação pelos usuários em todas as áreas de aplicação. Desta forma, apontou-se que a tecnologia foi aceita e validada. ",
    "Palavras-chave": "Moodle. Plugin. Fóruns virtuais. Aceitação.",
    "Introdução": "Acompanhando a globalização, de acordo com Segrera (2005), os sistemas educacionais foram obrigados a adaptarem-se a diversas mudanças, tais como: ● Mudanças organizacionais e no tipo de trabalho que exigem maior nível educacional e constante qualificação; ● Crescente pressão sobre os governos para maior investimento na área educacional, pois é necessário maior qualificação e técnicas aprimoradas, com intuito de competir no mercado exterior; ● A complexidade cada vez mais alta da educação superior, com currículos mais diversificados e a exigência de estudantes com domínio em diversas tecnologias e idiomas; ● O desenvolvimento da educação virtual com fins comerciais (principalmente a superior); Para isso, as instituições de ensino, utilizando-se das expansivas tecnologias da comunicação (principalmente a informática e a telecomunicação), deram vida a novos cenários e modalidades de ensino. Estas modalidades, associadas com o acelerado desenvolvimento das novas tecnologias da informação e comunicação (TIC) resultaram em uma série de aplicação, dentre elas, o ensino à distância (EAD) (HERMIDA et. al. 2006). Buscando oferecer suporte a essa modalidade, à troca de informações, interação e troca de materiais, surgem os ambientes virtuais de aprendizagem (AVAs), com a incorporação de novas tecnologias computacionais (RIBEIRO; MENDONÇA; MENDONÇA, 2007). Segundo França (2014), o principal papel de um ambiente virtual de aprendizagem é oferecer aprendizado ao usuário e suprir a interação entre pessoas necessária para ensinos presenciais, semipresenciais ou à distância. Assim, o conteúdo e a forma com que o mesmo é disposto neste ambiente deve ser amigável ao usuário também. Com a utilização destas tecnologias, é necessário também, ao desenvolver ou aprimorar estes recursos, ter em mente que o usuário deve ter a menor carga de processamento possível. Ou seja, não pode ter dificuldades em realizar a tarefa, ou em encontrá-la, ou precisar realizar uma grande quantidade de cliques para acessar. Há também uma série de outros fatores como design e dados importantes a serem utilizados (MACÊDO et. al., 2003). Caso o usuário tenha problemas com a interface ou com o processamento de informações oferecidas, é possível que o mesmo tenha dificuldades ou até mesmo deixe de realizar as atividades (OLIVEIRA et. al., 2016). Assim, uma interface voltada para o usuário, com dados suficientes para a realização das atividades, de uma forma clara e disposta de maneira amigável faz com que o mesmo aprenda as funções mais facilmente e efetivamente responda aos conteúdos propostos (PREECE et. al., 2013). É preciso ainda salientar que o usuário tende a esquecer dados, inclusive dados importantes como senhas, pois a memória humana é limitada e falha como aponta Gross et al. (2009). Por isso, o sistema de armazenar estas informações e a interface ser responsável de apresentar estes dados quando necessário. Visando melhorias na plataforma Moodle, foi desenvolvido um plugin do tipo bloco, seguido por uma avaliação no modelo TAM ( Technology Acceptance Model ) para constatação da necessidade de maiores informações e informações mais relevantes como os fóruns não respondidos na interface da plataforma.",
    "Conclusão": "Com a aproximação da tecnologia do espaço de sala de aula, há interação entre muitos dos conceitos, recursos, ambientes, métodos e ambientes. Essa interação resulta em novos horizontes para a educação, com novas possibilidades, novos questionamentos, novos paradigmas, etc. que proporcionalmente apresentam novos desafios e barreiras. Uma dessas barreiras, que surgiu com a criação dos ambientes virtuais de ensino e aprendizagem, é a interação entre os participantes dos cursos, como professores, estudantes e tutores. Seguindo o desenvolvimento destas tecnologias e suas adaptações ao meio educacional, chegou-se em um formato onde a interação, ponto necessário para o aprendizado do estudante, tornou-se possível através de recursos dos AVAs. Estes recursos, como fóruns, chats, atividades, etc. também trouxeram novas possibilidades e desafios. Um recurso que surgiu e é de grande uso nos ambientes seria a interação por fóruns que, por ser feita de forma assíncrona, não necessita que os usuários participantes da discussão estejam conectados ao mesmo tempo, cirando assim um ambiente que se adapta às rotinas, costumes, limitações e horários dos usuários. Porém, como toda nova tecnologia, essa liberdade acaba ocasionando percalços na comunicação uma vez que alguém deixa de responder (por motivos como esquecimento, por exemplo). Essa falta de resposta gera defasagens tanto para o estudante que deixou de interagir, quanto para os demais, que deixaram de receber o conhecimento por outro ângulo. Nesse cenário, a criação de uma ferramenta para auxiliar no cumprimento destas atividades foi a opção escolhida. Com o desenvolvimento e a implementação de um plugin que exibe os fóruns da plataforma que o estudante ainda não participou, torna-se mais fácil para o estudante saber quais atividades ainda devem ser feitas. Assim, após a implementação no AVA e utilização pelos estudantes, foi aplicado um questionário que coletou informações sobre a aceitação da tecnologia e validação da mesma. Tendo base nos resultados obtidos através da análise dos resultados, a aceitação do plugin pelos usuários é grande, o que sugere que o bloco desempenha devidamente sua função, é acessível ao usuário e foi bem recebido pela comunidade, como é possível notar no gráfico a seguir (Gráfico 1). Com essa aceitação, determina-se que a intenção de uso, ou seja, a probabilidade de o usuário utilizar a tecnologia, é grande e elucida a contribuição que o plugin trouxe para os estudantes e suas vidas acadêmicas."
}