{
    "Autor": "Paulo Henrique Tonetti Costa",
    "Título": "Análise e Proposta de Melhoria do Processo de Manutenção de Veículos da Companhia Catarinense de Águas e Saneamento - CASAN",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Paulo César Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "A necessidade dos clientes já não é mais a mesma. Para que uma empresa possa se manter competitiva no mercado, é necessário mais que oferecer os mesmos produtos e/ou serviços que sua clientela está acostumada a consumir. O contexto atual exige cada vez mais uma mudança de postura com vistas a diminuir a tomada de decisão, custos e auxiliar na tomada decisões da maneira mais correta e coesa possível. Para proporcionar essa mudança de atitude e otimização de todo processo interno de uma organização, existem metodologias e ferramentas com intuito de facilitar e conduzir o processo de forma que sejam percebidas oportunidades de melhorias e a partir destas ocorram efetivamente às mudanças. Ao longo deste trabalho serão apresentados os conceitos chaves para se implantar a busca pela qualidade em todos os níveis da empresa, são apresentadas as sete ferramentas da qualidade, além de um estudo de caso utilizando a metodologia do PDCA na dentro da Companhia Catarinense de Águas e Saneamento – CASAN. A metodologia utilizada foi uma pesquisa de caráter bibliográfico e documental exploratória por meio de livros, artigos, sítios eletrônicos, periódicos e revistas, com vistas a identificar as metodologias, conceitos e ferramentas da qualidade que têm sido desenvolvidas. Seguiu o trabalho com um estudo de caso, realizado através do mapeamento e análise do processo conforme método PDCA. O objetivo principal do trabalho é identificar e analisar o processo de manutenção de veículos da Companhia Catarinense de Águas e Saneamento – CASAN, finalizando com a proposta de possíveis melhorias.",
    "Palavras-chave": "Ferramentas da Qualidade, PDCA, Melhoria de Processo.",
    "Introdução": "Para que uma organização se mantenha no mercado, é necessário muito mais que um preço atrativo. Segundo Rodrigues (2010), é necessário obter conhecimento multidisciplinar, de forma que haja uma integração de toda a organização em torno do seu negócio. Conforme Carpinetti (2012), atualmente a qualidade no meio empresarial já é vista como fator estratégico para a melhoria da competitividade e produtividade. Num contexto como o atual, totalmente online, onde as críticas, observações e difusão da informação se fazem, praticamente, em tempo real, os clientes estão cada vez mais exigentes e, atendê-los de forma parcial não é mais considerado como uma prática organizacional aceitável. Entregar ao cliente algo que vá atender ou superar suas expectativas está consumindo cada vez mais os recursos da organização. É diante disso que muitas organizações já estão em busca da implantação do conceito de qualidade total em todos os níveis da instituição. Com essa visão implantada, as informações ficam mais acessíveis a todos funcionários da empresa, o que os coloca como participantes fundamentais e, ativos em cada etapa ou tarefa de todo ciclo produtivo da empresa, o que passa a criar uma nova visão gerencial, internamente, independente da atividade fim. O presente trabalho de conclusão de curso tem como tema central a qualidade, fazendo um estudo de caso com uma análise e proposta de melhoria de um processo dentro da Companhia Catarinense de Águas e Saneamento – CASAN. No referencial teórico, busca-se definir os principais conceitos, os métodos gerenciais que se subdividem em conceito de controle e de processo. Procurou-se abordar também a garantia da qualidade e o planejamento da qualidade, bem como as ações corretivas como base da garantia da qualidade. E, ainda, indicadores e ferramentas da qualidade, destinadas à implantação, acompanhamento e controle nas organizações. Após o embasamento teórico, buscou-se fazer um estudo de caso, mapeando o atual processo de manutenção de veículos da empresa, com objetivo de identificar possíveis pontos de melhoria. O mapeamento ocorreu com auxílio de uma ferramenta de modelagem, gratuita, algo que atualmente, já é bastante difundido e, permite que até mesmo pequenas organizações possam implantar o conceito de qualidade. Após esse mapeamento, foi utilizado o método PDCA para que seja possível analisar possibilidades de propor melhorias. Dessa forma, se busca fazer uma exploração abrangente do conteúdo que venha resultar num material amplo sobre o tema e, que possa servir para uma proposta de melhoria no fluxo dentro da organização. A área de mapeamento e melhoria de processos vem ganhando cada vez mais reconhecimento e, já vem sendo tratada com muito mais atenção pela grande maioria das empresas que almejam obter uma maior rentabilidade por meio da manutenção da qualidade dos produtos/serviços oferecidos. Segundo Carpinetti (2012, p.24), para que uma organização conquiste seu espaço no mercado e, possa se manter com fôlego para concorrer é muito simples, conforme seus dizeres: “Clientes satisfeitos representam faturamento, boa reputação, novos pedidos, resultados para empresa, empregos e remuneração para os funcionários.",
    "Conclusão": "Ao se analisar uma estrutura inteira de uma grande organização, composta por diversos setores e departamentos individuais e, ao mesmo tempo interligados, não existe outra possibilidade a não ser a utilização de uma ferramenta de gestão para combinar os procedimentos, processos e recursos de forma a manter um padrão e uma rotina de melhoria. A divisão em quatro partes do método PDCA juntamente com as ferramentas da qualidade, tornam de fácil compreensão e aplicação dentro de qualquer organização o processo de melhoria contínua. É possível ser praticado em qualquer setor, abrangendo cada processo ou tarefa de determinada atividade da empresa. Isto possibilita que sua implantação ocorra em todos os níveis da organização, com uma participação ativa e, intensa, no controle da qualidade total, no sentido de que os objetivos possam ser atingidos. O objetivo inicialmente proposto foi atingido. O processo foi identificado, mapeado e analisado. Foram identificados pontos de possíveis melhorias passíveis de implementação na organização. Estes resultados encontrados, não se aplicam a demais instituições pelo fato de se tratar de um estudo de caso, ou seja, não haverá condição idêntica em outra organização que permita apenas aplicar o resultado deste estudo. Com base no material bibliográfico levantado, foi possível explorar e apresentar os conceitos e definições do que representa qualidade dentro de uma organização. Nota-se que a qualidade está presente em cada etapa de cada processo, e que, cada mínima parte do todo é sim, fundamental e, contribui, diretamente, para que o objetivo seja alcançado. Portanto, buscar a qualidade é possível e fundamental para uma empresa que visa se manter no mercado de forma competitiva, aliando a satisfação dos clientes com minimização de custos seja de capital financeiro, de custos produtivos, operacionais, de recursos humanos ou quaisquer outros necessários para a sua operação. Para que trabalhos futuros, a implantação desta melhoria proposta irá gerar material suficiente para que seja feita uma análise e verifique-se a eficácia de tal mudança. Desta forma será possível quantificar as solicitações que ainda chegam com falta de informações e, se estas informações faltantes impedem seu prosseguimento ou não, bem como verificar índice de campos com maior falta de preenchimento para estudar mudanças tanto no layout do formulário quanto na definição dos campos que o compõem o formulário de pedido de manutenção."
}