{
    "Autor": "Éverlon Antônio Custódio",
    "Título": "AVALIAÇÃO DE USABILIDADE DE SISTEMAS ADMINISTRATIVOS DE UMA INSTITUIÇÃO PÚBLICA DE ENSINO E PROPOSTA DE UM SISTEMA UNIFICADO PARA GESTÃO DO ESPAÇO FÍSICO",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho apresenta a avaliação de usabilidade de dois sistemas utilizados na gestão do espaço físico da Universidade Federal de Santa Catarina, no Campus Araranguá utilizando os dados coletado na avaliação de usabilidade, a legislação relacionada e as necessidades dos usuários, faz a modelagem de um sistema único que atende às demandas identificadas. Do ponto de vista da legislação, é importante que os sistemas governamentais permitam transparência e publicidade das ações do governo, e, por isso, eles devem sempre em seu desenvolvimento considerar o direito à informação. Com a adequada publicidade, a própria comunidade pode atuar como fiscalizadora dos atos públicos. Com esta participação espera-se gerar um estado mais eficiente, menos burocrático e mais transparente. Para avaliação da usabilidade foi realizada uma avaliação heurística. Para modelagem do sistema utilizou-se diagramas da Linguagem Unificada de Modelagem, que permitem modelagem de sistemas utilizando diagramas padronizados. O sistema modelado deve permitir que administradores e usuários utilizem um único sistema, simplificando a gestão.",
    "Palavras-chave": "Usabilidade, Engenharia de Software, Linguagem Unificada de Modelagem, Transparência na Gestão Pública.",
    "Introdução": "Segundo Sommerville (2011), o mundo moderno não poderia existir sem o software, que é utilizado em infraestruturas e serviços nacionais, indústrias, sistemas financeiros, na indústria da música, cinema, jogos e muitas outras atividades. Os softwares hoje são muito importantes na sociedade, facilitando às pessoas, governos e empresas desenvolverem suas atividades e, mais facilmente, atingirem seus objetivos. No Campus Araranguá da Universidade Federal de Santa Catarina (UFSC), dois sistemas são utilizados para administração do espaço físico, o Controle Acadêmico de Graduação (CAGR) e o Sistema Integrado do Espaço Físico (SIEF). O CAGR é utilizado, na gestão do espaço físico, para alocação do espaço físico para aulas e geração de relatórios. O SIEF é utilizado, na gestão do espaço físico, para cadastro e atualização cadastral de ambientes e gerenciamento de eventos diversos que ocorrem na universidade (monitorias, reuniões, etc.). A gestão do espaço físico em uma instituição pública de ensino é uma atividade importante para todos os usuários destes espaços, em especial alunos e professores. O espaço físico deve ser suficiente para atender às necessidades das atividades que serão realizadas nestes ambientes, com estrutura adequada em relação à infraestrutura, mobiliário, iluminação, iluminação de emergência e acessibilidade a pessoas com necessidades especiais. Este trabalho apresenta uma avaliação de usabilidade do SIEF e do CAGR, e com base nas características levantadas nesta s avaliações ergonômicas e nas características mínimas necessárias a sistemas de gestão de espaços públicos se propõe a realizar a modelagem de um único sistema de alocação do espaço físico que unifique as atividades realizadas SIEF e CAGR e atenda às necessidades dos envolvidos. Para modelagem do sistema foi utilizada a Linguagem Unificada de Modelagem (UML).",
    "Conclusão": "Este trabalho realizou a avaliação de usabilidade de dois sistemas, o SIEF e o CAGR, utilizados na gestão do espaço físico da UFSC, no Campus Araranguá, e utilizando princípios de engenharia de software propôs um único sistema que atendesse às necessidades dos usuários. Para avaliação das interfaces, utilizou-se a técnica da avaliação heurística, realizada com um grupo pequeno de avaliadores que inspecionou a interface do SIEF e do CAGR em busca de problemas. Esta avaliação resultou na localização de problemas nas duas interfaces, que dificultam o trabalho dos usuários. Em relação à gravidade dos problemas localizados, a interface do CAGR possui problemas mais graves do que a do SIEF, porém é utilizada apenas por usuários internos, que são funcionários da UFSC. A interface do SIEF possui problemas menos graves que a do CAGR, porém o sistema é utilizado também por usuários eventuais, incluindo funcionários e alunos, e mesmo estes problemas deveriam ser corrigidos. Para a proposta do sistema, foram utilizados diagramas da modelagem UML para explicar os aspectos mais complexos do sistema. Na elaboração dos requisitos, os diagramas de caso de uso e atividades servem como facilitadores (Sommerville, 2011) e ajudaram a definir os requisitos do sistema. O sistema proposto deve centralizar e simplificar a gestão do espaço físico, pois deve permitir aos alunos e funcionários visualizar a situação atual do espaço físico administrado. O sistema SOEF também possibilita a atuação da comunidade como fiscalizador da gestão do espaço físico na universidade, cumprindo os princípios da Lei 12.527. Esta Lei orienta, entre outras coisas, a observância da publicidade como preceito geral, e do sigilo como exceção e, ao desenvolvimento do controle social da administração pública. (BRASIL, 2011). Como conclusão, o autor considera que foram alcançados os objetivos propostos. Utilizando-se as avaliações de usabilidade, com vistas à legislação aplicável e utilizando-se técnicas da UML e da engenharia de requisitos, realizou-se a modelagem de um único sistema que deve atender as necessidades da administração do espaço físico do Campus Araranguá da UFSC, nos ambientes utilizados como salas de aula. Como propostas a trabalhos futuros, sugerem-se: Pesquisa para desenvolvimento da interface do sistema; Pesquisa para desenvolvimento de uma página na internet aberta ao público em geral com relatórios atualizados da gestão do espaço físico; Pesquisa sobre o desenvolvimento do sistema."
}