{
    "Autor": "Vitória Raupp Adão",
    "Título": "Visualização de Dados do Censo Escolar: Uma Análise dos Indicadores de Tecnologia",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Dr.(a) Marina Carradore Sérgio",
    "Coorientador(a)": "",
    "Resumo": "O presente trabalho tem como objetivo desenvolver um dashboard interativo para a visualização dos indicadores tecnológicos do Censo Escolar, visando facilitar a análise e compreensão dos dados educacionais disponibilizados pelo Inep. Utilizando a metodologia DSRM, a partir dos dados coletados do Censo Escolar de 2013 a 2023, foi realizada a limpeza e o tratamento das informações, com foco nos recursos tecnológicos nas escolas brasileiras. A ferramenta foi construída utilizando a biblioteca Streamlit, permitindo a criação de uma aplicação web interativa, capaz de gerar gráficos dinâmicos com filtros personalizáveis, possibilitando a análise detalhada de informações por região, cidade, e recurso educacional. O dashboard proposto complementa as ferramentas existentes, como o Inep Data, oferecendo maior flexibilidade e acessibilidade aos usuários, desde gestores até pesquisadores. Além disso, a plataforma inclui funcionalidades de integração com APIs e a possibilidade de exportação de dados em formato CSV, tornando o acesso às informações mais democrático e acessível. O trabalho contribui para a transparência e para a melhoria da gestão educacional, promovendo uma análise mais eficiente dos recursos tecnológicos nas escolas brasileiras.",
    "Palavras-chave": [
        "Dashboard Interativo",
        "Censo Escolar",
        "Indicadores Tecnológicos",
        "Visualização de Dados",
        "Análise Educacional"
    ],
    "Introdução": "No cenário contemporâneo, a evolução contínua da tecnologia desempenha um papel fundamental na coleta, análise e interpretação de dados. Com o aumento constante da disponibilidade de informações, a aplicação de técnicas eficazes de visualização torna-se crucial para extrair insights de grandes volumes de dados. Nesse contexto, a visualização de dados, como definida por Keim e Ward (2003), refere-se à comunicação de informações por meio de representações gráficas, emergindo como uma ferramenta poderosa. Este trabalho explora a potencialidade da visualização e análise de dados no contexto educacional, com foco no Censo Escolar Brasileiro. Anualmente, essa coleta de dados abrange milhares de escolas da educação básica em todo o país, oferecendo uma visão abrangente da realidade educacional (Brasil, 2023). O INEP (Instituto Nacional de Estudos e Pesquisas Educacionais Anísio Teixeira) é responsável por diversas avaliações e coletas de dados em diferentes níveis e modalidades de ensino, incluindo a Educação Básica, exames de conclusão do Ensino Médio e informações sobre o Ensino Superior (Fonseca; Namen, 2016). Entretanto, a compreensão desse vasto volume de dados se torna desafiadora sem a aplicação de processos eficientes de visualização e análise. A educação básica é um pilar essencial para o desenvolvimento da sociedade, e a disponibilidade de informações precisas e acessíveis é crucial para a melhoria dos serviços educacionais. Indicadores importantes para o aprimoramento da educação incluem dados sobre matrículas de alunos e infraestrutura escolar, com ênfase em recursos tecnológicos. Estes indicadores abrangem a disponibilidade de computadores, tablets, redes Wi-Fi e fibra ótica nas instituições de ensino, elementos que influenciam diretamente o processo de aprendizagem dos alunos. Atualmente, a integração de tecnologias e mídias digitais no processo de aprendizagem promove novas formas de interação e criação. Essas transformações influenciam profundamente as relações sociais e a cultura digital, refletindo-se no ambiente educacional e proporcionando uma oportunidade para uma análise crítica sobre o impacto da tecnologia e da informação (Serafim, 2023). A coleta, tratamento e visualização eficaz desses dados são essenciais para a administração de escolas públicas e privadas, permitindo uma alocação mais eficiente de recursos e investimentos na melhoria da infraestrutura tecnológica voltada para a educação. O crescimento das tecnologias educacionais auxilia na adaptação das instituições acadêmicas aos desafios e oportunidades do aprendizado online (Adedoyin; Soykan, 2020; Vlachopoulos, 2020). Portanto, este trabalho visa explorar a importância da visualização de dados no contexto educacional, com foco nas tecnologias disponíveis nas escolas brasileiras, buscando compartilhar e expandir o acesso a essas informações.",
    "Conclusão": "O presente trabalho teve como intuito desenvolver um dashboard interativo para a visualização de recursos tecnológicos presentes no Censo Escolar, utilizando dados de 2013 a 2023. Através da integração, limpeza e tratamento dos dados, foi possível criar uma ferramenta que facilita o acesso e a compreensão de informações relevantes para a análise do panorama educacional voltado aos recursos tecnológicos no Brasil. A utilização da biblioteca Streamlit, aliada a outras ferramentas de visualização de dados, garantiu uma interface intuitiva, permitindo que gestores educacionais, pesquisadores e outros usuários interessados realizem análises detalhadas de forma personalizada. O Censo Escolar, como uma fonte crucial para o planejamento e a avaliação das políticas públicas educacionais no Brasil, oferece dados fundamentais sobre as infraestruturas e recursos disponíveis nas escolas. A proposta deste trabalho foi complementá-lo, oferecendo uma plataforma mais flexível e acessível, que possibilita não apenas a visualização dos recursos tecnológicos, mas também a integração dos dados com outras ferramentas e plataformas. A plataforma desenvolvida propõe uma solução, focando em uma interação simplificada com os dados e permitindo que os usuários realizem análises de acordo com suas necessidades específicas. A análise das informações através de gráficos interativos proporcionou uma visão mais clara sobre a evolução dos recursos tecnológicos nas escolas ao longo dos anos. A implementação de filtros personalizáveis tornou possível a extração de dados específicos por estado, cidade ou recurso, oferecendo uma ferramenta poderosa para a tomada de decisões informadas. A interface intuitiva e a possibilidade de realizar consultas de forma dinâmica demonstraram a importância de se investir em soluções que tornem os dados mais acessíveis e úteis para a sociedade brasileira, especialmente no contexto educacional. Apesar dos avanços apresentados, o trabalho também identificou algumas limitações, como a necessidade de maior infraestrutura para suportar um sistema em escala nacional e a ampliação das funcionalidades de visualização de dados. A democratização do acesso aos dados educacionais é essencial para promover uma gestão pública mais eficiente e participativa. A plataforma desenvolvida neste trabalho se insere nesse contexto, proporcionando um complemento ao Inep Data, que, apesar de suas contribuições, ainda limita a personalização de análises. A flexibilidade oferecida pela nova ferramenta amplia o potencial de uso dos dados do Censo Escolar, permitindo uma análise mais detalhada e orientada a resultados específicos de cada usuário, seja ele um gestor, um pesquisador ou qualquer outro interessado no setor educacional. Além disso, a possibilidade de integração com outras plataformas e o uso de APIs representam um avanço significativo na interoperabilidade dos dados educacionais. A capacidade de realizar consultas específicas e de baixar os dados em formatos acessíveis, como o CSV, garante maior transparência e facilita a exploração independente dos dados. Isso promove um ambiente mais colaborativo e aberto, no qual diferentes partes interessadas podem contribuir para o aprimoramento das políticas educacionais. Por fim, o trabalho contribui de forma significativa para o cenário educacional brasileiro, oferecendo uma solução interativa e acessível para a exploração dos dados de recursos tecnológicos do Censo Escolar. Com a constante evolução da tecnologia, essa plataforma poderá ser aprimorada e expandida para atender a novas demandas, agregando valor à gestão educacional no Brasil e fomentando a transformação digital no setor público."
}