{
    "Autor": "Bruno Marcel Arbelo Parrot",
    "Título": "A produção de áudio para jogos digitais: um estudo de caso",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Robson Rodrigues Lemos",
    "Coorientador(a)": "",
    "Resumo": "A indústria de jogos digitais trabalha com múltiplas áreas do conhecimento, sendo considerada uma das mais multidisciplinares na área da informática, visto que engloba desde a questão inicial de um projeto de jogo também chamado de game design, a parte gráfica com programação, artes e desenhos. O foco deste trabalho é estudar as ferramentas e o processo de implementação dos sons, músicas e efeitos sonoros com as novas tecnologias disponíveis no mercado e como funciona a integração da faixa de áudio digital até o processo em que é reproduzido dentro do cenário 3D, criando o que chamamos de ambientação, passando pelas etapas inicias de planejamento do projeto, criação de um conceito de ambiente até a implementação do áudio no cenário do jogo. Através da pesquisa exploratória realizada foi possível observar a importância do trabalho das equipes envolvidas no projeto do desenvolvimento de um jogo digital, e a importância do trabalho do áudio e seus elementos como ferramentas de auxílio a uma imersão mais real no mundo digital, demonstrando que quanto melhor for a implementação do áudio, maior será a sensação de realidade do jogo em questão. Como resultado apresentamos um ambiente tridimensional criado através de um motor de criação para jogos digitais, e todo o seu preenchimento de efeitos sonoros de acordo com a temática escolhida.",
    "Palavras-chave": "áudio digital, desenvolvimento de jogos, game áudio",
    "Introdução": "Os jogos eletrônicos estão presentes em nossas vidas há pouco mais de 40 anos desde o surgimento do primeiro vídeo game, o Magnavox Odyssey em 1972. Uma história de muitas inovações tecnológicas e que é repleta de inventores visionários que criaram um impacto sem precedentes na cultura mundial, e, presente em praticamente todos os dispositivos eletrônicos de mão como celulares, tablets, computadores, além dos consoles próprios para jogos. Ao produzir um jogo, deve-se ficar atento às características importantes de seu mercado consumidor, a plataforma que ele será destinado, estilo de jogo a ser desenvolvido, sua temática, efeitos gráficos e os efeitos sonoros. Durante uma partida em praticamente qualquer estilo de jogo, existem vários estímulos sonoros que são constantemente apresentados aos jogadores e que são absorvidos sem o usuário ter a total consciência desse acontecimento, e de todo o processo envolvido na implementação do áudio nos jogos digitais. Este trabalho busca analisar aspectos técnicos e teóricos além de apresentar algumas das ferramentas atuais de produção de áudio e desenvolvimento digital de jogos, desde o momento da concepção do projeto do jogo até o momento da implementação com os programas de desenvolvimento especializados para a criação de jogos digitais, neste estudo de caso com a utilização da ferramenta Unity 3D.",
    "Conclusão": "A partir da elaboração deste estudo de caso foi possível destacar a importância do áudio na experiência do jogador durante uma partida, e a importância da trilha sonora na construção da tensão e imersão no ambiente criado para o jogo. Reforçando a ideia apresentada durante este trabalho da função do áudio dentro do universo dos jogos digitais, e o quanto os elementos sonoros, são importantes, sejam eles efeitos de som, dublagem, ou trilha sonora, e sua influência na transmissão de sensações causadas ao jogador. Durante o desenvolvimento do projeto foi possível colocar em prática conhecimentos adquiridos durante o curso de Tecnologias da Informação e Comunicação, no que diz respeito a disciplinas, tais como, Sistemas Multimídia e Gestão de Projetos, onde explorou-se conhecimentos de organização estrutural de um projeto, a comunicação entre as diversas formas de mídia existentes, o áudio, a computação gráfica, a programação e a integração destes setores necessários para gerar um jogo digital. Como resultado final foi apresentado um ambiente 3D e toda sua ambientação de áudio, a relação de reforço do áudio sobre a parte da implementação gráfica e a compreensão da tecnologia agregada em todo o processo do desenvolvimento dentro da ferramenta Unity 3D. O cenário finalizado contou com a implementação de um som central e geral para os dois ambientes, este sendo chamado de “Ambiência – Vento”, o som do lado A chamado de “Ambiência - Lado A (inicial)”, o som do lado B como “Ambiência - Lado B (sombrio)”, consegue-se observar com esta implementação como funciona a relação espacial e tridimensional da área onde o determinado áudio terá cobertura e sua fonte de disparo, possuindo uma relação entre os três objetos dentro do espaço delimitado 3D. Na parte da implementação de efeitos sonoros, para dar mais vida e realidade ao cenário, foram implementadas duas fontes de áudio de passarinhos diferentes, e intercalado entre as árvores para não tornar repetitiva a experiência ao jogador, para dar mais realidade ao lado B e reforçar o clima sombrio e a temática de horror, foram adicionados quatro monstros no cenário, com um campo de alcance do áudio relativamente maior que seu tamanho, inserido o efeito de grunhidos para sinalizar que há perigo dentro do perímetro. E, para representar uma forma de objetivo e interação com o ambiente, foram inseridas 10 caixas pelo cenário, fazendo assim com que o jogador tenha que explorar o ambiente para realizar sua coleta, e ao ser coletado dispara o áudio chamado de “Efeito Sonoro - Coleta caixa” para reforçar que o ambiente foi recolhido pelo jogador. Desse modo pode-se concluir e demonstrar que a importância do áudio está diretamente ligada com a implementação gráfica e por consequência é relacionada também a programação de códigos e a todo o processo do desenvolvimento de um jogo digital. Quanto mais os setores disponíveis, de acordo com o tamanho do projeto, trabalharem integrados e trocando informações para implementação, melhor será o resultado da experiência imersiva do jogador dentro do ambiente criado."
}