{
    "Autor": [
        "CINTIA NATALÍCIO DE CAMARGO",
        "FÁBIO MATEUS MACHADO"
    ],
    "Título": "ESTIMULAR O APRENDIZADO PARA EXAME NACIONAL DO ENSINO MÉDIO UTILIZANDO O SISTEMA TUTOR INTELIGENTE MAZK",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. ª Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "A tecnologia avança continuamente e cresce no âmbito de ser usada como ferramenta educacional. Este trabalho tem como objetivo estimular o aprendizado para o Exame Nacional do Ensino Médio por meio do tutor inteligente MAZK que foi usado como ferramenta de aplicação. O trabalho está fundamento em aspectos como as principais dificuldades na utilização dessas tecnologias a favor da educação por parte dos estudantes, professores e alunos; que as tecnologias digitais aplicadas de forma planejada atraem os estudantes e auxiliam os professores; que o sistema tutores inteligente são aliados da educação e do aluno por oferecer um ensino-aprendizagem personalizado; a partir disso, foi realizada uma competição entre escolas públicas dividida em duas fases que envolveram escola, professor e alunos.",
    "Palavras-chave": [
        "MAZK",
        "Sistemas Tutores Inteligentes",
        "Educação"
    ],
    "Introdução": "O contínuo avanço tecnológico tem se destacado progressivamente nos diversos setores da sociedade. Observar atentamente e não ignorá-lo é fundamental, uma vez que este apresenta importância significativa na perspectiva de crescimento e desenvolvimento econômico e social do País. No contexto da educação, segundo Dazzi (2007), a tecnologia trouxe muitas vantagens, transformando constantemente o processo tradicional de ensino e aprendizagem. Tendo observado essa colocação, entende-se que estas transformações levam a exigências pedagógicas cada vez maiores. Por essa razão, para que o aluno absorva o conteúdo, não basta apresentar os conteúdos corretamente, é necessário prender sua atenção e apresentar-lhe as informações em um contexto adequado. Perrenoud (2000), diz que se utilizadas de forma responsável, as Tecnologias da Informação e da Comunicação (TICs) são instrumentos que podem ser utilizados como criadores e recreadores da realidade na escola. A Educação a distância (Ead), por exemplo, tem crescido muito e permanecerá crescendo, uma vez que a ideia de estudar a qualquer hora e em qualquer lugar por meio das plataformas de ensino e aprendizagem conquista rápido e encanta. Estas podem ser acessadas por meio de um celular, tablet ou notebook, fato que facilita o engajamento. (Dazzi 2007). Sancho et al. (2006), relata que é difícil negar a influência das TICs na conjuntura atual. A pesquisa TIC Educação (2016), do Centro de Estudos sobre as Tecnologias da Informação e da Comunicação (Cetic), aponta que em 2016, 52% das escolas utilizavam o aparelho celular em atividades com os alunos. Atualmente, é comum encontrar diversas plataformas de ensino-aprendizagem gratuitas disponíveis na rede. No entanto, a necessidade de ter uma plataforma de ensino-aprendizagem que seja gratuita e de boa qualidade, composta por um ambiente intuitivo, prático, adaptativo e focado na aprendizagem personalizada do estudante, impulsionou a idealização de um ambiente inteligente de aprendizagem denominado MAZK, conforme Vidotto (2017) e Bittencourt (2018). Um ambiente virtual de ensino-aprendizagem é um espaço utilizado para o compartilhamento de materiais relacionados aos cursos, tanto da parte do professor quanto do estudante. Além disso, ele oferece aos usuários ferramentas de interação para a troca de informações entre eles, como chat e fórum (Palomino, 2017). Segundo Pozzebon (2003), um STI (Sistema Tutor Inteligente) é alimentado por um especialista na disciplina a ser ministrada (no caso o professor). Se a resposta do aluno for diferente da estipulada pelo especialista, o sistema ajustará os níveis e estilos de aprendizagem para que sejam apresentados de forma mais apropriada aos conhecimentos que o aluno possui. A utilização de STI na prática de ensino-aprendizagem merece e deve ganhar mais espaço, visto que diversos estudos e relatos constatam a sua eficiência e atrativa aplicabilidade. O presente trabalho, por meio de uma competição denominada EDUCA ENEM, aplicada por meio do STIMAZK, transcorre como estimular os alunos a estudarem para o exame mais concorrido do País, conhecido como Exame Nacional do Ensino Médio (ENEM).",
    "Conclusão": "Analisando o que foi exposto no decorrer deste trabalho, conclui-se que um STI pode auxiliar no processo de ensino aprendizagem de um estudante e que a tecnologia quando bem aplicada pode estimular estudantes a estudar para exames como o ENEM. O objetivo desse trabalho foi estimular os estudantes das escolas públicas com ensino médio do município de Araranguá – SC a estudarem para o ENEM, para isso, uma competição denominada EDUCA ENEM foi criada e aplicada com apoio do STI MAZK. A competição trouxe como resultado uma melhora no desempenho dos estudantes em relação ao conteúdo do ENEM, os simulados que foram realizados foram pensados para aproximar o estudante da realidade do exame e de fato prepará-lo para a prova. O ENEM é rico em conteúdo e explorá-lo exige uma pesquisa e organização que só foi possível com o auxílio do MAZK. O MAZK como auxiliador e mediador do desempenho desses estudantes durante a competição teve atuação fundamental na busca dos objetivos propostos e além disso, enfatizou o quanto um STI pode influenciar no aprendizado dado seu poder de personalizar o seu conteúdo direcionando-o ao perfil do usuário. Trouxe também as escolas participantes uma opção de ferramenta para seu sistema de ensino-aprendizagem. Como trabalhos futuros, projeta-se a EDUCA ENEM para outros municípios da região e até mesmo do estado de Santa Catarina. Também é esperado poder contar com simulados mais completos, ou seja, que usem o recurso do conteúdo que pode ser aplicado junto às perguntas em cada sala. Além disso, utilizar o formato da EDUCA ENEM e promover ediçõe da competição para estimular o aprendizado direcionando-a a outros exames e até mesmo vestibulares."
}