{
    "Autor": "Jandir Bassani",
    "Título": "Distribuição Regional e Tipologia das Incubadoras no Estado de Santa Catarina",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "Com o advento do empreendedorismo no Brasil, as principais instituições de ensino do país, hoje mostram -se preocupadas em desenvolver pesquisas que fomentem a inovação e aproximem empreendedores, governos e universidades. Falar de empreendedorismo e não citar incubadoras é quase impossível. Atualmente a quantidade de pequenos e micro empresários que buscam alternativas para o apoio gerencial de suas Startups é muito grande e carece de atenção que esses habitats de inovação podem prover.\nO objetivo do estudo foi o de relatar como estão organizadas as incubadoras do estado de Santa Catarina utilizando como parâmetro de pesquisa o levantamento de informações em relação à distribuição regional considerando: onde estão localizadas, quanto tempo estão em atividade, que órgãos fomentam sua criação e continuação. Em relação à tipologia serão consideradas informações relativas à categoria de incubação, quais os serviços de apoio que prestam ao empreendedor e como são selecionadas novas empresas.\nNa realização do trabalho apenas incubadoras definidas nas categorias de tecnológica, mista e tradicional fizeram parte do universo da pesquisa.\nAs questões que influenciaram para a realização desta pesquisa serão apresentadas nesse capitulo bem como as metodologias que a apoiaram. A abordagem se dará da seguinte forma. Apresentação do problema encontrado pelo pesquisador, em seguida, a orientação e as metodologias seguidas durante a pesquisa e por último todos os processos utilizados para a coleta dos dados apresentados.",
    "Palavras-chave": [
        "Incubadora de empresas",
        "Empreendedorismo",
        "Apoio ao empreendedor"
    ],
    "Introdução": "Com o advento do empreendedorismo no Brasil, as principais instituições de ensino do país, hoje mostram uma preocupação em desenvolver pesquisas que fomentem a inovação e aproximem empreendedores, governos e universidades. Falar de empreendedorismo e não citar incubadoras é quase impossível. Atualmente a quantidade de pequenos e micro empresários que buscam alternativas para o apoio gerencial de suas Startups é muito grande e carecem da atenção que esses habitats de inovação podem prover.\nO objetivo do presente estudo foi o de relatar como estão organizadas as incubadoras do estado de Santa Catarina utilizando como parâmetro de pesquisa o levantamento de informações em relação à distribuição regional considerando as seguintes variáveis: onde estão localizadas, quanto tempo estão em atividade, que órgãos fomentam sua criação e continuação. Em relação à tipologia serão consideradas informações relativas à categoria de incubação, quais os serviços de apoio que prestam ao empreendedor e como são selecionadas novas empresas.\nNa realização do trabalho apenas incubadoras definidas nas categorias de tecnológica, mista e tradicional fizeram parte do universo da pesquisa.\nAs questões que influenciaram para a realização desta pesquisa serão apresentadas nesse capitulo bem como as metodologias que a apoiaram. A abordagem se dará da seguinte forma. Apresentação do problema encontrado pelo pesquisador, em seguida, a orientação e as metodologias seguidas durante a pesquisa e por último todos os processos utilizados para a coleta dos dados apresentados.\nO MCT e a SEPTE (2012) em seu relatório para implantação de incubadora apontam vantagens se se instalar uma incubadora para uma cidade ou região.\n“Os benefícios decorrentes da instalação de uma incubadora são muitos. Ocorre a mobilização e a coordenação de recursos locais já disponíveis e o surgimento de novos negócios. Quanto ao aumento do número de postos de trabalho, ainda que empresas intensivas em tecnologia absorvam pequenos contingentes de mão-de-obra, no longo prazo, caso sejam bem-sucedidas acabam por gerar empregos diretos e indiretos.”\nNo texto também aponta que “a longo prazo será observado um aumento gradual na arrecadação local de impostos, na medida em que as empresas se consolidarem e deixarem a incubadora, graduando-se, e passando a participar agressivamente no mercado. Além disso, pequenas indústrias regionais em declínio, mas que apresentem algum potencial de recuperação, poderão ser revitalizadas e aumentar a chance de se manterem competitivas se suas empresas tiverem a oportunidade de se instalar em uma incubadora.”\nA FINEP descreve as incubadoras de empresas como um ambiente flexível e encorajador onde é oferecida uma série de facilidades para o surgimento e crescimento de novos empreendimentos. Além da assessoria na gestão técnica e empresarial da empresa, a incubadora oferece a infraestrutura e serviços compartilhados necessários para o desenvolvimento do novo negócio, como espaço físico, salas de reunião, telefone, fax, acesso à internet, suporte em informática, entre outros. Dessa forma, as incubadoras de empresas geridas por órgãos governamentais, universidades, associações empresariais e fundações são catalizadoras do processo de desenvolvimento e consolidação de empreendimentos inovadores no mercado competitivo.\nCom base na utilização do conhecimento profissional e prático, os principais objetivos de uma incubadora de empresas estão na produção de empresas de sucesso e na criação de uma cultura empreendedora (ANPROTEC, 2014).\nDe acordo com a ANPROTEC (2014) uma incubadora é uma entidade que tem por objetivo oferecer suporte a empreendedores para que eles possam desenvolver ideias inovadoras e transformá-las em empreendimentos de sucesso. Para isso, oferece infraestrutura, capacitação e suporte gerencial, orientando os empreendedores sobre aspectos administrativos, comerciais, financeiros e jurídicos, entre outras questões essenciais ao desenvolvimento de uma empresa. O SEBRAE (2014) descreve uma incubadora de empresas como um ambiente que promove a transferência de tecnologia e é especialmente planejada para apoiar e estimular a criação e/ou desenvolvimento de micro e pequenas empresas industriais, de prestação de serviços, de base tecnológica ou de manufatura leves, voltadas à produção de bens ou serviços inovadores.\nAs primeiras incubadoras deram início em meados dos anos 1950, no continente americano por parte dos Estados Unidos, já na Europa, a difusora foi a Inglaterra. No momento em que o mundo passava por uma transformação global forçada pela crise do petróleo.\nA crise do petróleo causou o fechamento de várias empresas em ambos os continentes, por consequência, milhares de pessoas ficaram sem emprego. Empresas como a Massey Ferguson estadunidense e a British Steel Corporation na Inglaterra, deixaram centenas de desempregados e grandes galpões sem uso.\nA aquisição desses espaços e sua disponibilização para locação por pequenas empresas que compartilhavam a utilização dos recursos disponíveis, deu início às primeiras incubadoras de empresas.\nA consolidação do modelo de negócio se deu nos anos 70, a partir da expansão do Vale do Silício nos Estados Unidos e o impacto criado pelas empresas de tecnologia que sacudiram o mercado.\nNo Brasil a criação de incubadoras se deu no início dos anos 80 com a criação de cinco Centros. Com apoio do CNPq, foi criada a primeira incubadora do Brasil e da América Latina em 1984 na cidade de São Carlos (SP), em seguida mais três empreendimentos foram criados em Campina Grande (PB) 1984, Florianópolis (SC) 1986 e Rio de Janeiro (RJ).\nEm julho de 2012 o Ministério da Ciência Tecnologia e Inovação – MCTI, junto com a Associação Nacional Promotora de Empreendimentos Inovadores – ANPROTEC, publicou pesquisa que apontava para a existência de 384 incubadoras atuando em todo território nacional, apoiando 2.640 empreendimentos inovadores, gerando 16.394 empregos diretos, somando faturamento anual de R$ 533 milhões. A pesquisa mostra que até 2011, 2.509 empreendimentos já haviam sido graduados, somando faturamento de R$ 4,1 bilhões e gerando 29.205 vagas de emprego.\nEm dados levantados pela National Business Incubation Association (NBIA), é possível dimensionar a importância das incubadoras para o desenvolvimento do país. Segundo pesquisa da NBIA, o Brasil se encontra na frente, em número de incubadoras, de países como México e Canadá, com 191 e 120, respectivamente.\nNo Brasil as universidades são um fator importante para o sucesso das incubadoras, sendo que 40% das universidades federais contém uma incubadora vinculada, segundo estudo feito pela ANPROTEC (2012).",
    "Conclusão": "Pode-se afirmar, pelos resultados obtidos na pesquisa que a distribuição das incubadoras, sobre o território catarinense, se deu a partir da capital do estado Florianópolis e em seguida para as cidades polo de cada região do estado e hoje cobrem regionalmente todo o território catarinense.\nA expansão ocorreu principalmente após a virada do século, acompanhando a grande expansão do PIB estadual.\nConsiderando os modelos mista, tradicional e tecnológica o último teve a maior utilização em todas as regiões do estado, mostrando-se a melhor escolha através dos dados coletados pela pesquisa, já que apresentou maior geração de emprego e rentabilidade pelas empresas incubadas.\nO tempo de atividade se mostrou um fator importante para o sucesso das incubadoras, sendo que, ao passo que a incubadora vai amadurecendo os resultados também vão melhorando.\nFoi possível analisar a escalada no faturamento das empresas incubadas, que tendem a ser maior quando as incubadoras que as apoiam têm um período maior de atividade, fato que se repete na geração de emprego.\nQuanto ao período de atuação das incubadoras pode-se afirmar que o processo é recente em comparação com o processo nacional que teve início na década de 80, tendo em vista que 85% das incubadoras que responderam ao questionário afirmaram que sua implantação se deu após a virada do século, quase 20 anos após o início do processo nacional.\nPorém a rede de incubadoras de Santa Catarina se mostrou madura e bem estruturada com potencial para dar apoio ao empreendedor catarinense.\nDado relevante mostrado pela pesquisa e que apoia o desenvolvimento das incubadoras é o fato de que a maioria delas está vinculada a uma instituição de ensino superior, pública ou particular.\nEsse resultado mostra o papel relevante que as universidades têm como fator gerador de novos negócios inovadores.\nTodas as 15 incubadoras que responderam à pesquisa mantêm o modelo de incubação presencial, e dentre elas, 7 dispõem também do modelo de incubação virtual.\nO modelo de incubação presencial consegue acomodar 226 empresas incubadas de forma simultânea nas 15 incubadoras que responderam ao questionário.\nAs incubadoras são responsáveis por fornecer uma gama de serviços essenciais para as empresas em criação, permitindo assim que as empresas possam voltar seus recursos para outros setores.\nA pesquisa identificou os serviços que são prestados pelas incubadoras com maior frequência.\nContabilidade: serviço de apoio prestado por 4 das incubadoras entrevistadas;\nFinanceiro: 5 das incubadoras entrevistadas prestam este serviço de apoio ao empreendedor;\nPlano de negócio: este tipo de serviço é fornecido por 8 incubadoras;\nMarketing: serviço prestado por 8 das incubadoras que responderam ao questionário;\n8 das incubadoras destacaram que prestam outros tipos de serviços de apoio às empresas.\nEntre as incubadoras que responderam ao questionário somente o MidiTecnológico de Florianópolis afirmou prestar todos os serviços listados.\nPode-se afirmar através da pesquisa que as incubadoras prestam uma ótima cobertura na prestação de serviços essenciais para o apoio ao desenvolvimento de empreendimentos nascentes de base tecnológica.\nA geração de emprego segue um caminho natural crescente junto com o amadurecimento das incubadoras A pesquisa mostrou que conforme as incubadoras vão se solidificando vão ampliando também a capacidade de geração de emprego das empresas que abriga.\nAs incubadoras se mostram uma ótima forma de gerar empregos qualificados e de impacto, pois cada emprego gerado fatura em torno de R$ 620.214,51, anual.\nJuntas as empresas incubadas faturaram R$ 140.168.478,14 em 2013, com destaque para as empresas que pertencem às incubadoras tecnológicas que faturam mais de R$ 138 milhões por ano, ou seja 89% do faturamento.\nPara ter acesso às incubadoras as empresas passam por uma avaliação que varia de incubadora a incubadora, ou seja, cada uma delas tem suas próprias regras para a captação de novas empresas.\nEsse processo pode ser mais elaborado, sendo descrito e lançado através de editais, ou de outra forma, a partir de uma avaliação de uma banca especializada que representa os interesses da incubadora.\nO sucesso das incubadoras de Santa Catarina pode ser comprovado pelo número de empresas que já foram graduadas. Levando em conta que 3 das incubadoras que responderam ao questionário ainda não tiveram nenhuma graduada, a pesquisa revelou que já obtiveram o título de graduada 216 empresas. A incubadora com maior número de graduadas é o MidiTecnológico com 73 empresas, em 15 anos de atuação, com uma média quase 5 empresas graduadas por ano.\nAs incubadoras do estado tiveram aporte de diversas entidades para a sua criação, porém 8 das respondentes alegaram que além de recursos de terceiros usaram recursos próprios para a implantação, sendo que dizem não ter contado com recursos de outras instâncias para a implantação.\nComo fonte de manutenção as incubadoras responderam contar com apoio de entidades como FAPESC, CNPq, FINEP, governo municipal, estadual, Sebrae ou recursos próprios.\nComo considerações finais cabe destacar que a pesquisa revelou a necessidade de se contar com uma base de dados mais estruturada no estado de Santa Catarina sobre o desenvolvimento e estágio atual do processo de incubação. A importância do movimento de incubação e sua capilaridade pelo estado de Santa Catarina aponta também para a oportunidade de ampliação das pesquisas sobre esse processo. Há um grande espaço a ser coberto por um estudo ainda mais detalhado que possa dispor de recursos para a realização de uma pesquisa in loco às incubadoras identificadas por alguma informação disponível, no caso dessa pesquisa foram 55 e conhecer seu estado atual e as demais características de criação, desenvolvimento e distribuição pelo estado."
}