{
    "Autor": "Lucas Jeronimo dos Santos",
    "Título": "Sistema Especialista para Auxiliar na Identificação do Transtorno do Espectro Autista (TEA) na Infância",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Dra. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Neste trabalho apresenta-se um sistema especialista para auxiliar no diagnóstico do Transtorno do Espectro Autista (TEA) em crianças de 16 a 30 meses. Na elaboração deste sistema especialista foram utilizados os questionários MCHAT-R/F disponibilizados pela Drª. Diana L. Robins. Estes questionários ajudam pais e também profissionais da saúde para identificar crianças com risco de apresentarem o Transtorno do Espectro Autista, através de uma série de perguntas representando os principais sintomas do transtorno. O aplicativo foi desenvolvido para Smartphone e Tablets com Android e buscou-se ser fidedigno a uma aplicação final com implementação de padrões, definições de telas, validações, coerência com o questionário M-CHAT, funcionalidades e interações com os usuários finais. A validação do aplicativo foi satisfatória e teve a participação de profissionais da saúde na área da psicologia, pediatria, fonoaudiologia e terapia ocupacional.",
    "Palavras-chave": [
        "Informatização",
        "Transtorno do Espectro Autista",
        "Sistemas Especialistas",
        "Dispositivos Móveis"
    ],
    "Introdução": "As Tecnologias da Informação e Comunicação (TICs) estão cada vez mais presentes em nossas vidas e vem crescendo progressivamente, causando grande impacto em todo o mundo, tornando o dia-a-dia mais fácil e ágil. Estas estão presentes em muitas áreas, incluindo na saúde e medicina. As TICs em suas metas buscam eminente da evolução do conhecimento humano e também pela melhoria de processos e resultados. Vem sendo cada vez mais comuns, estudos utilizando as TICs para viabilizar a integração dessas tecnologias na prestação de serviços em todas as áreas. Na área da saúde, por exemplo, na medicina o uso dessas tecnologias já vem sendo implantadas há quase três décadas. Durante este período já foram implementadas diversas tecnologias que foram surgindo ao longo dos anos, sendo que está é uma área que tem uma demanda muito grande para inovações tecnológicas. Muitas dessas tecnologias foram aplicadas e estão fortemente presentes no cotidiano de profissionais da saúde, como computadores, Internet e internet sem fio, dispositivos móveis como tablets e smartphones , imagens de alta resolução utilizadas em aparelhos de ultrassom e raios-X, entre muitos outros. Com o crescimento exponencial das TICs, foi necessária a intervenção de órgãos federais para desenvolver um planejamento e definir regras e padrões de aplicação dessas tecnologias da área da saúde e medicina, visando fiscalizar e coordenar a construção de um futuro próspero para a tecnologia de informação nesta área. Desde 2013 o Centro de Estudos Sobre as Tecnologias da Informação e Comunicação (CETIC) vem realizando pesquisas sobre o uso das TICs na saúde, investigando a infraestrutura e a disponibilidade dessas tecnologias e nos estabelecimentos de saúde no país. E ainda observam como os profissionais da saúde utilizam dessas ferramentas em sua rotina de trabalho, analisando as principais dificuldades para a sua incorporação. Uma pesquisa realizada pelo CETIC em 2014 mostra que quase 99% dos hospitais e postos de saúde do país (Com exceção de estabelecimentos públicos no interior do Brasil) possuem acesso à internet contendo também sistemas de integração de serviços online. Essa mesma pesquisa conclui que os envolvidos com estes estabelecimentos (Médicos e enfermeiros) apesar de receber muito bem as TICs em seus cotidianos, apresentando um índice de 60% de aceitação entre os entrevistados. (BRASIL, 2015). A partir destes aspectos, o objetivo desse trabalho compreende em integrar as TICs na área saúde através do desenvolvimento de um protótipo de um sistema especialista, onde este utiliza conceitos e conhecimentos psiquiátricos para auxiliar no diagnóstico do Transtorno do Espectro Autista em crianças entre 16 a 30 meses de idade. O aplicativo auxiliará o profissional na prática de uma entrevista com os responsáveis do paciente, apresentando as perguntas sequencialmente até o fim do questionário, gerando um resultado imediatamente após o término, facilitando a aplicação de uma avaliação deste tipo, assim tornando mais rápido o diagnóstico da criança.",
    "Conclusão": "Com o desenvolvimento desse estudo foi possível aplicar alguns dos aprendizados adquiridos no decorrer do curso, e também colocar em prática conhecimentos obtidos durante o exercício do mesmo. Este trabalho teve como objetivo desenvolver e aplicar um protótipo de um sistema especialista voltado para auxiliar na identificação do Transtorno do Espectro Autista em crianças. A falta de acesso a tais informações e também de conhecimento sobre este transtorno pode submeter aos seus portadores a viverem muitos anos de sua vida sem um diagnóstico preciso, com isso impactando na sua qualidade de vida e também na qualidade de vida dos envolvidos com ele, como família e amigos. Com o diagnóstico precoce desse distúrbio pode-se auxiliar os portadores e responsáveis a estarem melhores preparados para lidarem com o que este transtorno pode representar e com isso pode-se ajudar a todos a conquistarem uma qualidade de vida mais estável. Por estes motivos é de extrema importância a identificação deste transtorno o mais cedo possível. O desenvolvimento do referencial teórico ajudou a compreender a dificuldade ao realizar diagnósticos de transtornos mentais, considerando que o cérebro é muito complexo, essas disfunções mentais ainda desafiam bastante a área da medicina. Os avanços tecnológicos providenciam cada vez mais softwares e hardwares robustos, automatizados e autossuficientes, inteligentes, com capacidade de processar grande quantidade de dados em um curto espaço de tempo, resultando na criação de análises, estatísticas, probabilidades entre diversos outros importantes recursos. Desde as primeiras aparições da computação, a área da saúde tem atraído muitos pesquisadores que tem como objetivo contribuir de alguma forma para melhorar as tarefas rotineiras, visando tornar os processos de diagnósticos de doenças em geral mais fáceis e rápidos. Através dos sistemas especialistas os desenvolvedores de aplicativos tem a chance de contribuir na resolução de diversas situações que anteriormente somente poderiam ser resolvidos por especialistas, contanto com uma base de conhecimento que geralmente é extraída de profissionais através de técnicas especificas, seguindo uma série de padrões e regras que procuram simular o raciocínio humano. Para construir um sistema especialista o desenvolvedor deve fazer um bom planejamento do projeto e ter uma base confiável de conhecimento para aplicar os mecanismos de inferência para obter um resultado o mais confiável possível. Através de um processo complexo tentando simular o comportamento humano utilizando a base de conhecimento de um ou mais profissionais especialistas, o aplicativo deve gerar e apresentar resultados com determinado grau de certeza. Para o desenvolvimento deste trabalho foram utilizados como base os questionários disponibilizados pela Dr. Diana L. Robins. O MCHAT-R/F é o resultado de anos de pesquisas, formulando um questionário que visa identificar crianças com risco de apresentarem o Transtorno do Espectro Autista, através de uma série de perguntas representando os principais sintomas do transtorno. Mesmo não possuindo um resultado absoluto, o teste ajuda a identificar se a criança precisa buscar ajuda de um profissional e também ajudam profissionais a chegar a um diagnóstico mais rápido. Como o público-alvo da avaliação utilizada no protótipo são crianças de 16 a 30 meses, então o aplicativo é projetado para atender como usuário final, responsáveis ou profissionais da área da saúde mental. Com isso a preocupação de trabalhar a linguagem mais formal visando tornar o aplicativo o mais profissional possível, mas não deixando de ser claro, acessível e compreensível, e de fácil uso já que nem todos os usuários podem ter conhecimento ou aptidão para área da informática. Os profissionais da área da saúde lidam diariamente com um grande volume de dados gerados por processos de diagnósticos e tratamentos, e com o crescimento constante desses dados os sistemas especialistas são ótimas ferramentas para melhorar e facilitar estas atividades atuando e auxiliando no apoio à tomada de decisões. Mesmo com as limitações dos SEs, estes podem ainda fornecer muitos benefícios e contribuições para a área da saúde. Essa e outras tecnologias são muito utilizadas e requisitadas, pois muitos cientistas e profissionais da saúde vêm se unindo para melhor aplicar o uso das tecnologias para solução de problemas área da saúde. Para trabalhos futuros incentiva-se elaborar a aplicação para expandir o foco e abordar outros transtornos mentais. Pois existem muitos outros transtornos onde seus diagnósticos podem se beneficiar com o uso dessas tecnologias. No ponto de vista tecnológico, visando melhor acesso, recomenda-se projetar a aplicação utilizando tecnologias para web ou móvel como foi executado nesse trabalho, possibilitando assim que o aplicativo obtenha um maior alcance, podendo ser utilizada por diferentes centros, ser facilmente localizada, e poder contribuir com mais pessoas. O uso da plataforma Android facilitou nesse quesito, sendo que uma vez que a aplicação estiver pronta, a mesma pode ser disponibilizada para qualquer usuário na plataforma de downloads PlayStore."
}