{
    "Autor": "Luiz da Rocha Farias",
    "Título": "APLICAÇÃO DE LÓGICA FUZZY NO CONTROLE DO CONSUMO DE ENERGIA EM VEÍCULOS ELÉTRICOS",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Anderson",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho descreve o projeto e o desenvolvimento de um sistema de controle para um veículo elétrico. O tema “Veículos Elétricos” voltou à tona nos últimos anos devido à necessidade de se construir veículos menos poluentes e, apesar das pesquisas nesta área terem avançado bastante, existem alguns pontos que devem ser melhorados e um deles é o rendimento energético do veículo. De modo a aumentar a eficiência energética de um veículo elétrico foi desenvolvido um sistema de controle utilizando Lógica Fuzzy que foi avaliado em diferentes situações de superfície (plano, declive e aclive). Por fim, os resultados obtidos como sistema de controle demonstraram que o mesmo foi capaz de manter a estabilidade da velocidade, consequentemente diminuindo o consumo da corrente e da potência consumida pelo veículo elétrico, mesmo em ambientes imprecisos.",
    "Palavras-chave": [
        "veículos elétricos",
        "eficiência energética",
        "lógica fuzzy",
        "sistema de controle"
    ],
    "Introdução": "Os combustíveis fósseis como carvão, petróleo e gás representam 80% da energia total produzida mundialmente. O restante desse percentual é dividido entre as energias renováveis (solar, eólica e geotérmica), energia hidroelétrica e energia nuclear (GOLDEMBERG, 2000). Mediante a este fato e por pressões de ambientalistas, os países industrializados estão propondo novas medidas para a redução do uso de combustíveis não renováveis, por consequência gerando uma diminuição de poluentes lançados no meio ambiente (AMARAL, 1998). O transporte terrestre vem contribuindo significativamente para a deterioração do meio ambiente, contribuindo para o aumento do efeito estufa causada pela emissão de gases como monóxido de carbono (CO), dióxido de enxofre (SO2), óxidos de nitrogênio (NOx) e dióxido de carbono (CO2) (AMARAL, 1998). Devido o crescimento vertiginoso da frota de veículos automotores nas últimas décadas e suas respectivas contribuições para a degradação do meio ambiente por meio da emissão de poluentes, políticas de contenção de emissão desses gases foram necessárias para reduzir a poluição atmosférica. No Brasil, por exemplo, o Programa de Controle da Poluição do Ar por Veículos Automotores (PROCONVE), criado pelo Conselho Nacional do Meio Ambiente (CONAMA), visa por meio de resoluções propor diretrizes, prazos e padrões regulamentando níveis admissíveis de poluentes emitidos por veículos automotores nacionais e importados (IBAMA, 2011). A partir das exigências impostas pelo PROCONVE, a indústria automobilística desenvolveu um novo sistema de mistura de ar-combustível para diminuir a emissão de poluentes, a injeção eletrônica. O sistema de injeção eletrônica tem a função de dosar a quantidade de combustível conforme a operação do motor. Os principais benefícios são: menor consumo de combustível, aceleração sem atraso e baixo teor de poluentes. Outras medidas foram tomadas, por exemplo, a imposta pelo Estado da Califórnia, Estados Unidos da América (EUA), onde a CARB (California Air Resources Board) previa que 2% da frota de carros deveriam ter características de emissão zero (ZEV - Zero Emission Vehicles) a partir de 1998, sendo que em 2003 esta porcentagem passaria para 10% (GAMMARIELLO; CARLOCK, 1997) (AMARAL, 1998). Esta foi a medida mais radical, em resposta à proposta da CARB, as montadoras voltaram a investir no Veículo Elétrico (VE) (LEITMAN; BRANT, 2009). O VE é composto por uma bateria que fornece energia para o motor elétrico acionando as rodas, e um controlador que regula o fluxo de energia para o motor (LEITMAN; BRANT, 2009). Atualmente o VE é a solução mais próxima do conceito zero emissão (ZE). Por ZE entende-se zero ruído, zero emissões de poluentes e zero emissões de gases do efeito estufa, onde é possível minimizar o aumento de temperatura dos últimos anos (BRAGA, 2010).",
    "Conclusão": "Os veículos elétricos (VE) estão cada vez mais presentes no mercado automobilístico devido ao aumento excessivo de emissão de gases de efeito estufa ocasionado, principalmente, pelos veículos com motores de combustão interna. Os VEs são considerados zero emissão de poluentes, mas as baterias, responsáveis por armazenar a carga elétrica, são formadas por materiais poluentes para o meio ambiente. A fim de comprovar e avaliar os benefícios do uso da Lógica Fuzzy no controle da eficiência energética de um VE, este trabalho apresentou uma arquitetura de controle para os VEs e um sistema de controle utilizando Lógica Fuzzy (SCF) para aumentar a eficiência energética de um VE. Para realizar a avaliação foi desenvolvido um sistema de controle If-Else e realizados alguns experimentos em aclive, declive e plano com os dois sistemas. Visando a eficiência energética do VE, foi utilizado como variáveis de entrada o valor obtido de um sensor do tipo acelerômetro, que determinava em qual tipo de superfície o VE se encontrava, um divisor de tensão para obter a tensão da bateria e de acordo com a base de regras obter a melhor saída. Para gerar o arquivo de log com o valor da corrente consumida e potência consumida, foi utilizado um divisor de corrente, no qual foi possível saber a quantidade de corrente que o motor estava consumindo e consequentemente calcular a potência consumida pelo motor. Para que fosse possível obter uma média de leituras foram realizados 10 experimentos comparativos entre o SCF e o sistema de controle com If-Else (SIF) em cada cenário, sendo que foram considerados somente os dados de 8 (oito) experimentos, sendo descartados os melhores e os piores valores. Os resultados obtidos nos experimentos demonstraram que o SCF proposto foi responsável por manter o controle da velocidade estável, diminuindo o consumo da corrente, e consequentemente, a potência consumida nos ambientes de aclive e declive. Na superfície plana também se mostrou estável, entretanto o SIF obteve uma ligeira vantagem porque não sofreu grandes variações nos valores obtidos como acelerômetro. Por fim, conclui-se que o SCF conseguiu manter uma velocidade estável e adequada nos testes realizados, mesmo com grandes variações nos cenários de testes, a Lógica Fuzzy garantiu maior estabilidade ao sistema de controle."
}