{
    "Autor": "André Luiz Bristot",
    "Título": "Desenvolvimento de um protótipo de sistema web para facilitar a comunicação entre surdos e ouvintes",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª Eliane Pozzebon, Dra",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho tem como objetivo principal o desenvolvimento de um protótipo de sistema web voltado para facilitar a comunicação entre pessoas surdas e ouvintes. Utilizando as linguagens HTML, CSS e JavaScript, busca-se aprimorar a interação entre indivíduos com e sem deficiência auditiva. Para atingir esse objetivo, foi realizada uma pesquisa com o intuito de compreender a construção desse protótipo, visando a melhoria na comunicação entre surdos e ouvintes por meio das linguagens mencionadas. Como resultado desse processo, foi desenvolvido um protótipo de sistema web integrado com um chatbot, oferecendo suporte à linguagem de sinais, incluindo a conversão do texto para a Linguagem Brasileira de Sinais (Libras). Além disso, foram implementadas funcionalidades de leitura em tela para pessoas com deficiência visual e ampliação de tela para aqueles com baixa visão. Esse protótipo representa um avanço ao permitir que diferentes grupos se comuniquem de maneira mais inclusiva. Ao oferecer recursos como a tradução para Libras e a adaptação para pessoas com deficiência visual, o sistema busca promover uma comunicação acessível e igualitária entre todos os envolvidos.",
    "Palavras-chave": "Chatbot; sistemas web; acessibilidade; surdos.",
    "Introdução": "A tecnologia desempenha um papel vital na vida das pessoas com deficiências, proporcionando meios essenciais para a comunicação, aprendizado, acesso à informação e participação na sociedade de maneira mais inclusiva. De acordo com Sichman (2021, p.38), não existe uma definição acadêmica, propriamente dita, do que vem a ser a inteligência artificial (IA). Trata-se certamente de um ramo da ciência/engenharia da computação, e portanto visa desenvolver sistemas computacionais que solucionam problemas. Para tal, utiliza um número diverso de técnicas e modelos, dependendo dos problemas abordados. Conforme Soares (2019, p.2), a IA vem entrando de uma forma consistente nas nossas vidas, das mais variadas formas, por via tecnológica, escrita, cinema, televisão ou rádio, para mencionar algumas. Segundo Barbosa (2020, p.90), ela (a IA) pode ser encontrada em equipamentos, ferramentas e aplicações variadas, tais como em celulares, jogos eletrônicos, chatbots, assistentes virtuais e internet banking. Ao passo em que traz benefícios e facilidade ao nosso dia a dia, a IA também apresenta desafios de ordem ética que demandam atenção cuidadosa. De acordo com Gomes et al. (2017 apud Sá et al., 2021, p.2), considerada um problema mundial de saúde pública, a deficiência auditiva em escala global totaliza cerca de 360 milhões de pessoas surdas e segundo o Censo Demográfico de 2010 do Instituto Brasileiro de Geografia e Estatística (2021), o Brasil possui 9.717.318 pessoas surdas. Isso corresponde a um número significativo quando o enfoque é a saúde, pois mesmo a Língua Brasileira de Sinais (Libras) sendo considerada a segunda do país, muitos profissionais da saúde não possuem domínio sobre ela, dificultando muitas vezes os cuidados. Atualmente, tem-se discutido muito sobre práticas para incluir socialmente essa população que, comumente, é vítima de preconceitos ou excluída da sociedade. Ao comparar os portadores de deficiência física, auditiva e visual, o surdo é quem se defronta com maior dificuldade de inclusão social, já que a audição é um sentido fundamental para obtenção e uso da linguagem e empregá-la. Percebe-se ainda, lacunas na preparação e conscientização dos profissionais da área da saúde e incentivo por parte dos governantes, com o intuito de capacitá-los para atenderem satisfatoriamente a essa população (Dantas et al., 2014 apud Sá et al., 2021, p.2). Neste trabalho a Inteligência Artificial será utilizada em um protótipo de um sistema web. Este trata-se de um aplicativo de comunicação via chat para os surdos interagirem com outras pessoas, sem a necessidade de utilizar a linguagem de sinais.",
    "Conclusão": "Este trabalho apresentou o desenvolvimento do sistema DeafLeaf, um protótipo de sistema web construído para facilitar a comunicação entre pessoas surdas e ouvintes. Através da integração das linguagens de programação JavaScript, CSS e HTML, aliadas ao uso do software de design Figma, foi possível criar as interfaces interativas. As interfaces desenvolvidas foram detalhadas, desde a tela inicial até as áreas de configurações, salas de bate-papo e ferramentas de interação. Cada aspecto do sistema foi pensado com foco na experiência do usuário, visando proporcionar acessibilidade, interatividade e personalização para atender às necessidades específicas da comunidade surda. A inclusão do leitor de Libras, por meio do plugin VLibras, foi significativo no acesso e na compreensão de conteúdos online para usuários surdos. Esta ferramenta, ao traduzir em tempo real o conteúdo textual para a Língua Brasileira de Sinais, demonstra um comprometimento com a acessibilidade e a igualdade de acesso à informação. O banco de dados, representado por um diagrama, descreveu a estrutura lógica do sistema, evidenciando as entidades, atributos e relacionamentos, proporcionando uma visão sistêmica e estrutural do sistema DeafLeaf. Além disso, as ferramentas de implementação - JavaScript, CSS e HTML - foram fundamentais para conferir dinamismo, estilização e estruturação às interfaces, permitindo uma experiência de usuário mais rica e fluida. Este trabalho não está isento de desafios pois há a necessidade de uma validação mais ampla do sistema, visando garantir sua eficácia e usabilidade. Além disso, destaca-se a importância do aprimoramento do DeafLeaf, considerando a implementação de recursos avançados, como a tradução de linguagem de sinais personalizada com Inteligência Artificial. A expectativa é que o DeafLeaf se torne não apenas uma ferramenta de comunicação, mas também um agente transformador na inclusão e acessibilidade para a comunidade surda. Este foi apenas um primeiro passo, e espera-se que este trabalho inspire e contribua para futuros desenvolvimentos tecnológicos que promovam uma sociedade mais inclusiva e igualitária."
}