{
    "Autor": "Bruno de Oliveira Machado",
    "Título": "AUTOMATIZAÇÃO DE CONTEÚDOS NUM SISTEMA TUTOR INTELIGENTE PARA O ENSINO-APRENDIZAGEM DE PROGRAMAÇÃO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª Drª Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Neste trabalho foi desenvolvido um Sistema Tutor Inteligente (STI) para o sistema operacional Android , onde os aprendizes com um tablet ou smartphone aceitam o desafio de responder uma sequencia de perguntas para aper feiçoar o nível de conhecimento em programação de computadores. O STI adapta automaticamente o nível de dificuldade das perguntas conforme a quantidade de acertos e erros dos aprendizes. O mesmo ocorre com o nível de conhecimento do aprendiz que é atualizado conforme seu desempenho ao responder as questões. Outro aspecto relevante deste trabalho é a inclusão do conteúdo pelo professor ou especialista. O professor pode incluir perguntas e explanações referentes à programação de computadores e o STI automaticamente seleciona a pergunta adequada ao aprendiz conforme seu nível de conhecimento. Para a validação do STI foi utilizado o método de observação direta e um questionário, onde os aprendizes responderam como foi a experiência na utilização do STI. Os resultados obtidos foram considerados positivos e corresponderam as expectativas do projeto.",
    "Palavras-chave": "Inteligência Artificial, Sistemas Multiagentes, Sistema Tutor Inteligente, Dispositivos móveis, Programação de Computadores.",
    "Introdução": "A Inteligência Artificial aplicada na educação pode ser um forte aliado no processo de ensino-aprendizagem. Atualmente existem diversos estudos que tentam provar a eficiência de técnicas de IA para facilitar o processo de aprendizagem, como resultados desses estudos surgem novas ferramentas de ensino baseadas na IA. O surgimento destas ferramentas é resultado do interesse dos pesquisadores em automatizar todo o processo de ensino e aprendizagem, tendo como objetivo facilitar o acesso ao conhecimento para todos, bem como fazer com que a aplicação se adapte ao perfil do aluno para o qual deverá ser efetuado o ensinamento (AGUIAR E HERMOSILLA, 2007). Segundo RICKEL (1989), um STI é definido como sendo um programa computacional destinado a auxiliar o processo ensino-aprendizagem, utilizando métodos e técnicas de IA para representar o conhecimento e para conduzir a interação com o estudante. É um sistema projetado para saber o que ensinar, a quem ensinar, e como ensinar. O desenvolvimento do STI proposto neste trabalho será por meio de um Sistema Multiagente. Para entender um Sistema Multiagente, é necessário compreender o que é um agente, segundo a FIPA (Foundation for Intelligent Physical Agents), “um agente é uma entidade que reside em um ambiente onde interpreta dados através de sensores que refletem eventos no ambiente e executam ações que produzem efeitos no ambiente. Um agente pode ser um software ou um hardware puro...”. Segundo Silva (2003), Sistemas Multiagentes são sistemas constituídos de múltiplos agentes que interagem ou trabalham em conjunto de forma a realizar um determinado conjunto de tarefas ou objetivos. Esses objetivos podem ser comuns a todos agentes ou não. Neste trabalho é desenvolvido um sistema tutor inteligente com enfoque em um módulo tutor para a automatização de conteúdos. O tema proposto é continuidade do trabalho de Minatto (2013). Para desenvolver o STI, que conta com quatro agentes: (a) um agente inteligente, que controla os níveis dos usuários e perguntas, e seleciona as perguntas para o aprendiz; (b) um agente tutor para automatização de conteúdos; (c) um agente aprendiz que realiza a avaliação; e (d) um agente administrador que insere tutores. Num Sistema Multiagente vários agentes se comunicam e trocam informações por um objetivo em comum, para acontecer essa troca de informações é necessário um meio de comunicação entre esses agentes. Para estabelecer essa comunicação e essa troca de informação, é utilizada a comunicação via socket. Socket é um mecanismo de comunicação, usado normalmente para implementar um modelo cliente/servidor, que permite a troca de mensagens entre os processos de uma máquina/aplicação servidor e de uma máquina/aplicação cliente. (SANTOS, 2014) Com os sockets é possível implementar um Sistema Multiagente com uma base de dados remota, onde cliente (usuário) e servidor (base de dados) possuem uma comunicação online, permitindo ao usuário acesso direto às atualizações da base de dados sem necessitar atualizar o software. A Inteligência Artificial com a utilização de Sistemas Multiagentes e as novas tecnologias como tablets e smartphones apresentam grande potencial para revolucionar as bases da educação virtual e móvel. A justificativa dada para a potencialidade destas tecnologias é que a Inteligência Artificial pode prover um conteúdo didático inteligente e objetivo para o aluno, além de que a utilização destes conteúdos em dispositivos móveis possibilita uma grande integração entre o mundo dentro e fora da escola, pois com acesso a estes materiais, o aluno pode ter sempre em mãos seu material de estudo.",
    "Conclusão": "Neste trabalho foi desenvolvido um protótipo chamado Mazk STI com a finalidade de automatizar os conteúdos em um sistema tutor inteligente. Neste protótipo foi desenvolvido um módulo tutor para a automatização de conteúdos e os demais módulos que completam o sistema: módulo administrador, módulo aprendiz. Além do protótipo, também foi desenvolvido um servidor para o armazenamento dos dados, que é onde reside o agente inteligente. O protótipo desenvolvido oferece ao professor uma interface simples e amigável para a automatização de conteúdos do STI. Quando o usuário do STI for do tipo tutor, o módulo tutor é carregado e neste módulo, o professor pode inserir, editar ou excluir uma pergunta, e inserir ou substituir uma explanação. No editor da explanação é permitido carregar imagens, colocar textos em negritos, sublinhados e itálicos para facilitar o entendimento da questão. O protótipo do STI desenvolvido conta com funcionalidades que estimulam os alunos e professores a o utilizarem. O aluno se sente estimulado a utilizar um aplicativo quando existe um desafio, como podemos acompanhar no dia dos testes, onde a maioria dos alunos faziam os testes duas ou mais vezes, para poderem alcançar um nível maior do que já haviam conseguido. Para os professores, além de acompanhar o rendimento dos alunos, o STI também conta com a colaboração do aluno ao nivelar as perguntas da base de dados. As perguntas são inseridas na base com o nível mínimo 1 (um), conforme os alunos as respondem, os níveis das perguntas também alteram dinamicamente, desta forma o professor pode conhecer a real dificuldade daquela pergunta para a sua turma, assim, quanto mais se utiliza o aplicativo, mais precisos serão os níveis obtidos pelas perguntas. Todos os objetivos propostos no início do trabalho foram alcançados satisfatoriamente. Todas as perguntas que foram respondidas nas avaliações, e suas respectivas explanações, foram inseridas com o Mazk STI. Com a utilização do aplicativo, as perguntas do banco de dados, que antes possuíam todas nível 1 (um), agora possuem níveis mais próximos da realidade, variando de 1 (um) a 5 (cinco). Os níveis dos usuários também estão mais próximos dos reais, no momento do cadastro todos usuários recebem o nível 1 (um), porém, atualmente os níveis registrados variam de 1 (um) a 5 (cinco). As críticas recebidas no dia da validação do protótipo foram consideradas positivas e certamente irão contribuir para futuras melhorias e evoluções do protótipo. Levando em considerações as expectativas do projeto, conclui-se que o protótipo desenvolvido atendeu as expectativas esperadas de forma satisfatória. Trabalhos Futuros: Criar uma tela de parametrização, ou seja, uma tela onde se possa configurar as informações que hoje são estáticas, como o tempo para responder cada pergunta, a quantidade de perguntas respondida em cada teste, etc. Criar uma tela para acompanhar o desempenho do aluno. Organizar os dados do STI por disciplinas, permitindo a utilização do STI para outras disciplinas além de programação."
}