{
    "Autor": "Hugo Mateus Almeida Moraes Soares",
    "Título": "Desenvolvimento de um Sistema Web para Gerenciamento de uma Empresa de Soluções Elétricas",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Fabrício Herpich",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho apresenta o desenvolvimento de um sistema web como ferramenta de gerenciamento no processo de gestão de negócios em uma empresa de soluções elétricas. Ele serve como um impulsionador de otimização e eficácia na gestão da Poraquê Energia. A abordagem ressalta a consideração dos Sistemas de Informações Gerenciais (SIG) baseados na web que são ferramentas essenciais para a melhoria e a fundamentabilidade empresarial, abordando suas características, benefícios e os desafios da implementação. A metodologia utilizada foi Design Science Research Methodology (DSRM), que direcionou o processo de desenvolvimento. A saída é um sistema baseado na Web desenvolvido e equipado com funcionalidades essenciais para o gerenciamento empresarial, como clientes, controle de estoque, gerenciamento financeiro e geração de relatórios. O sistema proposto é uma provável melhoria em seus processos de gerenciamento na solução de serviços de energia.",
    "Palavras-chave": "Sistema Web; Gestão de negócios; Soluções Elétricas; Tecnologia da Informação; Sistemas de Informações Gerenciais.",
    "Introdução": "O Desenvolvimento de um sistema web surgiu da necessidade da empresa Poraquê Energia fazer uma gestão das informações de forma holística, desta maneira, este trabalho procura desenvolver um sistema integrado de gestão para uma empresa especializada em soluções elétricas. Neste sentido, visa-se organizar convenientemente os dados e garantir um acesso fácil para os fatores críticos na tomada de decisões. De acordo com Balarine (2002), os diferenciais competitivos mais significativos hoje permanecem os da tecnologia da informação (TI), que é o meio pelo qual uma organização pode melhorar seus processos e alcançar alguma vantagem estratégica. Hardware ou software, tais sistemas devem ser projetados e estrategicamente integrados em uma organização, pois muitas vezes enfrentam restrições de recursos, mas precisam melhorar seu desempenho no mercado. Nesse sentido, os sistemas de informação gerencial, segundo Bazzotti e Garcia (2006), ajudam as empresas a chegar a uma visão mais estruturada e eficaz de suas próprias operações, apoiando assim a melhor tomada de decisão dentro das organizações. Segundo Audy, Becker e Freitas (1999), o planejamento estratégico para sistemas de informação não é apenas a aplicação da tecnologia, mas, de fato, também consiste em um processo contínuo de aprendizado dentro da organização, destinado a reforçar a resiliência e a competitividade. Há, além disso, a adaptação dessas soluções tecnológicas às necessidades específicas, pois cada empresa tem sua própria dinâmica e peculiaridades e sistemas personalizados aumentarão a eficácia das soluções, conforme observado por Oliveira e Araújo (2018). Soluções personalizadas, no entanto, também contribuem muito para facilitar para os gestores, ao mesmo tempo em que atendem às necessidades únicas de cada empresa. A proposta do desenvolvimento do sistema web resulta em uma ferramenta robusta para o gerenciamento da empresa de soluções elétricas, centralizando dados de clientes, estoque e serviços. Com arquitetura baseada em Django e interfaces intuitivas o sistema oferece funcionalidades como geração de relatórios, controle financeiro e agendamentos. A validação dos testes de usabilidade e segurança garantem alta eficiência e redução de erros. O feedback dos stakeholders destaca melhorias de informações para a tomada de decisão organizacional. O Desenvolvimento do sistema personalizado representa um avanço significativo na gestão da empresa.",
    "Conclusão": "A implantação do SIG desenvolvido neste projeto será eficaz para as demandas da empresa, fortalecendo sua competitividade e eficiência operacional. Portanto, ao propor o desenvolvimento de um sistema web, demonstra a capacidade dos profissionais de TIC na inovação e gerenciamento de projetos estratégicos para ajudar a empresa a superar desafios de mercado. O sistema automatiza processos internos, gerencia dados de clientes, controla o estoque e fornece insights analíticos para aprimorada tomada de decisões. Assim, a implementação de um Sistema de Informação gerencial eficaz pode ser uma ferramenta valiosa para otimizar o tempo do gestor. Cada tecnologia escolhida, HTML, CSS, JavaScript e o framework Django formaram a base para tornar o sistema escalonável e robusto, tornando o desenvolvimento fácil e as expansões futuras flexíveis. Desta forma, além das melhorias necessárias na interface do utilizador e suporte a outras ferramentas de análise de dados e inteligência empresarial. A manutenção do sistema e seu ajuste às mudanças de mercado emergentes é a chave para a resiliência e relevância do produto em longo prazo. No entanto, vale ressaltar que o sistema é uma versão inicial, portanto, a primeira fase de todo o processo de desenvolvimento. O sistema tem muitas funcionalidades, mas limitações ainda estão presentes. Entre essas restrições está a falta de notificações ou mensagens instantâneas, a responsividade aprimorada permitirá uma usabilidade aprimorada em dispositivos móveis. Além disso, há um requisito para novos módulos, como integração com sistemas de pagamento e geração de relatórios personalizados, que também foi identificado como uma área de melhoria fundamental para análise de dados e controle operacional. Dessa perspectiva, as próximas versões serão desenvolvidas de forma aprimoradas e beneficiadas por comunicações internas e externas, aprimorando também capacidades aumentadas do sistema para atender aos requisitos da empresa de uma maneira mais abrangente. Com essas melhorias, o sistema também ganhará eficácia substancial como uma ferramenta para gerenciamento estratégico, possivelmente para melhorar a eficiência operacional e facilitar uma melhor tomada de decisão em todos os níveis da organização."
}