{
    "Autor": "Telmo dos Santos Klipp",
    "Título": "Proposta de uma arquitetura para alocação de tarefas em grupos de robôs móveis baseada em acordo bizantino",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Anderson Luiz Fernandes Perez",
    "Coorientador(a)": null,
    "Resumo": "Robôs móveis vêm sendo usados cada vez mais para a execução de inúmeras tarefas, seja na indústria, na prestação de serviços ou em aplicações militares. Muitas tarefas são de natureza complexa e exigem a adoção de mais de um robô para sua completa execução. Sendo assim, a formação de grupos de robôs é fundamental e deve basear-se nas características da tarefa a ser executada, ou seja, das exigências funcionais do que é preciso para executá-la, mas também garantindo que, havendo uma falha de um ou mais robôs, a tarefa poderá ser concluída, mesmo em um tempo computacionalmente maior. Assim os robôs membros de um grupo devem ser escolhidos baseados em critérios físicos, comportamentais (habilidades) e de tolerância a falhas. Uma maneira de garantir a execução de uma tarefa por um grupo de robôs é adotar alguma técnica de tolerância a falhas, tal como o acordo bizantino. Acordo bizantino é baseado no princípio de que havendo falha de um robô no grupo existirão tantos outros que poderão dar continuidade a execução da tarefa. Este trabalho apresenta uma proposta de arquitetura para a alocação de tarefas em sistema multi-robôs baseada na taxonomia MRTA e que utiliza acordo bizantino para garantir o consenso e a resiliência entre membros de um grupo de robôs.",
    "Palavras-chave": [
        "robótica móvel",
        "sistemas multi-robôs",
        "acordo bizantino",
        "alocação de tarefas",
        "algoritmo de eleição"
    ],
    "Introdução": "Ao longo dos tempos a robótica móvel vem sendo aplicada a uma gama de tarefas (BRUMITT, 1998), tais como: exploração espacial (JPL - NASA), sondas de inspeção de dutos de petróleo e gás (robô G.I.R.I.N.O - Petrobrás), cirurgias (Da Vinci Surgical System - Intuitive Surgical), eletrodomésticos (robô Roomba - iRobot), entre outras. Em algumas aplicações o uso de apenas um único robô não é o suficiente para a solução do problema, neste caso faz-se necessário à utilização de um grupo de robôs móveis. A partir do interesse na área de robótica móvel se faz necessário entender além do funcionamento de um robô as tecnologias que permitem atribuir comportamentos mais complexos, como o compartilhamento de tarefas entre robôs, que permite estender a capacidade individual de um robô juntamente com outros a problemas maiores ou mais elaborados. O compartilhamento, seja de informações ou recursos, tem se apresentado como solução para diversos problemas de origem distribuída e assume um papel importante em diferentes tecnologias, permitir seu uso pode significar economia de tempo, esforço, capacidade de processamento, vida útil de recursos, entre outros fatores. Não obstante, existem problemas que podem ser complexos o suficiente para exigir uma divisão em partes e distribuição entre entidades especializadas nessas partes para uma possível solução. Nessa divisão de tarefas, vê-se que, o termo distribuído permite uma série de benefícios no que tange a utilização de recursos, podendo-se aplicar vários conceitos computacionais que otimizam esse processo, como, paralelismo, multiprocessamento, divisão da carga de trabalho, entre outros. O uso e o compartilhamento de tarefas entre robôs móveis pode significar uma vantagem na execução destas. Segundo Ribeiro et al.(2001), tarefas inerentemente distribuídas (espaço, tempo, funcionalidade), como busca e resgate, exploração, combate a incêndios são adequadas para o uso de um grupo de robôs. Por mais que robôs possam apresentar cada vez mais um comportamento inteligente utilizando tecnologias que os aproximem da capacidade cognitiva e racional humana, o que mais diferencia e valoriza o seu uso é o compartilhamento de tarefas proporcionando uma variedade de possibilidades tecnológicas. Um sistema pode atribuir a capacidade de monitorar, explorar, avaliar locais objetos e operações em vastas regiões geográficas. Destaca-se o aproveitamento de robôs móveis para o provimento de diversos serviços e que por meio de um sistema de ampla abrangência possa produzir dados para análise e gerência de amplos recursos dispostos geograficamente, a exemplo de um sistema de vigilância efetuado por robôs em locais e ambientes determinados (prédios, pátios, oceanos, florestas). A adoção de um grupo de robôs para a realização de algumas tarefas exige que o sistema de controle seja bem projetado, neste caso, é importante que o sistema seja capaz de determinar o que cada robô fará, ou seja, qual a tarefa que ele executará. Para este tipo de aplicação faz-se necessário à adoção de um sistema de compartilhamento de tarefas, que visa dividir o problema em problemas menores e então associar cada problema menor a um tipo de robô, respeitando as características e potencialidade do robô. Para que seja possível o compartilhamento de tarefas entre um grupo de robôs móveis é necessário a adoção de algum critério de alocação. A alocação de tarefas deve considerar que esta pode ser executada por um único robô, ou por mais de um robô, e ainda, que alguns robôs possam realizar mais de uma tarefa (GERKEY; MATARIC, 2004). Devido à multiplicidade de atribuições entre robôs e tarefas pretende-se utilizar uma taxonomia que trata de problemas de alocação de tarefas, MRTA (Multi Robot Task Allocation) proposta por Gerkey e Mataric (2004), somadas à necessidade de gerência e alocação dessas tarefas entre o grupo. Em sistemas multi-robôs a comunicação entre os robôs é essencial e deve incorporar confiabilidade e segurança na troca de mensagens, para que um grupo de robôs possa entrar em concordância sobre condições aplicadas ao mesmo (aceitação de uma tarefa). Em razão disso será proposta uma abordagem confiável através de acordo bizantino, para garantir que a comunicação entre o grupo seja tolerante a falhas eventuais, que não podem ser previstas. A garantia de tolerância a falhas em grupos de robôs móveis está relacionada com o objetivo principal deste trabalho que culmina com a proposta de uma arquitetura capaz de alocar tarefas entre robôs de maneira confiável. A arquitetura proposta é chamada de MRTA-B, pois faz uso da taxonomia MRTA com comunicação confiável baseada no acordo bizantino.",
    "Conclusão": "Este trabalho apresentou uma proposta de arquitetura para alocação de tarefas em sistemas multi-robôs baseada na taxonomia MRTA. A arquitetura proposta, intitulada MRTA-B, visa a formação de grupos de robôs e a alocação de tarefas de maneira confiável, isto é, garantindo que mesmo na presença de falhas arbitrárias por parte de algum robô do grupo a tarefa consiga ser executada. A arquitetura MRTA-B contempla problemas de múltiplas tarefas e múltiplos robôs (MT-MR) proposto na taxonomia MRTA. Na MRTA-B as tarefas são separadas conforme seus requisitos e associadas a grupos de robôs aptos a executá-las. Os grupos são formados por robôs que possuem características físicas e habilidades necessárias para o cumprimento da tarefa. O uso de acordo bizantino garante que a formação de grupos e a comunicação entre o robô coordenador e os líderes de grupos e entre o líder de um grupo e os robôs membros desse grupo sejam feitas de maneira confiável. O uso de acordo bizantino conduz a um número mínimo de 4 (quatro) robôs por grupo corroborando com os problemas aplicáveis a MT-MR em MRTA, ou seja, garantindo que uma tarefa complexa seja distribuída entre vários robôs, assim, um grupo formado por n robôs pode explicitamente cooperar na execução da tarefa. Para a compreensão da arquitetura MRTA-B foi utilizado um estudo de caso, sendo que foram listadas algumas tarefas para serem distribuídas em uma população de robôs. O estudo de caso demonstrou que a arquitetura MRTA-B tem potencial de fornecer os objetivos de alocação e confiabilidade na execução de tarefas. A arquitetura MRTA-B apresenta uma solução para a alocação de tarefas entre grupos de robôs, desta forma, o robô líder de cada grupo deve gerenciar e dividir a tarefa entre os robôs membros do grupo. O gerenciamento da execução da tarefa intra-grupo foge aos propósitos deste trabalho, podendo ser objeto de estudo em trabalhos futuros. Para melhor avaliar a arquitetura MRTA-B é necessário que a mesma seja implementada em ambiente simulado e em robôs reais. Ao longo da elaboração deste trabalho buscou-se implementar a arquitetura MRTA-B, entretanto por diversas razões isso não foi possível."
}