{
    "Autor": "Muriel Ricardo Ramos Andrigueto",
    "Título": "Método de Visualização de Dados para Geração de Insights na Gestão de Ideias",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.(a) Dr.(a) Marina Carradore Sérgio",
    "Coorientador(a)": "",
    "Resumo": "Na era digital, onde a informação cresce exponencialmente, a visualização de dados se torna uma técnica crucial para transformar informações textuais complexas em insights acionáveis, essencial para a análise de ideias inovadoras. Este trabalho investiga a aplicação de técnicas de visualização de dados em ideias coletadas do site \"Cool Business Ideas\", com o objetivo de revelar tendências, padrões e conexões ocultas, contribuindo para uma gestão de ideias mais eficaz e inovadora. Empregando uma abordagem quantitativa, o estudo analisou 904 ideias de negócios na categoria \"Tecnologia\" do período de 2004 a 2023, utilizando TF-IDF para vetorização e K-Means para agrupamento, complementados pela Análise de Componentes Principais (PCA) para redução de dimensionalidade. Os resultados apontam para um foco crescente em temas como inteligência artificial, sustentabilidade e soluções autônomas, destacando a importância de colaborações interdisciplinares e a integração entre áreas como IA e práticas sustentáveis. Conclui-se que a visualização de dados é uma ferramenta poderosa para a gestão e compreensão de ideias inovadoras, oferecendo insights valiosos para estratégias de negócios e inovação, e enfatizando a necessidade de abordagens que combinam tecnologia avançada com responsabilidade ambiental e social.",
    "Palavras-chave": "Visualização de Dados; Gestão de Ideias; Inovação.",
    "Introdução": "Em um cenário contemporâneo caracterizado pela geração contínua e maciça de dados, a capacidade de interpretar e compreender essas informações tornou-se essencial. Conforme argumentado por Padilla et al. (2018), a visualização de dados desempenha um papel crucial nesse contexto, sendo uma representação gráfica projetada para facilitar a compreensão intuitiva e acessível desses dados. Alhadad (2018) amplia ainda mais essa visão, enfatizando que a visualização não é apenas um meio de comunicação, mas também uma ferramenta poderosa para melhorar a percepção do público em relação a informações complexas. O domínio da visualização de informações, como observado por Eberhard (2023), transcende as fronteiras de várias disciplinas e setores. Essa prática multifacetada desempenha um papel fundamental, desde concentrar a atenção até facilitar o compartilhamento do conhecimento e identificar tendências e padrões subjacentes nos dados. A amplitude de aplicação da visualização amplifica sua relevância, especialmente no contexto da inovação (WANG et al., 2017). No ambiente corporativo, a inovação é mais do que uma mera ferramenta competitiva; é o motor do progresso econômico, como afirmado por Hansen (2022). Baregheh, Rowley e Sambrook (2009) ecoam essa ideia, definindo inovação como a alquimia de transformar ideias em soluções tangíveis que agregam valor discernível ao mercado. Entretanto, alimentar essa engrenagem de inovação requer uma gestão de ideias sólida e eficaz. Plataformas que agregam e apresentam ideias, como o \"coolbusinessIdeas.com,\" desempenham um papel importante nesse contexto. No entanto, como apontam pesquisadores como Martinez-Torres e Olmedilla (2016), Gabriel et al. (2016) e Dziallas e Blind (2019), um desafio formidável para essas plataformas é o vasto oceano de informações não estruturadas que geram e que exigem análise meticulosa. Este trabalho se propõe a explorar a interseção entre visualização de dados, inovação e gestão de ideias, destacando como a visualização pode ser uma ferramenta crítica para o processo de inovação e como abordagens eficazes de gestão de ideias podem ser aprimoradas por meio da análise de dados visualizados. A compreensão dessa relação é fundamental em um contexto empresarial cada vez mais orientado por dados e inovação.",
    "Conclusão": "Este trabalho apresentou uma análise detalhada de ideias de negócios da área de tecnologia, coletadas do site CoolBusinessIdeas.com, com o intuito de discernir padrões e tendências que informem estratégias de inovação e gestão. A pesquisa percorreu um caminho analítico, desde a limpeza e preparação dos dados até a aplicação de técnicas como TF-IDF, K-Means e PCA, para vetorização, agrupamento e redução de dimensionalidade dos dados. A análise temporal ressaltou na identificação de um aumento acentuado no número de ideias inovadoras a partir de 2018, com um pico em 2020, provavelmente em resposta aos desafios da pandemia. A relevância contínua de conceitos de negócios surgidos nas primeiras etapas do período estudado foi confirmada, demonstrando que certas inovações mantêm sua importância e aplicabilidade ao longo do tempo. Isso sublinha a importância de revisitar e reevaluar ideias anteriores, pois elas podem servir como fundamento ou inspiração para novas inovações. A pesquisa atendeu ao seu objetivo geral de analisar as tendências em ideias de negócios tecnológicos, fornecendo insights claros e quantificáveis para direcionar a inovação e a estratégia de negócios. Os objetivos específicos foram igualmente atendidos: a identificação de padrões temporais, a confirmação de ideias de negócios antigos e a extração de temas predominantes entre os clusters. A análise de palavras-chave e tendências temáticas revelou uma forte inclinação para automação, inteligência artificial, sustentabilidade e inovações energéticas. Este estudo também trouxe contribuições para o campo da análise de dados e visualização no contexto de negócios tecnológicos. Demonstrou-se que as técnicas de processamento de dados e aprendizado de máquina podem ser aplicadas com sucesso para extrair insights valiosos de conjuntos de dados textuais extensos. Logo, as visualizações criadas a partir da análise dos dados não apenas ilustraram as tendências de forma clara e intuitiva, mas também facilitaram a compreensão de conceitos complexos. Esta pesquisa pode contribuir com as empresas e empreendedores que buscam navegar no cenário tecnológico em constante evolução. As descobertas deste estudo oferecem uma base para decisões estratégicas e desenvolvimento de políticas relacionadas à inovação tecnológica. Ao mesmo tempo, a metodologia adotada pode ser replicada ou adaptada para futuras pesquisas em outras áreas do conhecimento ou setores de negócios. As limitações identificadas destacam oportunidades para pesquisas futuras. A expansão do conjunto de dados e a incorporação de técnicas analíticas adicionais poderiam enriquecer ainda mais o entendimento das tendências em inovações tecnológicas. A necessidade de atualização contínua das análises reflete a natureza dinâmica do campo tecnológico, enfatizando a importância de se manter constantemente atento às mudanças do mercado para sustentar a relevância e aplicabilidade das descobertas para inovação e estratégia de negócios. Para pesquisas futuras, identificou-se o potencial em explorar Large Language Models (LLMs) e representações vetoriais densas (embeddings). Estas técnicas permitem uma representação semântica mais rica de unidades de informação, que podem ser termos, sentenças, textos, imagens, vídeos, ou mesmo subgrafos. Especialmente em um contexto de inovação tecnológica, embeddings oferecem uma maneira avançada de capturar as nuances e a complexidade das ideias de negócios. Além disso, os grafos de conhecimento emergem como uma ferramenta promissora para suportar áreas como previsão tecnológica (technology forecasting), permitindo a visualização e a análise de conexões entre diferentes conceitos e inovações. Esta abordagem pode ser particularmente útil para empresas e empreendedores que buscam se manter à frente no cenário tecnológico dinâmico. Incorporando essas técnicas avançadas em estudos futuros, será possível aprofundar o entendimento das tendências atuais e antecipar a direção de futuras inovações."
}