{
    "Autor": "Arthur Volpato Batista",
    "Título": "Desenvolvimento de uma Aplicação Web3D para o Ensino da Anatomia do Sistema Esquelético",
    "Ano de publicação": "2017",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Robson Rodrigues Lemos",
    "Coorientador(a)": "Prof.ª Patricia Jantsch Fiuza",
    "Resumo": "As tecnologias Web3D apresentam grandes oportunidades de inovação no ensino de ciências da saúde. Desta forma, o uso de objetos 3D na Web nos permite explorar características fundamentais na busca do aumento da qualidade da Educação em ambientes virtuais. Este trabalho de conclusão de curso tem como objetivo o desenvolvimento de um ambiente virtual de aprendizagem e Jogo Sério para o estudo da anatomia do esqueleto humano utilizando tecnologias na WEB. O projeto do jogo sério foi realizado em conjunto e com a ajuda de especialistas em Anatomia Humana que auxiliaram na identificação e adição dos conteúdos dentro do estudo da anatomia para contribuir com a compreensão da estrutura do membro inferior, assim como conceitos representados de forma tridimensional que exibem a posição dos acidentes ósseos do membro. Tendo em vista a inovação nos ambientes virtuais, o jogo sério tem como objetivo principal apresentar um componente extra e inovador o qual possibilitará alunos de ciências da saúde fazerem uso de um ambiente virtual de ensino e aprendizagem onde a apresentação e a fixação do conteúdo de estudo levam em consideração conceitos associados a função e estrutura dos ossos. Foram realizados estudos de caso com alunos do curso de Fisioterapia na disciplina de Anatomia I através de técnicas de avaliação de usabilidade da área de pesquisa de Interação Humano Computador. A partir dos resultados obtidos com o estudo foi possível identificar características fundamentais e inovadoras que devem estar presentes em projetos de jogos sérios para o ensino de ciências da saúde.",
    "Palavras-chave": "Jogos Sérios, Jogos sérios na Saúde, Ambientes Virtuais de Ensino de Anatomia, Anatomia Óssea dos Membros Inferiores.",
    "Introdução": "No contexto de tecnologias da informação e comunicação, novos estudos e conceitos na área vem surgindo com bastante frequência. Métodos voltados para a educação são exemplos de evoluções que absorvem propriedades de diversas tecnologias. Como resultado, soluções para educação utilizando recursos multimídia e até mesmo jogos, vem contribuindo para o aprimoramento do aprendizado. Segundo Sá et al. (2007) o uso de jogos nas atividades de ensino possibilita oferecer ao aprendiz momentos lúdicos e interativos como etapas do processo de aprendizagem. Existe uma constante procura por tecnologias que auxiliam na educação, e os jogos visam o aprimoramento em áreas interdisciplinares que buscam a criação de abordagens diferenciadas e destinadas as necessidades particulares dos estudantes. É cada vez mais frequente o surgimento de ferramentas diferenciadas que levem a experiência de uso dos alunos a um nível sempre desejado, pensando nisso, fica claro que o engajamento nos estudos é um fator muito importante, com possibilidades e necessidades de aperfeiçoamento. Com o desenvolvimento dessas novas tecnologias, os jogos se tornaram um aliado nos ambientes de ensino, permitindo que os métodos educacionais saiam do ensino tradicional e passe a funcionar dentro do contexto das Tecnologias de Informação e Comunicação na Educação. O uso de jogos para treinar, aprender e executar atividades reais em ambientes virtuais pode melhorar o desempenho dos estudantes, pois possibilita a vivência de experiências de aprendizagem produzidas individualmente de acordo com o estilo do estudante (Prikladnicki e Wangenheim, 2008). Com o foco na saúde, existem inúmeras possibilidades e a necessidade de absorver o uso de jogos nas disciplinas de anatomia humana, servindo como um recurso adicional e diferenciado na aprendizagem dos estudantes. A anatomia humana é uma disciplina indispensável e uma base para todas as disciplinas clínicas. As metas do ensino de anatomia são, no mínimo, conhecer as estruturas anatômicas e as relações entre elas; reconhecer as estruturas anatômicas por meio de técnicas de imagens; e entender as bases anatômicas da Patologia (Corredera e Santana 2003). Aprimorar os recursos didáticos aplicados ao ensino de anatomia tende satisfatoriamente para o direcionamento das ações, estimula a participação do aluno como sujeito ativo na busca por novas informações promovendo suporte indispensável ao processo de ensino-aprendizagem (Guiraldes et al. 1995). O ensino tradicional da anatomia humana envolve dois momentos distintos: a exposição de conceitos teóricos e definições dos sistemas e órgãos do corpo humano; e a abordagem prática, que, por meio de peças anatômicas e cadáveres em laboratório, estuda as características gerais e suas inter-relações. Entre os diferentes métodos utilizados no ensino de anatomia podem ser citados os estudos em peças anatômicas previamente dissecadas, modelos anatômicos, ambientes virtuais interativos, softwares e ainda mídias sociais (Lopes e Teixeira 2012)(Nuland e Rogers 2015)(Hennessy et al. 2016). No entanto, a vasta nomenclatura anatômica pode tornar o aprendizado da disciplina complexo para os acadêmicos levando a uma experiência de aprendizado fraca, a qual é responsável pela origem de conotações negativas em relação ao assunto e resultando em uma abordagem superficial para a aprendizagem e até mesmo podendo levar à evasão do curso (Smith e Mathias 2010). Nesse cenário, ambientes virtuais para o ensino de anatomia assumem um grande papel no aprendizado fornecendo um novo ambiente de estudo diferente do laboratório de anatomia [Richardson et al. 2011]. Uma grande aplicabilidade dos ambientes virtuais está no fato desta ferramenta substituir o uso de modelos anatômicos e, dentro de determinados sistemas orgânicos, substitui a própria peça anatômica cadavérica. A preservação de estruturas anatômicas pequenas e frágeis como vasos sanguíneos e nervos, os quais requerem uma perfeita dissecação para uma satisfatória visualização pelos alunos, é um dos grandes desafios dos laboratórios de anatomia. Além disso, outra dificuldade que os laboratórios de anatomia enfrentam é o desgaste mecânico dos cadáveres e preparações cadavéricas durante as aulas de anatomia. O custo de manutenção de um laboratório é elevado, uma vez que o preparo de uma peça anatômica para estudo envolve o uso de grandes quantidades de reagentes, bem como materiais de dissecação e trabalho técnico. Desse modo, através da combinação de modelos geométricos da anatomia humana com software personalizado pode-se proporcionar aos alunos novas formas de interagir com a anatomia que não poderiam ser alcançadas durante dissecações ou através de imagens estáticas e diagramas (Ma et al., 2010). Neste trabalho de conclusão de curso, propõe-se o desenvolvimento de um ambiente virtual online voltado para o ensino da anatomia do sistema esquelético, dando ênfase ao membro inferior do esqueleto humano, com o objetivo de auxiliar no ensino dos estudantes na área da saúde. Com o intuito de investigar a relevância de jogos sérios para o ensino de anatomia, desenvolveu-se o jogo sério Web3D EducaAnatomia3D, para que assim possa se responder a seguinte questão: Jogos Sérios para o ensino virtual interativo de anatomia são relevantes no processo de aprendizagem de conceitos associados a função e estrutura de ossos?",
    "Conclusão": "O jogo sério EducaAnatomia3d visa facilitar o ensino de Anatomia, permitindo uma nova forma de auxílio para estudos e testes do conhecimento nesta área. Existem jogos sérios e ambientes virtuais disponíveis na literatura para o ensino e aprendizagem da disciplina de Anatomia (Biodigital 2017) (Visible Body 2017). No entanto, a abordagem no projeto de jogos sérios e dos ambientes virtuais para o ensino da Anatomia Humana encontrado na literatura apresentam normalmente diversos sistemas do corpo humano do ponto de vista de um atlas 3D. O estudo desenvolvido para o jogo sério permitiu com o auxílio de especialistas em Anatomia Humana explorar informações importantes no entendimento da função e estrutura dos ossos através do detalhamento das informações associadas aos acidentes ósseos. Desta forma, o jogo sério apresenta um componente inovador no projeto de jogos sérios possibilitando alunos de ciências da saúde fazer uso de um ambiente virtual de ensino e aprendizagem onde a apresentação e a fixação do conteúdo de estudo levam em consideração conceitos associados a função e estrutura dos ossos. No geral a aplicação recebeu na avaliação de usabilidade uma pontuação satisfatória e sugestões interessantes para possíveis melhorias para tornar a experiência para os estudantes mais completa e interessante. Assim sendo, o jogo sério EducaAnatomia3d demonstrou-se relevante como um instrumento adicional que pode fazer parte do processo de aprendizagem de conceitos associados a função e estrutura de ossos. Observou-se, a partir da análise dos resultados da utilização do jogo sério por parte do grupo de alunos de Anatomia I, que o jogo sério auxiliou a introduzir os conceitos a respeito da anatomia do membro inferior e auxiliou os alunos novatos a entender o relacionamento tridimensional (3D) dos acidentes ósseos com regiões do membro inferior. Como trabalhos futuros pretende-se explorar formas mais intuitivas para interação com os acidentes ósseos e adicionar mais elementos para o estudo dos diversos sistemas do corpo humano como, sistema muscular, sistema nervoso, sistema cardiovascular, além de incluir informações e diferentes mecanismos inovadores para explorar a compreensão das diversas funções e estruturas."
}