{
    "Autor": "Francieli Naspolini Formanski",
    "Título": "Influência das Novas Tecnologias da Informação e Comunicação no Processo de Ensino -Aprendizagem no Brasil e Portugal",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Juarez Bento da Silva",
    "Coorientador(a)": null,
    "Resumo": "O presente estudo apresenta a forma com que os professores utilizam as Novas Tecnologias da Informação e Comunicação (NTIC) no processo de ensino-aprendizagem e quais os recursos mais procurados pelos discentes disponibilizados num Ambiente Virtual de Aprendizagem (AVA), que neste caso é o Moodle. Estes recursos mais acessados podem representar a melhor forma a adotar -se para que a utilização dessas ferramentas tecnológicas facilitem o aprendizado dos alunos. A pesquisa fundamentou-se no levantamento de aspectos referentes as NTIC no ambiente acadêmico como apoio à docentes e discentes. Como metodologia foi adotada a abordagem quantitativa e qualitativa, onde basicamente a pesquisa está inserida na metodologia do tipo descritiva. Foi aplicado questionários e realizado uma análise dos dados retirados do uso da plataforma AVA, o Moodle, com o intuito de indicar de que forma a ferramenta tecnológica disponível é utilizada em instituições do Brasil e Portugal. A população deste estudo foi constituída efetivamente por 180 alunos do ISEP situado em Portugal. E Para finalizar este trabalho de conclusão de curso foi apresentada as respostas e resultados obtidos através do estudo. Onde se apontou que os alunos tendem a procurar recursos estáticos (material teórico) disponibilizados no Moodle ao invés de recursos dinâmicos, como os laboratórios de experimentação remota, por exemplo. Mostrou, também, que as NTIC auxiliam no processo de ensino-aprendizagem se utilizadas da forma correta. Não basta disponibilizar as ferramentas aos alunos, é necessário dar o devido suporte e incentivo à eles. Explicar a importância de tal ferramenta e benefícios que a mesma pode trazer.",
    "Palavras-chave": "ensino-aprendizagem, educação, novas tecnologias da informação e comunicação, laboratórios de experimentação remota.",
    "Introdução": "A informática surgiu para grandes cálculos de guerra e hoje com a globalização evoluiu e está presente em todos os lugares, não somente no setor administrativo, como também, no processo de ensino-aprendizagem. Através do desenvolvimento de plataformas sociais que permitem a todos os cidadãos contribuir para a geração de novos conhecimentos e recursos (MARCELINO, 2010), o computador e a internet tornam-se veículos de informação, que multiplicam as possibilidades de pesquisa, onde o sujeito interage, explora e comunica-se entre diferentes povos e culturas. As NTIC têm assumido um papel importante na representação social da realidade escolar, onde as mudanças que elas proporcionam, têm crescido rapidamente, surgindo assim uma nova cultura (SILVA, 2007), conhecida como a geração Y. A inserção destas NTIC tem mudado os paradigmas da educação, na qual o processo de ensino-aprendizagem já não está mais limitado aos trabalhos realizados dentro das salas de aulas. O desenvolvimento de soluções inovadoras e ferramentas educacionais criativas, já disponíveis mundialmente para toda a comunidade, têm contribuído para a propagação das ligações existentes e de novas criações no meio acadêmico. Acrescentando valor ao processo de ensino-aprendizagem (SILVA; ALVES e GIRALDI 2008). Neste contexto, as modalidades de ensino presencial e à distância começam a ser fortemente modificadas, desafiando as diferentes instituições de ensino a encontrar novos modelos para estas situações. Sendo assim, a utilização das tecnologias na educação tem sido adotada como forma complementar ao processo de ensino-aprendizagem, remodelando as interações entre professores e alunos. Atualmente existem estudos que visam o desenvolvimento de novos recursos educacionais. Alguns deles já consolidados, como os softwares educacionais (exercício e prática, tutoriais, jogos educacionais e simulação), os laboratórios de experimentação remota, ambientes virtuais de aprendizagem, mundos virtuais 3D, dispositivos hápticos entre outros (TAVARES, 2012). Além de desenvolver novos recursos educacionais, faz-se necessário inseri-los como facilitador ao ensino. O autor Schaff (1995) considera que apesar da disseminação dos computadores e do fascínio que causa nos alunos, há a possibilidade de um uso não adequado e produtivo do computador. Dentro dessa inserção surgem alguns problemas como a capacitação dos professores para este novo paradigma, na qual muitos não sabem utilizar essas novas ferramentas tecnológicas proporcionadas pelas Tecnologias da Informação e Comunicação (TIC), como os computadores juntamente à internet, ferramentas de apoio ao ensino, como por exemplo, os AVA, os mundos virtuais e a experimentação remota. Estudos, Santos (2006), demonstram que as escolas que utilizam as NTIC na educação, apresentam melhorias nas condições de estruturação do pensamento dos alunos com dificuldades de aprendizagem, atenção e concentração. De acordo com o autor Alves et al. (2012 , a), o uso das tecnologias educacionais surgem como uma boa oportunidade para melhorar e complementar o ensino-aprendizagem, incentivando os alunos a realizar diferentes atividades, que facilita a evolução dos mesmos no ritmo das necessidades individuais. Com o objetivo de estudar sobre de que forma os docentes utilizam essas ferramentas atualmente no ensino, este trabalho propõe responder as seguintes perguntas: • Quais as principais características do uso das NTIC pelos docentes? • Qual dos recursos disponibilizados em um AVA é mais utilizados pelos alunos? • Estas ferramentas tecnológicas auxiliam no processo de ensino-aprendizagem dos alunos? Para responder a esta questão, os objetivos geral e específicos desta pesquisa estão estruturados a seguir.",
    "Conclusão": "Pesquisas nacionais e internacionais indicam que a simples existência das NTIC nas escolas não se traduz em melhoria de desempenho escolar. Obviamente, dotar as escolas de computadores, melhorar o acesso à Internet e capacitar professores e alunos para o uso da informática são ações importantes para promover a inclusão digital e democratizar o acesso a informações indispensáveis para entender o mundo que nos cerca. Além da simples existência das NTIC nas escolas, é necessário saber como o uso das NTIC poderá de fato fazer diferença no processo de ensino-aprendizagem. Neste trabalho apresentaram-se algumas conclusões da pesquisa. Buscou-se apontar respostas para as questões levantadas, de forma a atender os objetivos da pesquisa realizada. A proposta apresentada nesse trabalho foi de expor um estudo sobre a utilização das NTIC pelos docentes no Brasil e Portugal e qual a melhor forma de utilizá-las para que as NTIC auxiliem no processo de ensino-aprendizagem. Trabalho realizado em Portugal no Instituto Politécnico do Porto e comparado com estudos previamente realizados no mesmo instituto e no Brasil como um todo e mais especificamente no campus Araranguá da UFSC. A pesquisa realizada neste trabalho já foi publicada no evento internacional Talking about Teaching 2012 (TAT’12), realizado na Áustria em 2012. O nome do artigo publicado é: Student Performance Analysis under different Moodle Course Designs. A revisão bibliográfica serviu para dar a fundamentação teórica ao trabalho e proporcionou um melhor conhecimento sobre o assunto que foi tratado no trabalho. Abortou temas como a educação item chave da pesquisa, uma vez que a pesquisa realizada tem por objetivo melhorar o processo de ensino-aprendizagem. Buscou-se também a identificação de algumas NTIC existentes e que podem ser utilizadas para facilitar a aprendizagem para qualquer nível da educação, desde a fundamental ao ensino superior. A realização da pesquisa surgiu em complemento às pesquisas já realizadas, fundamentou-se em disponibilizar os recursos a serem analisados numa ferramenta chamada Moodle, onde os alunos tiveram acesso durante todo o semestre em questão da pesquisa. Onde posteriormente foram analisados os dados de acesso ao Moodle correlacionando com suas notas finais. Juntamente aos dados analisados através do Moodle, foi disponibilizado dois questionários iguais, mas distribuídos separadamente, onde o primeiro foi disponibilizado nos primeiros dias do semestre e o segundo (igual ao primeiro) disponibilizado nos últimos dias do semestre, com o objetivo de analisar se houve ganho na aprendizagem ou não. De acordo com os resultados obtidos na pesquisa realizada em Portugal e comparando com os dados apresentados de pesquisas realizadas no Brasil, podemos observar que os participantes da amostra, geralmente utilizam todos os dias as ferramentas disponibilizadas, onde as conexões com estas ferramentas são feitas geralmente de suas casas e de curta duração. Na maioria das escolas de ensino fundamental do Brasil, é possível perceber que além de poucos professores utilizarem as NTIC oferecidas a eles, os programas que são mais utilizados pelos mesmos com os seus alunos são de baixa complexidade como, por exemplo, editores de texto. Já no ensino superior de Brasil e Portugal os recursos mais utilizados no Moodle são fóruns, envio de mensagens, diário, disponibilização de conteúdos e materiais de aula e envio de tarefas. A pesquisa realizada em Portugal mostra que os Guias de Laboratório (R1, embasamento teórico) é o recurso mais acessado e os experimentos remotos (R3) é o recurso menos acessado. Mostrando uma maior preferência por recursos gerais estáticos (R1). O número de alunos que encontram utilidade em outros recursos dinâmicos como fóruns de discussão ou relatórios online é de baixa importância. Isso não significa que o recurso não é útil, apenas expressa que ele só ajuda a uma pequena porcentagem de estudantes. No entanto, os resultados mostram estatisticamente que a qualidade dos recursos do Moodle influencia nos resultados finais obtidos pelos alunos. Sendo assim, o Moodle, uma das ferramentas disponíveis através das NTIC, pode facilitar o processo de transmissão do conhecimento de forma expressiva, os participantes da pesquisa afirmam que a inserção das NTIC no ensino facilitará a compreensão dos conteúdos e um maior e melhor acesso aos conteúdos. A maioria (80%) dos docentes brasileiros participantes da pesquisa considera que o uso das NTIC aportará algo novo e que a qualidade do ensino não será a mesma e apenas 5% concordam com que não aportará nada novo. No entanto, apesar da estrutura tecnológica oferecida no ambiente escolar ser boa, a formação oferecida aos professores ainda não é percebida como suficiente e adequada, pois falta preparo para o uso da tecnologia focado no ensino-aprendizagem dos conteúdos escolares. O número de professores que usam a tecnologia com seus alunos é ainda pequeno. Notou-se que muitos professores ainda hoje têm preocupação em incorporar as NTIC no processo de ensino-aprendizagem, por dois motivos: ou por ter receio de que as tecnologias substituirão os mesmos ou por ter um preconceito acerca das tecnologias, levando-os a acreditar que as NTIC não auxiliam no ensino. Para trabalhos futuros, em continuidade a esta pesquisa, propõem-se incluir outra ferramenta disponível e muito utilizada atualmente pelos jovens que são as mídias sociais. Pode-se estudar qual é a influência das redes sociais no processo de ensino-aprendizagem e qual uma melhor forma de utilizá-la para facilitar a aprendizagem dos discentes. Entretanto, como a pesquisa apresentou, ainda é necessário que os professores recebam uma melhor formação na área tecnológica para que as NTIC auxiliem ainda mais no processo de aprendizagem."
}