{
    "Autor": "Luís Felippe Floriani",
    "Título": "Avaliação de Usabilidade do Prontuário Eletrônico de Pacientes do Sistema Tasy e Análise de Satisfação do Corpo Clínico do Hospital Regional de Araranguá",
    "Ano de publicação": 2012,
    "Local de publicação": "Araranguá - SC",
    "Orientador(a)": "Prof. Eugênio Simão, Dr. Eng.",
    "Coorientador(a)": null,
    "Resumo": "O Prontuário Eletrônico de Paciente tem a intenção de facilitar o trabalho de médicos e outros profissionais da saúde possibilitando o acesso e o compartilhamento de informações clínicas e administrativas, auxiliando a realização de estudos científicos, bem como, o processo de tomada de decisão. Como um sistema de informação, deve ser desenvolvido com foco nos princípios da qualidade de software - para atender aos requisitos de funcionalidade e da engenharia de usabilidade - para que a interação com os usuários seja a mais satisfatória possível. Ao proceder-se à avaliação heurística do módulo Assistencial – Prontuário Eletrônico de Pacientes (PEP) do Sistema Tasy implantando no Hospital Regional de Araranguá (HRA), constata-se a existência de aspectos que violam orientações de autores e estudiosos da área, dentre os quais: a inexistência de um ícone de ajuda com a respectiva funcionalidade visível e acessível aos usuários deste módulo, a disposição não agradável de alguns campos para preenchimento em sua interface - ocorrendo um excesso de informações em um pequeno espaço de tela e, por fim, de que algumas informações que só poderiam ser preenchidas em caso de seleção de um determinado item estariam, entretanto, sempre acessíveis aos usuários. Questionários de avaliação de satisfação foram aplicados junto a profissionais que integram o corpo clínico do Hospital pelos quais foi possível constatar que, embora haja violações heurísticas frequentes - que também não chegam a comprometer o funcionamento do software - os usuários daquele nosocômio estão, em geral, satisfeitos com o sistema.",
    "Palavras-chave": "Qualidade de Software. Usabilidade. Satisfação. Informática Médica. Prontuários Eletrônicos de Pacientes.",
    "Introdução": "A competitividade do mercado e o fácil acesso à informação têm provocado mudanças no comportamento dos consumidores que, por sua vez, tornam-se cada vez mais exigentes. As organizações bem-sucedidas voltam suas ferramentas computacionais para o mercado, adaptando seus produtos ao comportamento de consumo dos clientes, com o intuito de assegurar a usabilidade e garantir sua qualidade. Neste sentido, o computador se torna uma ferramenta das equipes de trabalho, possibilitando automatizar processos repetitivos, armazenar informações importantes e servir de apoio às tomadas de decisão. Contudo, para que os sistemas possam auxiliar estas tarefas, a interface com os usuários têm papel relevante no sucesso de um sistema e, consequentemente, indicando a satisfação ou não dos usuários. Enquanto anos atrás os usuários dos sistemas eram os próprios desenvolvedores, a popularização dos computadores fez com que um público maior tivesse acesso aos sistemas de informação. Entretanto, as interfaces com estes usuários continuaram sendo deixadas como a última etapa do desenvolvimento. Das dificuldades verificadas nas relações entre usuários e sistemas computacionais surge a Engenharia da Usabilidade com estudos que abrangem desde a ergonomia à psicologia e à cognição. Diversos autores comungam da ideia de que interfaces complexas que aumentam a carga de trabalho do usuário acarretam em consequências negativas à utilização de um sistema - consequentemente, na satisfação dos usuários - resultando na resistência ao uso – a implantação de sistemas computacionais por si só já causa resistência numa organização. Se as interfaces forem mal planejadas isso se torna ainda mais grave; subutilização do sistema – devido às dificuldades de uso, ferramentas que são desenvolvidas para a gestão de uma organização, acabam sendo empregadas como coadjuvantes, não tendo seu potencial utilizado; atraso na implantação de um sistema – interfaces mal desenvolvidas podem atrasar a implantação demandando mais tempo para equipes de desenvolvimento; abandono – o resultado final de todos os itens acima. Por outro lado, interfaces com boa usabilidade influenciam positivamente no retorno dos investimentos para a organização fazendo com que os usuários tomem um ritmo natural de interação - podendo também evitar descontentamentos em função de correções frequentes e trabalhos adicionais. De modo geral, os sistemas computacionais voltados à área médica - área cientificamente conhecida como Informática Médica – são, segundo WECHSLER (2003), divididos em três grupos: Sistemas de Apoio à Decisão (SAD) – via de regra, são softwares que apoiam o médico e sua decisão clínica sendo caracterizados tanto os aplicativos que utilizam dados e informações como também aqueles que utilizam o conhecimento, ou os chamados Sistemas Especialistas (SE); Telemedicina – podendo ser compreendida como a utilização dos recursos de telecomunicação e informática quando aplicados ao procedimento diagnóstico e terapêutico à distância, consultas, orientações, educação médica continuada à distância, com imagens transmitidas por meio eletrônico; Prontuários Eletrônicos de Pacientes (PEPs) – inicialmente desenvolvidos para documentar as informações do estado de saúde (quadro clínico) de um paciente. Este trabalho apresenta uma avaliação do Prontuário Eletrônico de Paciente que integra o módulo Assistencial do Sistema Tasy. Trata-se de um sistema de informação clínico-hospitalar, projetado e desenvolvido pela empresa Wheb Sistemas com sede em Blumenau-SC, hoje sob o controle da Phillips do Brasil, implantado em nosocômios de renome nacional como: Hospital Samaritano, Hospital das Clínicas de São Paulo, Hospital Albert Einstein, Rede Sara Kubitscheck, dentre outros. A estruturação deste trabalho dar-se-á da seguinte forma: este primeiro capítulo aborda a apresentação do problema e sua justificativa, os objetivos gerais e específicos, bem como, as metodologias de pesquisa que o norteiam. No segundo capítulo, são abordados os principais tópicos que dão fundamentação teórica ao trabalho. O terceiro capítulo está relacionado ao universo e ao objeto de pesquisa - mais especificamente, ao Hospital Regional de Araranguá e ao Sistema Tasy. No quarto capítulo são apresentadas as pesquisas e os resultados com elas obtidos. No quinto capítulo, têm-se as considerações finais com uma análise crítica do que foi desenvolvido e suas possibilidades futuras.",
    "Conclusão": "Como qualquer sistema de informação, o projeto e o desenvolvimento de um Prontuário Eletrônico de Paciente também requerem cuidados que não ficam restritos aos aspectos de atendimento aos requisitos funcionais e não funcionais da aplicação. As interfaces de um software com a funcionalidade de automatizar processos em um ambiente clínico-hospitalar e registrar dados de pacientes devem ser construídas levando-se em consideração características inerentes ao perfil dos profissionais da saúde - usuários destes sistemas. O projeto de software que tem por base a satisfação do usuário, certamente conduzirá o sistema a um percentual de aceitação e utilização maior que aqueles que não o fazem. Neste trabalho, foram empregados conceitos comuns às disciplinas de Engenharia de Software e Interface Homem-Computador. Através de uma avaliação heurística foi possível levantar alguns problemas inerentes à interação usuário - sistema. Tendo como universo de pesquisa o corpo clínico do Hospital Regional de Araranguá – SC, foi possível avaliar o nível de satisfação destes com o Prontuário Eletrônico de Paciente do Sistema Tasy. Finalmente e não menos importante, a título de propostas de trabalhos futuros, sugere-se: a avaliação da usabilidade de outros módulos do próprio sistema, o impacto destes no processo de tomada de decisão, a medição do nível de segurança do sistema e das informações nele registradas e a implementação de novos requisitos ao software - com a inclusão de funcionalidades de apoio à decisão clínica com aplicações de técnicas da inteligência artificial (sistemas especialistas)."
}