{
    "Autor": "Evandro Machado Pereira",
    "Título": "Labs4Steam 2.0 - Desenvolvimento de um sistema de compartilhamento de práticas pedagógicas",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Juarez Bento da Silva, Dr.",
    "Coorientador(a)": "",
    "Resumo": "Práticas pedagógicas podem ser importantes ferramentas de apoio em sala de aula, com isso, o Laboratório de Experimentação Remota (RExLab) desenvolveu em 2019 uma ferramenta chamada Labs4STEAM, que tem como objetivo permitir o compartilhamento dessas práticas entre docentes do mundo inteiro. Com a popularização da ferramenta, uma nova atualização foi requerida a fim de facilitar o uso da plataforma. O presente trabalho demonstra a utilização da metodologia de desenvolvimento iterativa e incremental, bem como o referencial teórico levantado para o desenvolvimento dessa atualização. Inicialmente o sistema foi desenvolvido utilizando a plataforma Wordpress, e um formulário Google anexado à página para a submissão de práticas pedagógicas além de um e-mail para submissão de anexos a essas práticas, o que acarretava um constante trabalho manual para suas publicações. A nova versão trouxe a utilização de uma biblioteca Javascript chamada React e provisoriamente de ferramentas disponibilizadas pela plataforma Firebase e da Google que ao final se mostrou uma importante ferramenta que pode ser utilizada para o desenvolvimento ágil de diversas aplicações.",
    "Palavras-chave": "Práticas Pedagógicas 1. Labs4Steam 2. Sistema Web 3.",
    "Introdução": "Em meados de 2018 foi desenvolvido pela equipe do Laboratório de Experimentação Remota (RExLab) da Universidade Federal de Santa Catarina (UFSC) a Labs4STEAM, uma plataforma de compartilhamento de atividades pedagógicas que inicialmente teve como objetivo o compartilhamento das atividades que englobam as práticas com o VISIR (Virtual Instrument Systems in Reality), um laboratório remoto voltado a prática de circuitos elétricos (SILVA, 2019). A partir de 2021 com a aprovação do projeto “Plataforma aberta modular para construção, gestão e disponibilização de laboratórios remotos na Educação Básica”, pelo RExLab, junto ao Ministério de Ciência Tecnologia e Inovações (MCTI) tornou-se necessária a disponibilização de uma plataforma aberta para abrigar os planos de aulas elaborados e utilizados pelos docentes participantes das ações de capacitação previstas no projeto. Uma vez que, esta era uma das metas do projeto. Posteriormente, com a aprovação, em 2022, junto ao MCTI, do projeto “Programa contínuo de capacitação professores da Educação Básica para possibilitar a integração de tecnologias digitais em suas práticas pedagógicas, inspiradas na cultura maker, utilizando como base o Framework do Programa InTecEdu do Laboratório de Experimentação Remota da UFSC”, mais uma vez foi destacada a necessidade de disponibilização de um ambiente na Web para abrigar materiais educacionais digitais provenientes das capacitações de docentes. Para fins deste trabalho, definimos material educacional digital como um material elaborado pelos professores (equipe técnica ou pedagógica), que tem como objetivo a apresentação ou desenvolvimento dos conteúdos curriculares, em contexto educacional (tradicional ou à distância), a fim de, facilitar e conduzir a aprendizagem dos seus alunos, com ou através do respectivo suporte informático. Por outro lado, definimos recurso educacional digital, como o uso ou aproveitamento do material didático ou educacional digital disponível, a fim de, facilitar os processos de ensino e de aprendizagem, em qualquer um dos contextos educacionais mencionados, para que possam contribuir para a construção do conhecimento. Rossi (2022) define prática pedagógica como uma atividade realizada em âmbito escolar que tem um objetivo pedagógico e uma metodologia condizente com esse objetivo. Com essa definição, pode-se compreender que as práticas pedagógicas podem ser importantes instrumentos educacionais, que podem ser desenvolvidas por exemplo, através de jogos educativos e atividades lúdicas, estimulando maior interesse por parte dos estudantes (SAS, 2021). Como uma forma de auxiliar professores que desejam utilizar desses recursos, a plataforma em questão, fornece essas práticas como uma forma de passo-a-passo para que docentes consigam replicar essas práticas e obter resultados satisfatórios com seus estudantes. Inicialmente a plataforma foi desenvolvida utilizando o Wordpress, que pode ser considerado um CMS (Content Management System) ou Sistema de Gerenciamento de Conteúdo (SOUZA, 2019). É um dos sistemas mais utilizados no mundo inteiro, principalmente para administração de blogs que é a proposta pelo qual foi desenvolvido. Ao longo dos anos, por ser um sistema de código aberto, a comunidade que o utiliza passou a desenvolver plugins que permitem a utilização desse mesmo CMS para diferentes finalidades, como lojas online ou portais de notícia por exemplo. Inicialmente, o Labs4STEAM atendeu ao que se propunha, permitindo o compartilhamento das práticas entre professores de diferentes partes do mundo. Porém, conforme o sistema vai crescendo e mais usuários vão utilizando, surge uma necessidade de automatizar processos e melhorar interfaces. Essas que especificamente, no caso da plataforma, inicialmente foram desenvolvidas baseadas em um template para blogs, o que pode se tornar um dificultador para a publicação das práticas, afinal o template é desenvolvido para a publicação de postagens genéricas.",
    "Conclusão": "O presente trabalho teve como finalidade desenvolver novas interfaces para o sistema Labs4Steam e consequentemente, novas funcionalidades. Ao longo do projeto, pode-se perceber como o sistema de compartilhamento de atividades é importante principalmente para a comunidade de professores. De modo geral, os objetivos do trabalho foram alcançados. Por mais que a versão antiga do sistema ainda esteja no ar objetivando evitar qualquer tipo de perca de dados, onde posteriormente todas as informações do sistema na sua versão antiga estarão adaptadas a rodar na nova versão. Dessa forma, substituindo definitivamente a sua versão anterior. A utilização de ferramentas privadas como o Firebase foi de suma importância para o andamento do projeto, ela proporcionou rapidez no processo de desenvolvimento por proporcionar métodos de requisição de dados e de autenticação de usuário de uma forma rápida, sem que fosse necessário a criação de APIs para o controle dos dados armazenados na plataforma. Todavia existem limitações na ferramenta que limitam o acesso gratuito a ela, dessa forma, para trabalhos futuros é recomendado que se desenvolva uma API específica para a plataforma, podendo assim tratar requisitos de negócios específicos que a aplicação necessita. A utilização de um modelo específico de banco de dados ao longo do projeto não foi considerada como requisito, por isso, a fim de agilizar o processo de desenvolvimento, foi utilizado um modelo não relacional para armazenamento e estruturação dos dados. Em atualizações futuras é recomendado realizar o levantamento desse requisito, a fim de justificar uma melhor escolha de banco de dados. Após a conclusão do mais recente ciclo de iteração foram levantados novos requisitos que futuramente devem ser implementados na plataforma, sendo eles, a permissão de indexação de arquivos e a implementação de um processador de texto que é capaz de permitir facilmente a formatação do conteúdo disponibilizado na parte de seções na plataforma."
}