{
    "Autor": "Gustavo Henrique Branco Hining",
    "Título": "Desenvolvimento de Sistema Web para Avaliações de Curso do Ensino Superior na UFSC com Base no SINAES",
    "Ano de publicação": "2024",
    "Local de publicação": "Araranguá-SC",
    "Orientador(a)": "Prof. Dr. Fabricio Herpich",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho desenvolve um sistema web baseado no Instrumento de Avaliação de Cursos de Graduação (IACG) do INEP para reconhecimento de cursos, como objetivo de apoiar a autoavaliação e a preparação para avaliações externas, abordando deficiências no processo atual de avaliações internas. Com uso da metodologia Design Science Research (DSR), integrando etapas e documentação da engenharia de software, foi criado um artefato com documentação detalhada para replicabilidade, manutenção e orientação de uso. O sistema gerencia avaliações, relatórios e demais informações produzidas durante as avaliações, de maneira colaborativa entre os responsáveis pelas avaliações, e permite a visualização das informações por visitantes. Nos testes práticos, o sistema mostrou-se funcional, responsivo e de fácil entendimento, evidenciando potencial para melhorar o processo de avaliação de cursos. Embora seja necessária a implantação em ambiente real para validação completa, os resultados indicam que a ferramenta pode contribuir significativamente para a eficiência e qualidade das autoavaliações e preparações para avaliações externas no ensino superior.",
    "Palavras-chave": "sistema web, autoavaliação, avaliação de cursos, ensino superior, INEP, IACG, Design Science Research.",
    "Introdução": "A Lei nº 10.861, de 14 de abril de 2004, institui o Sistema Nacional de Avaliação da Educação Superior (SINAES), como objetivo de assegurar o processo nacional de avaliação das instituições de educação superior, dos cursos de graduação e do desempenho acadêmico de seus estudantes. O SINAES tem por finalidades amealhoriar a qualidade da educação superior, a orientação da expansão da sua oferta, o aumento permanente da sua eficácia institucional e efetividade acadêmica e social e, especialmente, a promoção do aprofundamento dos compromissos e responsabilidades sociais das instituições da educação superior.\nA avaliação do SINAES é dividida em três: de instituições, dos cursos e de desempenho dos estudantes (BRASIL, 2004).\nA avaliação dos cursos de graduação é realizada através de três dimensões: \"Organização Didático-Pedagógica\", \"Corpo Docente e Tutorial\" e \"Infraestrutura\". Cada dimensão é avaliada através de indicadores específicos e os resultados são expressos em conceitos pré-determinados que variam de 1 a 5 (INEP, 2017).\nEste trabalho tem como foco criar uma ferramenta para ser utilizada no gerenciamento das avaliações de cursos e dos arquivos produzidos durante as avaliações. Buscando entender seu funcionamento, deficiências e oportunidades de melhoria através da DSRM (Design Science Research Methodology), seguindo o padrão de desenvolvimento: regras de negócio; análise de requisitos; diagrama de classes; modelagem do banco de dados; desenvolvimento; testes.",
    "Conclusão": "Este trabalho teve como objetivo principal desenvolver um sistema web baseado no Instrumento de Avaliação de Cursos de Graduação (IACG) do INEP, com a finalidade de apoiar a autoavaliação e preparação para avaliações externas em instituições de ensino superior. Para alcançar esse objetivo, foram definidos objetivos específicos que incluíam identificar as principais dificuldades enfrentadas pelas instituições na avaliação de cursos, documentar cada etapa do desenvolvimento seguindo os preceitos da engenharia de software, desenvolver funcionalidades que auxiliem na superação dessas dificuldades e testar o sistema para avaliar se alcançou os objetivos.\nAtravés da aplicação da metodologia Design Science Research (DSR) e da integração com a engenharia de software, foi possível criar um artefato completo e funcional. O sistema desenvolvido atende às necessidades identificadas, oferecendo funcionalidades essenciais como o cadastro de relatores e visitantes, autenticação de usuários, gerenciamento de avaliações e manipulação de indicadores do IACG 2017. A documentação detalhada produzida não apenas facilita a replicabilidade e manutenção do sistema, mas também serve como guia para futuros desenvolvimentos e melhorias.\nEmbora a maioria dos objetivos tenha sido plenamente alcançada, algumas limitações foram identificadas, especialmente relacionadas à falta de testes em ambiente real e à ausência de implementação em um servidor online. essas restrições impedem a avaliação completa do sistema em termos de usabilidade, segurança e desempenho em múltiplos acessos simultâneos. No entanto, o sistema demonstrou potencial significativo para melhorar o processo de avaliação de cursos, contribuindo para um gerenciamento mais eficiente e colaborativo.\nDiante dos resultados obtidos, conclui-se que o sistema web desenvolvido representa uma contribuição para as instituições de ensino superior no contexto das avaliações orientadas pelo IACG. Recomenda-se que trabalhos futuros se concentrem na implementação do sistema em ambiente real, permitindo a realização de testes abrangentes de usabilidade e segurança. Além disso, a expansão das funcionalidades como, por exemplo, aceitar avaliações para credenciamento e recredenciamento além de explorar a análise de dados das próprias avaliações gerenciadas. Explorar futuramente essas funcionalidades poderá fortalecer ainda mais a ferramenta, promovendo avanços contínuos na gestão educacional e na qualidade dos processos avaliativos."
}