{
    "Autor": "Mateus Scheffer Freitas",
    "Título": "Desenvolvimento de um Sistema Web para Gestão de Notificações Tributárias em um Município do Extremo Sul Catarinense",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Fabrício Herpich",
    "Coorientador(a)": "Profa. Marina Carradore Sérgio, Dra. e Prof. José Eduardo Moreira Colombo, Me.",
    "Resumo": "Este trabalho surge através da experiência pessoal do autor em um setor de tributos de um município catarinense, na qual se fez necessário o desenvolvimento de um sistema web para organização e registro de notificações tributárias, visando melhorar a eficiência administrativa. Tem como objetivo o desenvolvimento de um sistema web, bem como a especificação de suas funcionalidades funcionais e não funcionais, casos de uso e regras de negócio. A metodologia utilizada foi o Design Science Research Methodology (DSRM), que contém um processo bem definido em seis passos, que auxilia a criação do projeto desde seu planejamento, sua execução e comunicação. A avaliação do sistema foi realizada por meio de questionário, cujos resultados indicaram através da escala Likert com uma considerável maioria de notas como “concordo”, indicando que o sistema auxilia em maior organização, produtividade e melhoria no desempenho das atividades do setor. Apesar de algumas funcionalidades não terem sido implementadas devido a limitações de tempo e recursos, o sistema cumpriu seus objetivos e atendeu às necessidades do setor, com seus requisitos funcionais, não-funcionais e regras de negócio sendo aplicados, e uma avaliação positiva por parte da entrevistada.",
    "Palavras-chave": "Sistema Web; Tecnologia Tributária; Notificações Tributárias.",
    "Introdução": "O sistema tributário nacional caracteriza-se por sua complexidade e baixa transparência. Com base nessa perspectiva, foi constatada, em uma experiência profissional realizada em uma prefeitura localizada no extremo sul do estado de Santa Catarina, a existência de uma pendência relacionada à organização, ao acesso e ao registro de notificações no setor de tributos. Diante desse contexto, identificou-se a necessidade de desenvolver um sistema web para solucionar o problema identificado. Cada ente da federação tem competências sobre algum grupo de tributos definido pela constituição federal (BRASIL, 1988), bem como a existência de profissionais para a fiscalização que averigua e garante o pagamento destes tributos. A notificação tributária se deriva de um processo de fiscalização que encontrou algum tipo de pendência, limitando um prazo para o pagamento desta. Cada ente tem seus próprios regulamentos para o tipo de notificação, como se notifica, prazos e para que tipos de pendências. No século XXI, os governos devem se atualizar e buscar novas tecnologias, pois “[...] cresce o desenvolvimento de políticas que usam as chamadas Tecnologias da Informação e estabelecem padrões que visam a construção de uma arquitetura na qual o acesso à informação pelos cidadãos é facilitado [...]” (Comunitas, 2024, p.18). Sendo assim, o sistema web trouxe o acesso transparente para o contribuinte e a organização da própria administração.",
    "Conclusão": "Este estudo apresentou o desenvolvimento e a implementação do sistema web \"Denotify\", voltado para a gestão de notificações tributárias em um município do extremo sul catarinense. O sistema demonstrou-se eficaz ao organizar, emitir e acompanhar notificações tributárias, promovendo maior transparência e eficiência no setor de tributos. A identificação e documentação dos requisitos funcionais e não funcionais, juntamente com a elaboração das regras de negócio, foram etapas fundamentais deste trabalho. Além disso, funcionalidades essenciais, como cadastro, consulta, edição e exclusão de notificações, foram desenvolvidas e implementadas com sucesso. A avaliação do sistema foi realizada por meio de um questionário aplicado a uma colega de profissão com o mesmo cargo e do mesmo setor. Os resultados revelaram impactos positivos, destacando o aumento na organização e produtividade, bem como melhorias no desempenho das atividades do setor. Os resultados indicam que o \"Denotify\" trouxe benefícios significativos para a administração pública municipal, incluindo maior controle sobre prazos e pendências tributárias, além de um acesso mais transparente às informações pelos contribuintes. Traz benefícios, como organização, produtividade e melhora de desempenho, na qual o setor neste presente momento já se teria impactos positivos. Apesar dos resultados positivos, o estudo identificou limitações, como a necessidade de funcionalidades adicionais que foram postergadas devido às restrições de tempo e recursos. Assim, futuras melhorias incluem a incorporação de novos módulos, como a integração com sistemas de dados disponibilizados pela receita estadual e federal e a aplicação de inteligência artificial para análises preditivas. Adicionalmente, este trabalho contribui para o debate sobre a democratização do acesso à informação e a transparência no setor público, ao promover a implementação de ferramentas tecnológicas que facilitam a interação entre os cidadãos e os órgãos administrativos. Para trabalhos futuros, sugere-se expandir a aplicação do \"Denotify\" para outros municípios, considerando adaptações legais e culturais, e explorar o impacto do sistema em médio e longo prazo, com o objetivo de validar sua eficácia em diferentes contextos administrativos. O \"Denotify\" representa um avanço significativo na gestão tributária municipal e reforça a importância de investir em TICs para aprimorar a eficiência e a acessibilidade dos serviços públicos, abrindo caminhos para novos estudos e inovações na área."
}