{
    "Autor": "Isabela Nardi da Silva",
    "Título": "Impacto da aplicação de tecnologia no ensino de empreendedorismo para estudantes concluintes da educação básica na rede pública",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Profª Drª Simone Meister Sommer Bilessimo",
    "Coorientador(a)": null,
    "Resumo": "Esta pesquisa pretende verificar o impacto da aplicação de ferramentas tecnológicas no ensino de empreendedorismo para estudantes matriculados no último ano escolar da educação básica em uma escola da rede pública. Foi realizado um estudo de caso, aplicado à turma do período noturno da Escola de Educação Básica Apolônio Ireno Cardoso, localizada no município de Balneário Arroio do Silva/SC. A turma foi escolhida para estudo por participar do Projeto Tecnologia, Empreendedorismo, Inovação e Aprendizagem (TEIA), pertencente ao Laboratório de Experimentação Remota (RExLab) da Universidade Federal de Santa Catarina, Centro Araranguá. Através da aplicação de inquéritos online, foram coletados e analisados dados relacionados à percepção e satisfação dos estudantes quanto ao uso de tecnologia em aula. As tecnologias aplicadas na escola foram: ambiente virtual de aprendizagem; dispositivos móveis; recursos do Google, tais como o aplicativo Apresentações Google e a plataforma Formulários Google. O uso destas tecnologias permitiu o desenvolvimento de um curso para acesso dos estudantes envolvidos, além de inquéritos criados através da Formulários Google e atividades realizadas por meio do aplicativo Apresentações Google. Todas as atividades que contaram com uso de tecnologia incluíram o acesso a dispositivos móveis. A pesquisa permitiu verificar que o uso de tecnologia em aula é algo bem-recebido pelos estudantes, que se sentem motivados quando realizam atividades que integram ferramentas tecnológicas ao ensino, e gostariam que estas tivessem participação maior nas salas de aula.",
    "Palavras-chave": "Empreendedorismo. Dispositivos móveis. Educação básica.",
    "Introdução": "De acordo com dados de pesquisa Global Entrepreneurship Monitor – GEM (2015), apenas cerca de 6% dos empreendedores brasileiros possuem ensino superior completo, algo que se relaciona com o fato de que, nas escolas públicas, há cerca de 8.076.150 estudantes matriculados no ensino médio (FUNDAÇÃO LEMANN E MERITT, 2016), porém, somente 2.173.188 matriculam-se no último ano escolar. A evasão ainda na educação básica ocorre por diversos fatores, dentre os quais observa-se a desmotivação dos alunos. Pouco incentivados a prosseguir com seus estudos, muitos ainda os abandonam por um emprego em horário integral ou até mesmo para sair de casa precocemente, não percebendo motivos para ingressar em um curso de graduação, por exemplo. Atualmente, por conta da crescente popularização da tecnologia, torna-se cada vez mais difícil fazer com que o conteúdo abordado em sala de aula pareça atrativo aos estudantes. Acostumados com ambientes e dispositivos que utilizam diversos recursos de mídia, a didática tradicional torna-se obsoleta, e com isso, ineficiente à nova geração. Sendo assim, tecnologias como ambientes virtuais de aprendizagem, dispositivos móveis e ferramentas e recursos Google tornam-se boas alternativas a serem integradas à educação básica. O relatório NMC Horizon (NMC/COSN, 2016) define práticas de empreendedorismo como tendência a adotar no ensino básico em cerca de um ano ou menos. De acordo com o relatório, estudantes aplicarão estas práticas para resolver problemas por meio de soluções inovadoras. Desta maneira, o ensino de empreendedorismo no ensino médio funcionaria como uma maneira de incentivar os estudantes para que continuem a frequentar a escola e compreendam seu lugar na sociedade como indivíduos colaboradores do ambiente onde estão inseridos, através do desenvolvimento da capacidade de encontrar soluções para problemas oriundos do lugar onde vivem. Sendo assim, torna-se necessário o desenvolvimento de alternativas que proporcionem esta situação. O projeto Tecnologia, Empreendedorismo, Inovação e Aprendizagem (TEIA), em conjunto com o Laboratório de Experimentação Remota da Universidade Federal de Santa Catarina, contribui para que isto seja possível. A maneira como o empreendedorismo é abordado se dá por meio de palestras e oficinas que aconteceram no período referente ao contraturno das aulas dos estudantes envolvidos. Além disso, tem sido utilizada fortemente tecnologia como apoio à aprendizagem, através da criação de cursos em um ambiente virtual de aprendizagem MOODLE e uso de dispositivos móveis, bem como de ferramentas Google. A aplicação de tecnologia potencializa o ensino de empreendedorismo por permitir recursos que vão além da sala de aula. Esta pesquisa possui como objetivo analisar o impacto do uso de tecnologias digitais aplicadas ao ensino de empreendedorismo mediante estudo de caso referente a uma turma do último ano do ensino médio da EEB Apolônio Ireno Cardoso, escola de educação básica da rede pública participante do projeto TEIA.",
    "Conclusão": "A presente pesquisa possuiu como pressuposto verificar o impacto do uso de ferramentas tecnológicas no ensino de empreendedorismo por meio de um estudo de caso, no qual o estudo foi aplicado a uma turma do ano concluinte do ensino médio de uma escola da rede pública, onde foram realizadas oficinas de empreendedorismo oferecidas pelo projeto TEIA. Ao longo do estudo, foi possível realizar todos os objetivos propostos. Foram criadas atividades em aplicação Google, bem como curso em ambiente virtual de aprendizagem, os quais os estudantes participantes acessaram mediante dispositivos móveis. Esta interação obteve boa receptividade entre os alunos, que apreciaram o contato com as atividades, proporcionado através das aplicações do projeto. No decorrer do desenvolvimento deste estudo, pôde-se perceber que, apesar do tema de empreendedorismo possuir um caráter inovador, poucos projetos aplicam tecnologia ao ensino de empreendedorismo. Este fator torna-se algo que deveria ser mudado por conta da tecnologia ter muito ao que agregar às práticas empreendedoras, pois possibilita uma maior gama de possibilidades para compartilhamento de informações e geração de novas ideias. A partir da coleta de dados realizada por intermédio de aplicação de inquéritos aos estudantes participantes do projeto TEIA, foi possível constatar que uso de ferramentas tecnológicas durante as aplicações do projeto causou um impacto positivo no grupo, sendo algo bem recebido pelos estudantes, os quais afirmaram desejar interagir mais com este tipo de prática por conta da alta participação que as tecnologias digitais possuem em seu cotidiano. Mediante este trabalho, foi possível notar que, nos dias que correm, tecnologia e empreendedorismo caminham juntos, além do fato de que ambos possuem grande potencial para aplicação na educação básica, por conta da experiência que proporcionam aos estudantes através de atividades que lhes incentivam o desenvolvimento do pensamento criativo e da habilidade de inovação. Por meio da pesquisa torna-se possível planejar trabalhos futuros, levando em consideração os resultados obtidos através do presente estudo. Além disso, serão realizadas novas aplicações do projeto TEIA para estudantes da educação básica, bem como a maneira como a tecnologia é abordada durante as aplicações do projeto será aprimorada, levando em consideração comentários negativos respondidos pelos estudantes durante o inquérito final."
}