{
    "Autor": "DANILO WOHNRATH ARROYO",
    "Título": "A CRIAÇÃO DE PERFIL FALSO NAS REDES SOCIAIS FACEBOOK E TWITTER: MOTIVAÇÕES E TIPOS",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Giovani Mendonça Lunardi",
    "Coorientador(a)": "",
    "Resumo": "O presente trabalho foi desenvolvido com o objetivo de analisar, com enfoque nas redes sociais Facebook e Twitter, as motivações possuídas por seus usuários para a criação de perfis falsos, assim como identificar tipos diferentes de perfis falsos criados de acordo com tais motivações. Para tanto, inicialmente foi realizada uma revisão bibliográfica que buscou contextualizar as principais redes sociais utilizadas no Brasil e no mundo. Posteriormente, procurou-se detalhar os processos de criação de perfil nas redes sociais Facebook e Twitter, para assim, então, relacionar as atividades dos perfis falsos destas redes com a prática de crimes de acordo com a legislação brasileira ou com a violação dos Termos de Serviço de ambas as redes. Por fim produziu-se, por pesquisa exploratória, uma relação dos tipos de perfis falsos encontrados nas duas redes sociais em questão, por onde associou-se a legislação com as principais atividades características de tais perfis. Desta forma, foram identificados sete tipos de perfis falsos, sendo eles: Clássico, Robô/ bot, Robô/ bot Político, Humorístico, Divulgador de Notícias, Propagador de Discurso de Ódio e Plagiador de Identidade. Foi concluído, a partir da tipificação, que todos os perfis que ocultam a identificação de seus administradores possuem características particulares de atuação, que por sua vez foram determinantes na escolha dos nomes de cada tipo. Assim, constatou-se que dentre os perfis falsos identificados, apenas os dois últimos citados estariam cometendo algum tipo de crime ou violando os Termos de Serviço das redes sociais. Como sugestão para futuros trabalhos, permite-se um aprofundamento nos possíveis impactos psicológicos causados em usuários comuns pela atuação de perfis falsos nas redes sociais online, assim como se admite uma extensão da pesquisa para além do Facebook e do Twitter, onde podem ser identificados novos tipos de perfis falsos em outras redes sociais.",
    "Palavras-chave": "Facebook. Perfil falso. Redes sociais. Twitter.",
    "Introdução": "Originada do aumento do uso das Tecnologias da Informação e Comunicação, a comunicação online é a grande revolução contemporânea quando se trata da transmissão de informações em tempo real. Conforme Teixeira e Marcon (2009), “uma nova maneira de se comunicar e de se fazer presente dentro da sociedade acontece no ciberespaço”. As redes sociais online, que fazem parte da primeira abordagem deste trabalho são um dos meios pelas quais a comunicação online se propaga, estando, inclusive, em crescente uso em todas as partes do mundo. A rede social online é entendida como uma plataforma digital onde usuários criam uma identidade virtual afim de interação mútua (ZENHA, 2017). A criação de uma identidade em redes sociais online, segunda abordagem deste trabalho, é uma atividade comum, afinal é o primeiro passo a ser dado pelos usuários para a criação de um perfil nestas próprias redes. Tal criação, seja no Facebook ou Twitter, é um processo prático, que não exige tanto tempo do usuário para a mesma. Dessa forma, com o advento de tais perfis, se formam as redes de usuários interconectados, com suas informações pessoais expostas aos outros usuários (FARIAS; MONTEIRO, 2012). Porém, no processo de criação de uma identidade nas redes, nem sempre os usuários fornecem informações que correspondam às suas reais características pessoas, seja por necessidade de preservação de seus dados, por falta de confiança na própria rede social, ou por motivações ilícitas como propagação de discurso de ódio ou falsificação ideológica, como afirmou Sthefanie e Silva (2017): A criação de perfil a partir de uma pessoa viva ou morta e que essa seja real, faz com que o criador possa cometer crime de falsidade ideológica, quando esta causa dano a vítima. Ao se manifestar como outra pessoa, fazer falsos relatos, afirmar a personalidade via incorporação, fazer declarações, fazer alterações de fatos ou contrarias das que foram versadas no contexto virtual, cria a obrigação de reparação e a feitura de pratica delituosa do agente, e constitui claramente a falsidade ideológica. Dessa forma, englobando o âmbito jurídico, se faz necessária uma investigação que aborde as motivações dos usuários para a criação de perfis falsos em tais redes, que ocultem ou forjem informações sobre o utilizador de determinados perfis, afinal, como foi comprovado anteriormente, crimes estão sendo cometidos por perfis que contêm estas características.",
    "Conclusão": "No decorrer da pesquisa, observou-se uma escassez de conteúdos já pesquisados no tocante dos perfis falsos. Os motivos podem estar relacionados tanto ao recente aumento da criação de perfis com tais características, quanto à forma de atuação destes perfis nas redes sociais, que por estarem descaracterizados, acreditam atuar de modo oculto, fazendo com que sejam, por muitas vezes, ignorados. Como sugestão para futuros trabalhos, seria interessante um aprofundamento nos impactos (psicológicos e sociais) causados pelas atividades destes perfis falsos aos usuários de perfis comuns, pois estas contas falsas anteriormente citadas estão diretamente relacionadas com diversas áreas da sociedade, sendo capazes de influenciarem política, ideológica e psicologicamente outros usuários das mesmas redes sociais; assim como também seria cabível a realização de pesquisas em torno das atuações e motivações de perfis falsos em outras redes sociais online, tais como Instagram, Linkedin, WhatsApp, entre outras, onde a probabilidade de que sejam identificados novos tipos de perfis falsos aumenta exponencialmente. Além disso, vale ser questionada a abertura fornecida pelo Facebook e pelo Twitter para a criação de perfis que não contenham informações pessoais suficientes de seus usuários, onde apenas com um e-mail falso qualquer indivíduo é capaz de criar um perfil que não o identifique verdadeiramente, podendo, assim, atuar de modo quase oculto nas redes sociais."
}