{
    "Autor": "Matheus Venos Da Silva Cataneo",
    "Título": "Simulador de Consulta Médica Específica para Capacitação de Futuros Médicos",
    "Ano de publicação": 2020,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof ª Eliane Pozzebon , Drª",
    "Coorientador(a)": "Prof. Antonio Reis de Sá Junior , Dr",
    "Resumo": "As técnicas de ensino na medicina são bem consolidadas e tem uma excelente base para a formação de um profissional da saúde, com a chegada das tecnologias a estrutura d a educação médica passa por ajustes que facilitam os métodos de ensino e agregam conhecimento para os envolvidos . Com isso observou -se que a criação de um simulador de consulta médica , pode contribuir com a experiência profissional do estudante , e disponibilizar registros que permitem acompanhar o seu progresso com os casos clí nicos propostos  pelo professor , a partir disso surgiu a intenção de projetar esse trabalho.  Este projeto  trata do desenvolvimento de um simulador de consulta médica  para estudantes de medicina. A ferramenta foi desenvolvida em arquitetura baseada em soluçõ es open source , que tem com o ênfase a  simplicidade e  boa usabilidade para o usuário, e seu público alvo  são professores e alunos da medicina. A  ferramenta chamada  Simulate Quiz tem três funções principais:  inserção de  casos clínicos , de perguntas e exam es para o caso ; a execução  da simulação;  e a visualização do desempenho  do aluno em simulações finalizadas . O trabalho foi desenvolvido em ciclos de análise de requisitos, desenvolvimento da aplicação, teste e evolução , e o ambiente foi projetado com o auxílio de um professor da área médica, portanto foi tencionada  para atender um cenário estudantil real dentro da universidade. Sendo assim a plataforma desenvolvida conta com funcionalidades que agregam em métodos de ensino -aprendizagem e contribuem para a formação do aluno de medicina o expondo à um maior número de casos  antes dele exercer sua atividade depois de formado.",
    "Palavras-chave": "Ensino na medicina. Simulador de consulta médica. Métodos de ensino.",
    "Introdução": "O objetivo da Educação Médica pode ser entendido como o processo de formar um profissional com conhecimento qualificado para o atendimento ao paciente e capaz de estender e atualizar esse conhecimento ao longo de sua prática profissional (Swanwick, 2010). Se  compreendermos o aprendizado como Demo (2004), o veremos como a reconstrução do conhecimento, onde o aluno estabelece as diferentes relações entre fatos e objetos.  Para Horizon Report (2020) as tecnologias que auxiliam com algum tipo de adaptação para o e nsino estão no caminho para atender à prática educacional  mais ampla e aprendizagem personalizada. Mesmo estando em elevação  na curva de adoção como  forma de ensino, as TIC’ s  podem fornecer à s instituições a oportunidade de repensar estrategicamente  os cur sos e até mesmo o currículo do curso no contexto de aprendizagem e sucesso do aluno.  Horizon Report (2020) enfatizam que instituições que adotaram a abordagem holística de aprendizagem adaptativa com a utilização da tecnologia obtém resultados encorajadore s, em muitos casos o sucesso do aluno no curso melhorou a satisfação do aluno com as suas experiências.  Uma alternativa para ajudar na formação de um médico é o uso de simuladores, nos  quais são fer ramentas cada vez mais utilizada s nas mais diversas áreas,  e provém melhorias  para todos os tipos de escopos. No geral, servem para testar processos, apresentar rotinas de atividades e principalmente ensinar, entre outras funções. Nas últimas décadas a tecnologia  lidera com formas de criação de simuladores, sendo  assim, parte essencial de inovação no ensino -aprendizagem para medicina.  Para Machado, Moraes e Nunes (2009), as simulações visam apresentar situações práticas vivenciadas no dia -a-dia e tem o objetivo principal de proporcionar o treinamento de profissionais, em várias áreas do conhecimento, situações críticas, conscientização de crianças, jovens e adultos. O autor Ziv (2005) define simulação como uma “técnica em que se utiliza um simulador, considerando -se simulador como um objeto ou representação parcial  ou total de uma tarefa a ser replicada”.  Segundo Flores, Bez e Bruno (2014), uso de simulação permite novas abordagens para  o ensino e prática médicas, denominadas de Medicina Baseada em Simulação. Por exemplo, os estudantes podem usar simulações anatômi cas e fisiológicas para prever os resultados de procedimentos e, assim, acompanhar os resultados de tratamentos a pacientes virtuais. Para fins de treinamento, os simuladores podem ser aplicados para apresentar situações críticas, que envolvam algum tipo d e risco, tomada de decisões ou desenvolver habilidades específicas.  Com base nisso , este trabalho de conclusão de curso é interdisciplinar porque integra com a área médica e educacional pois o simulador expõe o aluno a maior quantidade de casos reais ou pr óximos da realidade durante a sua utilização .  Nesse capítulo será apresentado o contexto definido para o início do projeto, indicando os objetivos da proposta, e como se pretende alcançá -lo.",
    "Conclusão": "Este trabalho apresenta  uma nova ferramenta para auxiliar na formação de novos médicos e nos métodos de ensino aprendizagem do âmbito educacional. Durante o seu desenvolvimento e da pesquisa realizada para levantar os problemas, notou -se que existem ferramentas que se comparam ao que foi proposto, mas o Simulate Quiz tem o diferencial de ter sido feito com a ajuda de um professor da medicina, e todo seu escopo preparado para um  grande crescimento futuro, totalmente criado com ferramentas gr atuitas leva a crer que sua disponibilização em âmbito educacional público posa ser sem custo aos usuários.  Os estudos realizados dos softwares existentes leva a acreditar que por mais que exista a ferramenta, não conseguimos ver aplicada nas universidades  da região, e por se tratar de simuladores que o foco é estimular a experiência profissional do aluno, a proposta desse trabalho busca além desse estimulo, uma forma avaliativa e acompanhamento gradual do aluno.  A proposta do protótipo foi discutida e apre sentada entre os orientadores, e foi bem  reconhecida como uma ferramenta de ensino, levando a motivar o desenvolvimento da mesma.  Dado os recursos mínimos necessários para o funcionamento da ferramenta foram  iniciado s os estudos das linguagens e framework que seriam utilizados agregando mais valor para o projeto, com entregas pequenas de curto prazo podendo demonstrar o protótipo e o visual do produto final durante reuniões.  A utilização do projeto presa pelo atendimento de alunos e professores da medicina,  tanto para o início da carreira quanto para especializações, com grande impacto compartilhando  conhecimento, informações e experiências .  No primeiro semestre de 2021 está previsto um aluno para fazer validações e  avaliações do simulador aqui apresentado, tendo assim números que informarão a importância e a relevância do projeto em sala de aula.  Devido a maneira que foi desenvolvido, utilizando formas padronizadas, o futuro guarda grandes possibilidades, pode -se destacar alguns deles de grande valor par a algo mais próximo como a criação de um gerenciador para administradores, podendo assim com que cada  instituição cadastre seus professores e não dependa mais do gerente de software, a alteração de senha e edição do perfil do usuário, paginaç ão das listagens e  entre as telas e novos recursos para que o aluno prescreva um diagnóstico e tenha uma inteligência artificial que compare com o diagnóstico do professor podendo avaliar mais um requisito do aluno."
}