{
    "Autor": "Rafael Rockenbach",
    "Título": "Viabilidade de implementação de Política de Segurança da Informação em Micro e Pequenas Empresas",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho visa demonstrar através da crescente demanda por Tecnologia da Informação e Comunicação a viabilidade de implementação de Políticas de Segurança da Informação em Micro e Pequenas Empresas. Assim como propor ações que as Micro e Pequenas Empresas devem tomar para prevenir vazamentos de dados, como também ações a serem tomadas para mitigar perdas e vazamentos de dados.",
    "Palavras-chave": "Tecnologia da Informação e Comunicação, Micro e Pequenas Empresas, Política de segurança da Informação.",
    "Introdução": "Trabalho realizado para a conclusão do curso de bacharelado em Tecnologias da Informação e Comunicação pela Universidade Federal de Santa Catarina, campus Araranguá. O currículo do curso é estruturado para atender as Diretrizes Curriculares Nacionais para o ensino de graduação brasileiro, definidos pelo Conselho Nacional de Educação (CNE) (Resolução n° 2 de 18 de junho de 2007) e nos Referenciais Orientados para os Bacharelados Interdisciplinares e Similares de Novembro de 2010. Tem por objetivo, a reorganização do processo de formação em torno de novos valores como competência, aprendizagem, participação e envolvimento de todos os agentes implicados, propondo uma educação integrada e flexível para atender diferentes perfis e orientações. (Universidade Federal de Santa Catarina - UFSC, 2013). No decorrer da última década podemos notar um crescimento expressivo no uso de tecnologias da informação e comunicação por organizações. Segundo a empresa de inteligência em negócios Empresômeto, o setor de tecnologia teve um crescimento de 118% no ano de 2019. Uma nova tendência surgiu para mudar a maneira como as pessoas e organizações executam suas atividades, o trabalho remoto teve um crescimento exponencial devido à pandemia de Covid -19. O trabalho remoto coloca à prova a segurança das informações compartilhadas. Requer um esforço contra possíveis ataques virtuais e demanda especial atenção às redes virtuais privadas, fluxo das informações, utilização de e-mails, e segurança de dados. Algumas das prevenções que podem ser tomadas são o uso de criptografia, maior frequência em atualizações dos sistemas operacionais, protocolos diferenciados para a comunicação de anomalias, bem como mudança de senhas em menor espaço de tempo (COLETA; SALUM, 2020). O crescimento tecnológico, juntamente com o crescimento organizacional cada vez mais informatizado fazem com que exista um crescimento no número de ativos de informação. Este aumento de ativos de informação pode levar a vulnerabilidades e expor as empresas aos riscos inerentes às possíveis falhas na segurança da informação. Segundo Coelho et al. (2014): A informação pode existir em diversos formatos: impressa, armazenada eletronicamente, falada, transmitida pelo correio convencional de voz ou eletrônica etc. Seja qual for o formato ou meio de armazenamento ou transmissão, recomenda-se que ela seja protegida adequadamente. Sendo assim, é de responsabilidade da segurança da informação protegê-la de vários tipos de ameaças, para garantir a continuidade do negócio, minimizar riscos e maximizar o retorno dos investimentos. Nos últimos anos podemos notar uma crescente conscientização por parte das organizações quando se trata de ativos de informação e da valorização da informação, assim como dos problemas que podem ocorrer caso haja uma falha na proteção dos dados organizacionais. Nesse sentido, a segurança da informação pode ser vital para as organizações e a forma como elas operam no mercado. Em uma era onde a informação se tornou essencial para qualquer decisão empresarial, a divulgação de informações traz, além da perda de vantagens sobre os concorrentes, riscos no que diz respeito às informações sensíveis ao negócio. Nesse sentido, qualquer empresa necessita de uma PSI com regras, métodos e procedimentos bem definidos, a fim de proteger esses bens tão valiosos para qualquer organização (Brasil, 2012). Uma boa PSI não visa conter somente ameaças virtuais contra suas informações, é necessário que ela cubra quaisquer tipos de ameaças, sejam elas virtuais, digitais ou físicas ((Brasil, 2012). Embora uma implementação de PSI em uma empresa possa parecer simples, é necessário muito estudo relacionado às particularidades de cada empresa. Além dessas particularidades, podem existir diversos obstáculos que possam vir a dificultar a criação e seguimento de regras, métodos e procedimentos que venham a estar presentes na política. A fim de diminuir os riscos e trazer prosperidade a um negócio, devemos levar em consideração a segurança da informação. Para garantir a segurança da informação é necessário criar um ou vários conjuntos de controle unindo políticas, criando processos e procedimentos a serem implementados e tratados na organização. Conforme cita Coelho et al (2014): Em particular, os controles necessitam ser estabelecidos, implementados, monitorados, analisados e continuamente melhorados, com o intuito de atender aos objetivos do negócio e de segurança da organização. A identificação de controles adequados requer um planejamento detalhado. No cenário brasileiro as Micro e pequenas empresas representam 27% do PIB nacional, totalizando em 8,9 bilhões de micro e pequenas empresas segundo o SEBRAE. Muitas dessas empresas não possuem uma PSI e não estão preparadas para lidar com tratativas de gestão de risco relacionadas às tecnologias da informação e comunicação. Isso cria uma oportunidade de negócio para análise e implementação de PSI para empresas dos mais diversos setores, não sendo elas necessariamente das áreas tecnológicas. Diante do exposto, esse trabalho visa demonstrar de forma teórica e crítica as vantagens da implementação de PSI em empresas cujo foco do negócio não está voltado para a área de tecnologias da informação e comunicação, apontando pontos positivos, negativos, possíveis dificuldades organizacionais na implementação, e propor planos de contingência que possam ser tomados por organizações e empresas. O propósito deste trabalho surgiu devido à crescente demanda por TIC - Tecnologias da Informação e Comunicação em Micro e pequenas empresas e pela necessidade de implementação de PSI - Política de Segurança da Informação que atendam os requisitos de funcionamento organizacional. A implementação de uma PSI nesse tipo de organização visa engajar a organização a seguir as políticas de forma a não impedir funções operacionais, e sim conscientizar e unir a organização diante da política.",
    "Conclusão": "Diante do exposto, é possível perceber o quanto as organizações podem ser vulneráveis a ataques, violações de dados e acessos não autorizados de seus dados relacionados a ativos de TIC. Com a crescente informatização das organizações, existe uma crescente demanda de mercado para soluções de segurança da informação organizacional. O cenário atual das Micro e pequenas empresas cria uma grande oportunidade de negócio a ser explorado quando o foco são as PSI, porém, ao mesmo tempo criam novos desafios quanto à implementação absorção da PSI na cultura organizacional assim para evitar a burocratização de processos das organizações. Foi constatado através deste trabalho que qualquer organização tem a capacidade de implementar uma PSI básica, e seguir atualizando a mesma conforme a demanda organizacional. É possível destacar também que até mesmo as políticas mais básicas podem trazer resultados positivos para a organização. Como trabalho futuro este trabalho abre a possibilidade de construção de um plano de negócios voltado para a área de consultoria com foco em Micro e pequenas empresas a fim de realizar a implementação de PSI nas mesmas. Fica aberta também a possibilidade de pesquisa para com a Lei Geral de Proteção de Dados e o que pode ser adicionado a uma PSI em respeito a essa lei. O trabalho também destaca que nenhuma organização está imune a uma violação de dados, e que uma organização preparada para lidar com um cenário de violação de dados possui uma chance muito maior de conseguir mitigar possíveis danos causados por uma violação de dados ou ataque. Por último, foi constatado que a melhor forma de fazer uma PSI ser absorvida pela organização é criar uma cultura de conscientização da existência da PSI, e a introdução da PSI através de treinamentos para os colaboradores atuais, assim como novos colaboradores nas organizações."
}