{
    "Autor": [
        "Gabriel Bardini Rombaldi",
        "Priscila Monteiro dos Santos Bilésimo"
    ],
    "Título": "Desenvolvimento de um Jogo Sério Utilizando Unity 3D para o Estudo de Anatomia no Ensino Fundamental",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "Com a crescente expansão das tecnologias da informação e comunicação, é natural que a mesma também deva ser incorporada no contexto educacional com maior efetividade. Neste âmbito surge a necessidade do desenvolvimento de novos softwares que auxiliem o professor a transmitir o conteúdo de ensino e auxiliem os alunos a interagir com o conteúdo de ensino durante o processo de aprendizagem. Com este objetivo, foi elaborado este trabalho, sendo que as etapas necessárias são: estudar os conceitos de tecnologias educacionais; estudar a estrutura dos sistemas do corpo humano para o ensino fundamental; estudar a plataforma de desenvolvimento de jogos Unity 3D; elaborar o projeto de um ambiente de ensino e interação através de um jogo sério para o ensino fundamental; desenvolver o ambiente de ensino utilizando o Unity 3D; aplicar este ambiente desenvolvido em sala de aula; avaliar e analisar a usabilidade do ambiente de ensino dentro do contexto de jogos sérios na educação. A metodologia utilizada consiste em estudos teórico-empíricos apoiados em implementações, experimentos e estudos de caso. Como resultado, pode-se perceber que a aceitação do jogo EducaCorpoHumano3D foi satisfatória, tanto por parte dos alunos quanto por parte dos professores. Para os alunos, os mesmos aprendem de uma forma lúdica e o jogo sério auxiliou na motivação dos estudos do corpo humano. Para os professores, o jogo sério auxiliou a repassar o conteúdo de ensino de uma forma mais clara e objetiva, pois no jogo é possível manipular os objetos no ambiente 3D, facilitando a compreensão de conceitos tradicionalmente apresentados em forma de gravuras nos livros.",
    "Palavras-chave": [
        "Jogos Sérios na Educação",
        "Ambientes Virtuais de Ensino de Anatomia",
        "Ambientes de Interação 3D"
    ],
    "Introdução": "O rápido avanço das tecnologias nos faz pensar em formas produtivas de aplicá-las. Hoje em função da resistência ainda ser grande por parte de alguns educadores aplicarem as Tecnologias da Informação e Comunicação (TICs) nas escolas na maioria das vezes se torna um trabalho árduo. Menezes (2012, p.5-5), afirma que é ilusório imaginar que elas não interferirão cada vez mais nas escolas, cuja função, é claro, inclui r, informar e comunicar. Conforme Oliveira et al. (2001), o ato de ensinar a apreender ganha um novo suporte com o uso de diferentes softwares educacionais. Estes devem passar por uma avaliação pedagógica antes da utilização, assim podem ser trabalhadas diversas áreas do conhecimento, como o estudo do corpo humano ou qualquer área da grade curricular. Os jogos de computadores devem ser considerados facilitadores das dificuldades dos professores, os auxiliando a passar conhecimento aos estudantes de forma mais inovadora e criativa já que os jogos estão cada vez mais presentes no cotidiano dos alunos. Os jogos educacionais devem ser aplicados de forma lúdica, com isso os jogos sérios consistem em jogos onde o principal objeto é o aprendizado. Pontes (2013, p.4-4) afirma que esse processo de aprendizagem é reforçado pelo estímulo, competição e diversão, oferecidos a seus usuários na forma de entretenimento. Em geral, jogos voltados para algum tipo de aprendizado são caracterizados como jogos sérios. Apesar de não haver uma definição correta para o termo é entendido que os jogos sérios são aplicados para promover algo além do mero entretenimento, podendo ser aplicado nas mais diversas áreas (WATTANASOONTORN, 2013, p.231-247). O uso dos jogos sérios relacionado à saúde tem se tornado uma forte tendência. A inclusão de aplicações 3D traz o aspecto lúdico favorecendo a criação de atividades com forte apelo para crianças e adolescentes. Segundo a pesquisa realiza por Clua (2014, p.5-5), ela afirma que diversos pesquisadores vêm realizando pesquisas que procuram explorar e mapear as mais diversas áreas da medicina e da saúde para o universo dos jogos digitais. A utilização dos jogos sérios para auxiliar no repasse do aprendizado para o ensino fundamental, aplicado ao estudo dos sistemas do corpo humano, são instrumentos que motivam, atraem e estimulam o processo de construção e conhecimento. Podendo ser definido, de acordo com Soares (2004), como uma ação divertida, seja qual for o contexto linguístico, desconsiderando o objeto envolto na ação. Se há regras, essa atividade lúdica pode ser considerada um jogo sério sendo este o objetivo deste trabalho. Enfim, através do conteúdo abordado foi desenvolvido o jogo sério intitulado EducaCorpoHumano3D que será aplicado ao quinto e sexto ano do ensino fundamental para a matéria de ciências auxiliando no ensino aprendizado dos sistemas do corpo humano. Em particular o sistema respiratório, digestório e esquelético que foram desenvolvidos no jogo sério.",
    "Conclusão": "Para este trabalho o objetivo geral foi desenvolver aplicar e avaliar a utilização de um ambiente de ensino e interação 3D baseado nos conceitos de jogos sérios e anatomia. Com a finalidade de facilitar a transmissão do conhecimento de sistemas do corpo humano para o ensino fundamental por parte do professor. Visando atender o objetivo geral, inicialmente foi realizado o levantamento do referencial teórico que contribuiu para o entendimento e dificuldades para o desenvolvimento do jogo sério EducaCorpoHumano3D. Nas revisões bibliográficas os conceitos de jogos sérios como suas principais características e áreas de aplicação foram abordados. Também foi discutida a finalidade das Tecnologias da Informação e Comunicação das Escolas, Ambientes Educacionais para o Ensino de Ciências do Corpo Humano. Concluindo a revisão bibliográfica iniciou-se o desenvolvimento do projeto e logo após a implementação do jogo sério EducaCorpoHumano3D. Que consiste em um jogo sério para estudo dos sistemas do corpo humano, sendo que este estudo é apresentado para o usuário de forma de desafios e fases que devem ser completados no decorrer do jogo. São esses desafios que despertam a interação dos alunos com o jogo. O EducaCorpoHumano3D acarretou uma abordagem diferente para os jogos 3D, trouxe a modelagem 3D como apoio pedagógico. O jogo não substituirá o ensino tradicional e sim complementará o aprendizado com opções realistas, com demonstrações dinâmicas que despertem o interesse e a criatividade. De modo a avaliar o jogo sério EducaCorpoHumano3D, ele foi aplicado para trinta e seis alunos do 5° e 6° ano do ensino fundamental de duas escolas públicas do município de Maracajá da região do Vale de Araranguá no estado de Santa Catarina. Essa avaliação contou com o auxílio da professora responsável de cada turma, que se dispuseram a avaliar e apresentar o parecer em relação às novas tecnologias implantadas em sala de aula, se de fato elas contribuem no aprendizado e se os alunos se sentem motivados a aprender quando o conteúdo didático é apresentado fora da metodologia de aula atual. Conforme as pesquisas apresentadas neste trabalho, cerca de 72% dos alunos do ensino fundamental no Brasil utilizam o computador e cerca de 99% deles têm acesso à internet pelo menos uma vez por semana. Com esses dados e com a avaliação do EducaCorpoHumano3D nas escolas, pode-se perceber a grande aceitação dos alunos ao jogo. A partir da análise dos dados obtidos com a avaliação de usabilidade observou-se que 94,4% dos alunos avaliaram o jogo como ótimo, e 91,7% afirmaram que jogariam novamente. As professoras que participaram na avaliação do jogo, afirmaram que as novidades que as novas tecnologias proporcionam aos alunos, trazem uma maior motivação para o aprendizado. O interesse em estudar mais vezes o assunto é despertado no aluno, assim como o aprendizado se torna mais rápido e mais prazeroso. Segundo ambas as professoras envolvidas na avaliação, seria excelente se as escolas tivessem infraestrutura necessária para que as tecnologias da informação e comunicação sejam abordadas nas escolas com mais frequência e qualidade. Por fim, dentro do contexto de trabalhos futuros são apresentadas abaixo algumas propostas para melhorias e novas adaptações do jogo sério EducaCorpoHumano3D: Adicionar mais sistemas do corpo humano ao jogo sério EducaCorpoHumano3D. Avaliar e adicionar formas de explicar o funcionamento do jogo para os alunos de forma não textual. Estender o EducaCorpoHumano3D para dispositivos móveis facilitando o uso do jogo sério em sala de aula."
}