{
    "Autor": "André Cardoso Jeremias",
    "Título": "Análise da Transformação Digital em Empresas de Varejo",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profº. Giovani Mendonça Lunardi",
    "Coorientador(a)": "",
    "Resumo": "Tendo em vista um desenvolvimento cada vez mais crescente das formas de tecnologia da informação e comunicação, as empresas vêm utilizando esses meios para poder implementar e otimizar seus negócios, realizando os seus resultados em ambiente cada vez mais digital. Com base nesse contexto que a presente pesquisa tem o objetivo de demonstrar uma análise realizada sobre empresas do setor de varejo de modo a avaliar as técnicas do processo que foram adotados na transformação digital desenvolvendo o modelo de negócios e criando valor com relação aos clientes e assim melhorando seus resultados perante os concorrentes no competitivo setor de varejo. A metodologia adotada e realizada para a presente pesquisa se trata de uma análise documental e qualitativa, onde foram consideradas as mais relevantes empresas varejistas e foi realizada a análise sobre as práticas de transformação digital que elas utilizaram e implementaram para o seu desenvolvimento e para a criação de valor com relação aos clientes. Foi possível verificar as evidências e compreensão das plataformas digitais multi laterais e suas implicações e impacto sobre o setor varejista, onde se analisou que as teorias sobre a transformação digital são relevantes para o varejo, onde empresas baseadas em plataformas como Amazon e Alibaba Group criaram sistemas de varejo que consistem em fornecedores independentes e usuários finais que podem criar valor através da interface digital de varejo.",
    "Palavras-chave": "Transformação digital. Varejo. Negócios digitais.",
    "Introdução": "Os novos desafios determinados pelo crescente desenvolvimento do mercado e da economia estabelecem o aumento da produtividade, a diminuição do tempo de execução para o menor custo possível, estimulando a alta competitividade entre empresas e a qualificação dos produtos e serviços específicos (Badiru; Ayeni, 2017). Tendo em vista o contexto apresentado, é fundamental então que as empresas atuem para o seu próprio benefício utilizando as melhores tecnologias, para as atividades que possam incrementar seus resultados. As diversas formas de tecnologia que aparecem todos os dias e se destinam à informação e comunicação, destacam como um elemento muito importante nas mais diversas atividades, propondo que a tecnologia demonstre a forma como as ações e comportamentos sejam determinantes para as culturas, relacionamentos, aprendizagem, etc. (Guimarães, 2017). Esse contexto demonstra a relação que os meios digitais e comunicação estão integrados e como são fundamentais nas vidas das pessoas, não diferente seria também a sua aplicação no desenvolvimento dos negócios. Recentemente, o conceito de transformação digital tornou-se muito popular na mídia e trouxe urgência para todas as áreas de negócios, principalmente devido ao fato de que a tecnologia está se desenvolvendo mais rapidamente do que as empresas conseguem acompanhar (Bruel, 2017). Clara mente, as regras de negócios mudaram e a disseminação de novas tecnologias e o surgimento de novas ameaças estão diretamente ligados à reorganização dos modelos e processos de negócios tradicionais. Conforme Rabelo (2017, p. 1) “A transformação digital utiliza a tecnologia para aumentar a produtividade, ampliar o alcance e obter melhores resultados. É uma mudança estrutural nas organizações orientada pela tecnologia.",
    "Conclusão": "Este documento, se apresentou uma visão geral das plataformas digitais multi laterais no setor de varejo. Durante a última década, as plataformas transformaram a lógica comercial fundamental de várias indústrias. No setor varejista, descobriu-se que os modelos comerciais das plataformas redefinem as lógicas básicas do setor, uma vez que as plataformas simplesmente intermediam as transações entre compradores e fornecedores, ao invés de manipular toda a cadeia de fornecimento e logística por conta própria. A análise realizada demonstra que os modelos de negócios das plataformas de varejo são, portanto, únicos em comparação com os varejistas estabelecidos devido ao grande volume e profundidade do ecossistema da plataforma digital. Como os aglomerados varejistas, como os mercados físicos, com o advento da digitalização, as plataformas digitais de múltiplos lados podem unir milhões de compradores e fornecedores finais, transferindo o risco do estoque de volta para o fornecedor. Foi possível verificar as evidências e compreensão das plataformas digitais multi laterais e suas implicações e impacto sobre o setor varejista, onde se analisou que as teorias sobre plataformas são relevantes para o varejo, onde empresas baseadas em plataformas como Amazon e Alibaba Group criaram plataformas de varejo que consistem em fornecedores independentes e usuários finais que podem criar valor através da interface digital de varejo."
}