{
    "Autor": "Vitor Goularte de Lucca",
    "Título": "Desenvolvimento de um Sistema Web para o Gerenciamento de Encomendas e Cartas na Agência dos Correios de Morro Grande - SC",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Vinicius Faria Culmant Ramos",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho tem como objetivo desenvolver uma aplicação Web para ser utilizada em uma agência dos Correios em Morro Grande – SC. Hoje, os funcionários da agência contam com planilhas de  cálculo para o gerenciamento das correspondências, seja para registrar o recebimento quanto a entrega destas. Ao se ter conhecimento das funções exercidas naquela agência dos Correios e as funcionalidades da planilha de cálculo  que atrasavam ou dificultavam o atendimento, foi possível criar um sistema que englobasse todas essas funções e trouxesse maior facilidade e praticidade em todo o sistema, quais sejam: registro de correspondências com tipo, data e hora do recebimento, registro da entrega das correspondências, busca por correspondências e edição dos dados da correspondência.  No desenvolvimento desse projeto foram aplicadas as linguagens de programação PHP e JavaScript. Para atingir o nosso objetivo, adaptamos a metodologia de desenvolvimento ágil  com uma abordagem Scrum, o qual permitiu organizar as entregas (sprints) e estabelecer os objetivos de forma mais eficiente. Ao longo do desenvolvimento do projeto foram realizados testes e entregas incrementais de partes do sistema funcionando, possibilitando a realização de alterações necessárias e obtendo opiniões para possíveis melhorias na aplicação.",
    "Palavras-chave": "Sistemas Web, Agência dos Correios, Desenvolvimento Web, Gerenciamento de Correspondências",
    "Introdução": "Com o avanço da Internet e suas ferramentas, hoje se tornou muito comum a utilização de sistemas Web em diversas áreas de negócios para atender diferentes finalidades do dia a dia. Um sistema Web ou aplicação Web são softwares  que são executados por um servidor Web.  Ao contrário de um sistema desktop, segundo Dourado (2013), um sistema Web apenas exige um navegador de Internet (browser) para acessá-lo e utilizá-lo, como também o seu processo de atualização e alteração é facilitado, por exemplo, quando este mesmo sistema é utilizado por diferentes máquinas em uma empresa.  De acordo com Oliveira (2018), um sistema Web pode ser considerado um site, porém ele está mais voltado para resolver um problema ou necessidade, sendo geralmente conectado a um banco de dados e um servidor, cujo acesso ao sistema pode ser restringido por um login e senha.  A utilização de sistemas Web para atender os modelos de negócios do mercado se tornaram mais frequentes, quando estas aplicações começaram a possuir maior complexidade e semelhanças a aplicativos desktops. Podendo já suportar uma base de dados de tamanho considerável e permitindo o acesso dessas informações de forma remota. (GARRIDO, 2015)  A importância de se ter um sistema dedicado a um específico modelo de negócio entre diversas vantagens, estão entre elas: economia de tempo, aumento na produtividade, maior controle e maior praticidade. O uso de produtos substitutos, que não sejam um sistema dedicado ou recomendado para um determinado modelo de negócio pode acarretar em desperdício de tempo e menor produtividade para os usuários.",
    "Conclusão": "No desenvolvimento desse trabalho foi possível colocar em prática vários conhecimentos adquiridos no decorrer do curso e com outras atividades de estudos independentes, que estavam muitas vezes necessitando de prática para construir um verdadeiro entendimento. Esse trabalho de conclusão de curso propiciou atuar em um exemplo real, onde foi possível disponibilizar o sistema para agência dos Correios de Morro Grande – SC, no qual obteve bons comentários e aceitação por parte dos funcionários da agência dos Correios.  O sistema Web criado nesse projeto, mesmo sendo simples, poderá se estabelecer como uma ótima ferramenta para agência dos Correios de Morro Grande, dado o software de editor de planilhas que era utilizado anteriormente. A vantagem de ter um sistema como esse é de que sempre permitirá atualizações, onde maiores funcionalidades ou complexidades poderão ser adicionadas tornando-o cada vez mais completo. Também poderá ser facilmente implementado o seu uso através de dispositivos móveis, se assim os usuários desejarem.  Foi possível organizar e nortear o processo de desenvolvimento utilizando uma abordagem Scrum, que incentiva a comunicação e entregas incrementais através das reuniões e das Sprints. Isso permitiu desenvolver o projeto com maiores chances de atender as expectativas do cliente, pois desde o início e em todo o desenvolvimento do projeto, o cliente estava presente.  Como trabalhos futuros ou ações futuras a se tomar na implementação do sistema, pode-se pensar em melhorias na interface de visualizações de algumas páginas e criar formas de relatórios de ações dentro da aplicação, tal como obter uma lista de exclusões e inserções que foram feitas por determinado funcionário num dia ou semana. Tudo isso para obter um sistema que ofereça maior controle e gerenciamento de todo o processo."
}