{
    "Autor": [
        "Andréia Panchera Schneider",
        "Carinna Nunes Tulha"
    ],
    "Título": "Percepção da Usabilidade do Moodle como Ferramenta para o Ensino de Ciências Baseado em Investigação",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Prof.ª Dr.ª Simone Meister Sommer Bilessimo",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho tem como finalidade verificar a usabilidade de um modelo de Sequência Didática desenvolvido baseado na metodologia de ensino investigativo, por meio de um Ambiente Virtual de Aprendizagem, sendo escolhida a plataforma Moodle. O objetivo deste espaço educacional é representar apoio à aprendizagem, a fim de facilitar e intensificar o desenvolvimento de atividades baseadas em investigação, além da interação entre discentes e docentes. Visando isto, foram desenvolvidos cursos no formato de Sequências Didáticas baseadas no modelo de ensino de ciências baseado em investigação em um Ambiente Virtual de Aprendizagem. Para o desenvolvimento desta pesquisa, foi realizada uma revisão bibliográfica sobre os temas chaves, tendo como autores Belloni (2012), Moran (2012), Nielsen (1994), Otto Peters (1983), como principal embasamento teórico. Para a percepção da experiência dos discentes e docentes sobre a usabilidade do sistema criado, foram desenvolvidos dois inquéritos diferentes baseados no modelo Tecnologia, Usabilidade e Pedagogia, os quais foram aplicados no final de cada curso. Desta forma, esta pesquisa é classificada como de caráter exploratório, aplicada, abordando o problema como uma pesquisa qualitativa. Esta pesquisa foi efetuada em duas instituições públicas de ensino básico das cidades de Araranguá e Balneário Arroio do Silva, o Instituto Federal de Santa Catarina e a Escola de Educação Básica Apolônio Ireno Cardoso, respectivamente. Foi realizado um censo com turmas do ensino médio totalizando 129 discentes, sendo 58 do primeiro ano da E.E.B. Apolônio Ireno Cardoso, 30 do terceiro ano e 41 do quarto ano do IFSC, além de uma docente de cada uma das instituições de ensino. Conclui-se que o uso da plataforma e das redes sociais para a realização do cadastro teve uma boa receptividade com relação aos discentes, apresentando diversos pontos positivos, e atenderam suas necessidades. A partir da percepção dos docentes com relação às suas experiências trouxeram sugestões de melhorias, como o desenvolvimento de cursos mais curtos, além da falta de infraestrutura na escola, disponibilidade de laboratórios de informática, Internet de baixa qualidade e ausência de suporte técnico.",
    "Palavras-chave": [
        "Sequências Didáticas",
        "Ambientes Virtuais de Aprendizagem",
        "Moodle",
        "Usabilidade",
        "Ensino de Ciências Baseado em Investigação"
    ],
    "Introdução": "As Tecnologias da Informação e Comunicação se mostram como catalisadoras e apresentam uma quebra de paradigma. As novas tecnologias educacionais desafiam os participantes do processo de planejamento de cursos, sendo necessário evoluir conceitos e práticas que deverão ajustar a tecnologia no processo de ensino e aprendizagem, incorporando novas práticas educacionais (SILVA, 1998). O uso de ferramentas digitais como mecanismo de ensino e aprendizagem visa melhorar a qualidade na educação, promovendo o dinamismo da aula, de forma a motivar o discente com atividades interativas e que requerem a colaboratividade entre estes. Para Moran (2012) a Educação a Distância é uma modificadora das formas de ensino e aprendizagem, inclusive as presenciais que podem optar por um complemento semi-presencial, flexibilizando a necessidade de presença física, reorganizando os espaços e tempos, as mídias, as linguagens e os processos presenciais e digitais. Entre tantos recursos educacionais interativos disponíveis, podem-se utilizar as plataformas para a construção de Ambientes Virtuais de Aprendizagem. Um dos sistemas de gestão de cursos existentes é o Moodle (Modular Object-Oriented Dynamic Learning Environment), acrônimo em inglês para Ambiente de Aprendizagem Dinâmico Modular Orientado a Objeto, este é licenciado sob a forma de software livre, objetivando o auxílio a docentes para a criação de cursos de aprendizagem participativa e ativa online. Existem diversas formas de desenvolver e/ou organizar um curso em um Ambiente Virtual de Aprendizagem, ou o uso de um modelo para colocação de conteúdo em um curso pode ser um fator decisivo na eficiência e eficácia da utilização deste. Um modelo já existente, comumente utilizado na sala de aula tradicional, que também pode ser replicado para ambientes virtuais é o Inquiry Based Learning (acrônimo em inglês para Ensino de Ciências Baseado em Investigação). Como o nome sugere, este modelo visa o aprendizado por meio da experiência do discente e da realização de investigações, assim, este passa a ser um agente ativo na construção do conhecimento. O docente, entretanto não deixa de participar, sendo necessária a mediação durante a realização das atividades práticas, construindo problemas instigando a curiosidade do discente. Estas atividades podem ser organizadas baseadas no modelo de Sequências Didáticas, que se constitui um conjunto de atividades que apresentam uma ligação entre si, as quais podem ser realizadas independentemente, no entanto, como são realizadas em etapas o discente terá um resultado mais satisfatório se realizá-las na ordem pré-definida. Com as novas formas de se comunicar, por meio da constante evolução em que vivemos, a educação também se beneficiou disto, e o ensino ficou mais dinâmico e flexível. O uso de plataformas para disponibilização de material educacional é um método para reter a atenção do discente efetivando a utilização de tecnologia integrada ao ensino e aprendizagem. É interessante que essas atividades estejam associadas a outras ferramentas, podendo-se assim personalizar o ambiente. Dados de uma pesquisa realizada pelo Censo Escolar de 2014 indicam que menos da metade (45%) das escolas públicas brasileiras possuem Laboratórios de Informática, com média de oito computadores disponíveis. Isto indica um dos fatores de carência que as escolas da rede pública enfrentam com relação à infraestrutura, dificultando a integração com as Tecnologias da Informação e Comunicação (TIC). Uma das possibilidades de solução que tem destaque atualmente é a Mobile Learning (Aprendizado móvel), com a popularização de dispositivos móveis e a familiarização por parte de discentes e docentes, permite desenvolver uma estratégia que supere os obstáculos surgindo como alternativa para o desenvolvimento de ambientes dinâmicos. A partir de dados da pesquisa TICEducação 2014, realizada pelo Comitê Gestor da Internet no Brasil (CGIBR), percebe-se que menos da metade (37%) dos docentes teve algum tipo de capacitação sobre a utilização de tecnologias. Isto é um dado preocupante levando em consideração que estes mediarão a integração dos discentes com as tecnologias, sem levarem em conta que este uso pode ocorrer de uma maneira ineficaz.",
    "Conclusão": "Apresentou-se neste trabalho a verificação de usabilidade de um novo modelo de Sequência Didática abordando conteúdos de ciências, conforme proposto nos objetivos específicos, empregando a metodologia de ensino baseada em investigação. Para isto ser desenvolvido em um Ambiente Virtual de Aprendizagem, foi necessária a adaptação não somente dos docentes, como dos discentes também, uma vez que ocorreu a adição da tecnologia alterando o padrão de ensino tradicional. No decorrer deste trabalho foi apresentada a importância de um Ambiente Virtual de Aprendizagem voltado à Educação a Distância, sendo este um espaço que pode ser acessado por meio de qualquer aparato tecnológico, desde computadores e dispositivos móveis, permitindo que o discente programe seus estudos no horário e local que achar mais conveniente. Sendo previamente criado e desenvolvido para disponibilizar conteúdos que promovam o processo de ensino e aprendizagem. Desta forma os discentes podem adquirir novos conhecimentos como auxílio das novas tecnologias de informação e comunicação. Para o bom andamento de uma atividade que ocorre mediante a utilização de Tecnologias da Informação e Comunicação, um dos fatores decisivos é a infraestrutura das escolas. Esta deixa a desejar, apresentando internet de baixa velocidade, salas de aulas mal equipadas. Como apresentado anteriormente, a partir do Censo Escolar de 2014 verifica-se que, em escolas públicas brasileiras, menos de 45% possuem laboratórios de informática, aliada também a falta de verba para receber as melhorias necessárias e reposição de novos equipamentos. Conclui-se que a percepção dos discentes do IFSC e da E.E.B Apolônio Ireno Cardoso quanto ao uso da plataforma se deu de forma positiva, sendo que a maioria achou o sistema confiável e pouco suscetível a falhas e ofereceu informações necessárias para orientá-los durante a navegação. A maioria dos discentes concorda que a forma de acessar o curso ocorre de forma clara e que a organização dos módulos em seções deixou o curso mais atraente e dom mais fácil observar seu avanço, além da linguagem utilizada ter sido de fácil compreensão e entendimento. Com relação à interação e a concordância entre os usuários gerou dúvidas com um pequeno número de discentes da E.E.B. Apolônio Ireno Cardoso, já no Instituto Federal de Santa Catarina, percebe-se que muitos discentes ficaram neutros quanto a está questão. Quanto ao uso do login social superou as expectativas, já que ele foi avaliado como rápido e eficiente para realizar o cadastro e sendo usado com mais frequência. É válido destacar que não está sendo feita uma comparação de resultados, devido às instituições de ensino serem de âmbitos educacionais diferentes, uma atende a nível Federal e outra a nível Estadual, assim apresentam realidades diferentes, além das turmas serem de séries distintas. No entanto, no decorrer da pesquisa a maioria dos discentes concordou que a plataforma atende suas necessidades estabelecidas e que o uso das redes sociais para a realização do cadastro foi mais eficiente. Como considerações para trabalhos futuros sugere-se que após a criação do curso, docentes e visitantes do repositório, enviem sugestões para que modificações e melhorias sejam realizadas. Recomenda-se a criação de Sequências Didáticas menores, com uma breve abordagem dos conteúdos na orientação, reduzindo ou simplificando a quantidade de atividades de forma que aperfeiçoe o tempo para a resolução das demais atividades e elaborar exercícios que atendam a necessidade dos discentes no momento. Para aplicações futuras aconselha-se a coleta de dados em mais turmas, realizando uma comparação da percepção entre estas e uma avaliação pedagógica durante a implementação de todas as etapas do processo."
}