{
    "Autor": "Isabela Rosso Blissari",
    "Título": "ANÁLISE DOS POSSÍVEIS FATORES DA EVASÃO NO CURSO DE TECNOLOGIAS DA INFORMAÇÃO E COMUNICAÇÃO",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Vinicius Faria Culmant Ramos",
    "Coorientador(a)": "",
    "Resumo": "A evasão no ensino superior nas áreas de tecnologia e matemática chega a 40% em todo o Brasil. No curso de Tecnologias da Informação e Comunicação da Universidade Federal de Santa Catarina a evasão média é de 52%, um número elevadíssimo. O curso é noturno, no interior do estado, cidade de Araranguá, com carga horária total de 2.916 horas e, apesar de ser interdisciplinar, a maior parte dessas horas envolve os conceitos da área de computação. Neste contexto, este trabalho busca a análise dos possíveis fatores da evasão no Curso Bacharelado de Tecnologias da Informação e Comunicação no período de 2010 a 2018, através de um questionário enviado aos ex-alunos. Como método optou-se por uma pesquisa com questões abertas e questões fechadas, qualitativas, utilizando a escala likert. Os principais resultados encontrados na pesquisa apontados pelos ex-alunos foram: falta de informação detalhada do curso, despreparo dos professores em relação à didática, relacionamento interpessoal e instalações precárias. Palavras-chave: Evasão. Ensino Superior. Tecnologia. UFSC.",
    "Palavras-chave": [
        "Evasão",
        "Ensino Superior",
        "Tecnologia",
        "UFSC"
    ],
    "Introdução": "A evasão no ensino superior nos cursos de computação e matemática tem média elevada: 40%. A evasão é a desistência do aluno de continuar no curso, seja por qualquer motivo, por exemplo, a simples saída do curso, a troca de curso ou a retirada compulsória do curso (jubilamento). Segundo Baggi e Lopes (2010), este problema preocupa as instituições de ensino superior (IES) no geral, sejam elas públicas ou privadas. Para os autores, a saída de alunos provoca graves consequências sociais, acadêmicas e econômicas. Para atacar o problema da evasão, é necessário que haja reorganização das estratégias dentro das Instituições de Ensino Superior (IES) para que os acadêmicos alcancem seus objetivos e consequentemente a conclusão do curso. Barlem et al. (2012, p.133) colocam: Que diversos são os motivos que podem levar o estudante a evadir-se de um curso, os quais podem estar relacionados ao próprio universo discente, tais como imaturidade, desconhecimento ou insuficiência de informações sobre o curso em que ingressou, dificuldade de adaptação ao meio acadêmico, problemas financeiros, familiares ou, ainda, insatisfação com o sistema de ensino ou, até mesmo, descontentamento com a profissão escolhida. Livramento (2011) aponta para um índice médio de evasão na Universidade Federal de Santa Catarina (UFSC) de 35,85%. A autora fez um recorte de 1996 a 2010 nos cursos oferecidos pela UFSC no campus de Florianópolis. Ainda, a autora aponta que cada centro de ensino, no entanto, apresentou suas particularidades e índices anuais que se superaram, ou ficaram aquém dessa média. (LIVRAMENTO, 2011). O censo das IES de 2017 (INEP-Instituto Nacional de Estudos e Pesquisas Educacionais Anísio Teixeira) mostra que um dos grandes problemas que preocupa as IES é a evasão que acontece já no primeiro semestre de cada ano. Dentro desse contexto, buscou-se evidências que corroborassem os estudos anteriores sobre a evasão no ensino superior, especificamente, no curso de Bacharelado em TIC da UFSC, Campus Araranguá. Este curso teve a sua primeira oferta no segundo semestre de 2009, no período matutino e noturno. A proposta total era 200 vagas, com 100 vagas para cada turno. Em 2010 ainda foi ofertado ao todo 200 vagas, cabe ressaltar que esta pesquisa analisa os dados período noturno. Portanto, ao escolhermos um curso de período noturno para análise, também estamos preocupados com as políticas públicas educacionais, estabelecidas pelo REUNI (Decreto nº 6.096, de 24 de abril de 2007), que buscou interiorizar e democratizar o ensino superior público e gratuito. O nosso objetivo é, portanto, analisar as principais fatores da evasão do Curso de Bacharelado em TIC. Atualmente, o Curso de TIC apresenta um alto índice de evasão, aproximadamente 52%. Os dados levantados junto à secretaria integrada de graduação (SIG) mostram que desde a criação do curso noturno em 2010, 452 alunos evadiram. Dentre as desistências, 349 estudantes abandonaram o curso por não comparecerem mais às aulas, 88 desistiram da graduação comparecendo à Coordenação e solicitando sua desistência, 15 acadêmicos excederam o prazo máximo de formação e foram jubilados. Dessa forma, pretendemos encontrar alguns indicadores da evasão do curso de graduação em TIC e interpretar alguns fatores para a sua ocorrência. Espera-se que o conhecimento produzido possa fomentar discussões acerca das políticas de ensino e de atendimento aos discentes adotados pela instituição, em especial, à coordenação do referido curso.",
    "Conclusão": "A evasão é um acontecimento constante no sistema de ensino brasileiro. Os dados adquiridos neste trabalho baseiam em 8% dos evadidos e possibilitaram concluir que existem alguns fatores críticos que levaram os alunos a evadir do curso de Tecnologias da Informação e Comunicação - UFSC. Conforme descrito, a evasão ocorre por várias razões, tanto fatores internos à instituição quanto fatores externos, que interferem para a não continuidade da vida acadêmica. Os dados coletados e analisados corroboram com os estudos dos autores citados anteriormente, (KOTLER e FOX (1994); BIAZUS (2004) e NUNES (2005), uma vez que os resultados dos questionários apontam fatores externos como: contexto familiar, contexto social e econômico, que variam entre as respostas obtidas. Há ainda particularidades de cada ex-aluno que contribuíram para a evasão do curso. A evasão perpassa todos os níveis de ensino, seja ele público ou privado. Quando são analisadas as questões internas (ANDERSON (1987) que contribuíram para a evasão no curso de TIC, destacam-se as motivações que se enquadram dentro do contexto universitário e que demonstram ser a fragilidade do sistema educacional, inclusive dentro do curso. É necessário que haja uma mudança, há necessidade de mais recursos investidos em melhorias nas instalações acadêmicas, de modo a possibilitar mais conforto e condições adequadas para aprendizagem dos alunos. Destacam-se os seguintes fatores para o aumento dos índices da evasão do curso: falta de informação detalhada do curso; despreparo dos professores em relação à didática e relacionamento interpessoal; instalações precárias. É necessário verificar a grade curricular, fazendo sua atualização sempre que necessário, adequando as disciplinas teóricas e práticas, criando projetos que envolvam os alunos com a comunidade, dando oportunidade de contato com a prática. Para a motivação relacionada ao despreparo do professor seria necessário designar, nos primeiros períodos do curso, professores que tenham maior relacionamento interpessoal com os alunos. Em relação a infraestrutura, cabe ressaltar que todo ensino público, seja na educação básica ou no ensino universitário, necessita de investimentos por parte do governo, de forma que essas melhorias proporcionem mais qualidade no ensino, e consequentemente diminuição da evasão. Há necessidade de que a instituição desenvolva um processo de gestão apoiado em políticas públicas, para que essas ações proporcionem a permanência do aluno na universidade. Há necessidade de mais discussões sobre o tema da evasão dentro da Instituição. A pesquisa aqui desenvolvida abre caminhos para um maior aprofundamento nos estudos sobre o tema, tendo a possibilidade de buscar neles uma explicação para a evasão no curso."
}