{
    "Autor": "Filipe Ribeiro da Cas",
    "Título": "Estudo e Implementação de Interface Humano - Computador em Mundos Virtuais 3D",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Roderval Marcelino",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho tem o objetivo de estudar o cenário atual das interfaces humano-computador e propor a introdução do Microsoft Kinect como interface natural nos mundos virtuais 3D aplicados na educação básica. Aplica-se a uma amostra de dois alunos com o intuito de comparar o uso das interfaces tradicionais com o Kinect, onde os resultados foram obtidos através de um questionário. O estudo e a introdução da forma de como integrar o Kinect com os mundos virtuais poderá ser visualizada neste trabalho, assim como as ferramentas e tecnologias aplicadas. O objetivo do questionário é verificar se as interfaces humano-computador tradicionais fazem parte do cotidiano de cada aluno e comparar com o uso do Kinect. Verificar a aceitação e o interesse dos alunos em relação a possível introdução da nova interface no seu ambiente educacional onde um mundo virtual piloto foi utilizado. Por fim, foi possível comparar o uso de cada interface utilizada pelos alunos e demonstrar qual foi o resultado da intenção de introduzir o Kinect como forma de interface nos mundos virtuais aplicados na educação básica.",
    "Palavras-chave": "Interfaces Naturais, Microsoft Kinect, Mundos Virtuais 3D, Educação básica.",
    "Introdução": "As formas de interação entre os humanos e computadores no ambiente educacional, evoluem através da criação de novos equipamentos. As tecnologias aplicadas nestes equipamentos podem contribuir para o processo de aprendizado das novas gerações de alunos conectados. Existe assim a possibilidade de inserção de novas formas de acesso à informação, através do estudo e da introdução de dispositivos tecnológicos que venham facilitar a interação dos alunos aos computadores. Entre as alternativas tecnológicas que vem sendo implantadas nos ambientes educacionais, estão os mundos virtuais 3D, que permitem uma maior imersão dos alunos às atividades de estudo propostas pelos professores. A participação ativa do aluno através dos novos dispositivos tecnológicos de interfaces naturais, dentro de um ambiente virtual dedicado ao ensino, promove o conhecimento de uma nova experiência imersiva na educação. (MARCELINO, 2010). Dentre os novos tipos de interfaces naturais disponíveis atualmente e que podem ser aplicadas a educação, existe o Kinect, onde o estudo e a pesquisa de sua introdução em um mundo virtual 3D criado com a ferramenta Opensimulator (OPENSIMULATOR, 2015) é o foco da pesquisa deste autor. Introduzir novas ferramentas tecnológicas no atual ambiente educacional torna-se um desafio, visto que o investimento é alto no que se refere ao valor dos dispositivos e disponibilização de infraestrutura. Desta forma, existe a possibilidade de aplicação de interfaces naturais para a educação e o desafio de implantar e fazer com que o acesso a estas ferramentas se torne possível aos alunos que são os principais beneficiados.",
    "Conclusão": "Este trabalho de pesquisa permitiu que os conhecimentos teóricos adquiridos em sala de aula ao longo do curso de Tecnologias da Informação e Comunicação pudessem ser aplicados em uma situação experimental prática em alunos da educação básica. A pesquisa estudou os tipos de interfaces humano-computador existentes e tentou propor a introdução do Microsoft Kinect como forma de interface natural no mundo virtual 3D desenvolvido com Opensim aplicado a dois alunos da educação básica. A importância do estudo dos tipos de interfaces, tipos de dispositivos utilizados, dos mundos virtuais 3D existentes e as ferramentas necessárias para que a interface funcione no computador pode contribuir para o aprimoramento do ensino através do uso de ambientes virtuais de aprendizagem. Através da aplicação prática da interface proposta pelo autor com o aluno A e o aluno B e os dados colhidos no questionário, pode-se concluir de acordo com as respostas dos alunos que a proposta de introdução do Kinect nos mundos virtuais 3D é válida desde que a interface de reconhecimento de gestos evolua de tal maneira que permita um controle e uma imersão maior dos alunos no mundo virtual em relação à interface convencional que utiliza o teclado e mouse. O questionário mostra de certa forma analisando-se apenas os alunos A e B que a realidade das escolas públicas e privadas onde o aluno A estuda na escola pública e não tem acesso ao computador e o aluno B que estuda na particular possui. Quando questionados pelo autor sobre a validade da aplicação dos mundos virtuais em suas escolas como apoio ao ensino os alunos foram unânimes em suas respostas e concordaram totalmente com a introdução desde que ocorram os melhoramentos na interação com o mundo virtual. Os mundos virtuais 3D mostram que o sentimento de imersão e o interesse dos alunos neste ambiente é surpreendente e com o avanço da computação os mundos virtuais serão ainda mais reais e a sensação de imersão estará também mais presente. Como recomendações para trabalhos futuros salienta-se a importância de incentivar a aplicação de reconhecimento de novos gestos pelo Kinect no mundo virtual 3D, inserir os recursos de reconhecimento de voz e principalmente o clique através dos gestos. Outra recomendação seria a possível aplicação do Oculus Rift em mundos virtuais 3D para verificar se este dispositivo pode ser usado com sucesso para educação, pois já dispõe de visualizadores para aplicação no Opensim. Entende-se que o profissional de Tecnologias de Informação e Comunicação pode ser o elo entre os alunos, a tecnologia e os professores, atuando como facilitador. Disponibilizando sempre novas ferramentas que facilitem a interação e o aprendizado tecnológico dos alunos. Fazendo com que a experiência em utilizar os sistemas computacionais possa despertar o interesse tanto em desenvolver novos sistemas como em utilizar cada vez mais a tecnologia no ambiente educacional."
}