{
    "Autor": "Igor Pires da Silva",
    "Título": "SABEPI : Sistema avaliativo baseado em peer instruction",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Cristian Cechinel , Dr.",
    "Coorientador(a)": "",
    "Resumo": "Este Trabalho de Conclusão de Curso foi julgado adequado para obtenção do Título de Bacharel em Tecnologias da Informação e Comunicação e aprovado em sua forma final pelo Curso de Tecnologias da Informação e Comunicação.\n\nAraranguá , 15 de dezembro de 2022\n\n________________________\nProf. Vilson Gruber , Dr.\nCoordenador do Curso\n\nBanca Examinadora:\n\n________________________\nProf. Cristian Cechinel , Dr.\nOrientador\nUniversidade Federal de Santa Catarina\n\n________________________\nProf. Fabrício Herpich, Dr.\nAvaliador\nUniversidade Federal de Santa Catarina\n\n________________________\nProf. Vinicius Faria Culmant Ramos , Dr.\nAvaliador\nUniversidade Federal de Santa Catarina\n\nDedico este trabalho aos meus queridos pais.",
    "Palavras-chave": "peer instruction, Metodologias ativas, Software.",
    "Introdução": "O peer instruction é uma metodologia ativa que surgiu na década de 90, elaborada por Eric Mazur, Professor de física na universidade Harvard. Ao perceber que seus alunos não conseguiam resolver questões complexas de física, pelo fato de: Não terem noções consolidadas sobre o assunto, haja vista que estavam apenas decorando as formulas. Então, Mazur decide testar métodos diferentes de ensinar (MAZUR; SOMERS, 1999).\nConhecido no Brasil como instrução em pares, sua aplicação é bem simples e ajuda o professor a guiar sua aula, antes da mesma ocorrer, os alunos recebem os assuntos a serem discutidos em aula e devem ler e absorver. Em sala, o docente apresenta uma questão, que servirá para validar o entendimento de sua turma sobre o tópico que será abordado. Após verificar quantos alunos acertaram, é analisado quanto isso representa sobre o total da turma. Os dados são utilizados para guiar os próximos passos do professor e o rumo que a aula seguirá.\nO problema surge nessa etapa, o professor precisa, constantemente, verificar a porcentagem de acerto de cada questão, isso dará a direção de como a aula deve prosseguir. Além de aplicar a questão, ainda é preciso recolher a resposta de cada aluno e validar o conhecimento. No início da metodologia, Mazur, utilizava cartões para realizar as validações e verificar o conhecimento de sua turma. Todo esse processo é extremante simples, porém, aplicá-lo sem as ferramentas corretas, torna o processo burocrático e extenso.\nAs mudanças na forma de ensinar estão acontecendo a bastante tempo, as metodologias ativas são muito promissoras e as tecnologias da informação e comunicação são um grande aliado nessa transformação. A falta de ferramentas, gratuitas, para auxiliar a aplicação do peer instruction e a ascensão do ensino a distância motivaram a elaboração desta pesquisa. O presente trabalho tem como objetivo minimizar os esforços durante a aplicação do peer instruction em sala aula, a proposta é elaborar um sistema web que facilite sua aplicação, tornando as aulas mais dinâmicas, ajudando o professor a identificar as lacunas presentes no conhecimento dos seus alunos. O maior propósito é oferecer uma ferramenta gratuita, de código livre, que todas as instituições possam utilizar.",
    "Conclusão": "A tabela 1 apresenta o as funcionalidades que foram implementadas durante a elaboração deste projeto comparando com as ferramentas Kahoot e Socrative. Apesar de o Socrative e o Kakoot possuírem mais funcionalidades, SABEPI possui código fonte aberto e livre para distribuição e foi projetado para aplicar o peer instruction.\n\nTabela 1– Comparação com outras ferramentas\nFuncionalidade Kahoot Socrative SABEPI\nCriação de jogos e quizzes Sim Sim Apenas quizzes\nJogos em tempo real Sim Sim Não\nJogos de aprendizado em ritmo próprio Sim Sim Não\nPersonalização de jogos Sim Sim Não\nRelatórios de desempenho Sim Sim Sim\nCompartilhamento com outros Sim Sim Sim\nIntegração com outros aplicativos Sim Sim Não\nFerramentas de ensino remoto Não Sim Não\nAnálise em tempo real Não Sim Sim\nElaborado para aplicar o peer instruction Não Não Sim\nCódigo livre Não Não Sim\nFonte: kahoot , 2022 ; Socrative, 2022\n\nO custo de hospedagem de um aplicativo Rails de tamanho médio pode variar bastante dependendo da plataforma de nuvem escolhida e dos recursos necessários para o aplicativo. Algumas das principais opções de nuvem para hospedagem de aplicativos Rails incluem o Amazon Web Services (AWS), o Google Cloud Platform (GCP) e o Microsoft Azure. A tabela 2 exibe uma estimativa dos custos médios para hospedar um aplicativo Rails de tamanho médio em cada um desses provedores de nuvem. Observe que esses preços podem variar de acordo com as configurações e os recursos específicos do aplicativo. Além disso, esses provedores de nuvem podem oferecer descontos por uso prolongado ou por compromisso de uso.\n\nTabela 2 – Custo médio para hospedar um aplicativo Rails\nProvedor de nuvem Preço mensal (médio)\nAmazon Web Services (AWS) $200 - $400\nGoogle Cloud Platform (GCP) $150 - $300\nMicrosoft Azure $200 - $400\nFonte: Microsoft; Amazon; e Google cloud, 2022.\n\n5.1 LIMITAÇÕES\n\nA construção de uma aplicação full stack, profissional que tem a capacidade de atuar em várias áreas diferentes dentro de um projeto web (infraestrutura, front end, back end e etc...), é um trabalho árduo e exige muitas horas de estudo; a tarefa fica mais complicada quando o projeto é executado por apenas um desenvolver. Se fosse necessário refazer todo projeto, com toda certeza, optaria em desenvolver apenas uma API.\nO tempo disponibilizado para a disciplina de TCC II foi a maior dificuldade em todo o ciclo de vida deste projeto, levando em consideração a quantidade de funcionalidades desenvolvidas.\n\n5.2 POSSIBILIDADES FUTURAS\n\nO peer instruction é uma metodologia promissora e existem funcionalidades que não puderam ser implementadas, a refatoração deste projeto, transformando-o em uma API, seria uma oportunidade para que outros acadêmicos pudessem utilizar para criar uma aplicação front end, utilizando tecnologias reativas, como React.js, Vue.js e React Native. Algumas funcionalidades que facilitariam ainda mais a aplicação do peer instruction podem ser: 1) Caso o percentual de acertos em determinado assunto fique entre 30 a 70 por cento, criar um agrupamento entre alunos que deram respostas divergentes. 2) Se for uma aula remota, seguindo o raciocínio da funcionalidade anterior, criar um canal privado com pequenos grupos de alunos que divergiram, para que eles possam debater suas respostas. 3) Criar um quadro de métricas, para indicar para os professores quais assuntos os alunos possuem mais dificuldade."
}