{
    "Autor": "Tiago Mota de Oliveira, Rafael Cabral Chaves",
    "Título": "Acessibilidade Computacional por Meio de Teclado Adaptado",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Juarez Bento da Silva",
    "Coorientador(a)": "Professor Dr. Giovani Mendonça Lunardi",
    "Resumo": "O presente trabalho apresenta um projeto social, no qual une inclusão social e a tecnologia. Com a criação e o desenvolvimento do protótipo de um teclado com teclas em alto relevo especial e acessível para as pessoas com deficiência visual. A ideia é tornar esta tecnologia viável e disponível para todas as pessoas, com expectativa de criar o teclado em 2018. O projeto irá analisar e estudar a vida cotidiana dos deficientes visuais, para incluir como meta, sanar as dificuldades latentes para essas pessoas. A tecnologia consegue alcançar uma distância inimaginável, partindo desse princípio o objetivo é quebrar barreiras e criar pontes.",
    "Palavras-chave": "Inclusão social. Educação. Projeto social.",
    "Introdução": "Este trabalho tem como objetivo principal a criação do protótipo de um teclado alfanumérico adaptado com letras em alto relevo para deficientes visuais construído em uma impressora 3D, para que futuramente exista uma nova opção de tecnologia aos deficientes visuais. Através da responsabilidade social, este projeto será destinado a pessoas que realmente necessitam de uma atenção especial, pois assim como outros tipos de deficiências, a deficiência visual é por vezes esquecida no país. O teclado alfanumérico com letras em alto relevo tem como propósito, ser acessível para essas pessoas, o que contribuirá significativamente para o desenvolvimento pessoal e social de cada um. A educação ganhará a tecnologia como instrumento de ação. Através da impressão 3D o teclado irá incluir tecnologia de ponta, dedicando exclusivamente a parte das mãos. Uma pessoa que não enxerga, possui uma grande sensibilidade nas mãos e sua audição é perfeitamente atenta aos detalhes. A preocupação com o conforto é um fator essencial para a produção das teclas deste teclado, visando a possibilidade de que deficientes visuais possam ter acesso aos computadores, internet e o mundo virtual. O valor será acessível como prioridade para a inclusão social. O objetivo é que todos possam obter esse equipamento em suas casas, escolas, faculdades, empresas. Tornar comum é aceitar as diferenças.",
    "Conclusão": "Este trabalho buscou descobrir as reais dificuldades encontradas por um deficiente visual no uso de serviços computacionais. E como consequência, encontrou-se necessidades reais de aprimoramento no que se diz respeito à usabilidade e acessibilidade para alguns meios. É certo de que no andamento, teremos limitações financeiras e de maior especialização durante os processos. Entretanto, em seu conteúdo, pode-se obter uma fundamentação sólida para trabalhos futuros. Desta maneira, foi possível a realização de algumas propostas: O aprimoramento no acesso aos deficientes visuais, uma avaliação mais específica e com proporções maiores. E a criação de uma nova ferramenta para somar e viabilizar um melhor acesso voltado para este público. Com isso, é interessante que desperte o interesse das empresas para que algo seja feito. Para um melhor aperfeiçoamento, em uma possível próxima etapa do projeto vamos fazer teste com impressoras 3D que trabalham com resina fotossensível liquida."
}