{
    "Autor": "Tamira Silva Spanhol",
    "Título": "UM ESTUDO SOBRE A INTERAÇÃO ENTRE USUÁRIOS E CHATTERBOTS",
    "Ano de publicação": "2017",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Eliane Pozzebon",
    "Coorientador(a)": "",
    "Resumo": "A Inteligência Artificial (IA) é uma área em expansão, assim como o desenvolvimento de aplicações inteligentes. Para acompanhar este crescimento evitando o obsoletismo, vê-se necessário o levantamento de pesquisas que analisam o nível de preparo dos usuários para lidarem com tecnologias inteligentes. O presente trabalho realiza este estudo através dos Chatterbots, máquinas que simulam a conversação humana, e estão disponíveis como forma de aproximar as pessoas à IA. A pesquisa utiliza como referencial um estudo sobre o desenvolvimento da cognição humana, bem como a cognição de máquina, aproximando o leitor às similaridades existentes, de forma a cativar e compreender a tendência positiva de máquinas inteligentes. Os resultados desta aplicação foram embasados de acordo com a interação de usuários com as máquinas de conversação, seguido de um questionário avaliativo, sendo possível analisar o comportamento dos participantes e caracterizá-los como aptos, estando preparados para lidar com a IA, desde que as condições de desenvolvimento estejam favoráveis ao uso, considerando a necessidade de refinamento dessas tecnologias.",
    "Palavras-chave": [
        "Inteligência Cognitiva Humana",
        "Inteligência Artificial",
        "Chatterbots",
        "Análise de usuários"
    ],
    "Introdução": "O grande avanço tecnológico proporcionou ao ser humano ambições para o exercício do seu livre arbítrio, acrescentando ao mundo uma era digital inerente a construção do próprio homem, o que estimulou suas criações e aplicações a diferentes áreas do conhecimento. Nesta perspectiva, a Inteligência Artificial é derivada da própria inteligência humana e da natureza perfeita do ser humano, tendo como objetivo trazer a inteligência e o conhecimento para um cérebro virtual, tenta não somente entender, mas construir aplicações inteligentes de maneira a expandir o alcance das inovações no mercado de Tecnologia da Informação (RUSSELL; NORVIG, 2010). As inovações precisam estar de acordo com o nível de interatividade do ser humano, por serem estes, usufrutos de sua própria criação. As tecnologias são um atributo para o desenvolvimento econômico e social, e para equiparar-se com um usuário, seu preparo também deve ser considerado. Preparar o homem para utilizar novas tecnologias é uma tarefa visualmente simples, mas orientá-lo a lidar com aplicações advindas da IA é um desafio. Desta forma, torna-se necessário conhecer a essência de aprendizagem do ser humano, para equipá-lo a máquina e auxiliar na construção do seu preparo mental. Nesta perspectiva, uma maneira eficaz de contato primário direto com uma IA, dá-se através dos chatterbots, uma das aplicações que está em ascensão no mercado. Os bots, segundo Leonhardt (2005), atuam como máquinas que simulam a conversação humana, desenvolvidas para propósitos distintos, e sua interação testa a capacidade do homem e máquina, posta à prova para exibir um comportamento inteligente, de modo que o usuário em tempo de diálogo, possa acreditar que está conversando com um humano, mesmo tendo ciência do ato. A validação desta experiência torna-se eficiente partir do momento em que os usuários assimilam que houve um bom nível de interação, e começam a se identificar e compartilhar emoções, intensificando que uma aplicação de tecnologia artificial, quando bem desenvolvida, pode agregar a novos ambientes de utilização virtual, preparando as pessoas para lidar com tais tecnologias. Desta forma, o enlace deste trabalho é compreender como funciona a aquisição do conhecimento, a fim de compartilhar com o usuário semelhanças, que, postas em práticas com máquinas de conversação, como os Chatterbots, por exemplo, possam prepará-lo para interagir positivamente em um futuro próximo, onde as IAs serão comuns no dia-a-dia. Em suma, a evidência da usabilidade de IAs no âmbito pessoal é uma grande área de estudo e planejamento, sendo possível, através da investigação do preparo dos usuários, apurar novas áreas que necessitam melhor interatividade com usuário e refinar tecnologias existentes.",
    "Conclusão": "Alan Turing, em seu primeiro livro estreou o estudo sobre a máquina e as mentes humanas, incitando uma explicação no qual chamou de “Jogo da Imitação”, onde duas “pessoas” se comunicam através de um interpretador, sendo uma pessoa humana e a segunda o computador. Turing indaga então, o que foi considerado a nova teoria da computação e das máquinas: “Can machines think?” (TURING, 1950). Conforme o desenvolvimento das tecnologias, o estudo das máquinas inteligentes tem se tornado uma tendência acadêmica e de negócios. Kloc e Pinheiro (2009, p. 9) afirmam que “a Inteligência Artificial é usada no desenvolvimento de produtos tecnológicos com capacidade de imitar ou potencializar as funções do cérebro humano”, o que une duas áreas do conhecimento, o ser humano e a máquina. Esta pesquisa obteve como embasamento teórico a apresentação da Inteligência Artificial e o desenvolvimento cognitivo de máquina, que, para compreensão desta área, também se torna necessário a compreensão de onde esta advém, pelo desenvolvimento da cognição humana, ponderando a necessidade do conhecimento de ambas as áreas, por serem consequentes. Traçado um paralelo entre as cognições, mostrou-se ao usuário o quanto próximo estas áreas trabalham, e como podem influenciar positivamente na educação global. As teorias de aprendizagem explicam as possíveis maneiras de aquisição de conhecimento do ser humano, da mesma forma que, na transcrição do processo de aprendizagem de uma IA, a semelhança encontra-se pela mesma razão de existirem variadas formas de inserção de instruções na máquina. Algumas diferenças a nível de linguagens e implementações, sobretudo, como a máquina determina seus movimentos finais, também se torna viável a escolha de um método de aprendizado coerente com seu resultado. Como objetivo de entendimento destas duas áreas, a aplicação dos Chatterbots veio para agregar a compreensão da interatividade do usuário com máquinas que conversam, trabalhando como um método de avaliação primária entre interação do homem com a máquina, de modo a analisar o seu comportamento. As máquinas, no entanto, embora limitadas podem ser aprimoradas através das redes neurais pode influenciar positivamente na aceitação das pessoas de acordo com interações eficientes. Nye (1994) cita que a recepção das pessoas perante a tecnologia pode se enquadrar no que ele chama de \"sublime tecnológico\", uma mistura de medo, admiração e reverência em direção às tecnologias, o que incita aos dados desta pesquisa. Em análise geral, 46% dos participantes desta pesquisa se sentem preparados para lidar com máquinas pensantes no futuro, enquanto 42% também se sentem preparados, mas depende do nível de interação, o que torna importante o preparo destes usuários em nível de aproximação, e também o desenvolvimento de aplicações inteligentes que compreendam seus limites de interação, enquanto apenas 12% acham desconfortável e intimidante, de maneira negativa. Em suma, 86% achou a experiência positiva e interessante, sendo um dado positivo para avaliação final desta pesquisa. Conforme análise dos dados, pode-se afirmar que as pessoas se sentem preparadas para lidar com chatterbots, bem como novas tecnologias na área da IA aplicada aos robôs, desde que estas sejam bem estruturadas e possam realmente manter uma linha de raciocínio coerente. Ou seja, embora ainda estejamos com bons resultados, é preciso melhorar a aplicação dos chatterbots, uma vez que, a tendência é cativar quem é da área de interesse e estimular usuários de áreas relacionadas. As pessoas estão preparadas para a IA, mas por sua vez, esta precisa estar preparada para as pessoas. Entende-se que não basta apenas desenvolver aplicativos e serviços em IA, sem compreender se os usuários estão preparados para lidar com tal interação, em analogia, é como desenvolver um produto em uma start up sem realizar uma pesquisa de mercado. A falta de preparo dos usuários é um fator crucial para o desenvolvimento efetivo de aplicações."
}