{
    "Autor": "Rafael Pellegrini",
    "Título": "ANÁLISE DAS PRÁTICAS DAS 6ª E 7ª EDIÇÕES DO GUIA PMBOK PARA O GERENCIAMENTO DE PROJETOS",
    "Ano de publicação": 2020,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Paulo C. L. Esteves",
    "Coorientador(a)": "",
    "Resumo": "A colaboração de maior expressão do PMI para o mundo da gestão de projetos, foi a criação do guia de melhores práticas de gerenciamento de projetos, o PMBOK, considerado a base de todo conhecimento para a gestão de projetos, tendo uma nova versão lançada a cada quatro anos com atualizações em suas abordagens, áreas e processos. Portanto o objetivo geral deste trabalho é analisar a evolução das novas práticas propostas na 6ª e 7ª edições do guia PMBOK, apresentando e conceituando de forma clara todos processos e áreas de conhecimento presentes no guia, também serão apresentadas as evoluções entre as edições do guia juntamente com uma análise de suas novas práticas. Como metodologia foram feitas pesquisas de caráter descritivas, juntamente com analises e comparações entre as informações coletadas, após a obtenção dos dados os resultados serão apresentados de forma qualitativa. E, a partir de toda pesquisa e análise finalizada, foi possível concluir que o impacto no gerenciamento de projetos foi ocasionado pelo início da mudança de foco que começou a ser feita na sexta edição com a inserção definitiva dos métodos híbridos e ágeis, por isso teremos a sétima edição do PMBOK voltado mais para o valor agregado das ações do gerente de projeto do que para os processos em si.",
    "Palavras-chave": "PMBOK. PMI. Gerenciamento de projetos. Processos.",
    "Introdução": "A presente pesquisa tem como foco a análise da evolução das práticas propostas na 6ª e 7ª edições do guia PMBOK para o gerenciamento de projetos. Segundo Vargas (2009) no âmbito empresarial, a velocidade e qualidade com que o projeto é entregue se torna um fator crucial, e para que isso seja atendido o gerenciamento de projetos baseado em prioridades e objetivos torna-se indispensável. Para ele a definição de gestão de projetos trata de um conjunto de métodos gerenciais que possibilitam à empresa criar um kit de habilidades, que engloba conhecimento e capacidades individuais, direcionado ao controle de eventos não repetitivos, individuais e complexos, tudo isso dentro de um cenário com objetivos propostos para sua execução. E para entender com maior facilidade o que é gerenciamento de projetos, é preciso ter uma definição clara de que um projeto, é um empreendimento não repetitivo, definido por uma sequência de eventos, com início meio e fim, com a finalidade de atingir objetivos definidos, conduzidos por pessoas com objetivos predefinidos para sua execução (VARGAS, 2009). Nos dias de hoje, quase tudo que compõe a civilização passou direta ou indiretamente por um projeto, seja ela algo pequeno como o desenvolvimento da estrutura de um simples livro ou software ou algo grandioso como uma construção de um monumento, sendo assim o gerenciamento de projetos algo essencial para o desenvolvimento da civilização. Em 1969 na Filadélfia, EUA, durante um jantar Jim Snyder e Gordon Davis davam continuidade a uma longa conversa sobre a criação de uma nova organização. O objetivo dessa organização era criar um meio em que os gerentes de projetos se reunissem para trocas informações e ideias e discutir sobre problemas envolvendo o gerenciamento e desenvolvimento de projetos, e após uma convenção realizada em outubro de 1969, na cidade de Atlanta, EUA, cinco voluntários fundaram o Project Management Institute conhecido como PMI. (PROJECT MANAGEMENT INSTITUTE (PMI), 2020) O PMI (Project Management Institute) vem ao longo do tempo promovendo melhorias contínuas na gestão de projetos e na valorização dos profissionais que nelas atuam. Nos dias atuais a colaboração de maior expressão do PMI para o mundo da gestão de projetos, foi a criação do guia de melhores práticas de gerenciamento de projetos, o PMBOK (Project Management Body of Knowledge) considerado a base de todo conhecimento para a gestão de projetos. Atualmente do PMBOK está na sua 6ª edição que foi lançada em 2017 e traz consigo uma visão clara do conhecimento sobre as 10 áreas apresentadas no guia, são elas: • Gerenciamento de Integração de projetos • Gerenciamento do Escopo do projeto • Gerenciamento do Cronograma • Gerenciamento de Custos • Gerenciamento da Qualidade • Gerenciamento de Recursos do projeto • Gerenciamento de Comunicações • Gerenciamento de Riscos • Gerenciamento de Aquisições do projeto • Gestão de Partes Interessadas do projeto ou stakeholders Discutir sobre as novas práticas propostas na sexta e sétima edição do guia PMBOK direcionadas à gestão de projetos justifica-se pelo fato de que, o gerenciamento de projetos não é algo recente, se adaptando e evoluindo constantemente ao longo do tempo, está diretamente envolvido no desenvolvimento da nossa civilização há centenas de anos, através de monumentos, eventos esportivos, desenvolvimento de empresas, criação de softwares, publicações de livros e grandes construções arquitetônicas. É possível notar que por ser diferente de uma metodologia que consiste em seguir procedimentos, regras e técnicas, o PMBOK é um guia de boas práticas voltado para gerenciamento de projetos. Isso possibilita ao usuário do guia, criar seus procedimentos, regras e técnicas para determinada etapa do projeto, por isso discutir e analisar as novas práticas das edições mais recentes do PMBOK no gerenciamento de projetos pode impactar direta ou indiretamente no sucesso da realização de várias etapas de um projeto de forma mais eficiente e eficaz tudo isso através da criação e aplicação de práticas, ideias, ferramentas e técnicas de gerenciamento de projetos com base no PMBOK. Assim, o presente trabalho partiu da necessidade de entender e analisar as diferenças entre as novas práticas propostas nas últimas duas edições do guia, apresentando suas mudanças, as diferenças entre elas, e o impacto que essas mudanças geram no gerenciamento de projetos.",
    "Conclusão": "Conforme apresentado ao longo do trabalho, pode-se reafirmar a importância do PMBOK para o gerenciamento de projetos, visto que a utilização bem aplicada de suas práticas através dos processos, impactam de forma positiva no resultado de um projeto ou produto. Portanto apresentar e analisar a evolução dos processos do guia PMBOK visa compreender os processos de forma clara e a entender suas diferenças de uma versão para outra do guia. Após o desenvolvimento do trabalho, com a apresentação de forma clara do que são as áreas de conhecimento, para que servem e como são utilizados seus processos no PMBOK sexta edição, percebe-se uma grande utilização das tecnologias de informação como ferramenta, seja ela para coletar, difundir ou armazenar informações através de aplicativos de mensagens, reuniões online e até mesmo de sistemas de informações de gerenciamento de projeto (SIGP). Algumas das novas práticas da sexta edição foram a inclusão de três processos novos e a exclusão de um, dois processos novos visando sanar dois problemas e um facilitar o ajuste de uma área de conhecimento. Ainda na sexta edição várias nomenclaturas de processos foram alteradas, visando dar mais clareza e consistência com o que realmente é executado nos processos. Após o entendimento dos processos já existentes e suas áreas de conhecimento, juntamente com análise dos novos processos, foram feitas pesquisas das principais diferenças das novas práticas do PMBOK em conjunto com a análise da evolução de cada edição, na sexta edição tivemos a inserção definitiva dos métodos híbridos e ágeis no PMBOK, com recomendações para métodos híbridos e ágeis em todas as introduções das áreas de conhecimento, a inserção do tailoring da mesma forma, e o lançamento de uma versão do PMBOK com foco total em métodos híbridos e ágeis. Já na sétima edição que está para ser lançada em 2020 a principal evolução é a mudança de visão, agora a visão principal não é mais voltado para os processos executados, mas sim os princípios utilizados pelo gerente de projeto, também temos mudanças nos grupos de processos que agora são princípios de entrega do projeto, mudanças nas áreas de conhecimento que agora são domínios de performance e a Standards Plus Digital Content Platform ferramenta online que servirá de capítulo extra para o PMBOK sétima edição. Após todas pesquisas e informações coletadas, chegamos à conclusão que às diferenças entre as duas edições são suas abordagens, na sexta edição mesmo com a inserção dos métodos híbridos e ágeis o guia continua tendo um método preditivo como foco, já na sétima edição e pela primeira vez desde sua criação teremos o foco do PMBOK voltado para abordagens híbridas e ágeis, e o impacto que causa no gerenciamento de projetos é justamente essa mudança de foco que começou a ser feita na sexta edição, portanto teremos um PMBOK voltado mais para o valor agregado das ações do gerente de projeto do que para os processos em si."
}