{
    "Autor": [
        "Lucas Vinícius de Oliveira",
        "Ricardo Orige de Bem"
    ],
    "Título": "ANÁLISE E PROPOSTA DE MELHORIA NA ESTRUTURA DE REDES SEM FIO EM ESCOLAS PÚBLICAS NA MICRORREGIÃO DE ARARANGUÁ",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Juarez Bento da Silva",
    "Coorientador(a)": "Prof. Dr. Paulo Manoel Mafra",
    "Resumo": "As redes sem fio alcançaram um patamar indispensável na comunicação humana. Diferentemente dos seus antecessores, as redes sem fio podem comportar diversos dispositivos em locais que anteriormente eram inviáveis de implementar em uma rede cabeada. Devido a sua praticidade as redes sem fio podem ser utilizados em diversas áreas como ambientes do mésticos, corporativos e educacionais. O presente trabalho de conclusão de curso, teve como objetivo fazer um estudo da estrutura de redes sem fio em quatro escolas de educação básica da rede pública situadas na microrregião de Araranguá, Santa Catarina, a fim de identificar problemas e realizar a reestruturação da rede sem fio, prezando pela aplicabilidade e uso da experimentação para o ensino. A proposta deste trabalho está inserido no \"Promovendo a inclusão digital em escolas de Educação Básica da rede pública a partir da integração de tecnologias inovadoras de baixo custo no ensino de Ciências Naturais e Exatas\" que tem o foco na aprendizagem de ciências por alunos da rede pública e a capacitação dos docentes das escolas participantes no uso das tecnologias, para isso foram desenvolvidas diversas práticas remotas. Entretanto, alguns problemas foram encontrados na estrutura atual dessas escolas impossibilitando o uso eficiente da tecnologia remota. Este trabalho teve o intuito de melhorar o acesso às redes sem fio, solucionando os problemas que impedem o desenvolvimento do projeto. Inicialmente foi feita uma análise prévia da situação em relação a infraestrutura em cada escola e então desenvolveu-se um estudo para a metodologia, para criar um embasamento teórico. Após a fase de metodologia, foi feita uma análise profunda da estrutura das escolas. Para isso, foram feitas diversas visitas aos locais, analisando toda a rede encontrada, focando principalmente em aspectos como sinal wireless, gerenciamento de senhas e localização dos access points (pontos de acesso). Seguido às visitas, foram desenvolvidas as plantas baixas de cada uma das quatro escolas, demonstrando as localizações dos dispositivos atuais. Com o conhecimento adquirido no levantamento em relação aos aspectos técnicos, foi proposta uma reestruturação de redes sem fio das escolas, atendendo a critérios de gerenciamento e segurança de rede e distribuição de sinal wireless.",
    "Palavras-chave": [
        "Redes sem fio",
        "Experimentação Remota",
        "Ensino Básico",
        "Tecnologias na Educação"
    ],
    "Introdução": "Este trabalho de conclusão de curso nasceu da necessidade e da oportunidade de levar as escolas de ensino público das cidades de Araranguá e Balneário Arroio do Silva o uso de laboratórios por meio da experimentação remota. Existe uma falta de equipamentos, estrutura e profissionais qualificados para atuar no ensino dos mais básicos conteúdos científicos. Como não existe uma forma rápida de modificar essa situação, buscou-se suprir as necessidades por meio da tecnologia remota. Vivemos em uma época na qual quase todos têm acesso a internet e podemos refletir então, que o caminho mais simples para contornar as necessidades básicas do ensino é utilizar de técnicas que façam uso da internet para transmitir esse conhecimento e dar acesso aos laboratórios que faltam dentro das escolas. O Laboratório de Experimentação Remota (Rexlab) atua no município de Araranguá levando práticas remotas as escolas públicas, com o interesse de promover a tecnologia dentro da sala de aula. O Rexlab com o auxílio do programa InTecedu, vem mantendo diversos projetos educacionais aplicados na microrregião de Araranguá. Esse programa, visa a integração da tecnologia dentro da educação básica da rede pública de ensino, dividindo-se em dois eixos principais: A capacitação de docentes no contexto das tecnologias e a integração das tecnologias dentro das atividades didáticas. O uso dessa tecnologia, se dá através de dispositivos móveis, que são utilizados para interação com ambientes virtuais de aprendizagem, objetos de aprendizagem, simuladores e experimentos remotos. O programa InTecedu proporcionou que diversos projetos fossem submetidos, entre eles, o projeto Promovendo a inclusão digital em escolas de Educação Básica da rede pública a partir da integração de tecnologias inovadoras de baixo custo no ensino de Ciências Naturais e Exatas, que disponibiliza materiais para melhoria das escolas, sendo a base para o tema deste trabalho. Após a submissão e aprovação de uma proposta do RexLab de recursos para a melhoria na estrutura de rede das escolas da região de Araranguá e Balneário Arroio do Silva, ocorreu uma solicitação de diversos materiais para a melhoria da estrutura de rede dessas escolas.",
    "Conclusão": "Neste trabalho apresenta-se a viabilização de modificações na rede sem fio na estrutura de redes em quatro escolas, duas da rede estadual, escola Educação Básica Profª. Maria Garcia Pessi (Araranguá - SC) e Escola de Educação Básica Profº Apolônio Ireno Cardoso (Balneário Arroio do Silva - SC) e duas da rede municipal, Escola de Educação Básica de Araranguá e Escola de Educação Básica Profº. Otávio Manoel Anastácio, ambas em Araranguá. Possibilitando que os docentes durante a aula possam utilizar de práticas de experimentação remota. Conforme pode ser visto no capítulo 1, foi aplicada uma pesquisa bibliográfica para dar o embasamento teórico necessário para o conhecimento de redes sem fio utilizado nas visitas e na proposta de reestruturação. Um aspecto importante é que a prática nos auxiliou igualmente na criação do conhecimento, prática essa, adquirida principalmente nas diversas idas às escolas para a coleta de dados. As visitas foram importantes para que o aprendizado visto em disciplinas anteriores dentro da universidade fosse centralizado em um ponto específico, o uso de redes sem fio. Com os dados coletados, iniciou-se o desenvolvimento de plantas baixas das escolas. Com as plantas podem ser encontradas as localizações exatas dos equipamentos disponíveis nas escolas. As plantas baixas foram utilizadas como forma de expor antes e depois dos locais, possibilitando ao leitor, uma forma prática de visualizar todo o trabalho feito. Com a estrutura das escolas desenhada em mãos, captamos todos os novos equipamentos que serão utilizados no projeto e assim, desenvolvemos uma proposta que se encaixe nas necessidades. As propostas elaboradas, tiveram um foco principal de suprir as falhas encontradas na estrutura de wireless de rede nas instituições pesquisadas, além de proporcionar um eficiente gerenciamento de senhas utilizando poderosos protocolos de segurança de rede. Como resultados, podemos afirmar que a reestruturação das escolas, é totalmente viável e pode ser executado, tendo em vista a melhora da distribuição da internet nas salas, um gerenciamento de senhas confiável e eficiente, além de uma melhora na segurançaessas senhas, possibilitando assim, o uso pleno da tecnologia remota em sala de aula como foi apresentado no capítulo 4. Portanto conclui-se que as escolas necessitam da mudança estrutural para que possam prover um ambiente apto a utilização da experimentação remota. A reestruturação da redes pode prover as escolas a possibilidade de novas atividades com o uso da tecnologia. Tablets, celulares e notebooks, podem contribuir nesse novo ambiente criado, fazendo com que a falta de um laboratório físico seja mero detalhe. Inicialmente seriam aplicadas as mudanças nas quatro escolas, entretanto, devido a problemas burocráticos (atraso da licitação de equipamentos) tornou-se inviável a execução da proposta de melhoria. Portanto, este trabalho de conclusão de curso, mostra um caminho para aqueles que desejam modificar as escolas de uma forma efetiva, ao utilizar de duas maneiras distintas aplicadas de acordo com a necessidade atual das escolas. A implantação que ocorreria, acabou por se tornar uma proposta, devido ao limite de tempo atingido. Porém como um trabalho futuro, pode-se aplicar a proposta criada neste trabalho de conclusão de curso, abrindo o caminho para tecnologia dentro da sala de aula e assim deixamos uma sugestão para que sejam realizados novos estudos a respeito do tema futuramente."
}