{
    "Autor": [
        "Jean de Stefani",
        "Jonathan da Silva Gomes"
    ],
    "Título": "PROPOSTA PARA IMPLEMENTAÇÃO DE ACESSIBILIDADE NO SISTEMA TUTOR INTELIGENTE MAZK",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof ª. Dra. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "No presente trabalho são desenvolvidas e apresentadas propostas de implementação de módulos de acessibilidade no Sistema tutor inteligente MAZK. O objetivo geral da pesquisa foi analisar os recursos necessários para que o sistema tutor inteligente possibilite a acessibilidade em cursos a distância, autonomia e independência de estudantes com deficiência visual, permitindo que pessoas com deficiência visual possam usufruir ao máximo da plataforma de aprendizagem com uma maior facilidade. A metodologia utilizada no desenvolvimento das propostas consiste em uma análise bibliográfica sobre acessibilidade, deficiência, tecnologia assistiva, ambientes virtuais de aprendizagem e as novas tecnologias de informação e comunicação na educação. Para o desenvolvimento das propostas, foi feito um estudo no sistema tutor inteligente MAZK, e desenvolvido os protótipos com o auxílio da ferramenta Balsamiq, montando as prévias das páginas do MAZK antes e depois da implementação dos métodos propostos, mostrando as melhorias que podem acontecer com as devidas implantações.",
    "Palavras-chave": [
        "Acessibilidade",
        "Deficiências",
        "AVA",
        "TIC",
        "NTICs",
        "MAZK",
        "Tecnologia"
    ],
    "Introdução": "A sociedade tem passado por uma revolução, a da tecnologia da informação e comunicação, que vem se tornando um dos fatores mais importantes para adquirir informação e conhecimento, uma grande evolução dessa parte. Com isso, segundo Pereira (2011), é chegado o momento de nos apropriarmos das TIC para podermos, por meio delas, nos comunicar, relacionar, informar e aprender. Todas as pessoas têm direito de estudar, ter lazer, saúde e educação, inclusive pessoas que possuem qualquer tipo de deficiência. Destinamos este projeto para as pessoas que realmente necessitam de uma atenção especial, com diferentes tipos de deficiência, como as dificuldades visuais - baixa visão e também para os que não possuem visão, aplicando o conceito de acessibilidade. O acesso a estas áreas contribui diretamente na inserção social do indivíduo, fazendo com que o mesmo tenha uma melhora na qualidade de vida. (PAGLIUCA et. al, 2007). O Brasil instituiu em 2015 a Lei de Inclusão da Pessoa com Deficiência nº 13.146 e conforme seu Artigo 2º: Art. 2º Considera-se pessoa com deficiência aquela que tem impedimento de natureza física, mental, intelectual ou sensorial, o qual, em interação com uma ou mais barreiras, pode obstruir sua participação plena e efetiva na sociedade em igualdade de condições com as demais pessoas. (PLANALTO, 2015). Art. 1º É instituída a Lei Brasileira de Inclusão da Pessoa com Deficiência (Estatuto da Pessoa com Deficiência), destinada a assegurar e a promover, em condições de igualdade, o exercício dos direitos e das liberdades fundamentais por pessoa com deficiência, visando à sua inclusão social e cidadania, (PLANALTO, 2015). Art. 3º Para fins de aplicação desta Lei, consideram-se: Acessibilidade: possibilidade e condição de alcance para utilização, com segurança e autonomia, de espaços, mobiliários, equipamentos urbanos, edificações, transportes, informação e comunicação, inclusive seus sistemas e tecnologias, bem como de outros serviços e instalações abertos ao público, de uso público ou privados de uso coletivo, tanto na zona urbana como na rural, por pessoa com deficiência ou com mobilidade reduzida. (PLANALTO, 2015). O termo acessibilidade significa a participação de pessoas com deficiências em atividades em uso do produto, serviços e informação. Alguns exemplos são as calçadas das cidades com acesso para cadeirantes e também acessibilidade para pessoas que não possuem visão alguma. (COLEGIOWEB, 2013). A acessibilidade procura melhorar a qualidade de vida das pessoas. Ela deve estar presente em todos os lugares, dos meios físicos à informação e comunicação, inclusive na tecnologia, onde as TICs vêm mudando nosso dia a dia, ajudando as pessoas com necessidades especiais que portam algum tipo de deficiência. (PESSOA COM DEFICIENCIA, 2017). As tecnologias estão presentes no nosso cotidiano há séculos, passando por uma evolução, fator importante que vem contribuindo para os grandes avanços; a tecnologia vem facilitando as vidas das pessoas, inclusive dos portadores de deficiências. Com o avanço da tecnologia se tornou possível realizar várias atividades que podem melhorar a vida das pessoas com deficiência. A tecnologia promove amplo conhecimento, trazendo grandes vantagens para benefício da população, gerando sempre novas ideias proporcionando novas formas de interagir. (PORTALDAEDUCAÇÃO, 2018). Segundo Silva et al (2011, p.217), um dos maiores desafios da Sociedade da Informação “Consiste em tornar a informação acessível a todas as pessoas, independente de sexo, raça, condições econômicas, grau de instrução e limitação física ou sensorial”. Já existem vários tipos de ferramentas tecnológicas no mercado para deficientes, inclusive para portadores de deficiências visuais. Podemos citar o próprio portal da Universidade Federal de Santa Catarina (UFSC) que possui uma barra de acessibilidade com atalhos de navegação padronizados e a opção para alterar o contraste. Essas ferramentas estão disponíveis em todas as páginas do portal.",
    "Conclusão": "Depois de uma pesquisa entre ambiente virtual de aprendizagem com acessibilidade e definir melhor tutores inteligentes (STI), chegou-se a um resultado para sugerir ideias de melhorias no sistema tutor inteligente MAZK, onde pessoas com deficiências pudessem utilizar do mesmo sem grandes dificuldades, o que é previsto em lei, comentada no decorrer do trabalho. Foi dialogado com os desenvolvedores do MAZK a possibilidade de estarem criando esses novos métodos de acesso ao conteúdo, onde as pessoas deficientes conseguissem interagir com maior facilidade no sistema tutor inteligente. Trabalhando com o segmento de auxílio às pessoas com deficiência visual, foi pesquisado mais sobre o assunto, buscando entender os tipos de deficiência visual e suas reais necessidades para com o uso de computadores. Após definidos os tipos e dificuldades, buscou-se melhorar o acesso dessas pessoas ao sistema tutor inteligente MAZK, e foi encontrado alguns métodos de auxílio virtual, como leitores de tela, lupas, aumento da fonte e alternância de contraste. Esses métodos foram estudados, e indicados à inserção no MAZK através de plugins, onde tornaria o ambiente uma plataforma acessível às pessoas com deficiências visuais. Com as implantações dos plugins estudados no decorrer deste trabalho, chegou-se ao resultado de um sistema tutor inteligente mais acessível às pessoas com deficiências, possibilitando os mesmos acessarem o conteúdo de aprendizagem com mais autonomia e agilidade. Poucos são os ambientes com esses tipos de acessibilidade, o que torna o MAZK mais atraente para as pessoas com deficiência visual, fazendo assim, o MAZK ganhar uma nova gama de usuários, fortalecendo cada vez mais seu uso. Conforme analisado, o sistema tutor inteligente MAZK se encontra em grande crescimento na área da educação, abrangendo vários usuários dispostos a prover informações de uma forma mais educacional. Com essas melhorias pode-se torná-lo mais acessível às pessoas portadoras de deficiência visual, sendo um ambiente virtual que se referência em acessibilidade."
}