{
    "Autor": "Arissa Nagava Inoue",
    "Título": "Avaliação heurística da Plataforma de Acompanhamento Educacional Inclusivo",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Giovani Mendonça Lunardi, Dr.",
    "Coorientador(a)": null,
    "Resumo": "A usabilidade de uma plataforma visa proporcionar uma interação eficiente, eficaz, fácil e agradável ao usuário, para ser simples e natural a execução de todas tarefas e ações. Muitas plataformas podem apresentar problemas em suas interfaces, dificultando ou impossibilitando seu uso pelos usuários. Assim, surge a necessidade de realizar uma avaliação que seja capaz de identificar esses problemas. Este trabalho de conclusão de curso tem como objetivo investigar a usabilidade da Plataforma de Acompanhamento Educacional Inclusivo através da realização de uma avaliação heurística. A metodologia consistiu na revisão da literatura e pesquisa exploratória com uma abordagem qualitativa. Como resultado foi identificado a violação de cinco das dez heurísticas aplicadas, sendo elas a visibilidade do status do sistema, compatibilidade do sistema e o mundo real, prevenção de erros, flexibilidade e eficiência de uso e ajudar os usuários a reconhecerem, diagnosticarem e se recuperarem de erros.",
    "Palavras-chave": "Experiência do usuário, Avaliação heurística, Usabilidade",
    "Introdução": "As sociedades contemporâneas têm realizado grandes avanços na implementação de políticas públicas que garantem direitos sociais e educacionais de pessoas com deficiências e outras condições atípicas do desenvolvimento, sobretudo com a ampliação das chamadas políticas de educação inclusiva fundamentadas nos princípios da diversidade e dos direitos humanos (PLETSCH; MENDES, 2014). Essas ampliações são resultado do reconhecimento de direitos e das práticas de fortalecimento da cidadania, abertos pela pressão das lutas sociais para incluir os excluídos. A partir da Lei 9394/96 (Lei de Diretrizes e Bases da Educação Nacional) todos os estudantes com deficiência passaram a ter preferência de serem matriculados na rede regular de ensino, não mais em instituições segregadas (escolas especiais) filantrópicas -privadas (BRASIL, 1996). Diante disso, conforme o censo escolar realizado pelo Instituto Nacional de Estudos e Pesquisas Educacionais Anísio Teixeira (INEP), o número de matrículas na educação especial chegou a 1,3 milhão em 2020, sendo que entre os anos 2016 e 2020, o número de estudantes da Educação Especial matriculados em classe comum subiu de 89,5% para 93,3%, em alunos de 4 a 17 anos de idade. A ampliação do acesso à educação básica aliada a melhoria da acessibilidade, foram fatores que contribuíram também para o aumento das matrículas de estudantes com deficiência na educação superior. De acordo com o Censo da Educação Superior, houve um aumento de 11 4,1% no número de alunos com deficiência matriculados em cursos de graduação entre 2016 e 2020. Com a política de inclusão cada vez mais presente nos sistemas de ensino, a educação brasileira sofre um grande processo de transformação na concepção da educação inclusiva (SANTOS, 2016), mas o processo de ensino e aprendizagem oferecido, ainda enfrenta problemas e limitações de diversas ordens (PLETSCH; MENDES, 2014) para garantir equidade e qualidade. Nesse contexto de crescentes disparidades, de um lado há uma escola, que pretende ser para todos e inclusiva, e de outro há o imobilismo ainda existente no âmbito escolar. Através disso, percebeu-se a necessidade de pensar em soluções tecnológicas para apoiar e potencializar estratégias pedagógicas do atendimento educacional especializado (AEE) das escolas, para garantir o acesso de alunos deficientes aos seus direitos e objetivos de aprendizagem (REUS, 2019). As Tecnologias da Informação e Comunicação (TICs) também surgem como alternativas inovadoras para contribuir para as mudanças educacionais. Com isso em mente, como proposta de pesquisa de dissertação de mestrado da Vanderleia Benedet Reus em 2019, a partir do uso das TICs e dos problemas elencados, foi investigado a melhor maneira de criar e desenvolver uma plataforma virtual e colaborativa como ferramenta de gestão do processo de escolarização, ensino-aprendizagem e inclusão educacional de pessoas com deficiências, surgindo a primeira versão da plataforma de acompanhamento educacional inclusivo (PAEI). A PAEI é uma plataforma virtual, colaborativa e multidisciplinar destinada ao acompanhamento do processo de ensino-aprendizagem de estudantes da educação especial. O principal objetivo é que essa plataforma proporcione o acompanhamento e a troca de informações entre os profissionais da saúde como o fisioterapeuta, fonoaudiólogo, médicos, psicólogo, terapeuta ocupacional, entre outros, com os professores, gestores da escola e os pais do estudante, como demonstrado na figura abaixo.",
    "Conclusão": "O presente trabalho foi desenvolvido buscando ressaltar a importância de se ter uma interface intuitiva aos usuários. A análise da usabilidade pode ser feita através de uma avaliação heurística, que se trata de um método eficiente, rápido e de baixo custo. Essa metodologia pode ser replicada em qualquer outro projeto, não sendo um método exclusivo para testar uma plataforma educacional. Ao longo desse estudo, constatou-se, por diversos autores da área, a necessidade de proporcionar uma interface que seja eficiente, eficaz, fácil e agradável, para que os usuários consigam realizar uma navegação fluida e tenham a sensação de estar utilizando uma plataforma com maior qualidade. Após a aplicação das heurísticas de Nielsen na plataforma, foi identificado a não conformidade de cinco das dez heurísticas aplicadas. Das heurísticas não cumpridas, se pode destacar a importância da compatibilidade do sistema e o mundo real, a prevenção de erros e ajudar os usuários a reconhecerem, diagnosticarem e se recuperarem de erros. Com essa avaliação heurística se pode apontar quais são os problemas concretos na interação do usuário com a plataforma e salientar a necessidade dessas modificações para o cumprimento de todas as heurísticas, para então testar novamente com usuários finais e verificar a necessidade de novas atualizações e aprimoramentos. Por isso, como trabalhos futuros a sugestão é de que sejam implementadas as melhorias necessárias para o cumprimento das dez heurísticas e após as modificações, sejam realizados testes de usabilidade com os usuários finais de modo a verificar a necessidade de mais correções e adaptações antes da plataforma começar de fato a ser utilizada. Além disso, é importante também a verificação do cumprimento dos critérios de acessibilidade da PAEI."
}