{
    "Autor": "Josiel Pereira",
    "Título": "RExTAbuada: um jogo pedagógico para o ensino da multiplicação",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Prof. Dr. Juarez Bento da Silva",
    "Coorientador(a)": null,
    "Resumo": "No presente trabalho, se propõe o projeto e implementação de um software educativo para facilitar e melhorar o ensino e a aprendizagem de um tema concernente na matemática a tabuada, considerando que a Informática na Educação, sobretudo na educação da Matemática, é um meio poderoso para desenvolver no aluno suas potencialidades, criatividade e imaginação. Esta pesquisa foi realizada com uma turma do quarto ano do Ensino Fundamental da Escola Municipal “Otávio Manoel Anastácio” do Município Araranguá/SC. A metodologia se baseou no desenvolvimento de uma aplicação computacional com um trabalho de campo. Sendo realizada uma avaliação da aplicação desenvolvida através de questionários, com uma turma do ensino fundamental constituída por 19 alunos do quarto ano do Ensino Fundamental. O questionário para avaliação, foi uma adaptação de um modelo já validado do tipo escala Lickert. Tendo obtido resultados positivos na avaliação.",
    "Palavras-chave": [
        "jogos",
        "dispositivos móveis",
        "aprendizagem",
        "matemática"
    ],
    "Introdução": "Em vista da popularidade dos dispositivos móveis na última década, a UNESCO (2014) lançou um documento intitulado “Diretrizes de políticas para a aprendizagem móvel” para apoiar práticas que se utilizem destes dispositivos na educação, pois apesar da sua onipresença e dos tipos especiais de aprendizagem que elas podem apoiar, com frequência essas tecnologias são proibidas ou ignoradas no s sistemas formais de educação. Porém, de acordo com Alfarani (2014), “educadores ainda são resistentes à ideia de integrar esta tecnologia em sua prática, principalmente por causa dos vários desafios que ela apresenta para eles” e também por acreditarem tirar o foco dos discentes, além de não conseguirem ver o potencial que esta tecnologia possui, também pensam que os aparelhos tiram o foco dos estudantes das matérias e que eles não usariam para fins pretendidos. Além das dificuldades se dos desafios apontados pelos docentes na integração quanto a essas tecnologias ao seu cotidiano escolar, também existem leis que proíbem o uso de tais dispositivos na sala de aula em grande parte dos estados brasileiros (Tabela 1). Tais leis foram criadas com o argumento de que o uso do telefone celular pode desviar a atenção dos alunos, além de possibilitar fraudes durante avaliações, podendo assim influenciar no rendimento escolar. De acordo com os dados do CETIC.BR (2014) de uma pesquisa sobre a percepção de docentes, que ministram aula na 4ª série do ensino fundamental, em relação a utilização de computadores na sala de aula, 25% assinalam que possuem habilidade insuficiente, sendo que 69% afirmam que possuem apenas habilidades suficientes para realizar esta. Em relação a atividades realizadas na internet por estes docentes, 11% indicam que possuem muita dificuldade em realizar estas atividades, e que somente menos da metade assinalam que não possuem dificuldades. Porém, esta tecnologia poderia ser utilizada para amenizar os problemas de infraestrutura enfrentados pelas escolas públicas. A edição K12 do relatório NMC Horizon Report (2015) descreve as tecnologias emergentes que têm impacto na educação básica, trazendo as tendências na educação. Entre as tendências apontadas estão a BYOT (Bring Your Own Technology), que consiste na prática das pessoas trazerem seus próprios dispositivos tecnológicos tal como laptops, smartphones e tablets para o ambiente de trabalho ou educacional. Segundo instituições onde tal prática acontece, observa-se um ganho de produtividade. Também se deve notar que escolas não possuem infraestrutura suficiente para proporcionar esses dispositivos móveis aos alunos, dessa forma as escolas podem se beneficiar dessa prática, fazendo atividades que se utilizem dos dispositivos dos próprios alunos. (JOHNSON, 2015) Conforme dados do censo de 2014 retirados do portal QEdu a média é de 8,85 computadores por escola, e sobre as quantidade de escolas que possuem Internet é de 61%, enquanto 51% possuem banda larga, e somente 45% possuem laboratórios de informática. A quantidade de computadores disponível para acesso não consegue atender a quantidade de alunos que as escolas atendem, além dos outros dados apontados que evidenciam a falta de infraestrutura tecnológica das instituições de ensino pública. (Censo, 2014) Neste contexto, a falta de infraestrutura tecnológica adequada aliada à resistência dos docentes na utilização de tecnologias resulta em um cenário onde o estudante se sente desmotivado e desinteressado, pois o ambiente escolar difere profundamente do seu cotidiano. Os nativos digitais, como são chamados por Prensky (2001) estão acostumados a receber informações muito rapidamente, são multi-tarefas, preferem imagens do que texto, e trabalham melhor em rede.",
    "Conclusão": "Este trabalho identificou a usabilidade de um jogo digital em dispositivos móveis por alunos do ensino fundamental. Discutiu a popularidade que os dispositivos móveis têm tido atualmente, e suas características que atraem cada vez mais as pessoas, assim como métodos que se utilizem disto para potencializar o processo de ensino-aprendizagem. Também foram abordados os benefícios que a utilização de jogos educacionais digitais podem trazer no que diz respeito à motivação dos alunos, desse modo potencializado o aprendizado. Além disso, também foi abordada a combinação de dispositivos móveis e jogos educacionais digitais, que juntos podem ampliar seus potenciais criando um ambiente enriquecedor de formação. Para fazer a avaliação foi primeiramente realizada uma reengenharia de um jogo, adaptando ele para que fosse utilizado em dispositivos móveis. Para realizar esta, foi analisado jogos já desenvolvidos no âmbito do projeto Rede Piá, e foi escolhido dentre estes um para se fazer a reengenharia. Por fim, foi realizado a aplicação do jogo em uma turma de quarto ano do ensino fundamental. Aplicado questionários, um para identificar o perfil dos estudantes e outro para verificar aspectos motivacionais, de usabilidade e também relacionados a questões de aprendizagem. Após foi feita tabulação dos dados e analisado os resultados. Estes confirmam que os jogos em dispositivos móveis podem exercer efeitos benéficos para aprendizagem dos alunos, por influenciar em aspectos motivacionais, e pela facilidade de utilização, além do fato de necessitar de uma infraestrutura menor. Ademais, estes serem mais acessíveis em uma possível disponibilização do jogo, para os mesmos poderem instalar em seus próprios dispositivos móveis, levando em conta que alguns já possuem e que é mais fácil adquirir estes em relação a dispositivos tradicionais. Para trabalhos futuros, sugere-se construir jogos com desafios mais consistentes, já que estes foram cumpridos rapidamente por alguns alunos. Também é sugerida a criação de jogos mais interativos, nos quais sejam exploradas as oportunidades que os dispositivos móveis proporcionam. Sendo assim, serão proporcionados conteúdos educativos para professores utilizarem em suas aulas, além de integrar os professores ao planejamento dos jogos, os quais futuramente serão utilizados em sala de aula."
}