{
    "Autor": [
        "César Henrique Cardoso dos Santos",
        "Maykon Carlos de Freitas"
    ],
    "Título": "VisDadosEnem: Visualização de dados do ENEM com a biblioteca D3",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "Com o avanço tecnológico surgem soluções capazes de resolver problemas com alto nível de complexidade, grande volume de dados e que demandam um alto poder de processamento. O aumento em massa da informação pode gerar alguns problemas para análise e compreensão de dados. Os computadores evoluem em grande escala, já os usuários não possuem a capacidade de acompanhar tamanha evolução. Pensando nisso, foi elaborado este trabalho com o objetivo de demonstrar a importância da visualização da informação sobre um grande volume de dados. Para tal, foi desenvolvida uma aplicação Web para visualização de dados do exame nacional do ensino médio (ENEM) com a biblioteca D3 (Data-Driven Documents), na qual seja possível disponibilizá-la na internet, para facilitar o processo de análise dos dados e tomada de decisão do exame nacional do ensino médio. Levando em consideração os recursos de visualização que a aplicação proporcionou, comprovou-se que o seu uso, ou o uso de ferramentas similares, faz-se necessário para realizar análises sobre um grande conjunto de dados, como no caso dos dados adotados neste trabalho. Análise esta, que uma tabela comum dificilmente irá proporcionar. O estudo das tecnologias da informação e comunicação possibilitou o desenvolvimento da ferramenta para visualização de dados, intitulado VisDadosEnem. Como resultado das análises comparativas realizadas sobre o ENEM com o VisDadosEnem, observou-se que alunos de escolas particulares, ou que cursaram maior parte do tempo nela, obtiveram no geral uma melhor média em comparação à alunos oriundos de escola pública. O projeto foi desenvolvido com os micro dados do ENEM, a partir do portal brasileiro de dados abertos, para comprovar a necessidade e eficácia da utilização de ferramentas nesse sentido. Pode-se afirmar que, a utilização do VisDadosEnem possibilitou uma análise comparativa sobre o conjunto de dados e foram descobertos padrões que seriam dificilmente encontrados em uma tabela ou gráfico tradicional.",
    "Palavras-chave": [
        "Visualização da Informação",
        "Análise de Dados",
        "Micro Dados",
        "Tecnologias da Informação e Comunicação",
        "Dados do ENEM"
    ],
    "Introdução": "Com o avanço tecnológico são criadas novas tecnologias capazes de solucionar problemas com alto nível de complexidade, grande volume de dados e que demandam um alto poder de processamento. Na ciência da computação isso é considerado um grande avanço tecnológico, pois traz novos recursos ou a evolução dos já existentes. Entretanto, se as quantidades de dados aumentam, de que maneira o usuário lida com isso? Qual a capacidade que um ser humano tem de assimilar uma grande quantidade de dados? É fato que o aumento em massa da informação pode gerar alguns problemas, para análise e compreensão de dados. Os dados são irrelevantes quando não se tem sentido, ou seja, para que haja informação, os mesmos devem ser interpretados e relacionados para que estejam inseridos dentro de um contexto e permitam a geração do conhecimento. Os computadores evoluem em grande escala, já os usuários não possuem a capacidade de acompanhar tamanha evolução. Exemplificando, pode-se imaginar um cesto com dez frutas dos mais variados tipos. É uma tarefa fácil, agrupar por tipos e compará-las pelo tamanho, massa e volume devido à pequena quantidade de frutas. Agora suponha que, ao invés de um cesto com dez frutas, tem-se um tanque com mil frutas, dos mais variados tipos. Em quanto tempo a mais um ser humano irá demorar para levantar as mesmas informações sem nenhum auxílio? Considerando esse problema, desenvolvedores cada vez mais se preocupam, e dão uma atenção especial para a visualização de dados, em que ferramentas são lançadas com o propósito de auxiliar a visualização dos dados, através de gráficos, que simplificam e esclarecem a informação para a fácil compreensão humana, que atua diretamente na tomada de decisão. Combinando aspectos da computação gráfica, interfaces humano-computador e mineração de dados a visualização da informação permite a apresentação de dados em forma gráfica de modo que o usuário possa utilizar sua percepção visual para melhor analisar e compreender as informações. (FREITAS et al., 2001) Este trabalho visa demonstrar a importância da visualização da informação, essencialmente sobre um grande volume de dados. Para isso, a base de dados escolhida no desenvolvimento da ferramenta de visualização foi o micro dados do ENEM, que conta com mais de 7 milhões de linhas.",
    "Conclusão": "O aumento em massa dos dados, na área da informática, trouxe grandes problemas para análise e compreensão da informação. Devido ao volume excessivo de dados, fator este que dificulta o processo de visualização, torna-se necessário o uso de ferramentas auxiliares com o objetivo de contribuir para melhoria deste processo. O estudo das Tecnologias da Informação e Comunicação possibilitou o desenvolvimento da ferramenta para visualização de dados, intitulado Visdados Enem. O projeto foi desenvolvido utilizando-se um conjunto de dados, os micro dados do ENEM, para comprovar a necessidade e eficácia da utilização de ferramentas de visualização. Pode-se afirmar que a utilização do Visdados Enem possibilitou uma análise comparativa sobre o conjunto de dados. Foram descobertos padrões, que seriam dificilmente encontrados em tabela ou gráfico tradicionais. Além disso, o projeto proporcionou uma ferramenta on-line de utilidade pública, que pode ser facilmente acessada e utilizada para diversas análises. A mesma pode ser de interesse aos órgãos educacionais, que podem analisar os resultados dos tipos de escola, estados e regiões e assim, contribuir para a tomada de decisão com base nas informações extraídas com a visualização. Este projeto inicia várias possibilidades de trabalhos e estudos futuros. O conjunto de dados utilizado para projeção da visualização e as informações que foram obtidas podem ser utilizadas em diferentes cenários. Como exemplo, estudos estatísticos sobre o ENEM, como proceder à avaliação da qualidade da escola pública em comparação à privada em relação às notas obtidas, identificar facilmente quais os estados que possuem um melhor desempenho no ENEM. Enfim, várias possibilidades de arranjos de dados foram apresentadas. Porém, a utilização de todo o potencial do VisDadosEnem somente poderá ser alcançada, se o usuário souber utilizar essas ferramentas conforme seus objetivos e assim possibilitando um importante apoio à toma de decisão."
}