{
    "Autor": "FILIPE ZEFERINO",
    "Título": "VIEW.GOV: VISUALIZAÇÃO DE DADOS DE ENDEREÇOS ELETRÔNICOS DO GOVERNO COM A BIBLIOTECA D3",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "A quantidade de dados vem crescendo exponentialmente e cada vez mais cresce a demanda por ferramentas para gerir e visualizar essas informações. O objetivo deste trabalho de conclusão de curso é propiciar ao usuário uma visão geral e uma aplicação que possa exemplificar diferentes formas de visualização de dados e de interações de um conjunto de dados. Para atingir esses objetivos, foi realizada uma pesquisa exploratória a fim de identificar técnicas e algoritmos de visualização de dados. Um conjunto de dados foi obtido para usar como base para a aplicação que foi desenvolvida na linguagem PHP, utilizando banco de dados em MySQL para a consulta dos dados, e a biblioteca D3 (Data-Driven Documents) para o processamento e a visualização de dados. Com a apresentação dos resultados, pode-se verificar que a ferramenta desenvolvida intitulada VIEW.GOV contribui para o aprendizado e a tomada de decisão do usuário em relação aos dados de domínios registrados pelo Governo Federal Brasileiro.",
    "Palavras-chave": "Visualização de Dados, Dados Abertos, Governo Federal, PHP, MySQL, JavaScript, JSON, D3, Tecnologias da Informação e Comunicação.",
    "Introdução": "Nos dias de hoje, a quantidade de dados disponíveis de determinados assuntos é extremamente grande. O termo big-data, utilizado hoje em dia para indicar um grande volume de dados, demanda por muito poder de processamento e ferramentas cada vez mais robustas para trabalhar, com dados cada vez mais complexos. As Tecnologias da Informação e Comunicação (TIC) têm um grande papel nesse meio, com o objetivo de trazer novas funcionalidades ou aprimoramentos ao contexto atual. Cada dia mais, os dados crescem de forma exponencial. Deste modo, surge a questão de como o usuário comum pode tratar e visualizar esses dados sem uma ferramenta adequada. Os dados, sem um tratamento correto, sem um processamento mais minucioso e sem uma visualização intuitiva, resultam na diminuição do interesse do usuário na busca de informações adicionais. Por exemplo, o estoquista de um supermercado, de posse de uma lista pequena de produtos, poderá vivenciar as seguintes situações: no primeiro olhar, o estoquista saberia onde guardar cada produto. Mas e se fosse uma lista com cinco mil itens? Provavelmente ele perderia muito tempo somente para separar os itens por setor e para organizar os produtos em uma determinada ordem, de uma forma eficiente. Esse tipo de problema é muito comum e é por isso que cada vez mais a visualização de dados é tratada com atenção por desenvolvedores e usuários avançados envolvidos com as TICs. Os métodos de visualização baseados em gráficos são uma maneira simples e universal de mostrar dados os quais têm como objetivo auxiliar o usuário na compreensão e tomada de decisão. Uma visualização de dados adequada pode gerar inúmeros benefícios, que vão desde uma comunicação mais efetiva, até a obtenção de insights para a tomada de decisão. Por meio da inovação, torna-se possível extrair informações valiosas e novas percepções em conjunto de dados que antes não eram utilizados. Ou seja, seja para aprender, para ensinar ou para compartilhar dados, a visualização pode ser o meio mais eficaz nesses processos (MARQUESONE, 2016, p. 235). Neste trabalho de conclusão de curso será investigado a importância e os benefícios da visualização de grande volume de dados, mais precisamente a visualização de dados de endereços eletrônicos registrados pelo governo visando proporcionar uma visualização mais clara, objetiva e amigável para o usuário final.",
    "Conclusão": "Com o advento do big-data na área de Tecnologia da Informação e Comunicação, cada vez mais surge a necessidade de se ter ferramentas robustas e intuitivas para o processamento e a visualização de dados. A trajetória do curso e a vivência acadêmica foram de suma importância para desenvolvimento da aplicação de visualização de dados intitulada VIEW.GOV. O conjunto de dados original foi apresentado em forma de uma lista bruta sem algum tipo de processamento ou interação. A eficiência da aplicação é comprovada quando comparada com a lista, podemos visualizar os dados de uma forma intuitiva e mais objetiva. Outro ponto importante no desenvolvimento do projeto e no decorrer do trabalho de conclusão de curso, é que a aplicação é ferramenta que estará sempre disponível na WEB para qualquer usuário e pode ser acessada de forma facilitada e por ser responsivo, pode ser acessado por qualquer dispositivo. Os dados de domínios do Governo Federal que foram carregados na base de dados para serem usados na aplicação são datados até o dia 07/11/2017. Porém, da forma em que a aplicação foi desenvolvida, possibilita a um usuário intermediário com alguns conhecimentos em bancos de dados em MySQL e na linguagem PHP, carregar um novo arquivo com novos dados no futuro, podendo assim sempre manter as informações atualizadas. O framework D3 tem uma comunidade ativa que todos os dias disponibilizam novas formas de visualização explorando diferentes tipos de algoritmos de visualização de dados, além de já contar com milhas de técnicas prontas e livres para o uso. Pode-se afirmar que os objetivos de se obter uma forma mais intuitiva na visualização de dados foram alcançados e futuramente, novos dados podem ser carregados a fim de manter uma ferramenta sempre atualizada. Os códigos-fonte estão bem comentados facilitando a compreensão para uma futura manutenção e implementação de novas formas de visualização de dados."
}