{
    "Autor": "Cassiano Tramontin Beletti",
    "Título": "Estudo de viabilidade da utilização da tecnologia Power Line Communication - PLC em redes locais em comparativo com cabo de par trançado",
    "Ano de publicação": "2015",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Vilson Gruber",
    "Coorientador(a)": "",
    "Resumo": "O presente trabalho tem por objetivo analisar a viabilidade da utilização da tecnologia PLC em redes locais em comparativo com cabo metálico de par trançado UTP. O estudo aborda a tecnologia PLC para acesso indoor. No transcorrer da pesquisa faz-se uma breve introdução sobre o PLC contando um pouco de sua história, princípios de funcionamento, principais aplicações e topologias. Também é feita uma breve introdução sobre a tecnologia de transmissão de dados por meio de cabos metálicos de par trançado UTP, contando um pouco de sua história, princípios de funcionamento, categorias e tipos de cabos existentes. O foco da pesquisa destina-se a analisar a viabilidade de utilização da tecnologia PLC em redes locais onde a passagem de cabos metálicos de par trançado não é possível ou viável devido a barreiras físicas existentes e entre outros, como por exemplos dutos para passagem dos cabos lotados ou distância entre as partes a serem interligadas. Para tal conclusão foi realizado um estudo de caso em bancada de laboratório analisando e comparando as duas tecnologias mediante os testes de HTTP, HTTP de página completa, ping para gateway, RDP e velocidade. De acordo com a pesquisa a tecnologia PLC mostra-se eficaz, e se conclui que é viável a utilização de PLC nas redes locais.",
    "Palavras-chave": "Power line communication. Broadband Power Line. Internet sob rede elétrica. Cabos par trançado UTP.",
    "Introdução": "O Power Line Communication ou PLC como é conhecido surgiu por volta de 1920 com a ideia de se utilizar a rede elétrica como meio de transmissão de dados. Contudo foi somente em 1988 que as pesquisas com o intuito de se transmitir esses dados há altas taxas de velocidade tomaram destaque, sendo possível realizar as transmissões a partir de 1991. Na época a tecnologia ganhou destaque no cenário mundial e trazia consigo a ideia de resolver os problemas de acesso à internet na última milha. Os projetos e estudos com a tecnologia PLC no Brasil surgiram em grande escala no ano de 1998. No ano de 2001 foi implementado o projeto piloto CEMIG, este previa o acesso à internet em banda larga através da rede secundária de distribuição elétrica. Em 2003 os resultados do projeto foram publicados, e segundo Santos e Silva (2010) mostraram que quanto maior a carga energética da rede, maior era a degradação do acesso dos usuários, sendo necessário a criação de filtros para controle de possíveis fontes de interferência. No ano de 2002 foi implementado um projeto inovador em Santa Catarina pela Iguaçu Distribuidora de energia. O projeto visava a transmissão de internet e telefonia sobre a rede de energia elétrica, porém os dados referentes aos resultados do projeto nunca foram revelados. No ano de 2003 a COPEL no Paraná também iniciou um projeto levando internet banda larga via rede elétrica a cerca de 50 domicílios na região de Curitiba. Segundo dados da própria empresa, os resultados do projeto que se estendeu até 2010, mostram que é viável a transmissão de internet banda larga via rede elétrica, porém o custo de implantação é 50% mais elevado comparado a tecnologia ADSL. (SANTOS JÚNIOR; SILVA, 2010). Atualmente o Brasil se destaca em toda América Latina por meio da Universidade Federal de Juiz de Fora, que realiza pesquisas em torno da tecnologia PLC para implantação em cenários residenciais e industriais. A pesquisa tem retornado resultados positivos, uma vez que foi desenvolvido um sistema de transmissão que se adequa as redes de energia elétrica e consegue garantir uma alta taxa de transferência de dados e uma alta qualidade no serviço mesmo com condições adversas (DUQUE, 2015). A tecnologia PLC ao redor do mundo mantém-se em estudos e projetos que continuam atualmente visando a melhoria e padronização da tecnologia, e verificando as diversas formas de integração com outras tecnologias já existentes. Em 2014 detectou-se um total de mais de 100 iniciativas em PLC cobrindo mais de 40 países e 600 empresas (Anexo 1) (LITTLE, 2014). Dentre alguns projetos que foram e estão sendo realizados ao redor do mundo, verificou-se que: As atividades de PLC sobre a infraestrutura elétrica não afetam a rede e o serviço elétrico; A tecnologia se mostrou pronta para ser implantada no âmbito comercial; Serviços de PLC que foram implantados comercialmente como acesso à Internet em banda larga e voz sobre IP tiveram grande aceitação dos usuários; Uma das principais opções para redes de distribuição está sendo o PLC sobre a média tensão; Quando comparada a outras tecnologias de acesso, o PLC mostra ser uma tecnologia competitiva; Iniciativas comerciais estão partindo das mais diversas prestadoras de serviço de utilidades ao redor do mundo. Diante desse quadro, apresenta-se como problema de pesquisa a viabilidade da utilização da tecnologia PLC em redes locais em comparativo com cabo metálico de par trançado UTP. Tem-se como objetivo geral desse trabalho analisar a viabilidade da utilização de PLC em redes locais em comparativo com cabo metálico de par trançado UTP. Como objetivo específico, analisar a viabilidade do uso do PLC para interligação entre dois pontos em uma rede local aonde não é possível a passagem de um cabo metálico de par trançado UTP, sem a perda de qualidade no serviço de internet, transferência de dados. Para tanto é realizada uma análise em bancada de laboratório simulando os possíveis cenários existentes e verificando a viabilidade do uso do PLC na interligação da rede mediante testes de HTTP, HTTP de página completa, ping para gateway da rede, RDP e teste de velocidade. O presente trabalho se justifica por analisar a viabilidade do uso da tecnologia para ser empregada comercialmente em um provedor de internet, para o uso em residências aonde por motivos estruturais não é possível a passagem de cabos metálicos UTP, muitas vezes limitando o acesso à internet a alguns pontos da residência. O trabalho foi desenvolvido em seis capítulos, sendo o primeiro e o último destinado à introdução e às considerações finais, respectivamente. O segundo capítulo aborda a tecnologia PLC, contando um pouco de sua história, princípio de funcionamento, algumas características e aplicações mais comuns. O terceiro capítulo trata o cabeamento metálico de par trançado UTP, contando também um pouco de sua história, princípio de funcionamento, algumas das categorias de cabos encontradas no mercado atualmente. O quarto capítulo engloba a metodologia da pesquisa, caracterizando a mesma e mostrando os métodos que foram utilizados para coleta dos dados. O quinto capítulo expõe a análise dos dados, mostrando de forma clara os resultados obtidos com a pesquisa.",
    "Conclusão": "Normalmente quando pensamos em internet sob rede elétrica pensamos em algo futurístico, fora da nossa realidade, contudo como se pode observar com o desenvolvimento do trabalho, é algo real e presente em nosso cotidiano, porém ainda muito pouco utilizado, tanto por questões físicas e estruturais (redes elétricas precárias), regulamentais (ainda se trata de uma tecnologia não regulamentada pelos órgãos competentes) e também por falta de conhecimento técnico e científico, pois por mais que existam diversas pesquisas na área, ainda falta conhecimento técnico especializado para aplicação. Contudo podemos frisar que apesar de todos os empecilhos que se fazem presentes no caminho da tecnologia PLC, a mesma como se pode observar através do desenvolvimento desse trabalho se mostra crescente e a cada dia que passa ganha mais adeptos, estes dispostos a torná-la um dos novos meios de transmissão de dados. Através do desenvolvimento dessa pesquisa e análise dos resultados obtidos em bancada de laboratório, pude concluir que a tecnologia PLC é viável para utilização em cenários indoor, em redes LAN, quando comparada com cabo metálico de par trançado. A tecnologia pode ser utilizada para ligação entre dois pontos aonde não se faz possível a passagem de cabos metálicos de par trançado, como foi proposto no estudo. Como podemos observar a tecnologia se comportou muito bem, se manteve estável, não demonstrou nenhum tipo de perda e em alguns momentos se mostrou superior ao cabo metálico de par trançado. Em um comparativo geral se mostrou eficaz para utilização em redes LAN, alcançando assim o objetivo geral proposto nesse trabalho. Além dos resultados obtidos a tecnologia tem outras vantagens que podemos levar em contato para implantação em redes locais, como por exemplo de utilizar a estrutura física já existente no local, uma vez que se utiliza da rede de energia elétrica para transmissão dos dados. Contudo isso deve ser um dos pontos a serem observados no momento da implantação da tecnologia, pois uma vez que tenhamos uma rede elétrica de má qualidade, o serviço de PLC também terá uma qualidade inferior. A tecnologia PLC vem crescendo e se desenvolvendo a cada dia que passa, e como já destacado no trabalho atualmente existem diversas empresas ao redor do mundo que buscam melhorar a qualidade dessa tecnologia e quem sabe não resolver problemas em cenários indoors como foi o caso da pesquisa, mas sim em cenários outdoor, levando acesso à internet até a última milha, e realizando a inclusão digital nessas áreas, nos tornando assim cada vez mais conectados."
}