{
    "Autor": "Evair Araujo Cesconeto, Henrique Borges Cesconeto",
    "Título": "A EDUCAÇÃO A DISTÂNCIA NO EXTREMO SUL CATARINENSE: PERSPECTIVA DE GESTORES, PROFESSORES E ALUNOS",
    "Ano de publicação": 2015,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profa. Drª. Patricia Jantsch Fiuza",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho foi desenvolvido por meio de pesquisa bibliográfica, bem como pesquisa de campo, visando compreender a percepção de gestores, professores e alunos sobre a Educação a Distância. Sabe-se que essa modalidade educacional vem crescendo grandemente ao longo dos últimos anos, principalmente em função do desenvolvimento das tecnologias de informação e comunicação, que permitem os estudos fora do ambiente acadêmico, de acordo com a disponibilidade de tempo de cada aluno. Com a EaD os custos da educação superior se tornam menores e, com isso, cada vez mais indivíduos podem acessar a educação e obter uma formação superior. Além disso, a flexibilidade de tempo permite que mesmo pessoas com horários de trabalho pouco convencionais possam estudar. Identificou-se que para o bom andamento da EaD, o comprometimento dos alunos, bem como sua interação com professores e gestores é essencial, caso contrário, suas chances de obter uma formação qualificada tornam-se menores. Para a condução da pesquisa de campo fora entrevistados 9 gestores, 19 professores e 43 alunos envolvidos na modalidade a distância, distribuídos em 4 instituições de ensino, sendo que todos receberam um questionário para responder, tendo sido informados sobre os objetivos do estudo, bem como assegurados de que seus dados não seria revelados. Os estudos permitiram identificar que a qualidade e o alcance da EaD vêm crescendo ao longo dos anos, porém, mudanças e melhorias ainda precisam ser conduzidas para deixar a EaD mais dinâmica, com mais ações práticas, integrando os conhecimentos teóricos com a realidade profissional de cada curso de formação oferecido. Identificou-se que para os gestores, a EaD trouxe maior facilidade de acesso à educação de forma geral, para os professores o cenário educacional do país foi fortemente impactado desde o desenvolvimento da educação à distância e os alunos afirmam que a EaD lhes permitiu acessar uma graduação.",
    "Palavras-chave": "Educação a Distância. Percepção. Gestores. Professores. Alunos.",
    "Introdução": "A Educação a Distância – EaD, trata-se de uma modalidade educacional legalmente reconhecida no país, que vem crescendo ao longo dos últimos anos. De forma geral, sua maior vantagem consiste em permitir que todos os indivíduos que têm acesso à internet e computadores possam fazer parte dela, estudando quando e onde lhes pareça mais conveniente. Além disso, essa forma de educação apresenta custos mais acessíveis, considerando-se que a disponibilidade de espaço, recursos materiais e recursos humanos tem demandas menores e, assim, os preços das mensalidades podem ser mais baixos do que na educação presencial. Essa forma de educação teve início com a utilização de correspondências, rádios e televisão para a apresentação das aulas, porém, com o advento das tecnologias de informação e comunicação desenvolveu-se grandemente, alcançando mesmo as cidades mais afastadas do país, nas quais as universidades e faculdades presenciais não podem ser encontradas. As tecnologias de informação e comunicação permitiram uma maior acessibilidade, tornando essa modalidade educacional muito mais democrática, de modo que aqueles indivíduos que antes não poderiam imaginar alcançar uma formação superior, atualmente podem buscar os cursos que melhor atendem suas demandas e expectativas. Todavia, também existem dificuldades associadas à EaD. Os alunos dessa modalidade de educação precisam estar conscientes de que seu papel é muito mais amplo, que devem buscar novos conhecimentos em diferentes fontes e, assim, terão chances de alcançar uma formação cada vez melhor. Como as aulas presenciais ocorrem apenas uma vez na semana, esse aluno não poderá ser acomodado, aguardando que o tutor esclareça suas dúvidas, as deverá buscar o máximo de dados que puder sobre um conteúdo, evitando que este seja pouco assimilado. Além disso, é preciso compreender que em função da facilidade de acesso a diferentes conteúdos disponibilizados pela internet, muitos alunos recorrem ao plágio e, assim, deverão o tutor e a própria instituição buscar formas de acompanhar e verificar suas atividades para que a prática de plágio seja identificada e o acadêmico perceba quão incorreta é sua atitude, prejudicando sua própria formação e aquisição de conhecimentos. Os cursos à distância podem ser livres, aqueles sem custos, oferecidos pela instituição com o intuito de permitir aos participantes que desenvolvam capacidades específicas, como no caso dos cursos de matemática financeira, organização de fluxo de caixa, entre outros. Os cursos regulados são aqueles que, na maioria das vezes, apresentam custos e, após a conclusão, o participante obtém um grau de formação específico, como bacharel ou licenciado em determinado curso, como letras, pedagogia, etc. Além disso, é preciso destacar que, de acordo com a portaria nº 4.059 de 10 de dezembro de 2004, as Instituições de Ensino Superior poderão oferecer uma parte de seus conteúdos a distância, ou seja, por meio do uso de recursos tecnológicos, desde que não ultrapasse 20% da carga horária total do curso (art. 1º, § 2º).",
    "Conclusão": "Este trabalho foi desenvolvido com o objetivo geral de verificar o crescimento dos cursos a distância na última década e as perspectivas para a próxima. Os objetivos específicos, por sua vez, foram definidos como compreender a EaD e seu desenvolvimento no Brasil, verificar o papel das tecnologias de informação e comunicação no desenvolvimento das EaDs; verificar os números da EaD no Brasil; e destacar a visão de gestores, professores e alunos de EaD sobre essa modalidade de educação. Alunos, gestores e professores de 4 diferentes instituições de ensino foram entrevistados e seus dados foram tabulados em forma de gráficos, permitindo uma compreensão mais aprofundada dos resultados obtidos em cada questão. Os dados a respeito da identidade dos participantes foram mantidos em sigilo, sendo que as universidades foram apresentadas sob números. Por meio do desenvolvimento do presente trabalho identificou-se que a EaD vem crescendo grandemente nos últimos anos, atingindo uma parcela cada vez maior da população e permitindo que indivíduos de diferentes locais possam receber formação superior, ainda que tenham muitos compromissos ou poucas condições de pagar por uma formação tradicional. As pesquisas realizadas junto aos gestores, professores e alunos da EaD, demonstram que a qualidade e o alcance dessa modalidade educacional vêm crescendo ao longo dos anos, todavia, mudanças e melhorias ainda podem ocorrer para deixar a EaD mais dinâmica, com mais ações práticas, integrando os conhecimentos teóricos com a realidade profissional de cada curso de formação oferecido. Os dados demonstram que os gestores utilizam-se da internet, com mais frequência, para contatar os professores da instituição. Para os professores, depois dos livros, a internet é a fonte de maior utilização para a seleção de materiais, enquanto os alunos utilizam a internet, basicamente, para estudar. Os gestores afirmam que sua prática de gestão foi fortemente impactada pela internet, principalmente no que se refere à sua forma de comunicação. Para a maioria dos professores essa ferramenta é muito útil em sua prática pedagógica e para os alunos trata-se de uma ferramenta de grande relevância para a realização de pesquisas. Para a maioria dos gestores a internet é utilizada diariamente para comunicar-se dentro e fora da instituição de ensino. Os professores, em sua maioria, utilizam-se dessa ferramenta diariamente para a disponibilização de materiais e, no caso dos alunos, mais de 70% utilizam-se dela todos os dias para estudar. Segundo os gestores, a internet tornou-se uma ferramenta altamente positiva em sua prática de gestão. Para os professores a internet facilitou grandemente sua prática pedagógica e, para os alunos, a internet alterou muito sua educação. Os estudos demonstraram que, na opinião dos gestores, a EaD trouxe maior facilidade de acesso à educação de forma geral. Os professores afirmam que o cenário educacional do país foi fortemente impactado desde o desenvolvimento da educação a distância. Os alunos afirmam que, de modo principal, a EaD lhes permitiu acessar uma graduação. Pensando-se na eficiência da EaD, esta é extremamente confiável na visão dos gestores. Os professores afirmam que utilizam-se da internet, basicamente, para oferecer exercícios aos alunos. Para os alunos, a principal contribuição da EaD foi a possibilidade de aquisição de formação profissional. Quanto a qualidade da EaD, os gestores destacam que EaD e presencial apresentam o mesmo nível de qualidade, porém, na mesma proporção de gestores existe a crença de que a EaD é superior. Para os professores, de forma predominante, ambas estão no mesmo nível. Os alunos compartilham da mesma opinião. Para os gestores, as principais perspectivas para EaD nos próximos anos referem-se a ampliação da EaD com qualidade. Para os professores, a melhoria de recursos e tecnologias para a prática pedagógica e para os alunos, maior disponibilidade de cursos e atividades mais prática. Pode-se afirmar, assim, que a visão dos gestores, professores e alunos da EaD se assemelha em alguns pontos, porém, em outros, existem percepções e expectativas diferentes entre os entrevistados. Esse crescimento se deu, com maior ênfase, em função das tecnologias de informação e comunicação que permitiram não ser mais necessário deslocar-se até a instituição de ensino todos os dias. Essas tecnologias reduziram as distâncias e permitiram que pessoas de todos os perfis fossem integradas, indivíduos de todas as idades podem estudar, obter uma formação ou especializar-se em alguma área que considerem viável. É preciso destacar que o presente trabalho não teve a capacidade de esgotar o tema, considerando-se quão amplo ele é e quantas alterações ocorrem no cenário das tecnologias e da sociedade todos os anos e, assim, sugere-se que estudos sejam conduzidos de forma mais frequente para que essas alterações sejam acompanhadas e os conhecimentos sejam expandidos, permitindo que a EaD deixe de ser vista como uma forma secundária de educação e se torne uma forma amplamente reconhecida e utilizada pelos indivíduos. Para trabalhos futuros, destaca-se a relevância do estudo da gestão da educação a distância, visando compreender as diferentes formas de gerir essa modalidade educacional para a obtenção de seus melhores resultados. Além disso, sugere-se o estudo do papel do tutor na educação a distância, visando compreender sua relevância no sentido de auxiliar o aluno a obter os melhores resultados, tanto em sua atividade quanto na aprendizagem dos alunos."
}