{
    "Autor": "Eduardo Possamai Contessi",
    "Título": "Capacidade Absortiva de Empresas do Extremo Sul Catarinense, usuárias de um Sistema de Gestão Financeira",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professora Dra. Solange Maria da Silva",
    "Coorientador(a)": null,
    "Resumo": "Analisar a capacidade absortiva dos usuários das empresas que passaram pelo processo de implantação de um sistema de gestão financeira é um dos objetivos dessa pesquisa. Para tanto, é importante aprofundar os conhecimentos sobre o tema capacidade absortiva e sistemas de gestão financeira. A capacidade absortiva de acordo com os autores pesquisados e utilizados como referencial teórico apresentam alguns indicadores, para que seja mensurada a capacidade absortiva das empresas, que também são contemplados no presente trabalho. Adicionalmente ao referencial teórico, foi aplicada uma pesquisa em algumas empresas que passaram pela implantação do sistema de gestão financeira Bônus, com o objetivo de avaliar a capacidade absortiva dos usuários dessas organizações.",
    "Palavras-chave": "Capacidade Absortiva, Sistema de Gestão Financeira, Implantação de Software.",
    "Introdução": "Em função da crescente competitividade entre as empresas nos últimos anos, não há dúvidas sobre a importância da informação no contexto organizacional. Geralmente, em qualquer empresa o volume de informações só tende a crescer, com isso é exigido das empresas maior controle na gestão dos seus recursos e dos processos. As empresas precisam buscar conhecimento e se adequar às novas ferramentas disponíveis para gerenciamento do seu negócio, visando ganhar vantagem competitiva e atingir seus objetivos. A utilização de softwares faz parte cada vez mais das atividades modernas. Isso faz com que os gestores das empresas utilizem um sistema de gestão financeira para auxiliá-los nessa tarefa. A gestão financeira para ser eficaz, necessita de instrumentos confiáveis que aperfeiçoam o trabalho no momento de tomada de decisões. Dessa forma as empresas de software investem em novas tecnologias para tornar seus sistemas em bons produtos para comercialização. No processo de implantação do sistema, a participação dos usuários representa um fator, importantíssimo, para o crescimento do mesmo, adequando melhorias para tornar o sistema estável, customizável e, de fácil utilização. Com a participação dos usuários é possível identificar a capacidade absortiva da empresa ao transformar o conhecimento existente dos usuários junto com o conhecimento obtido dos treinamentos oferecidos no processo de implantação do Sistema de Gestão Financeira Bônus. Quanto mais ampla e diversificada a base de conhecimento dos usuários da empresa, maior será a chance dos indivíduos fazerem novas associações e conexões, de modo a aumentar sua capacidade de inovar e aplicá-la para fins comerciais. Não foram identificados estudos junto às empresas do extremo sul catarinense voltados para o processo de absorção do conhecimento no processo de implantação de um sistema de gestão financeira. Assim, o objetivo geral da presente pesquisa consiste em analisar a capacidade absortiva percebida pelas empresas usuárias do Sistema de Gestão Financeira Bônus, desenvolvido pela Octal Sistemas. Portanto, formulou-se a seguinte questão de pesquisa: qual a capacidade absortiva, diante da implantação do Sistema de Gestão Financeira Bônus em empresas do extremo sul catarinense?",
    "Conclusão": "Durante a busca pelo referencial teórico foi possível perceber que os primeiros estudos referentes à capacidade absortiva são datados de 1989, exclusivamente, por pesquisadores de fora do Brasil. Estes estudos visavam adequar um modelo de mensurar as habilidades das empresas em reconhecer um conhecimento externo, assimilá-lo com o conhecimento já existente e transformá-lo em vantagem competitiva para a empresa. Dos modelos propostos sobre capacidade absortiva o modelo de Cohen e Levinthal (1990) e, o modelo de Zahra e George (2002) se fortaleceram no âmbito da pesquisa sobre o tema. Apesar de ser um tema de importância para empresas já que a capacidade absortiva pode ser um diferencial competitivo, é um tema pouco desenvolvido por pesquisadores brasileiros, tanto que no processo de busca na base de dados Scopus não foi listado trabalhos com o país de origem Brasil. Sobre a capacidade absortiva são apresentados diferentes modelos de vários autores, porém, nessa pesquisa, foi utilizado o modelo de Zahra e George (2002) por ser considerado o mais adequado para mensurar a CA. O referido modelo é dividido em dois grupos de capacidades, a Potencial (Aquisição e Assimilação) e a Realizada (Transformação e Exploração). Esse modelo serviu de base para a elaboração do questionário que foi aplicado aos usuários que passaram pela implantação do sistema. Com a efetiva participação dos usuários ao responder a pesquisa, pode-se mensurar a média de cada indicador e a média geral de cada empresa pesquisada. A partir dos resultados obtidos na pesquisa entre as empresas que passaram pela implantação do sistema, foi possível concluir que todas obtiveram valores acima da média (3), mostrando que as empresas estão preocupadas em investir em capacitação de funcionários, porém ainda estão distantes de uma excelência (5). As quatro empresas que apresentaram os maiores índices de capacidade absortiva foram justamente as empresas que já faziam uso do sistema comercializado pela empresa desenvolvedora. Isso mostra que quando a empresa possui uma boa base inicial de conhecimento, a aquisição de um novo se torna um processo mais fácil. O tema capacidade absortiva futuramente poderá se tornar sobrevivência das empresas, devido ao seu potencial de desenvolvimento competitivo e habilidade em ter um diferencial. Para trabalhos futuros recomenda-se levar em conta os principais influenciadores da capacidade absortiva (Base inicial de conhecimento, Capital Humano, Estrutura organizacional e Relações interorganizacionais) que poderá ser utilizado junto com o modelo de Zahra e George (2002), para uma melhor precisão na mensuração da capacidade absortiva."
}