{
    "Autor": "Leonardo Paulino Nunes; Rodrigo Cardoso Rufino",
    "Título": "Integração de tecnologias para mobilidade urbana: proposta de sistema digital para estacionamentos rotativos",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Giovani Mendonça Lunardi, Dr.",
    "Coorientador(a)": "",
    "Resumo": "No atual contexto das cidades, os problemas da mobilidade urbana vem se agravando, devido ao crescimento descontrolado do número de veículos individuais transitando nas vias, geralmente saturadas nos horários de pico, aliado à diminuição da demanda do sistema de transporte público urbano, por conta do individualismo dos cidadãos, gera diversos problemas na mobilidade urbana de milhões de pessoas. Esta pesquisa em questão, visa propor uma solução tecnológica para um problema na mobilidade urbana do município de Araranguá - SC, especificamente no atual sistema de Estacionamento Rotativo do município. A proposta foi feita com base em dados levantados em uma pesquisa bibliográfica e documental, determinando o objeto de estudo, fazendo uma pesquisa qualitativa e quantitativa, por meio da aplicação de um questionário online. Após a análise do questionário aplicado, onde algumas pessoas responderam a perguntas sobre o Estacionamento Rotativo, obteve-se resultados satisfatórios para a proposta em questão. Por fim, conclui-se que a proposta é viável e que traria um alívio para os problemas identificados no atual sistema Rotativo municipal.",
    "Palavras-chave": "Tecnologias da Informação, Mobilidade Urbana, Estacionamento Digital",
    "Introdução": "O aumento do uso de transportes individuais em detrimento da utilização de transportes coletivos, embora esses últimos também encontrem dificuldades com a superlotação. Os deslocamentos da população estão sendo analisados para visar mudanças na mobilidade urbana e torná-la mais sustentável, mais econômica e também mais acessível no âmbito geral. Seu objetivo é preencher o tempo ocioso dentro dos meios de transportes públicos. O exemplo acima mostra em números expressivos a situação atual da mobilidade nas principais capitais do País. O Brasil é um dos países que mais sofre com problemas de mobilidade urbana, justamente por ter um histórico de planejamento urbano baseado no modelo rodoviário, ou seja, existe pouco ou nenhum investimento nos transportes pluviais, ferroviários e marítimos. As grandes capitais brasileiras são as que mais sofrem com a crise na mobilidade urbana, como a cidade de São Paulo, por exemplo. De acordo com uma pesquisa realizada pelo IBOPE, estima-se que o paulistano passa até 45 dias por ano parado no trânsito, um número absurdo para quem procura qualidade de vida (BORGES, 2019). A sociedade enfrenta com o desenvolvimento urbano acelerado e desordenado ocorrido no país. Além disso, a pesquisa apresenta outras opções que seriam de incentivo ao uso de meios de transporte alternativos e não poluentes, como as bicicletas, por exemplo. Todavia, para que isso seja possível, os governos precisam investir na construção de ciclofaixas e ciclovias com qualidade. O grande desafio é melhorar a qualidade de vida da população devido ao crescimento do número de veículos individuais transitando nas vias, geralmente saturadas nos horários de pico, aliado à diminuição da demanda do sistema de transporte público urbano. Na pesquisa levantada, observa-se que muito se tem discutido sobre métodos de resoluções dos problemas de mobilidade no país e no mundo. O transporte público, tem se difundido na literatura como um meio muito importante para o alívio do caos urbano. Portanto esta pesquisa procura revisar o assunto sobre a mobilidade urbana, define os tipos de modalidades de transporte praticados no meio urbano, demonstrando alternativas ao transporte coletivo e não motorizado, trazendo alguns exemplos praticados no Brasil e no mundo. Sendo assim, a respeito do desenvolvimento acadêmico científico, este trabalho oferece contribuições ao apresentar o problema da mobilidade urbana e estudá-lo na cidade de Araranguá, propor a implantação de um estacionamento digital utilizando as novas tecnologias que hoje se fazem presente. Na elaboração da proposta do trabalho efetuou-se um questionário de aplicação dos usuários do estacionamento rotativo, na região central da cidade, onde o estacionamento funciona, o que permite gerar conclusões, acerca da melhor forma de elaboração para aplicar um novo modelo, com a migração do estacionamento rotativo analógico que existe hoje para um meio digital, que já é muito utilizado hoje e ampliar a visão de futuras pesquisas acadêmicas. A mobilidade urbana é algo fundamental a todas as cidades do mundo, isso porque é ela que propicia as atividades comerciais, industriais, educacionais e recreativas. Além disso, sem ela, não seria possível existir o desenvolvimento urbano. Sendo assim, o transporte urbano é tão importante para a qualidade de vida da população, quanto os serviços básicos do cidadão, como o de água, esgoto e energia elétrica (FERRAZ, 2004). Boareto menciona que \"Infelizmente o desenvolvimento se deu de forma desorganizada, na maioria das cidades do país, o que está sendo refletido nos problemas de deslocamento, acidentes, congestionamentos, desperdício de energia e aumento da frota de veículos individuais (BOARETO, 2008)\".",
    "Conclusão": "A mobilidade urbana deve ser estudada e planejada durante a formação e expansão das cidades, sendo papel fundamental dos gestores planejar de forma que acompanhe o crescimento exponencial urbano e pensando sempre na questão sustentável, que hoje é uma das pautas mais levantas por conta da urgência de resultados positivos nessa questão, a fim de ir de encontro aos problemas da mobilidade e minimiza-los. O crescimento do número de veículos deixa aberto uma janela de oportunidades para quem quer investir em soluções para a mobilidade urbana e, com a constante evolução na tecnologia, este mercado de soluções tecnológicas segue evoluindo cada vez mais, gerando oportunidades de emprego, contribuindo economicamente e socialmente. Diversas tecnologias já estão disponíveis hoje para solucionar problemas na mobilidade urbana, e neste presente trabalho foi apresentada uma pesquisa para propor a implantação de um sistema digital de estacionamento rotativo, todavia nessa pesquisa identificamos que ainda existe certo receio sobre essas novas tecnologias por parte de algumas pessoas, pois muitos cidadãos acham que pode ser difícil utilizar sistemas digitalizados. Entretanto, percebe-se que a maioria participante da pesquisa aceita uma proposta de digitalização do sistema rotativo municipal da cidade de Araranguá, o que torna o projeto viável, diante do feedback positivo retornado, auxiliando no gerenciamento do estacionamento rotativo, diminuindo os transtornos, economizando tempo e gerando comodidade para os usuários que o utilizam."
}