{
    "Autor": "Tiago Elias dos Santos",
    "Título": "UMA METODOLOGIA PARA CONTABILIZAÇÃO DA GERAÇÃO E DO CONSUMO DE ENERGIA ELÉTRICA EM SMART GRIDS",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Anderson Luiz Fernandes Perez",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho apresenta uma metodologia para a contabilização da geração e do consumo de energia elétrica em Smart Grids no cenário nacional, considerando a legislação vigente. Um smart grid pode ser caracterizado pela forte integração das Tecnologias da Informação e Comunicação com os equipamentos das redes de energia elétrica, que permitem uma maior interação entre os usuários finais e as concessionárias de energia elétrica, bem como possibilita a mudança do perfil do consumidor que passará a ser um agente ativo no sistema, isto é, não somente consumindo energia, mas também gerando, facilitando desta forma que este negocie o excedente com a concessionária. Visando garantir o atendimento a crescente demanda por energia elétrica e priorizando a utilização de fontes renováveis de geração, percebe-se o quanto é importante a implementação das redes elétricas inteligentes, também conhecidas por Smart Grid. Este trabalho apresenta uma forma de se aproveitar a energia excedente gerada por esses consumidores através de uma nova metodologia e conceito do sistema de distribuição de energia elétrica.",
    "Palavras-chave": "Energia Elétrica; Smart Grid; Geração Distribuída; Cidades Inteligentes.",
    "Introdução": "A energia elétrica é um bem essencial ao ser humano e representa um fator determinante no desenvolvimento socioeconômico da população mundial, pois é utilizada para diversos fins. Há apenas dois séculos que ela surgiu como uma solução para a necessidade de aprimorar os sistemas de iluminação pública e para alavancar o crescimento industrial. Com a evolução da tecnologia surgiram novos equipamentos que facilitaram a gestão da geração e distribuição da energia elétrica, como os medidores de energia elétrica e os dispositivos de automação de rede (TOLEDO , 2012). Porém, nota-se que em países em desenvolvimento como o Brasil, os investimentos na estrutura do setor elétrico são muito menores que em países desenvolvidos como Estados Unidos, o que acarreta uma estrutura que não atende a demanda. Apesar do avanço tecnológico pouco se investiu nas linhas de transmissão e distribuição o que vem ocasionando diversos problemas, como por exemplo os apagões. Portanto, torna-se necessário mais investimentos em geração e distribuição de energia elétrica. A inovação no setor surge para atender um novo conceito de consumidor que já não estão mais satisfeito em apenas consumir energia elétrica, mas também gerar sua própria energia, proporcionando uma economia para si mesmo e uma redução do impacto socioambiental causado pelas grandes usinas geradoras de energia elétrica, sobretudo porque a autogeração é feita de maneira sustentável e ecologicamente correta. As redes inteligentes, também conhecidas como Smart Grids, têm um papel fundamental nesta nova fase do setor elétrico, uma vez que integram as Tecnologias da Informação e Comunicação (TICs) com o sistema elétrico tornando possível a coleta de dados de forma remota e contínua, além de tornarem possíveis que sejam tomadas medidas instantâneas, em situações de pane no sistema sem a necessidade da intervenção humana.",
    "Conclusão": "Este trabalho apresentou uma metodologia para contabilizar a geração e o consumo de energia elétrica em Smart Grids (SG). A metodologia proposta propõe o uso das características de um SG para o aproveitamento de energia excedente dos consumidores autoprodutores. O SG pode ser compreendido como redes de energia elétrica que utilizam as Tecnologias da Informação e Comunicação (TICs) para gerenciar e monitorar o transporte da energia elétrica em tempo real com um fluxo de informações e energia bidirecionais entre os consumidores finais e o sistema de fornecimento de energia. No Brasil a área de SG é carente de padronização e regulamentação, pois o foco das concessionárias ainda está na fase inicial da implementação do SG, que é a fase de instalação de equipamentos que possibilitem o monitoramento e a gerência de dados de forma remota. A metodologia proposta apresentou a criação de um novo conceito de distribuição de energia elétrica, criando as subestações de bairro que têm como finalidade a redistribuição da energia oriunda da concessionária aos consumidores conectados a ela e também a gerência da energia excedente de seus consumidores, repassando a concessionária todos os dados referente ao despacho de energia excedente em seu sistema. A metodologia apresentada neste trabalho foi criada em conformidade com a Resolução 482/2012 da ANEEL."
}