{
    "Autor": "Diogo Rodrigues de Souza",
    "Título": "IMPLANTAÇÃO DA METODOLOGIA ÁGIL SCRUM EM UM AMBIENTE DE DESENVOLVIMENTO",
    "Ano de publicação": 2014,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Dr.ª Luciana Bolan Frigo",
    "Coorientador(a)": "",
    "Resumo": "As metodologias ágeis de desenvolvimento de software têm tido grande aceitação no Brasil, pois servem como ferramenta na busca por melhores resultados em produtos de software, fornecendo aprimoramento de gerenciamento e de processos utilizados nesses projetos. Mesmo conhecendo os benefícios que estas metodologias podem trazer, o processo de implantação nem sempre é simples, pois não depende só de uma alteração estrutural da empresa, mas também na cultura organizacional da mesma. O objetivo deste estudo é apresentar uma experiência de implantação da metodologia ágil Scrum. Essa metodologia se destacou pois visa a realização de incrementos que agreguem mais valor ao negócio, podendo assim trazer uma série de melhorias, como também algumas perdas, uma vez que proporciona uma reflexão organizacional com várias mudanças, e não só a nível de estrutura de desenvolvimento de código. Antes da implantação do Scrum não havia uso específico de uma metodologia para apoiar o gerenciamento do processo de software, o que foi um fator relevante para a busca de uma mudança. A adoção do Scrum foi um processo necessário para a melhoria da empresa, despertando o interesse da equipe e melhorando os processos organizacionais, o que tornou a equipe ágil e permitindo um melhor conhecimento dos resultados obtidos.",
    "Palavras-chave": "Métodos ágeis. Engenharia de Software. Cultura ágil. Scrum.",
    "Introdução": "As metodologias de desenvolvimento ágil, no Brasil, têm gerado grande entusiasmo entre seus usuários, assim como na comunidade acadêmica. Destacam-se, principalmente, os aspectos relacionados as melhorias nos resultados que a empresa de software deseja obter, como o aprimoramento de seus processos internos e de sua estrutura organizacional (VARASCHIM, 2009). Nesse aspecto, destaca-se o Scrum, que vem ganhando cada vez mais espaço, pois tem como objetivo acelerar o desenvolvimento de software visando uma melhoria contínua do processo. Tendo como características: (i) a ênfase na comunicação em tempo real; (ii) a documentação reduzida comparando com outras metodologias;(iii) e, tratando também cada nova iteração no software como um novo projeto, que será realizado. Ressalta-se que essa metodologia visa agregar incrementos que estejam ligados diretamente ao valor do negócio (VARASCHIM, 2009). Segundo Schwaber (2011), Scrum é um framework para desenvolver e manter produtos complexos, esta definição consiste em papéis, eventos, artefatos e as regras do Scrum que unem os demais e os mantém integrados. Ken Schwaber e Jeff Sutherland desenvolveram o Scrum, o Guia do Scrum é escrito e fornecido por eles. Confrontando essas características com os ambientes encontrados, hoje em dia, em empresas de desenvolvimento de software, verifica-se que essa metodologia se aplica muito bem, pois temos cenários aonde cada vez mais os desenvolvedores vêm trabalhando com pequenos incrementos e entregas mais curtas, como também cada vez mais se busca a qualidade dessas entregas, gerando maior segurança e valor para os clientes. A implantação de uma metodologia ágil requer uma mudança não só em nível de ferramentas e organização da equipe, mas sim uma mudança real na mentalidade de cada participante do processo.",
    "Conclusão": "As metodologias tradicionais não têm atendido as necessidades dos projetos de software, que exigem cada vez mais uma resposta rápida e eficiente à demanda dos clientes, além da alta competitividade. As metodologias ágeis vieram suprir estas exigências garantindo uma formalização e uma produção de alto desempenho, sem deixar de lado o atendimento aos requisitos de segurança e controle de todo o processo de desenvolvimento de software. A adoção do Scrum na Empresa despertou grande interesse da equipe devido ao potencial desta metodologia em melhorar os processos organizacionais. O impacto das mudanças foi positivo, fazendo com que a equipe trabalhasse em conjunto, melhorando a auto estima e assim o rendimento de todos os envolvidos no processo. Um ponto a se destacar foi à quantificação dos resultados obtidos, tanto com o levantamento de dados antes e depois da adoção, quanto com o questionário apresentado no capítulo anterior. O questionário foi de extrema importância, permitindo chegar a conclusão de qual a opinião da equipe, e juntamente com as métricas obtidas, dar um feedback adequado a mesma. Podem-se apresentar algumas contribuições para a empresa, como por exemplo: organização e controle de solicitações, bem como comunicação otimizada e análise do processo através de métricas. Foram identificadas algumas áreas onde alterações precisam ser revistas ou adotadas, visando melhorar o procedimento atual, como por exemplo a documentação do software e um controle padronizado para versões, tarefas essas que no Scrum não abrange. Ressalta-se que a mudança é principalmente cultural dentro de uma empresa, uma vez que todo o processo é baseado na organização de tarefas bem definidas, e todos devem segui-las. Exalta-se como critério chave para o sucesso o envolvimento de toda a equipe no processo. Não havendo rejeição inicial a proposta, sendo uma decisão tomada em conjunto. Ao final deste trabalho conclui-se que os objetivos propostos foram plenamente alcançados. Inicialmente, foi realizado um estudo da metodologia ágil Scrum e após obter esse conhecimento, foi feito um planejamento para adaptação da empresa, realizando todas as mudanças necessárias, e por fim, apresentado uma análise de todo o processo."
}