{
    "Autor": "JAISON DE MELO GONÇALVES",
    "Título": "MODELO DE ACEITAÇÃO DE TECNOLOGIA: APLICAÇÃO NO SISTEMA TUTOR INTELIGENTE MAZK",
    "Ano de publicação": 2020,
    "Local de publicação": "ARARANGUÁ",
    "Orientador(a)": "Prof. Drª Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "As tecnologias estão cada vez mais presentes na rotina escolar. Este trabalho tem como objetivo medir o nível de aceitação da tecnologia sistema tutor inteligente MAZK, em alunos do ensino fundamental anos finais. O trabalho se fundamenta em aspectos como: as tecnologias auxiliam os professores quando aplicadas de forma estratégica e planejada; os sistemas tutores inteligentes contribuem com o processo de ensino e aprendizagem personalizado ao aluno e na teoria de aceitação de tecnologia. A partir disso, foi realizada uma pesquisa quantitativa e aplicado modelo de aceitação de tecnologia (TAM) em alunos de 6º ao 9º ano do ensino fundamental da E.M.E.B. Jardim Atlântico. Ao término deste trabalho, foi possível identificar que os alunos demonstraram um grau aceitável de concordância, indicando uma aceitação positiva do STI MAZK e que a Facilidade de Uso Percebida é a maior responsável pela aceitação.\n\nPalavras-chave: MAZK. Sistema Tutor Inteligente. Modelo de Aceitação de Tecnologia. TAM. Educação.",
    "Palavras-chave": [
        "MAZK",
        "Sistema Tutor Inteligente",
        "Modelo de Aceitação de Tecnologia",
        "TAM",
        "Educação"
    ],
    "Introdução": "As tecnologias estão sendo inseridas na vida das pessoas cada vez mais cedo. Para LOPES, as crianças interagem com as tecnologias desde de a primeira infância. Esta interação tão precoce e intensa no cotidiano familiar, sugere que as tecnologias devem ser inseridas no ambiente escolar (VIDOTTO, LOPES e POZZEBON). É neste ponto que surgem as tecnologias educacionais, que para Oliveira (1997) é toda e qualquer aplicação ou utilização sistemática de conhecimentos científicos ou de outra natureza, em situações ou problemas educacionais. Se as instituições de ensino pretendem acompanhar as transformações vivenciadas pelas novas gerações, elas precisam se voltar para uma leitura das linguagens tecnológicas (PORTO, apud KUBICHEN, 2016). Os Sistemas Tutores Inteligentes (STI), entram nesta gama de recursos de tecnologia educacional. Pois segundo Delgado (2005), o STI é um sistema que aplica técnicas de inteligência artificial (IA), direcionadas para o processo de ensino e aprendizagem, objetivando um aprendizado de forma individualizada. Para Pozzebon (2008), o STI é um sistema computacional projetado para o ensino, que possui algum grau de tomada de decisão em relação as interações com cada usuário. Desta forma ele aprende com as interações do usuário e se molda a cada um deles. Um exemplo de STI é o MAZK, objeto de estudo deste trabalho, que foi desenvolvido no Laboratório de Tecnologias Computacionais (LabTec) da Universidade Federal de Santa Catarina (UFSC), campus Araranguá. O objetivo geral desta aplicação é servir como instrumento de apoio pedagógico para as estratégias do professor, contribuindo para qualidade de ensino e aprendizagem dos alunos, para isso foi desenvolvido em um ambiente web, podendo ser acessado através de diferentes dispositivos, como tablet, smartphone e notebooks (BITTENCOURT, 2018). Na literatura de Ciências da Computação é comum encontrar estudos sobre a aceitação de tecnologia, no entanto estes normalmente são voltados aos requisitos técnicos dos sistemas de informação, porém a Ciência da Informação tenta mudar esta perspectiva, elevando a importância da percepção do usuário sobre o uso efetivo dos sistemas (CARVALHO, 2006). Com isso, temos o Modelo de Aceitação de Tecnologia (TAM) criado por Davis (1989), que busca identificar porque os usuários rejeitam ou aceitam determinada tecnologia da informação (TI) e como melhorar esta aceitação. O modelo TAM é uma adaptação da Teoria de Atuação Racional (TRA) que é derivada da psicologia e ajustada para gerar modelos de aceitação de TI (GAHTANI, 2001). O TAM auxilia os responsáveis pelas implantações de um sistema de informação a avaliar sua aceitação. Para Gahtani (2001), o TAM foi elaborado para atingir seus objetivos, através da identificação de algumas variáveis fundamentais, ligadas a fatores cognitivos e afetivos da aceitação de TI. Que no modelo de Davis (1989) são: utilidade percebida que tenta compreender o grau em que a pessoa acredita que o uso de um sistema pode melhorar seu desempenho e facilidade de uso percebida que tenta entender o grau em que um indivíduo acredita que o uso de um sistema de informação será livre de esforço. Os temas em debate neste estudo são de suma importância para o cenário educacional, pois o MAZK é uma tecnologia baseada em inteligência artificial e segundo a Revista EDUCAUSE Horizon Report (2020) a IA está mapeada como uma das tendências de uso no mundo educacional, para os próximos anos. Logo, é imprescindível verificar aceitação dessa tecnologia. O objetivo deste trabalho é, aplicar o TAM com alunos do ensino fundamental anos finais, para medir o nível de aceitação da tecnologia STI MAZK. Para atingir os objetivos deste trabalho, foi realizada uma pesquisa quantitativa, sendo conduzida pelo método Survey, através do instrumento questionário, que foi elaborado na plataforma Google Formulários e baseado no modelo produzido por Sek et al (2010). Participaram da pesquisa 65 usuários do STI MAZK, que eram alunos da Escola Municipal de Educação Básica (E.M.E.B.) Jardim Atlântico, do município de Balneário Arroio do Silva.",
    "Conclusão": "Atualmente as crianças estão envolvidas de forma intensa pelas tecnologias no seu cotidiano e esse contato nos aponta que essas tecnologias devem ser levadas para a rotina escolar. Neste ponto entra em ação as tecnologias educacionais, que almejam o aperfeiçoamento do processo de ensino e aprendizagem. Um exemplo dessas tecnologias são os Sistemas Tutores Inteligentes, que aplicam técnicas de Inteligências Artificiais e foca no aprendizado individualizado direcionando cada aluno pelo melhor caminho. O MAZK é um Sistema Tutor Inteligente, que serve como ferramenta de apoio as práticas pedagógicas do professor e busca proporcionar um ensino adaptativo, reativo, flexível e personalizado. O Modelo de Aceitação de Tecnologia foi adaptado da Teoria de Atuação Racional para gerar modelos capazes de medir a aceitação de uma tecnologia. Os temas abordados neste trabalho se mostram relevantes para o mundo educacional, pois em um período em que os alunos estão mais conectados com as redes sociais do que com a sala de aula, precisamos de tecnologias educacionais que consigam chamar a atenção destes alunos. A inteligência artificial estando mapeada como uma tendência na área educacional para os próximos anos e o MAZK sendo um Sistema Tutor Inteligente que faz o uso desta tecnologia, precisamos medir a aceitação entre os alunos referente ao uso do Sistema Tutor Inteligente MAZK para usamos o Modelo de Aceitação de Tecnologia. O trabalho tinha como objetivo investigar a aceitação do Sistema Tutor Inteligente MAZK através do Modelo de Aceitação de Tecnologia (TAM). Para atingir este objetivo, foi utilizado o modelo TAM de Sek et al, com a adaptação das escalas e reescrita do questionário para o contexto da pesquisa. O questionário foi aplicado em alunos do ensino fundamental anos finais da E.M.E.B. Jardim Atlântico, buscando identificar o grau de aceitabilidade do STI MAZK por estes alunos, onde 65 alunos responderam de forma voluntária. Para mensurar os dados da coleta, foi utilizada uma escala de Likert de 5 pontos. Com os resultados obtidos, foi realizada um RM para identificar o grau de aceitação ou rejeição. Sendo que em todas as variáveis o RM ficou acima de 3, o que indica que os alunos são concordantes com as assertivas propostas. Logo, sugerem que o MAZK pode ser utilizado por professores como uma ferramenta auxiliar a sala de aula, pois os alunos tendem a aceitar o uso da mesma. O instrumento de pesquisa e as suas análises, nos permitem concluir que os alunos apresentam um grau favorável de concordância, referente a aceitabilidade do STI MAZK. E que essa, tem uma influência direta da Facilidade de Uso Percebida. Encontramos dificuldades em encontrar referências sobre a descrição de como deve ser uma tecnologia educacional. Também achamos poucos trabalhos realizados como o TAM aplicado à Sistemas Tutores Inteligentes. Devido a pandemia, tivemos dificuldades em aplicar o questionário, pois mesmo sendo um questionário eletrônico não tivemos a oportunidade de explicar pessoalmente aos alunos a finalidade da pesquisa. Mas mesmo com as dificuldades encontradas, conseguimos atingir de forma satisfatória os objetivos deste trabalho. Por último, propomos que estudos futuros busquem o refinamento do instrumento utilizado na presente pesquisa, pois esta é a primeira adaptação aplicada ao STI MAZK em alunos do Ensino Fundamental. Também podemos considerar a avaliação para inserção de novos constructos como Variáveis Externas."
}