{
    "Autor": "Leonardo Huff Oliveira",
    "Título": "Fatores determinantes na internacionalização de empresas de base tecnológica: Uma revisão da literatura",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "O processo de internacionalização de empresas tem objeto de estudo por acadêmicos e pesquisadores que buscam compreender os fatores que influem nesse fenômeno desde a década de 70. Com o surgimento das Empresas de Base Tecnológica (EBT) nas últimas décadas surge uma nova vertente nos estudos sobre internacionalização de empresas que tentam entender o fenômeno da internacionalização dessas EBT’s e suas peculiaridades. As EBT’s são empresas que se distinguem das demais por sua atuação fundamentada no conhecimento científico e uma cultura organizacional centrada na inovação e que desempenham um importante papel na economia atual, pois além de contribuir para o crescimento econômico também impulsiona os avanços tecnológicos de sua área de atuação. A compreensão dos fatores que influenciam o processo de internacionalização é essencial para o desenvolvimento de estratégias eficazes de internacionalização, portanto este trabalho tem como objetivo analisar através de uma revisão da literatura existente quais os fatores que impactam de forma determinante e limitante o complexo fenômeno de internacionalização dessas empresas. Serão explorados fatores estratégicos, ambientais e organizacionais e suas implicações no processo de internacionalização dessas empresas. Os resultados apresentados contribuem para uma compreensão mais aprofundada das dinâmicas existentes na internacionalização de EBT’s.",
    "Palavras-chave": "Internacionalização; Empresas de Base Tecnológica; Fatores Determinantes",
    "Introdução": "O crescente processo de globalização dos dias atuais exige que empresas multinacionais tenham que preencher os mais variados requisitos para ter sucesso nas diversas localidades do mundo. A internacionalização de uma empresa permite que ela acesse novos mercados e aproveite oportunidades de crescimento na tentativa de estabelecer uma presença global. Para Guimarães e Azambuja (2018) um dos pressupostos econômicos mais relevantes na atualidade é o de que o desenvolvimento econômico depende de uma integração qualificada à economia mundial. Essa inserção global já não é mais vista como uma opção e está progressivamente se transformando em uma exigência para a maioria dos setores econômicos, englobando até os setores tradicionais e de baixa densidade tecnológica (LEMES; PRATES, 2014). No Brasil, segundo a FDC (2019), das 5 milhões de empresas existentes apenas 500 possuem subsidiárias ou franquias no exterior, ou seja, apenas 0,01%. A internacionalização de empresas de base tecnológica se tornou um tema de crescente interesse acadêmico e empresarial, impulsionado pelas diversas mudanças tecnológicas assim como a expansão em escala global dessas empresas, no entanto, apesar do reconhecimento da importância da internacionalização, há ainda espaço para descobertas e estudos sobre os fatores determinantes desse processo. Para Prudencio, Valois e De Lucca (2004) “A globalização e a consequente interação de mercados fizeram com que a internacionalização e a Localização de Software e websites passassem a ser uma preocupação constante para as empresas que agem ou pretendem agir globalmente”. A World Trading Organization (2008) afirma que a integração global de produto, capital e do mercado de trabalho resultou em uma alocação econômica mais eficiente no curso do tempo. Através dela consumidores têm uma gama maior de escolhas e produtos a um custo menor. Ainda segundo o relatório, os benefícios são suficientemente tangíveis e grandes o suficiente para que as pesquisas internacionais sobre opinião pública indicarem um amplo respaldo à globalização. Ao analisar empresas de base tecnológica este trabalho abordará os fatores que podem influenciar positivamente ou negativamente a inserção de empresas de base tecnológica no mercado global.",
    "Conclusão": "O presente trabalho buscou entender através da literatura pesquisada quais são os fatores determinantes no processo de internacionalização em empresas de base tecnológica (EBT s) e como esses fatores se relacionam com as teorias clássicas de internacionalização, os resultados destacam a complexidade desse processo por vezes divergindo das abordagens propostas pelas teorias clássicas. A natureza dinâmica e a evolução da tecnologia impõem às EBT’s a necessidade de adaptação às mudanças do ambiente e flexibilidade nos seus processos, como destaco por Cerqueira (2017). Os aspectos ambientais presentes nesse processo, como fatores políticos, acessibilidade, localização em ambientes de inovação e a percepção da população do país alvo emergem como elementos cruciais. O estado desempenha um papel de extrema importância, tanto no país de origem como no país alvo, com políticas que podem favorecer a entrada ou saída de investimento, além disso, a acessibilidade no país alvo pode ser um desafio ou uma oportunidade segundo Cerqueira (2017). Outros fatores internos à empresa como sua experiência e recursos também são determinantes na inserção em novos mercados além da cultura organizacional. Empresas que possuem uma cultura que promove a inovação e o aprendizado organizacional têm seus colaboradores se adaptando mais facilmente a estratégias de negócios internacionais conforme evidenciado por Gonçalves (2008) e Bruneel (2009). Do ponto de vista estratégico, a escolha do mercado, a estratégia de negócios da empresa, que pode ser auxiliada pela estratégia de marketing internacional, e o processo de internacionalização são elementos essenciais. Para born-globals, ingressar rapidamente em mercados estrangeiros e formar parcerias estratégicas revela-se uma estratégia comum e eficiente conforme Régis (2011). A pesquisa mostrou que o contexto inicial em que a empresa está inserida pode ser decisivo para os próximos passos. Uma empresa de base tecnológica está inserida em um mercado que muda muito rápido devido ao surgimento de novas tecnologias e da alta concorrência, portanto para ter vantagem competitiva é necessário estar atento às novas tecnologias desenvolvidas, portanto para EBT’s a rede de colaboração é um fator fundamental, estar situada em um espaço de inovação como um parque tecnológico são alguns exemplos que permitem à empresa o acesso a novas tecnologias assim como o compartilhamento de experiência e conhecimento com outras empresas vizinhas e uma melhora na rede de contatos da firma, tanto com a empresa como com outros agentes como o governo e universidade, o que permite à empresa ter conhecimento e tentar parcerias internacionais através de programas dessas entidades. Um ponto de acordo com os fatores determinantes propostos pelas teorias tradicionais de internacionalização foi o papel do tomador de decisões que tem um papel significativo para o processo de expansão global. A experiência de vivência internacional, assim como o conhecimento sobre o mercado internacional aliados à rede de relacionamento do exterior do empreendedor, ajuda durante as tomadas de decisões estratégicas e na elaboração da estratégia utilizada na internacionalização da EBT. Apesar de se tratar de um fenômeno relativamente recente em relação à internacionalização de empresas tradicionais e ter uma literatura limitada acerca do tema, esta pesquisa revelou a complexidade do processo de internacionalização nas EBT’s, à medida que elas continuam a desempenhar um papel crucial na economia global compreender os fatores determinantes nesse processo ajuda a futuras pesquisas e empresas na formulação de estratégias e na tomada de decisões apropriadas para alcançar o sucesso em um mercado internacional."
}