{
    "Autor": "Arthur Henrique Gonçalves da Silva",
    "Título": "A infodemia do discurso de ódio e das fake news: estudo de caso no Twitter",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profa. Dr. Andréa Cristina Trierweiller",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho tem como objetivo analisar a propagação do discurso de ódio e das fake news no Twitter durante a pandemia da COVID-19. Para tanto, utilizou-se de dados secundários com o levantamento de literatura sobre os temas-chave, em busca de definições, classificações e assuntos relacionados às fake news e o discurso de ódio. Como procedimentos metodológicos, esta pesquisa apresenta caráter exploratório e descritivo. Na sequência, buscou-se casos de fake news e discurso de ódio que circularam no Twitter durante o período pandêmico. Dentre os resultados, verificou-se que os comentários e/ou publicações estão estritamente ligados à ideologia política, ademais, percebe-se que muitos usuários se sentem impunes quando navegam pelas redes sociais. Além disso, nota-se que o discurso de ódio e as fake news contribuíram de forma ativa no grande volume de informações que circulam na internet, causando assim o fenômeno da infodemia. Como sugestão para trabalhos futuros, verifica-se a possibilidade da realização de um estudo sobre o discurso de ódio e as fake news durante a pandemia da COVID-19, não somente em uma rede social específica, mas também, as consequências que tais fenômenos trouxeram para a sociedade neste período.",
    "Palavras-chave": [
        "Infodemia",
        "Fake News",
        "Discurso de ódio",
        "Pandemia",
        "COVID-19",
        "Twitter"
    ],
    "Introdução": "Desde os tempos mais remotos, a comunicação tem sido a chave para a evolução humana. Graças a ela foi possível trocar informações, conviver em sociedade e obter recursos fundamentais para a sobrevivência. A comunicação passou por várias transformações até a forma como é conhecida hoje. Por conta das inúmeras evoluções tecnológicas, é possível se inteirar sobre qualquer assunto, dar uma opinião ou conversar com alguém a todo momento, e em qualquer lugar. Devido às facilidades que a internet traz, muitas pessoas se aproveitam para disseminar conteúdos de má índole, como o discurso de ódio e a propagação das fake news. Isso tornou-se ainda mais evidente no ano de 2020, marcado pela pandemia do Coronavírus, que teve uma quantidade excessiva de informações falsas e ofensivas compartilhadas nas redes sociais. O Twitter, a rede social abordada neste trabalho, é a plataforma onde é possível enxergar tais comportamentos recorrentemente. Devido ao seu alcance, as notícias viralizam rapidamente, o que a torna um lugar ideal para aqueles que querem espalhar conteúdos maliciosos. Dito isso, compreende-se a importância de entender e discutir sobre como as fake news e o discurso de ódio se espalharam pelo Twitter no período pandêmico, além de expor o contexto que se inseriram e quais foram as suas influências sobre a população, principalmente no Brasil – um dos epicentros da pandemia.",
    "Conclusão": "Neste trabalho, apresentou-se, casos de discurso de ódio e fake news no Twitter, responsáveis por causar uma infodemia na plataforma durante a pandemia da COVID-19. A infodemia em si é um fenômeno recente, ainda são necessários muitos estudos para compreender seus diferentes aspectos e impactos na sociedade como um todo. Também vale ressaltar que o alicerce para o estopim deste tsunami de informações, a COVID-19, ainda não acabou. Dessa forma, conclui-se que para compreender melhor este fenômeno, deve-se entender primeiro o contexto da pandemia causada pelo Coronavírus. Analisando por essa perspectiva, também é possível pressupor que a infodemia depende da existência de outro fenômeno para que ela ocorra, como por exemplo a atual da guerra da Ucrânia com a Rússia e as eleições presidenciais no Brasil, neste ano. Com relação as fake news, embora o termo seja relativamente novo, tornou-se um fenômeno comum e fazem parte do cotidiano das pessoas. Apesar disso, é indiscutível que a população, em geral, não sabe lidar com as fake news. A melhor forma para superar essa barreira de informações tendenciosas é procurar por notícias em fontes de credibilidade que assumem compromisso com a transparência e a responsabilidade. No entanto, deve-se entender que, enquanto houver pessoas que se fecham dentro de sua “bolha” e não fazem questão de buscar a verdade, sempre haverá fake news. Considerando o Brasil, em específico, o país tem sido um grande criador e disseminador mundial de fake news. Muito desta conduta se deve pela forma de administrar dos líderes de Estado, que queriam ter mais razão do que os próprios cientistas. Essa maneira de conduzir a pandemia por parte de tais líderes, acarretou uma produção em massa de fake news, agravando ainda mais a situação sanitária do país, contribuindo com a criação de movimentos negacionistas e, polarizando a população em extremos. Além de dificultar o combate à COVID-19, a desinformação também ressoou como discurso de ódio na internet. Essa problemática voltou a ganhar os holofotes devido a quantidade massiva de mensagens repletas de ódio, que apenas trouxe mais caos para a sociedade. Observando o comportamento dos usuários que propagam tais manifestações, é possível perceber um padrão completamente agressivo, que trata como inimigos os indivíduos com diferentes visões de mundo. Analisar tais atitudes, nos leva a reflexão de que as pessoas preferem atribuir ofensas gratuitas do que apresentar argumentos que defendam a sua cosmovisão. Além disso, através deste trabalho, percebeu-se que o discurso de ódio muitas vezes se camufla atrás deboches, sarcasmo, outras formas de ironia e principalmente a intolerância. Como sugestão para trabalhos futuros, pode-se levantar quais são as melhores medidas educativas para lidar com as fake news e, as consequências do discurso de ódio em si durante o período pandêmico, tendo não apenas uma plataforma como referência, mas tentando analisar o ambiente da internet como um todo e as repercussões que este conteúdo teve no mundo real."
}