{
    "Autor": "Pollyanna Cardoso Souza",
    "Título": "Desvendando Padrões e Insights: Visualização de Ideias com Modelos de Linguagem e Análise de Agrupamento",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.(a) Dr.(a) Marina Carradore Sérgio",
    "Coorientador(a)": null,
    "Resumo": "A inovação desempenha um papel fundamental no desenvolvimento estratégico das organizações, sendo frequentemente impulsionada por ideias que emergem de diversas fontes. As plataformas de gestão de ideias surgem como ferramentas para coletar ideias e sugestões, permitindo explorar a criatividade coletiva e identificar oportunidades estratégicas. Este trabalho tem como objetivo analisar ideias e sugestões coletadas de um sistema de gestão de ideias, com foco na identificação de padrões temáticos e tendências úteis para a gestão estratégica. Para alcançar esse objetivo, foi utilizada uma abordagem metodológica integrada, combinando vetorização de texto com SBERT, agrupamento com K-means, redução de dimensionalidade com PCA, e busca semântica com modelos de linguagem (LLM). Os resultados revelaram que, embora as ideias estivessem distribuídas em diferentes categorias e agrupamentos, emergiram padrões temáticos recorrentes, conectando áreas distintas. Entre os destaques, identificou-se o uso de tecnologias sustentáveis como um tema transversal e inovações significativas na área da saúde. O método desenvolvido provou ser eficiente na extração de insights relevantes, contribuindo para apoiar gestores e empreendedores na identificação de oportunidades de mercado e no aprimoramento de produtos e processos. A análise também mostrou que a combinação de tecnologias emergentes com abordagens sustentáveis tem um grande potencial para gerar soluções inovadoras. Este estudo contribui para a compreensão de como a análise de grandes volumes de dados pode ser utilizada para a gestão estratégica de ideias.",
    "Palavras-chave": "Gestão de Ideias; Inovação; Busca Semântica; Modelos de Linguagem.",
    "Introdução": "No cenário empresarial atual, a gestão eficaz de ideias tornou-se um pilar essencial para o desenvolvimento e a inovação contínua das empresas. Valorizar as ideias permite que as organizações não apenas se mantenham competitivas, mas também liderem na criação de soluções inovadoras. De acordo com Mikesone et al. (2020), o gerenciamento de ideias envolve a identificação, geração e avaliação de ideias, destacando sua importância para o crescimento e a sustentabilidade organizacional. A capacidade de transformar ideias em valor está diretamente correlacionada ao sucesso a médio e longo prazo de qualquer empresa (Mikesone et al., 2024). Vierula (2024) reforça essa visão ao afirmar que a gestão de ideias é crucial na era da informação, onde a inovação oferece uma vantagem competitiva significativa. Rampa e Agogué (2021) argumentam que ideias bem geridas podem se transformar em inovações disruptivas que reposicionam uma empresa no mercado. Nesse contexto, a Gestão de Ideias não é apenas um facilitador, mas uma peça fundamental no processo de inovação, como destacado por Barbieri, Álvares e Cajazeira (2009) e Cooper, Edgett e Kleinschmidt (2001). Ao longo dos anos, foram desenvolvidos diversos modelos e ferramentas para facilitar o processamento sistemático de ideias, com o objetivo de extrair insights valiosos que possam gerar inovação (Ahmed, 2008; Bakker, Boersma e O'Reel, 2006; Brem e Voigt, 2009). A gestão de ideias deve ser coordenada, conectando ideias semelhantes para gerar valor e inovação dentro das organizações (Thom, 2003). Com o advento da tecnologia, o processamento manual de grandes volumes de ideias tornou-se inviável. Ferramentas automatizadas, como as baseadas em Processamento de Linguagem Natural (NLP - Natural Language Processing), surgiram como soluções eficazes para otimizar a gestão de ideias. O NLP, fundamentado em inteligência artificial, permite a análise de grandes volumes de texto, identificando padrões e gerando insights relevantes (Liddy, 2001; Chowdhury, 2003). Mais recentemente, técnicas avançadas como aprendizado de máquina, aprendizado profundo e modelos de linguagem de larga escala (LLM) têm sido incorporadas aos Sistemas de Gestão de Ideias (SGI) para melhorar ainda mais a eficácia desse processo (Naveed et al., 2023). Aprendizado de máquina, do inglês Machine Learning, é definido por Mitchell (1997) como o estudo de algoritmos que melhoram automaticamente através da experiência. Já o Aprendizado Profundo, do inglês Deep Learning, utiliza redes neurais profundas e tem se mostrado particularmente eficaz na extração de informações relevantes de grandes volumes de dados (Shinde; Shah, 2018). Recentemente, modelos de linguagem pré-treinados aplicados em larga escala, como o BERT, têm se difundido e alcançado resultados de nível humano em tarefas relacionadas à linguagem (Kasneci et al., 2023). A aplicação dessas tecnologias nos Sistemas de Gestão de Ideias permite não apenas a organização e avaliação de ideias, mas também a extração de insights como emoções, opiniões e tendências (Berger; Packard, 2022). Dessa forma, as empresas podem aproveitar de maneira mais eficaz o vasto conjunto de dados não estruturados disponíveis, transformando ideias em inovação. Nesse contexto, este trabalho busca analisar as ideias coletadas de um site de geração de ideias utilizando algoritmos de vetorização como o modelo SBERT, técnicas de agrupamento, como o K-means, e técnicas de busca semântica baseadas em LLM, com o objetivo de identificar padrões e insights que possam aprimorar os processos de gestão de ideias em organizações.",
    "Conclusão": "Este trabalho investigou o potencial da análise de ideias para a gestão estratégica e a inovação organizacional, utilizando um conjunto de técnicas avançadas de análise de dados. A partir da coleta e análise de sugestões de diversas categorias, extraídas de uma plataforma de ideias, o estudo foi capaz de identificar padrões e tendências emergentes que são fundamentais para entender como diferentes temas, muitas vezes classificados de forma distinta, se conectam em um contexto mais amplo. O uso de ferramentas como BERT, K-means, PCA e LLM, combinadas de forma integrada, permitiu a vetorização, clusterização e redução de dimensionalidade dos dados, resultando em uma análise aprofundada das ideias. Uma das principais conclusões deste estudo é a identificação de tendências globais e interdisciplinares, que se concentram em questões de relevância mundial, como sustentabilidade, inovação tecnológica e eficiência social. Esses temas, quando analisados de diferentes perspectivas, destacam a importância da interconexão entre áreas de conhecimento, o que proporciona uma base sólida para o desenvolvimento de soluções inovadoras e a geração de impacto positivo. A pesquisa também demonstrou que as ideias, embora agrupadas em categorias específicas, podem abordar temas semelhantes sob ângulos distintos, o que amplia a compreensão sobre as inter-relações existentes entre diferentes áreas de interesse. Esse entendimento contribui diretamente para a gestão de ideias, permitindo que gestores e empreendedores identifiquem pontos focais que podem ser explorados para aprimorar produtos e processos. A implementação do método de vetorização e clusterização, além de garantir a precisão na extração de dados, demonstrou ser eficaz no processamento de grandes volumes de informações e na identificação de insights relevantes. Além disso, a análise automatizada do conteúdo não só possibilitou a extração de insights significativos, mas também levantou reflexões sobre a aplicabilidade dessas técnicas na gestão de ideias, destacando seu potencial em apoiar decisões estratégicas e no planejamento organizacional. A pesquisa também foi bem-sucedida ao atingir seus objetivos específicos, demonstrando como as diferentes abordagens analíticas, como o uso de LLM e agrupamento de dados, podem ser aplicadas de maneira eficiente para a gestão de grandes volumes de ideias. Por fim, este estudo apresenta implicações práticas para empreendedores e gestores, fornecendo uma metodologia robusta que pode ser utilizada para analisar tendências e identificar oportunidades no mercado. O método desenvolvido neste trabalho não apenas contribui para a gestão de ideias, mas também oferece uma base sólida para futuras investigações, que poderão replicar ou adaptar as técnicas propostas em diferentes contextos de pesquisa. Dessa forma, a análise e visualização de ideias se consolida como uma ferramenta estratégica, capaz de gerar insights decisivos para a inovação e o sucesso organizacional."
}