{
    "Autor": "Arthur Figueiredo Nunes",
    "Título": "SISTEMAS DE RECOMENDAÇÃO E FEED DE NOTÍCIAS : Um estudo sobre a difusão de ideologias na rede social virtual Facebook",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Giovani Mendonça Lunardi , Dr.",
    "Coorientador(a)": "",
    "Resumo": "O presente trabalho tem como tema os sistemas de recomendação e feed de notícias da rede social virtual Facebook. Seu objetivo é investigar o uso do sistema de recomendação, EdgeRank, para ampliação da difusão de fake news no feed de notícias dos usuários. Para isso realizou-se uma pesquisa bibliográfica com a finalidade de aumentar a compreensão do tema e levantar dados sobre a difusão de fake news no Facebook. Utilizou-se das bases de dados: Repositório Institucional da UFSC, IEEE, Scielo, Capes, Scopus, Web of Science e Google Scholar, com os descritores: redes sociais, redes sociais virtuais, ideologia, fake news, sistemas de recomendação, algoritmos de recomendação, feed de notícias, EdgeRank e Facebook. Como resultado foi possível verificar empiricamente que as fake news são amplamente difundidas no Facebook e que são um importante meio para difusão da ideologia da classe dominante uma vez que, em sua maioria, são conteúdos de cunho político e que, por sua natureza, apresentam uma falsa representação da realidade. Constatou-se também que o EdgeRank é um sistema que propicia a difusão das fake news pois é responsável por realizar uma espécie de controle editorial e ordenar o conteúdo no feed de notícias dos usuários, selecionando em diversas ocasiões fake news como relevantes. Também se evidenciou que o Facebook se beneficia com a propagação de fake news e consequentemente com a difusão de ideologias, pois é um importante agente para a preservação da forma social capitalista. Conclui-se que o desenvolvimento do trabalho possibilitou uma maior compreensão sobre o tema e que as medidas do Facebook para atenuar a propagação das fake news não tiveram efeito positivo significativo. Ademais, identificou-se uma contradição nessas medidas visto que os meios de comunicação de massa da forma social capitalista possuem o papel de difundir ideologias.",
    "Palavras-chave": "redes sociais virtuais, fake news, ideologia",
    "Introdução": "Um grande problema da sociedade contemporânea é o uso que algumas grandes corporações e Estados estão fazendo das redes sociais virtuais à serviço da preservação do capitalismo, nessas redes encontramos diversas técnicas de dominação da mente humana como: difusão de fake news, filtros-bolha, câmaras de eco, perfis falsos, bots, formadores de opinião, venda de dados para anunciantes etc., influenciam em processos eleitorais, em assuntos de saúde pública, nas decisões do que consumir e até mesmo são capazes de mudar o humor das pessoas. Essas técnicas de dominação são nocivas para o desenvolvimento da humanidade pois representam um atraso para o pleno aumento das capacidades humanas, uma vez que ao invés dessas redes servirem para engrandecimento da humanidade, estão servindo para a destruição do ser humano em uma das coisas que tem de mais importante, sua consciência. O tema da dominação intelectual de usuários de redes sociais virtuais (RSV) ganhou ainda mais relevância na atualidade por conta de diversos eventos que mostraram a capacidade de dominação dessas plataformas sob seus usuários, como o escândalo da Cambridge Analytica, em que 87 milhões de usuários do Facebook tiveram seus dados expostos para utilização na campanha eleitoral norte-americana de 2016 (ANGST; BOGLER, 2019). Além dos relatórios divulgados por Edward Snowden, ex-agente da agência de segurança nacional norte-americana (NSA), que demonstram como esta realiza espionagem, vigilância e controle de pessoas de diversos países por meio de programas como o Prism, XKeyscore e Tempora (FUCHS; TROTTIER, 2017). Apesar das fake news não serem exclusividade das plataformas de RSV, são amplamente difundidas nestas redes e isso tem gerado diversos problemas na sociedade. Seus efeitos podem ser diversos como negacionismo, influência em processos eleitorais, polarização política, até desinformação sobre saúde pública etc. A rede social virtual Facebook é atualmente a maior do mundo em usuários ativos, com cerca de 2,74 bilhões de usuários, além de o grupo Facebook ser proprietário de outras grandes RSVs como o WhatsApp (2 bilhões de usuários), Facebook Messenger (1,3 bilhões de usuários) e Instagram (1,221 bilhões de usuários) (WE ARE SOCIAL, 2021). Nesse trabalho, por conveniência, estudaremos o Facebook por sua predominância em número de usuários ativos no momento que essa monografia é escrita. Um dos principais recursos presentes no Facebook é seu feed de notícias por ser uma área da plataforma com grande destaque em que o usuário recebe novos conteúdos selecionados de forma personalizada pela RSV. O conteúdo exibido no feed de notícias é selecionado pelo sistema de recomendação EdgeRank, este sistema utiliza algoritmos proprietários cujo conteúdo não é revelado para escrutínio público. Para auxiliar nesse estudo sobre a manipulação do pensamento na RSV foi realizada uma pesquisa bibliográfica com objetivos exploratórios, com finalidade de aumentar a compreensão sobre o conceito de ideologia sob uma perspectiva marxista e verificar se as fake news difundidas nessas redes realmente são ideologias e quais segmentos da sociedade possuem interesse na sua difusão.",
    "Conclusão": "O desenvolvimento deste trabalho possibilitou uma maior compreensão acerca do sistema de recomendação EdgeRank do Facebook e como esse sistema tem propiciado a difusão das fake news e, portanto, beneficiado o Facebook e o sistema capitalista como um todo com a difusão de ideologias. A principal contribuição desse trabalho, a nosso juízo, foi a constatação de que as fake news estão intimamente relacionadas com o conceito de ideologia sob uma perspectiva marxista, pois representam uma falsa expressão da realidade e são úteis para o sistema capitalista uma vez que servem como forma de justificação dos interesses da classe dominante. Sendo assim podemos verificar que não são os usuários que clamam por conteúdo alienante, mas principalmente porque a classe dominante (detentoras dos meios de produção material e intelectual) é a responsável por ofertar massivamente esse tipo de notícia, promovendo a manipulação dos usuários sobre o que pensar e secundariamente influenciando, com certos limites, na conservação da produção do sistema capitalista. Verificamos que os critérios utilizados no sistema de recomendação EdgeRank ainda permitem uma ampla difusão de fake news na RSV Facebook e que, apesar das medidas adotadas pela empresa para atenuar a difusão de essas notícias, não foi possível verificar uma diminuição significativa, uma vez que fake news continuam sendo amplamente difundidas. Ademais, constatamos que essas medidas representam uma contradição pois o papel principal de um meio de comunicação de massa na forma social capitalista é secretar ideologias. Também verificamos durante o trabalho que para Silva (2017) não é possível impedir a difusão da ideologia dominante em uma sociedade dividida em classes sociais e que, portanto, a ideologia da classe materialmente dominante continuará sendo secretada pelos principais meios de difusão de ideias da sociedade, sendo assim, para que as ideias e crenças da classe dominante parem de ser representadas como interesses gerais da sociedade, será necessário que não exista mais classes dominantes, ou seja, que a sociedade não seja mais dividida em classes sociais. Este estudo limitou-se em utilizar como referência principal os estudos de Ludovico Silva por isso sugere-se em estudos futuros a análise das fake news difundidas nas redes sociais virtuais por meio de sistemas de recomendação sob perspectivas de outros autores. Outra limitação do estudo foi o fato dos sistemas de recomendação do Facebook não serem abertos para escrutínio público o que dificulta a análise técnica sobre o funcionamento dos algoritmos implementados pela plataforma. Neste TCC escolhemos analisar somente as fake news e o sistema de recomendação EdgeRank da empresa Facebook, mas certamente as formas de manipulação não se encerram no fenômeno das fake news selecionadas pelo meio técnico EdgeRank, dessa forma sugere-se maior aprofundamento em outras formas de manipulação dos usuários como os filtros-bolha, bots, venda de dados para anunciantes, perfis falsos, influenciadores digitais etc. Também recomendamos pesquisas em outras redes sociais virtuais de modo a verificar se o mesmo identificado no Facebook se aplica a outras redes e modelos de negócios."
}