{
    "Autor": "Guilherme Vaz da Silva",
    "Título": "NOVAS PRÁTICAS UTILIZANDO REALIDADE AUMENTADA NO ENSINO DE BIOLOGIA EM ESCOLAS DE ENSINO FUNDAMENTAL",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.(a) Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho tem como objetivo investigar a aplicação da Realidade Aumentada (RA) e das Tecnologias da Informação e Comunicação no contexto educacional, mais especificamente em aulas de Biologia para alunos do ensino fundamental até 5° série, a partir da utilização de material já desenvolvido na Universidade Federal de Santa Catarina (UFSC), junto ao Laboratório de Tecnologias Computacionais (LabTec). A rápida evolução tecnológica e o crescente acesso a dispositivos móveis proporcionaram novas oportunidades para o ensino e aprendizagem, possibilitando a criação de ambientes educacionais mais dinâmicos e interativos. A RA é uma tecnologia que combina elementos do mundo real com elementos virtuais, proporcionando uma experiência imersiva aos usuários. Neste estudo, exploramos como a RA pode ser utilizada para enriquecer o ensino de biologia, proporcionando aos alunos uma compreensão mais profunda e significativa dos conceitos abordados em sala de aula. Além disso, as TI desempenham um papel fundamental nesse contexto, fornecendo as ferramentas e recursos necessários para a implementação da RA. Através de aplicativos e softwares específicos, é possível criar modelos tridimensionais interativos, simulações e jogos educativos que ajudam os alunos a visualizar e manipular estruturas biológicas complexas, tornando o processo de aprendizagem mais envolvente e estimulante. Desta forma será mostrado os resultados de um plano de aula na disciplina de Biologia que foi desenvolvido junto a uma instituição de ensino fundamental, sediado no município de Gravataí no estado do Rio Grande do Sul para assim demonstrarmos o resultado dessa pesquisa aplicada de caráter exploratório utilizando metodologia de análise de dados qualitativa em uma turma do 7° ano com 31 alunos. Os resultados obtidos demonstraram o quão positivo é a utilização de novas tecnologias como a RA no ensino-aprendizagem, a partir de questionário aplicado antes e depois, junto a depoimento dos alunos. Estes resultados demonstram que a maior parte dos alunos concordam que a aula de biologia se torna muito mais interessante junto as interações e possibilidades que a realidade aumentada traz ao ambiente de ensino.",
    "Palavras-chave": "Biologia; Realidade Aumentada; Tecnologias da Informação e Comunicação; Educação; Ensino e Aprendizagem",
    "Introdução": "A crescente evolução das Tecnologias da Informação e Comunicação (TIC) vem trazendo consigo uma enorme bagagem de conhecimento e aplicações, estas que frequentemente são utilizadas no cotidiano das pessoas, desde ao momento em que acordam a rotinas normais, tudo isso aliando tecnologia e praticidade, como automações residenciais unidas a Inteligência Artificial. Também podemos acrescentar que durante a pandemia tivemos um período em que houve uma crescente utilização de novas tecnologias e a evolução de algumas outras trazendo uma melhor comunicação e transmissão de dados como áudio e vídeo, assim como foi necessário repensar nossas práticas de ensino aprendizagem, aliando as TIC ao estudo a distância. A partir do retorno as aulas presenciais foram realizadas adaptações a utilização das tecnologias para dentro das salas de aula, estas que hoje podem trazer uma dinâmica maior as disciplinas na área das ciências da natureza, com a utilização da RA, entregando uma experiencia imersiva e interativa aos alunos junto ao assunto abordado. Em um esforço para encontrar abordagens inovadoras de ensino na educação, em que o objetivo é despertar o interesse e a curiosidade dos alunos, torna-se cada vez mais crucial estabelecer conexões entre diferentes áreas do conhecimento, relacionar os conteúdos ministrados em sala de aula com a vida dos estudantes e garantir que a aprendizagem seja uma experiência estimulante e gratificante (DUARTE, 2018). Devido a integração da tecnologia da informação e comunicação, os educadores podem utilizar recursos digitais, como aplicativos, plataformas online e dispositivos móveis, para criar experiências de aprendizagem enriquecedoras e colaborativas. A combinação dessas tecnologias traz um novo horizonte para a educação, permitindo que os alunos explorem conceitos complexos, desenvolvam habilidades práticas e se envolvam de forma ativa na construção do conhecimento. Com a evolução das Tecnologias de Informação e Comunicação (TICs), têm surgido transformações e avanços nos métodos convencionais de ensino. A incorporação das tecnologias tem viabilizado uma aprendizagem mais impactante, alterando a maneira pela qual o conhecimento é transmitido entre educadores e estudantes dentro do ambiente escolar (PRENSKY, 2012). Assim, pode-se dizer que as TIC “afetam praticamente todos os âmbitos de atividade das pessoas, desde as formas e práticas de organização social até o modo de compreender o mundo, de organizar essa compreensão e de transmiti-la para outras pessoas” (COLL; MONEREO, 2010) Portanto a busca por demonstrar que a utilização da RA na construção de novas práticas de ensino aprendizagem se tornam cada vez mais próximos e viáveis nos ambientes escolares. GONÇALVES, Ruan Lopes et al. (2019) se referem a distribuição e como utilização das denominadas “novas tecnologias” têm sido objeto de políticas sociais e educacionais. Televisores, data-shows, lousas eletrônicas, tablets e aparelhos de som são alguns dos artefatos disponibilizados nas instituições de ensino acompanhados, geralmente, de um discurso que determina a inserção de artefatos eletrônicos e aplicativos digitais à melhoria da qualidade do ensino e à inovação do processo ensino-aprendizagem. Atualmente, a realidade aumentada é empregada de diversas maneiras, abrangendo diversos setores e áreas de aplicação, como educação, entretenimento e jogos, setores imobiliários, saúde, design e turismo.",
    "Conclusão": "A aplicação do material de Realidade Aumentada no ensino do mecanismo celular e biologia celular apresentou resultados promissores e abre novas possibilidades de utilização no campo da educação. A pesquisa e o estudo das relações entre a realidade aumentada e as técnicas de ensino-aprendizagem forneceram uma base sólida para o desenvolvimento de um plano de aula em parceria com o professor(a) da disciplina de biologia. Através do uso de um aplicativo e dispositivo compatível com realidade aumentada, foi possível implementar o plano de aula e oferecer aos alunos uma experiência imersiva e interativa no estudo do mecanismo celular e da biologia celular. A realidade aumentada proporcionou uma visualização tridimensional dos conceitos abstratos, permitindo uma compreensão mais profunda e significativa dos processos celulares. Os resultados das aplicações de tecnologias de realidade aumentada revelaram um aumento no engajamento dos alunos, bem como uma melhoria na retenção e aplicação dos conhecimentos adquiridos. A interatividade e a possibilidade de manipulação virtual dos elementos celulares contribuíram para o desenvolvimento de habilidades práticas e cognitivas dos estudantes. Além disso, a utilização da realidade aumentada despertou o interesse dos alunos pela biologia celular, tornando o aprendizado mais estimulante e motivador. A visualização realista dos componentes celulares e dos processos biológicos proporcionou uma conexão mais tangível entre a teoria e a prática, ampliando a compreensão dos alunos sobre a importância e relevância desses temas. Aplicar essa tecnologia traz consigo um dos maiores desafios: preparar os professores para sua utilização. Muitos professores não nasceram na era digital e podem sentir dificuldades e medo ao se depararem com essas inovações. Portanto, o uso da Realidade Aumentada exige que os professores adotem uma nova perspectiva pedagógica e se adaptem a esse novo conceito, tornando a educação mais colaborativa. Os resultados da pesquisa nos trouxeram uma visão melhor da estrutura e adaptação da realidade aumentada junto a uma instituição de ensino particular que possui um ambiente adequado para tal aplicação, como conexão à internet adequada, dispositivos compatíveis com a tecnologia, assim como interesse em trazer novas metodologias de ensino, engajando mais seus alunos e tendo um diferencial no ensino comparado a outras instituições. Também vale salientar o interesse da instituição de ensino em realizar adaptações e evolução em seu plano de aula, utilizando-se das tecnologias de RA junto ao ensino tradicional, fomentando ainda mais a prática e inclusão, após a aplicação, assim tendo êxito em nossa pesquisa pois o objetivo era conseguir demonstrar que o ensino aliado a tecnologia de realidade aumentada traz maior interesse aos alunos e dessa forma também beneficiando a escola. Portanto, a aplicação do material de Realidade Aumentada no ensino do mecanismo celular e biologia celular mostrou-se uma abordagem eficaz e inovadora, capaz de aprimorar o processo de ensino-aprendizagem e estimular o interesse dos alunos. Os resultados obtidos apontam para a necessidade de explorar ainda mais as possibilidades dessa tecnologia na educação, visando aperfeiçoar a forma como os conteúdos complexos são ensinados e assimilados, proporcionando uma educação mais dinâmica, envolvente e eficaz. A ideia de incorporar a Realidade Aumentada na educação é empolgante e revolucionária, pois tem um impacto significativo na aprendizagem. No entanto, muitos professores têm dificuldades em aceitar e aplicar essa prática devido à falta de capacitação profissional em relação às novas tecnologias. Como resultado, eles optam por utilizar apenas os métodos de ensino tradicionais, pois não se sentem seguros o suficiente para explorar as possibilidades da Realidade Aumentada. No entanto, ao observar os resultados positivos alcançados por instituições de ensino particulares que possuem os recursos adequados, fica evidente que a utilização da Realidade Aumentada no processo de aprendizado é viável. Para projetos futuros, recomenda-se o uso do aplicativo Zappar devido à sua facilidade de uso, compatibilidade e disponibilidade gratuita. Seria interessante aplicá-lo em outras áreas de ensino, como física, química, matemática, português e até em outras disciplinas relacionadas à ciência. Isso ampliaria ainda mais o conhecimento e a interação dos alunos com a Realidade Aumentada, proporcionando benefícios ao processo de ensino-aprendizagem. Além disso, também seria válido explorar o uso da Realidade Virtual nessas mesmas áreas mencionadas, pois, com essa tecnologia, os conteúdos se tornam mais atraentes e aprimoram o aprendizado dos alunos."
}