{
    "Autor": "Moisés Tomazi",
    "Título": "A Estratégia Nacional de Ciência, Tecnologia e Inovação 2016-2019 e as Políticas de Financiamento para Tecnologia e Inovação",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá, SC",
    "Orientador(a)": "Paulo Cesar Leite Esteves",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho tem como objetivo analisar a ENCTI 2016 e identificar as principais ações elencadas para o desenvolvimento da Ciência, Tecnologia e Inovação e quais as modalidades e mecanismos de financiamento disponíveis no Brasil para implementar os programas e projetos definidos como estratégicos para CT&I. Inicialmente foi realizada uma pesquisa bibliográfica e documental sobre os conceitos básicos de tecnologia e inovação, Sistema Nacional de Ciência Tecnologia e Inovação e a estrutura legal do setor. Na sequência foram apresentadas as principais agências de fomento para CT&I existentes no Brasil, os cinco pilares fundamentais e suas ações prioritárias e os onze temas estratégicos e as respectivas estratégias associadas que estruturam a ENCTI 2016-2019. Também foram apresentadas as principais modalidades e mecanismos de financiamento disponíveis para apoio aos programas e projetos de CT&I no Brasil. Conclui-se que a foco central para alavancar o desenvolvimento da CT&I no Brasil é a expansão, consolidação e integração do Sistema Nacional de CT&I, e que umas das ações prioritárias é a ampliação da capacidade de financiamento do FNDCT. As principais modalidades de apoio financeiro disponíveis são o financiamento reembolsável, financiamento não-reembolsável e investimento, sendo que os instrumentos utilizados para a alocação dos recursos são: Concessão de Bolsas; Concessão de Auxílios à pesquisa e à Infraestrutura; Subvenção Econômica, Empréstimos, Renda Variável; Compra do Estado com Margem de Preferência Local; Encomenda Tecnológica; Incentivos Fiscais; Bônus Tecnológico; Títulos Financeiros; e Cláusula de PD&I de Agências Reguladoras.",
    "Palavras-chave": "ENCTI 2016, Políticas de Financiamento, Tecnologia, Inovação.",
    "Introdução": "Para que se possa desenvolver novas soluções tecnológicas e produtos inovadores, precisa-se de mais investimentos e o fortalecimento das parcerias entre o governo, instituições de ensino e empresas. De acordo com a Estratégia Nacional de Ciência Tecnologia e Inovação – ENCTI (2016-2019), o investimento em Ciência, Tecnologia e Inovação (CT&I) é visto em nível mundial como peça fundamental para alavancar o crescimento econômico dos países, gerando mais empregos e desenvolvendo as habilidades humanas, tendo o apoio de grandes pensadores, dos gestores das grandes corporações e dos líderes políticos em todo mundo (ENCTI, 2016). Presencia-se em alguns países uma notável ampliação do conhecimento científico nas áreas de automação, microeletrônica e informatização. Esse fato ocorreu, primeiramente, em um grupo reduzido de países, tais como: Estados Unidos, Japão, Alemanha e recentemente Coréia do Sul e China, refletindo diretamente no aumento da produtividade e redução dos custos unitários de produção desses países (ENCTI, 2012). Visto o desenvolvimento dos países citados acima, que são referência em tecnologia e inovação e a velocidade em que as mudanças tecnológicas ocorrem, o Brasil necessita de políticas de financiamento atuantes para o setor de CT&I e um grande esforço para que se avance na geração e utilização do conhecimento técnico - cientifico. De acordo com a Estratégia Nacional de C,T&I 2012-2015, O desenvolvimento econômico dos Países tem por base, cada vez mais, na inovação e no desenvolvimento científico e tecnológico. Com esse entendimento vários Países, a exemplo de Estados Unidos e China, têm colocado a inovação e o apoio a P& D como eixos centrais de suas estratégias de retomada do crescimento, de enfrentamento de crises e de promoção do crescimento no longo prazo. De uma maneira geral, nas políticas governamentais de C,T&I mantem-se focadas tanto no fortalecimento da base científica e tecnológica quanto na ampliação da capacidade de inovação do setor empresarial.",
    "Conclusão": "Para o desenvolvimento desse trabalho, inicialmente, foi realizado uma pesquisa bibliográfica e documental sobre os principais conceitos referentes à tecnologia e inovação, Sistema Nacional de Ciência Tecnologia e Inovação e a legislação do setor: Lei de Inovação, Lei do Bem e o Novo Marco Legal da Ciência, Tecnologia e Inovação. No segundo momento, foram apresentadas as principais agências de fomento para CT&I existentes no Brasil, que são: CNPq, CAPES, FINEP e BNDES, sendo apresentada também a FAPESC, Fundação de Amparo à Pesquisa e Inovação do Estado de Santa Catarina. Após a contextualização inicial, foi analisada a Estratégia Nacional de Ciência, Tecnologia e Inovação (2016-2019) para identificar quais as principais ações estratégicas contidas no documento para o desenvolvimento da Ciência, Tecnologia e Inovação, no Brasil, e quais as principais políticas de financiamento disponíveis para implementar essas ações. Um dos principais desafios apresentados na ENCTI é posicionar o Brasil entre os países mais desenvolvidos em CT&I. O atingimento desse objetivo é de suma importância, pois o desenvolvimento em CT&I é uma importante ferramenta para a geração de novas oportunidades de renda, aumento na produção e na agregação de valor a produtos e serviços. O desenvolvimento dos países está, cada vez mais, ligado ao quanto é investido em inovação e no desenvolvimento científico e tecnológico. As principais economias mundiais investem maiores percentuais em P&D, como por exemplo, a Coréia do Sul que em 2013 investiu 4,15% do seu PIB enquanto o Brasil investiu 1,24%. Para atingir esse objetivo a meta estabelecida é investir 2% do PIB Brasileiro em P&D (ENCTI, 2016). O Eixo Estruturante da ENCTI é a expansão, consolidação e integração do Sistema Nacional de CT&I, que destaca como um dos pilares fundamentais a ampliação do financiamento para o desenvolvimento da CT&I. Esse pilar é de suma importância, pois é através dos recursos financeiros que são colocadas em prática todas as ações planejadas para o desenvolvimento em CT&I. Para isso, umas das ações prioritárias contidas na ENCTI é a recuperação da capacidade de financiamento do FNDCT. As principais agências de fomento do SNCTI são a financiadora de Estudos e Projetos – Finep e o Conselho Nacional de Desenvolvimento Científico e Tecnológico – CNPq. Completam as agências de fomento do SNCTI, a Coordenação de Aperfeiçoamento de Pessoal de Nível Superior – CAPES, o Banco Nacional de Desenvolvimento Econômico e Social – BNDES e as Fundações de Amparo a Pesquisa – FAP. Políticas de financiamentos bem estruturadas e atuantes são peças fundamentais para o desenvolvimento da CT&I, pois sem o apoio financeiro adequado todas as estratégias traçadas para o desenvolvimento do setor não surtirão o efeito desejado. Outro fator muito importante a ser destacado para que Brasil de um salto no desenvolvimento científico e tecnológico e eleve a competitividade de seus produtos e processos é a participação de investimentos por parte das empresas e demais instituições privadas. No Brasil, as principais modalidades de apoio financeiro disponíveis são o financiamento reembolsável, financiamento não-reembolsável e investimento. Os instrumentos utilizados para a alocação dos recursos do SNCTI são: Concessão de Bolsas; Concessão de Auxílios à pesquisa e à Infraestrutura; Subvenção Econômica, Empréstimos, Renda Variável; Compra do Estado com Margem de Preferência Local; Encomenda Tecnológica; Incentivos Fiscais; Bônus Tecnológico; Títulos Financeiros; e Cláusula de PD&I de Agências Reguladoras. Visto a importância do tema em questão, trabalhos futuros podem abordar o monitoramento da Estratégia Nacional de CT&I (2016) e se as políticas de financiamento estão adequadas e suficientes para posicionar o Brasil entre os países mais desenvolvidos em CT&I."
}