{
    "Autor": "Josue Mupenza Mupenza",
    "Título": "O ensino e estudo de Inteligência Artificial num país francófono utilizando o sistema tutor inteligente MAZK",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Constata-se hoje em dia uma troca global de conhecimento, onde um estudante que tem possibilidade financeira se encontra em solo estrangeiro apenas pela busca de conhecimento e os que não tem morrem sem. O presente trabalho trata-se de possibilitar o ensino e estudo de Inteligência Artificial num país francófono utilizando o sistema tutor inteligente MAZK. Para alcançar os resultados foi feito uma pesquisa exploratória e qualitativa e foi aplicado um questionário com dois grupos de alunos do curso da Gestão Informática do Instituto Superior da Informática Programação e Análise, grupo 1 com uma efetiva de 10 aprendizes e o segundo grupo contou com 8 aprendizes, depois de ler o material, responderam às perguntas e o sistema gerou um percentual total de erros e acertos. E o mesmo foi aplicado para os aprendizes de Tecnologias da Informação e Comunicação da Universidade Federal de Santa Catarina constata-se com a participação de 15 aprendizes percebe-se 68% de acertos e 32% de erros e logo depois foi elaborado perguntas sobre os o conteúdo abordado e o software educacional utilizado. Conclui-se, assim, que o sistema cumpre seus objetivos e é possível disponibilizar e traduzir o software em francês e ainda mais línguas, também torna mais efetivo e eficiente o aprendizado, tornando a avaliação do professor mais justa para o aluno, pela riqueza dos detalhes apresentados pelo MAZK, gerando valor para a sociedade como um todo também é possível o acesso e compreensão no STI.",
    "Palavras-chave": "MAZK, Ensino e Aprendizagem, Traduzir Mazk para Frances.",
    "Introdução": "A aprendizagem é uma das atividades mais ricas desempenhadas pelo ser humano, lhe proporcionando a assimilação de conhecimentos novos. Um dos contextos mais envolventes, onde se realiza a aprendizagem, é a 'sala de aula'. Neste contexto, pode-se verificar o desenvolvimento do processo de ensino-aprendizagem, onde o professor desempenha o seu importante papel (Azevedo, 2001). Segundo Tavares (2001), para auxiliar em seu trabalho com os alunos, professores e educadores utilizam diversos recursos para ajudá-los no processo de ensino-aprendizagem. Entre alguns destes recursos, pode-se citar: livro didático, televisão, vídeos, etc. Porém, com os avanços tecnológicos que ocorrem dia após dia, é necessário que cada vez mais, haja a utilização de novos recursos. Um dos mais recentes recursos, que vem sendo utilizado com esta finalidade, é o computador. Neste contexto, o computador é visto como um instrumento didático. Uma das formas de utilização do computador na educação é através de software educacional, um software para auxiliar um estudante no aprendizado de um determinado conteúdo. Um software educacional, também, possui o objetivo de auxiliar o professor, fazendo com que o mesmo tenha a seu dispor, um valioso recurso. (Breno F. T. Azevedo, 2001) Com avanço das tecnologias percebe-se diversos tipos de softwares educacionais clássicos (expositivos e tutoriais), portanto a necessidade é grande, mas constata-se a falta de softwares educacionais mais elaborados, como os Sistemas Tutores Inteligentes. Estes sistemas representam uma importante ferramenta no processo de ensino-aprendizagem. A Francofonia refere-se em primeiro lugar ao conjunto de pessoas que partilham uma língua comum: o francês. O presente trabalho tem como objetivo disponibilizar o Sistema Tutor Inteligente MAZK na versão francesa abordando, especificamente, os conteúdos da disciplina de Inteligência Artificial para que estes sejam acessados pelos francófonos. O software pode ser acessado em qualquer lugar do mundo sem restrição, a partir do seu celular, computador e qualquer dispositivo desde que possua um navegador e acesso à internet. Devido a esta possibilidade, um possível obstáculo seria a língua, sendo assim, para disponibilizar acesso e compreensão pelos estudantes francófonos, surgem as perguntas: é possível adaptá-lo para ensinar esta matéria? E como fazê-lo?",
    "Conclusão": "O presente capitulo tratará de uma conclusão nos que foram definidos nos objetivos desse trabalho. Emprestando as palavras do (Canal & Pereira, 2018), percebe-se que o MAZK possibilita a construção de competências favoráveis ao educador no processo de trocas e de assimilação do ensino aprendizagem, agindo como facilitador do processo. É um instrumento que pode ser utilizado com a finalidade de instigar a interação dos estudantes perante as aulas ministradas pelo professor, sendo possível a aplicação dos conhecimentos adquiridos por meio de atividades mais interativas. Torna-se possível, então, a concretização e a idealização dos objetivos propostos pelo professor, facilitando o entendimento dos conceitos. Pode se dizer que é possível traduzir o sistema Tutor Inteligente MAZK para o francês, com base num arquivo gerado pelo próprio sistema que contém todas as palavras existentes no software consegue-se traduzir cada uma delas para o francês justamente para que o MAZK seja acessado pelos estudantes que fala francês. Depois de traduzir o sistema, foi elaborado o conteúdo para disponibilizar aos estudantes da disciplina de Inteligência Artificial da Universidade federal de Santa Catarina e do Instituto Superior da Informática Programação e Análise. Com isso, foi possível elaborar conteúdos e disponibiliza-lo em duas línguas. O STI MAZK foi capaz de ser o mediador entre o professor e aluno e também reproduzir transferir para um a vida virtual, todo contexto de uma sala real. preparou-se o software educacional para explanações exemplos e salas virtuais, formando assim um material a ser disponibilizado à grupos ou turma de estudantes que vão ter acesso a sala através de um código que o sistema gera, sempre controlado pelo professor que acompanha o desempenho dos seus alunos. O conteúdo sobre Inteligência Artificial foi aplicado com alunos no Brasil e no exterior, em francês e português, para os francófonos houve a participação de 18 alunos, obteve-se nas 7 perguntas uma taxa de acerto de 44.59% e a taxa de erro de 9.41%. Respostas corretas 83% e erradas 17%. Para os lusófonos participaram 15 alunos com taxa de acerto de 66.35% e de erro foi 31.65%. Resposta corretas 68% e erradas 32%. Para verificar a percepção dos aprendizes sobre a utilização do MAZK e sobre o conteúdo abordado. Elaborou-se 4 perguntas pelo Google Form, onde três objetivas e uma descritiva, para que os aprendizes possam opinar. A primeira pergunta foi 'Qual é a facilidade de acesso?', dos lusófonos, 10 alunos responderam nessa questão, 30% afirmaram que o MAZK é muito difícil de utilizar e 20% disseram que é muito fácil de utilizar e dos francófonos, 17 responderam 41.2% que o STI MAZK é muito difícil de utilizar e 11.8% acharam muito fácil e simples de utilizar. Segunda pergunta 'O que achou do conteúdo abordado?', 11 alunos responderam, as opções de respostas foram de tipo Péssimo, Regular, Bom e Ótimo, 72.7% disseram que o conteúdo abordado é bom, 9.1% escolheram a opção de resposta Ótimo e 18.2% Regular, e para os francófonos participaram 17 alunos, 70,6% disseram que o conteúdo foi Ótimo e 29,4% Bom. A terceira 'Encontrou dificuldade na navegação do conteúdo?', com resposta esperada de tipo Sim ou Não. Para os lusófonos participaram 11 alunos responderam Sim 63,6% e Não 36,4%, e os francófonos, com o mesmo número de participação dos alunos 64,7% para Não e 35,3% Sim. E a última pergunta, foi aberta onde os estudantes deram opiniões, sugestões para melhoria e suas motivações no Sistema Tutor Inteligente MAZK e parabenizaram também a iniciativa. Para trabalho futuro, sugere-se que também as tags sejam traduzido em outras línguas no MAZK, que o sistema tenha na tela inicial um vídeo que explique como usar ele ou as ferramentas que possui, que no bate papo haja uma interface de tradução que quando alguém escreve em português um francófono pode ler isso em francês e responder e o brasileiro por sua vez vê a mensagem na sua língua. Para realizar esse trabalho, a principal dificuldade encontrada foi em relação a aplicar no Congo, pois lá os alunos enfrentam problemas com Internet, como já mencionado. Para eles também foi difícil começar a navegar com MAZK, foi necessário elaborar um cursinho explicando o passo a passo de como utilizar o software. Por meio dessa pesquisa, afirma-se que foi adquirido bastante conhecimento pratica, de como por exemplo, na tradução do software fato este, que permite que o Sistema Tutor Inteligente MAZK seja traduzido por outras línguas. Conclui-se, assim, que o sistema cumpre seus objetivos e é possível disponibilizar ainda mais línguas, também torna mais efetivo e eficiente o aprendizado, tornando a avaliação do professor mais justa para o aluno, pela riqueza dos detalhes apresentados pelo MAZK, gerando valor para a sociedade como um todo também é possível o acesso para todos. Esta pesquisa traz uma satisfação por ter lidado com a maioria parte do nosso estudo sem alegar ter esgotado esta questão de procurar. Somos, portanto, únicos responsáveis pelas possíveis imperfeições de substância e forma que podem estar contidas neste trabalho. No entanto, pede-se indulgência por parte dos leitores e, portanto, fica abertos a todas as observações e sugestões construtivas, dada a imperfeição de qualquer trabalho humano."
}