{
    "Autor": "Andrei Henrique dos Santos Savi",
    "Título": "Ferramentas para ilustrações digitais de imagens vetoriais e bitmaps com tecnologias livres ou gratuitas para o ambiente acadêmico e profissional",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Mendonça Lunardi",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho tem, como enfoque, maneiras de desenvolver ilustrações digitais através de ferramentas de software com tecnologias livres ou gratuitas, com intuito de tornar os mesmos acessíveis a interesses profissionais e acadêmicos . Foi necessário conceituar as tecnologias livres e a ilustração física e digital de imagens bitmaps e vetoriais. Apresentar softwares proprietários e softwares com tecnologias livres ou gratuitas utilizados na área e realizar um benchmarking com as ferramentas de software com tecnologias livres ou gratuitas, avaliando suas possíveis áreas de aplicação. Realiza-se uma pesquisa básica estratégica, com o objetivo descritivo e exploratório e com um procedimento qualitativo, mediante a verificação documental e bibliográfica. Constatou-se a existência de ao menos um software com tecnologias livres para o desenvolvimento vetorial, e um para o desenvolvimento bitmap, que se aproximam da equiparação aos softwares proprietários confrontados. Concluiu-se que o uso de softwares livres ou gratuitos, torna possível a ascensão de novos ilustradores na área da ilustração digital, estando disponíveis neste trabalho, estes softwares e suas áreas de aplicações recomendadas.",
    "Palavras-chave": [
        "Ilustração Digital",
        "Tecnologias Livres",
        "Software Livre",
        "Ferramentas de Software",
        "Benchmarking",
        "Edição Vetorial",
        "Edição Bitmap"
    ],
    "Introdução": "Há uma necessidade humana primitiva que se baseia na representação de experiências vivenciadas pessoal e coletivamente, através de simbologias, utilizando diversos materiais como meio de gravação (DIGOLO; MAZRUI, 1988). Conforme relatos de Digolo e Mazrui (1988), as primeiras ilustrações xilográficas surgiram no século XV, no qual passaram a ser registradas e m livros. Contudo, apenas no início do século XVIII, que técnicas como a litografia proporcionaram obras com qualidade de produção aperfeiçoada. No Século XIX as revistas popularizaram-se ainda mais. Uma ilustração é uma imagem com a serventia de sintetizar uma informação ou simplesmente decorar algum elemento (OCVIRK, 2014). Com isso, o auxílio da tecnologia amplia progressivamente todas as etapas que envolvem estes processos de síntese de informação. O ramo da ilustração faz-se cada vez mais presente em aplicações cotidianas (DIGOLO; MAZRUI, 1988).. Frequentes estudos sobre o assunto possibilitaram enormes avanços no desenvolvimento do setor (DIGOLO; MAZRUI, 1988). Com o avanço dos microprocessadores, a área, da ilustração digital começou a ganhar espaço nos meios de comunicação (DIGOLO; MAZRUI, 1988). “O contexto contemporâneo é marcado por enormes avanços tecnológicos, que permitiram a transformação de diferentes tipos de comunicação para o meio digital. ”(STEAGALL, 2008, p.12). Então, entende-se como ilustração digital, qualquer ilustração criada digitalmente, por meio do uso de softwares (DIGOLO; MAZRUI, 1988). O uso da arte digital torna possível a exploração de uma grande área de pesquisa, devido aos softwares efetuarem a simulação de movimentos na ilustração, nos quais seriam impossíveis de se conseguir com uma representação simples (STEAGALL, 2008). As dificuldades de acesso as ferramentas de softwares que possibilitam a manipulação de ilustrações digitais, seja pelo alto custo financeiro necessário para a aquisição dos mesmos, entre outros fatores, em conjunto com o baixo grau de popularidade de ferramentas de software gratuitas, limita a fomentação da criação de conteúdo, de estudo e de desenvolvimento tecnológico pela comunidade (DIGOLO; MAZRUI, 1988). A questão central desse trabalho é apresentar ferramentas de criação e desenvolvimento vetorial e bitmap com tecnologias livres ou gratuitas, sendo elas portadoras de qualidades capazes de suprir as necessidades de desenvolvedores em atividades acadêmicas, profissionais e de acessibilidade suficiente para todos os interessados nas mesmas.",
    "Conclusão": "No início do presente trabalho, partiu-se da ideia de que realizar a pesquisa era relevante para que se propusessem maneiras de desenvolver ilustrações, utilizando-se de ferramentas de software com tecnologias livres ou gratuitas em ambiente acadêmico e profissional. Deste modo, constata-se após a realização da pesquisa, que a relevância de fato, é a mesma que foi proposta, tendo em vista que utilização exclusiva de ferramentas do software proprietárias, torna o desenvolvimento de ilustrações, limitante economicamente em conjunto com a desmotivação gerada ao potencial ilustrador no ingresso a esta área. No projeto, estabeleceu-se como objetivo geral a investigação de ferramentas de softwares voltadas para o desenvolvimento de ilustrações de imagens vetoriais e/ou bitmaps que possuam tecnologias livres ou gratuitas, em conjunto com suas funcionalidades e possíveis áreas de aplicação. Percebe-se, neste momento, que tal meta foi atingida, tendo em vista que ferramentas com essas características foram apresentadas, tal qual como suas características se adequavam para as áreas de aplicação propostas. Como primeiro objetivo específico, definiu-se a conceituação de ilustrações físicas e digitais, de imagens bitmaps e vetoriais e de tecnologias livres. Este, foi atingido no embasamento teórico e pesquisa bibliográfica de autores que compactuavam com as intenções propostas por este trabalho. Em seguida, objetivou-se a apresentação de softwares líderes de mercado e softwares com tecnologias livres ou gratuitas, utilizadas na área de desenvolvimento vetorial e bitmap. Nota-se que este foi alcançado, na pesquisa documental e na apresentação descritiva de ferramentas que condiziam com estas características. Como último objetivo definido, pretendeu-se a realização de um Benchmarking com estes softwares, avaliando suas possíveis áreas de aplicação. Com isso, este objetivo foi atingido na execução de dois benchmarkings e na apresentação dos resultados, no qual avaliou-se e indicou-se as possíveis áreas de aplicação que seriam apropriadas aos mesmos. A pesquisa partiu da seguinte problemática de pesquisa: “Quais as ferramentas de softwares voltadas para o desenvolvimento de ilustrações de imagens vetoriais e/ou bitmaps que possuem tecnologias livres ou gratuitas, em conjunto com suas funcionalidades e áreas de aplicação?”. Então, após a coleta de dados e análise das informações, concluiu-se que o desenvolvimento de ilustrações como estas, torna possível a ascensão de novos ilustradores na área da ilustração digital, movimentando o exigente mercado de ilustrações, estando também, disponíveis neste trabalho, estas ferramentas e áreas nas quais há a possibilidade de aplicação das mesmas."
}