{
    "Autor": [
        "Jaaziel Lopes",
        "Varner Silveira Cardoso"
    ],
    "Título": "ESTUDO DE VIABILIDADE DE UMA REDE SOCIAL PARA FOMENTAR O DESENVOLVIMENTO DE IDEIAS INOVADORAS E DE GRUPOS DE RELACIONAMENTO DISPOSTOS A COLABORAR",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá - SC",
    "Orientador(a)": "Profª Drª Andréa Cristina Trierweiller",
    "Coorientador(a)": null,
    "Resumo": "Nos dias atuais, a inovação surge de maneira essencial; como processo contínuo e sistemático de uma organização. Ao que se observa, iniciativas para fomentar a geração de ideias com potencial de inovação são fundamentais para transpor as barreiras de recursos limitados da realidade brasileira, unindo pessoas com interesses em comum. Nesse sentido, tornou-se necessário reduzir a distância do encontro entre o idealizador e os recursos requeridos para a construção e aplicação de uma ideia inovadora. Dessa forma, esta pesquisa se propõe a investigar a viabilidade da criação de uma aplicação web para mediar a construção de ideias inovadoras, que possibilite a concretização de projetos por meio do fornecimento de recursos necessários. É uma pesquisa de abordagem quali-quantitativa, sua fase qualitativa se refere ao aprofundamento da investigação de referencial teórico sobre o assunto em estudo em temáticas correlatas; com este embasamento, pode ser elaborado um questionário para investigar a predisposição dos sujeitos quanto à viabilidade da criação de uma aplicação web para mediar a construção de ideias inovadoras com vistas a, futuramente, viabilizar a concretização de projetos por meio do fornecimento de recursos necessários, disponibilizados pelas partes interessadas. Para tanto, utilizou-se a pesquisa survey com potenciais usuários e entrevista com especialista. Este questionário incluiu questões abertas, que permitem a livre expressão do respondente e consequentemente, são tratadas de forma qualitativa e ainda, questões fechadas, em que as alternativas estão postas para escolha dos respondentes, gerando tratamento quantitativo. A partir dos resultados obtidos nesta pesquisa, possibilitou-se o aprimoramento da referida aplicação web, em foco. Compreendeu-se que, é importante a inclusão de tags e termos de indexação para facilitar as relações entre usuários. Na entrevista com o especialista surgiram pontos para aprimorar a aplicação, como evitar a “Partida Fria”, ter estratégias de marketing para adesão e divulgação da rede, bem como para obter lucratividade, incentivo financeiro, construir um plano de negócios sólido, e ter parcerias com laboratórios de pesquisa. O questionário online contou com 138 participantes. Houve maior representação, do sexo masculino (56,5%). Foi mais frequente pessoas na faixa etária dos 18 aos 35 anos e solteiros. A maioria significativa se interessou em utilizar (94,9%), mas apontou barreiras, contudo, muitas delas, podem ser minimizadas pelo uso de uma aplicação web, tal qual a analisada neste trabalho. Neste modelo de rede, o usuário poderá encontrar pessoas dispostas a colaborar com suas ideias, de forma intelectual ou financeira; com troca mútua de conhecimento. Na questão 14, percebeu-se a iniciativa e o desejo de criar algo novo para a sociedade, bem como a necessidade de atingir independência financeira e empreender, a partir da geração e da gestão de boas ideias. Acredita-se que, este trabalho é como a “ponta de um iceberg”, que representa algo muito construtivo e inovador a se desenvolver, necessitando o envolvimento da academia, das organizações, públicas ou privadas, bem como do governo.",
    "Palavras-chave": [
        "Inovação",
        "Geração de Ideias",
        "Gestão de Ideias",
        "Aplicação web"
    ],
    "Introdução": "Atualmente, a inovação não é mais considerada como sendo, apenas, de origem tecnológica. A partir do lançamento do Manual de Oslo (OECD, 2005) são considerados quatro tipos de inovação: produto/serviços, organizacional, marketing e de processo. Ou seja, o modelo mental de inovação como estando atrelado somente à produtos tangíveis e tecnologia dá espaço a tipologias que consideram aspectos intangíveis da inovação, isso oportuniza que pequenas e médias empresas possam ter potencial para inovar. Afinal, as inovações também podem ser incrementais e de diversos graus, desde inovações para o mundo – que quebram modelos de negócio e rompem estruturas de mercado – até inovações para o mercado e para a empresa. Nesse cenário, a inovação como processo surge de maneira essencial; pois não pode ser considerada apenas um espaço, mas sim, um processo contínuo e sistemático da organização. Há inúmeros modelos de processos de inovação na literatura; considerando desde a fase inicial de ideação até o lançamento no mercado, alguns estudiosos detalham mais, esse último processo, de comercialização, outros nem tanto. Alguns modelos serão abordados na seção de Revisão de Literatura. Contudo, o cenário político e econômico brasileiro não tem favorecido a longevidade das empresas. Diante disso, muitas ideias com potencial de se tornarem inovação, “morrem”, antes mesmo de qualquer tentativa de lançamento no mercado. As carências são inúmeras, escassas linhas de financiamento para novos projetos, falta de espaço adequado para abrigar startups, insipiente transferência de tecnologia da universidade para as empresas. Ou seja, o modelo de inovação brasileiro agoniza, diante de inúmeras barreiras. Ao que se observa, iniciativas para fomentar a geração de ideias com potencial de inovação são fundamentais para transpor as barreiras de recursos limitados da realidade brasileira, unindo potenciais empreendedores, investidores (anjos) e possíveis colaboradores, que tenham interesse em comum: a geração de ideias e inovação. Nesse sentido, para ultrapassar os obstáculos inerentes à prática da inovação, é necessário encontrar um meio de reduzir a distância entre a efetivação do encontro do idealizador com os recursos humanos, ou investidores, necessários para a construção e aplicação de uma ideia inovadora. A internet se destaca, neste cenário, por possuir inúmeras mídias e meios de comunicação, tais como: e-mails, chats, blogs, vídeos, fóruns e redes sociais. Destes, o que possui a comunicação mais dinâmica, até mesmo englobando o foco dos demais, no senso comum, parece ser a rede social; que propõe uma interação diversificada dos usuários, alimentando a necessidade de utilização da mesma. Sendo assim, uma rede social cuja essência seja a geração de ideias inovadoras, oferece grande potencial para impulsionar uma constante troca de informações, quebrando as barreiras físicas e temporais; fomentando a evolução e a ideação de projetos inovadores. Do ponto de vista teórico, existe um consenso, já estabelecido socialmente, que entende a rede social como facilitadora de formação de colaborações multidisciplinares, por meio da qual interagem os diferentes atores da concretização de um projeto inovador. Estes, podem ser os próprios idealizadores, mas também, profissionais do meio acadêmico, investidores, dentre outras classes. Essa junção pode funcionar como um potente viabilizador da geração, da efetivação e da gestão das ideias e da inovação, de forma que, cada classe participante possa contribuir de forma singular para tal, de acordo com as características do seu perfil na rede (TOMAÉL, 2005). Portanto, a partir desse contexto e das hipóteses desenvolvidas no decorrer desta seção, entende-se a importância do objetivo geral desta pesquisa, disposto a seguir.",
    "Conclusão": "Considera-se que, os objetivos específicos propostos foram atendidos e as ações realizadas, tais como: estudo teórico, mapa mental, entrevista com o especialista e pesquisa de campo. Estes trouxeram contribuições extremamente relevantes para a resolução do objetivo geral desta monografia, que propunha realizar um estudo de viabilidade de uma aplicação web para formar grupos colaborativos em torno de ideias publicadas, utilizando um formato de rede social. Desta forma, com base no que foi disposto na seção anterior (Resultados e Discussão), pode-se concluir que, a criação desta aplicação é viável, e tem potencial de trazer benefícios para os usuários interessados em desenvolver ideias de potencial inovador, de forma colaborativa. Ainda, durante o desenvolvimento desta monografia, a ideia da aplicação evoluiu de maneira significativa, reduzindo as lacunas e estruturando o que, inicialmente, havia sido idealizado pelos detentores da ideia, dos quais um deles, é também, autor deste trabalho. Por fim, por meio do envolvimento do especialista, durante o período da entrevista, estimulou-se buscar, após a conclusão deste estudo, a realização de parcerias com laboratórios de pesquisa da Universidade Federal de Santa Catarina (UFSC), como o LABeGIS (Laboratório de Gestão, Inovação e Sustentabilidade) e com o PPGTIC (Programa de Pós-Graduação em Tecnologias da Informação e Comunicação); onde pode-se encontrar auxílio nos futuros incrementos da aplicação ou ainda, no próprio processo de criação da mesma. Pode-se tomar como exemplo, a utilização de algoritmos desenvolvidos no PPGTIC, que podem ser aplicados na base de dados da rede, minerando e recomendando informações, de forma inteligente, antes de apresentá-las aos usuários. Acredita-se que, este trabalho é, recorrendo a uma expressão figurativa, a “ponta do iceberg” de algo muito construtivo a se desenvolver no meio inovador, envolvendo a academia e as organizações, públicas ou privadas, bem como o governo."
}