{
    "Autor": "Nicolas de Marco Alcalay",
    "Título": "Alimentos e seus sistemas de produção: Integração de tecnologias para identificação biomolecular de alimentos orgânicos e convencionais",
    "Ano de publicação": 2020,
    "Local de publicação": "Araranguá/SC",
    "Orientador(a)": "Prof. Giovani Mendonça Lunardi",
    "Coorientador(a)": null,
    "Resumo": "ALCALAY, Nicolas de Marco. Alimentos e seus sistemas de produção : integração de tecnologias para identificação biomolecular de alimentos orgânicos e convencionais . Curso de Tecnologias da Informação e Comunicação, Universidade Federal de Santa Catarina, Araranguá, 2020. A busca por uma solução que permita a identificação e o reconhecimento de alimentos que carreguem algum tipo de agrotóxico, fertilizante ou pesticida é de utilidade social. Essa liberdade de conferência e validação ao público comum, gera valor ao mercado dos alimentos limpos e aumenta a segurança alimentar para todos indivíduos. Inspirado em soluções de reconhecimento alimentar e molecular já existentes no mercado mundial, esse trabalho será desenvolvido com o intuito de criação de uma nova aplicação que visa melhorar a vida das pessoas com o esclarecimento científico e comprovado sobre as diferenças entre os alimentos orgânicos e convencionais. A partir do conceito e método de identificação dessas soluções, será proposta uma melhoria na maneira como inspecionamos alimentos ao redor do mundo, facilitando e democratizando os processos de controle de qualidade, monitorando produtores e vendedores e controlando com total facilidade a nossa exposição aos agrotóxicos.  O dispositivo entregará soluções nas áreas de alimentos e bebidas, grãos, hortifruti, produtos manufaturados e produtos farmacêuticos.",
    "Palavras-chave": "Agrotóxicos. Orgânicos. Convencionais. Reconhecimento biomolecular. Segurança alimentar.",
    "Introdução": "Historicamente, a produção de alimentos foi desenvolvida em uma matriz orgânica. Originalmente, a prática da agropecuária foi desenvolvida nas proximidades de grandes rios, notadamente o Tigre e Eufrates, além do Nilo, o Ganges e outros. Não por coincidência, foram nessas localidades que surgiram as primeiras grandes civilizações de que se tem notícia, pois a prática da agricultura permitiu o desenvolvimento do comércio graças à produção de excedente. No último meio século, grandes laboratórios químicos e farmacêuticos entraram no mercado da produção de alimentos com soluções que prometem elevar a produtividade em determinadas culturas, mas que deixam uma herança tóxica bastante duvidosa (ESPÍRITO SANTO, 2006). Não bastasse a carga tóxica que os agroquímicos deixam no solo, na água e na saúde das pessoas, pesa sobre os laboratórios a questão ética de produzir agrotóxicos que matam plantas indesejadas, ao mesmo tempo em que produzem “remédios” para combater as patologias oriundas do contato de toda cadeia produtiva com os agrotóxicos. Essa atuação nas duas pontas da cadeia reveste-se de uma ambivalência ética muito questionada no mercado mundial. Desde a década de 1950, quando se iniciou a chamada “revolução verde”, foram observadas profundas mudanças no processo tradicional de trabalho agrícola, bem como em seus impactos sobre o ambiente e a saúde humana. Novas tecnologias, muitas delas baseadas no uso extensivo de agentes químicos, foram disponibilizadas para o controle de doenças, aumento da produtividade e proteção contra insetos e outras pragas. Não se pode negar o crescimento, em termos de produtividade, proporcionado pela difusão de tais tecnologias no campo (MOREIRA et al., 2002). Entretanto, essas novas facilidades não foram acompanhadas pela implementação de programas de qualificação da força de trabalho, sobretudo nos países em desenvolvimento, expondo as comunidades rurais a um conjunto de riscos ainda desconhecidos, originado pelo uso extensivo de um grande número de substâncias químicas perigosas e agravado por uma série de determinantes de ordem social (PERES et al., 2003). Desta forma, a produção convencional é um processo produtivo que visa a larga escala em monoculturas, nas quais ocorre o plantio de uma única espécie, prejudicando a recuperação e manutenção do solo e, para o sucesso da colheita com esse método, se faz necessária a utilização de fertilizantes, agrotóxicos e pesticidas para otimizar o processo de produção agrícola. A agricultura convencional, por se valer de mecanismos e tecnologias artificiais para a proteção da lavoura, é considerada muito agressiva tanto ao meio ambiente quanto à saúde humana (CONSUMO SUSTENTÁVEL, 2005). Agrotóxicos, defensivos agrícolas, pesticidas, praguicidas, remédios de planta, veneno são algumas das inúmeras denominações relacionadas a um grupo de substâncias químicas utilizadas no controle de pragas (animais e vegetais) e doenças de plantas (FUNDACENTRO, 1998).",
    "Conclusão": "Ao longo do desenvolvimento deste trabalho, foi possível perceber que é necessário dedicar muitos esforços para fortalecer o sistema de produção orgânico e que, em que pese o lobby das grandes empresas do veneno, existe espaço para o crescimento da produção orgânica no cenário nacional e internacional. Pensar o sistema de produção orgânica de maneira holística, isto é, considerando todos os elementos que compõem uma produção sustentável em nível ambiental, econômico e social, respeitando assim, os três pilares da sustentabilidade, torna possível aumentar a capacidade produtiva de nossas culturas a fim de escalar a produção e, com isto, diminuir o valor final do produto orgânico. Sendo tecnicamente viável alimentar a humanidade sem a utilização de agrotóxicos e/ou fertilizantes químicos e diante do cenário atual para análise de resíduos de agrotóxicos em alimentos, do aumento, da quantidade e da variedade de produtos químicos aplicados na agricultura convencional, a proposta desse trabalho de conclusão de curso apresenta-se relevante. Poder detectar a presença de agrotóxicos nos alimentos, a fim de que as pessoas possam ter maior controle dos alimentos que consomem, agrega valor ao mercado dos alimentos orgânicos e aumenta a segurança alimentar dos indivíduos. Por estas razões, o dispositivo chega em um momento decisivo em que o consumidor está valorizando e escolhendo como prioridade sua saúde, e em um ambiente propício para se tornar um aliado das boas práticas agrícolas orgânicas. Esta autonomia poderá proporcionar ao consumidor final a possibilidade de decidir, de fato, quais alimentos e qual tipo de alimento adquirir, além de que os órgãos orgânicos certificadores, eventualmente, poderão utilizá-lo para detectar alguma possível irregularidade (contaminação por agrotóxico) em produtores e nos alimentos comercializados como orgânicos. O conceito desenvolvido entrega proteção e controle, como na conhecida frase atribuída a Thomas Jefferson (EXAME, 2018), um dos autores da Declaração de Independência dos Estados Unidos e o terceiro presidente do país (1801-1809): “O preço da liberdade é a eterna vigilância.”"
}