{
    "Autor": "Jones Costa D’avila",
    "Título": "ESTUDO DOS EGRESSOS DOS CURSOS TÉCNICOS DO IFSC CAMPUS ARARANGUÁ: DESENVOLVIMENTO E APLICAÇÃO DE NOVAS TECNOLOGIAS E EMPREGABILIDADE",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo César Leite Esteves",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho consiste em uma pesquisa, cujo objetivo principal é investigar a atual situação dos egressos dos cursos técnicos do Instituto Federal de Santa Catarina, Campus Araranguá em relação à empregabilidade e ao potencial de desenvolvimento e aplicação de novas tecnologias. Assim, a pesquisa parte de uma análise histórico-relacional procurando entender a formação do ensino profissionalizante no Brasil, bem como a situação do egresso na Rede Federal de Educação Profissional e Tecnológica. Para isso, fez-se necessário uma revisão bibliográfica e uma pesquisa na legislação vigente buscando entender as transformações da educação profissional ocorridas no país. Neste contexto, foi realizada uma pesquisa qualitativa, com a utilização de técnicas de coleta de dados como a entrevista e a análise documental. Nesta perspectiva, o estudo tem como principal objetivo identificar o potencial dos egressos em relação à aplicação e desenvolvimento de novas tecnologias, bem como a empregabilidade proporcionada pela conclusão dos cursos técnicos do Instituto Federal de Santa Catarina Campus Araranguá nas empresas da região. Por fim, para complementar o estudo, foi feita uma pesquisa junto aos egressos sobre a adequação e as exigências dos currículos dos cursos em relação às demandas do mercado de trabalho da região.",
    "Palavras-chave": [
        "Cursos técnicos",
        "Egressos",
        "Empregabilidade",
        "Tecnologia"
    ],
    "Introdução": "Atualmente, vive-se em uma sociedade que passa por constantes inovações tecnológicas impactando no modo de vida das pessoas e nas relações de produção e trabalho. Essas novas tecnologias impõem cada vez mais aos indivíduos novos conhecimentos, tornando a informação fator essencial para acompanhar o desenvolvimento tecnológico e para garantir a permanência no mercado de trabalho. Segundo Generoso (2012, p. 27), “vive-se em uma sociedade onde a evolução tecnológica, as transformações nas formas de emprego e as mudanças na vida pessoal, social e profissional são constantes”. Neste sentido, a educação é fator crucial para o entendimento e o posicionamento no mundo do trabalho. Desde a criação da Rede Federal de Ensino Profissional e Tecnológico (EPT), em 1909, houve diversas mudanças nos objetivos educacionais das escolas que compõem a Rede. Inicialmente, com caráter assistencialista, as primeiras escolas profissionalizantes atendiam a parte da população formada pelos desvalidos sociais, buscando inserir no mercado de trabalho a população marginalizada das grandes cidades. Com as transformações ocorridas na sociedade, essas escolas passaram a ampliar suas responsabilidades perante a sociedade formando mão de obra qualificada para o desenvolvimento industrial e tecnológico do país. Com sua expansão a Rede Federal de EPT vem ofertando novas oportunidades para a sociedade, proporcionando conhecimento técnico e tecnológico, ampliando as formas de acesso ao mercado de trabalho e fomentando a criação e desenvolvimento de novas tecnologias em diversas áreas dos setores econômicos do país. Neste sentido, a criação dos Institutos Federais possibilitou novas oportunidades de ensino e formação a camadas da população que não tinham acesso ao ensino profissional. Deste modo, essas instituições assumem um papel importante perante a sociedade, levando ensino profissional e tecnológico de qualidade, contribuindo para o desenvolvimento das economias locais e regionais. Para acompanhar essas transformações e adequar a oferta da educação ao mercado de trabalho e às inovações tecnológicas é necessário o desenvolvimento de mecanismos de avaliação das estruturas educacionais do Instituto Federal de Santa Catarina Campus Araranguá (IFSC-ARU) para possíveis e necessárias adequações às transformações em curso. Neste sentido, os egressos dos cursos técnicos do IFSC-ARU constituem importante fator para o trabalho de acompanhamento e avaliação da estrutura educacional, a fim de potencializar e realimentar os métodos para criação e transformação dos cursos. A pesquisa com os egressos possibilita o levantamento de informações em relação à sua situação no mundo do trabalho, do seu potencial de desenvolvimento e da sua capacidade de aplicação de novas tecnologias na região de Araranguá. Assim, o desenvolvimento da pesquisa encontra justificativa com valor ao contribuir para o processo de planejamento e adequação das políticas educacionais do IFSC-ARU.",
    "Conclusão": "Essa parte do trabalho apresenta as conclusões sobre a pesquisa realizada e algumas recomendações que poderão auxiliar na elaboração de trabalhos futuros sobre o tema discutido, bem como, recomendações pertinentes a mudanças nos cursos estudados. O objetivo geral do trabalho está voltado à análise dos egressos dos cursos técnicos do IFSC-ARU em relação a sua empregabilidade e ao potencial de desenvolvimento de inovações tecnologias. O cumprimento do objetivo geral da pesquisa exige o atendimento aos objetivos específicos propostos. Visando atingir a tais objetivos, indagou-se primeiramente sobre a empregabilidade dos egressos. Através da pesquisa, constatou-se que os cursos técnicos do IFSC-ARU proporcionaram um aumento de 32% no nível de empregabilidade dos egressos dos cursos técnicos preparando assim seus alunos para o competitivo mercado de trabalho. A pesquisa também constatou que após a conclusão dos cursos os egressos obtiveram um aumento de 60% na oportunidade de obter crescimento profissional dentro das empresas onde já estavam trabalhando. Isso evidencia que as empresas da região estão valorizando os profissionais que buscam capacitação e reconhecem a qualidade da formação dos alunos do Instituto. Isso mostra ainda que os cursos técnicos além de aumentarem as chances dos egressos na obtenção de um emprego abrem novas oportunidades para ascensão profissional nas empresas da região. Com relação à aplicação de tecnologia constatou-se que os cursos procuram desenvolver técnicas direcionadas para as indústrias da região. Os dados mostram que 64% dos alunos já aplicaram alguma técnica, método ou procedimento novo na empresa onde trabalha, porém em se tratando do desenvolvimento de produtos nenhum dos entrevistados participou da criação de novos produtos. Os dados são preocupantes, pois mostram que falta ainda um grande caminho a percorrer para formação de alunos inovadores. Neste aspecto verificou-se ainda qual o benefício gerado pela aplicação da tecnologia nas empresas e constatou-se que 44% trouxeram como principal vantagem o aumento na produção e 4% a redução no consumo de insumos. Por fim, para complementar a pesquisa, verificou-se se o nível de exigência de capacitação profissional ministrada nos cursos correspondia às demandas das atividades profissionais exercidas pelos egressos nas empresas, bem como, se os currículos dos cursos estavam também de acordo com as exigências do mercado. Constatou-se que os cursos estão bem adequados à realidade das empresas da região, tanto no que se refere às exigências técnicas quanto ao que se refere aos currículos, sendo que nenhum aluno respondeu que os cursos ou os currículos estão inadequados à realidade das empresas da região."
}