{
    "Autor": "Denis Takao Tominaga",
    "Título": "Impacto do uso de um livro com realidade aumentada no ensino-aprendizagem: um estudo de caso",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª. Eliane Pozzebon",
    "Coorientador(a)": "",
    "Resumo": "A Realidade Aumentada é uma tecnologia emergente que possibilita visualizar, em tempo real, o mundo real sobreposto por objetos virtuais registrados em modo tridimensional. Seu uso abrange desde aplicações voltadas para entretenimento até simulações em treinamentos militares. Na educação, seu uso está inserido no grupo das tecnologias interativas, juntamente com os jogos digitais e a realidade virtual. A presente pesquisa se classifica como exploratória e comparativa, e o seu método de procedimento é o estudo de caso. O trabalho tem por objetivo comparar, em termos motivacionais, dois cenários: uma aula baseada no uso de um livro físico com Realidade Aumentada embutida e outra aula baseada no uso de um livro em formato digital sem o uso da tecnologia de Realidade Aumentada, ministradas a grupos distintos de alunos. Um pequeno livro aumentado com o uso de marcadores fiduciais e outro em formato digital sem o uso de Realidade Aumentada, porém com o mesmo conteúdo informativo, foram desenvolvidos para que fosse possível proceder a essa comparação. O conteúdo dos livros é um breve histórico sobre a evolução da computação. O uso desta tecnologia interativa, no presente estudo, é empregado para visualizar informação em objetos virtuais e para inserção de áudio. A avaliação dos cenários de ensino-aprendizagem, em termos motivacionais, foi realizada por meio do Instruction Materials Motivation Survey. Os resultados obtidos ao final da pesquisa indicam que a inserção da realidade aumentada pode ser um fator de motivação para o processo de ensino-aprendizagem.",
    "Palavras-chave": [
        "Realidade Aumentada",
        "Tecnologias Interativas",
        "Educação"
    ],
    "Introdução": "No contexto das Novas Tecnologias da Informação e Comunicação e dos nativos digitais, educadores têm procurado alternativas eficazes de integração das novas tecnologias aos processos de ensino-aprendizagem como alternativa aos métodos tradicionais de ensino (MORAN, 2000; TORI, 2010). A inserção de novas tecnologias traz possibilidade aos processos de ensino-aprendizagem, afetam o modo de ensinar e alteram as experiências de aprendizagem (KATO et al., 2014). Nesse contexto, dois aspectos foram fundamentais para a delimitação do tema e da proposta do presente trabalho: a ideia de criar um livro com Realidade Aumentada embutida e a oportunidade de experimentá-lo no ambiente educacional como ferramenta mediadora das atividades de ensino-aprendizagem. Foram criados um livro em formato digital e um pequeno livro interativo que faz uso da Realidade Aumentada (RA), criado com a ferramenta de autoria ARTool-Book (OKAWA; KIRNER; KIRNER, 2011), ambos com o mesmo conteúdo informativo, a fim de aplicá-los em dois cenários distintos, em sala de aula, junto a alunos do curso de graduação em Engenharia da Computação e do curso de graduação em Tecnologias da Informação e Comunicação do Centro de Ciências, Tecnologias e Saúde da Universidade Federal de Santa Catarina (UFSC). O presente trabalho visa a dar respaldo, com base nos resultados obtidos, a propostas de trabalhos futuros dentro dos cursos na universidade. O conteúdo a ser ministrado por meio do livro é uma breve abordagem da história da evolução da computação, tema atinente às ementas curriculares de ambos os cursos. A Realidade Aumentada (RA) é uma tecnologia emergente e promissora, e seu uso encontra respaldo nas atividades de simulação e treinamento desde a sua criação. A RA é um recurso cada vez mais presente em sistemas computacionais quando utilizada em simulação, treinamentos e aplicações reais em diferentes áreas. Essa tecnologia possibilita visualizar, em tempo real, objetos digitais em meio físico, fazendo uso de uma série de dispositivos tecnológicos (como smartphones, tablets PCs e PDAs). Grande parte das aplicações de RA para dispositivos móveis baseia-se em marcadores ou símbolos, lidos por meio de uma câmera de um dispositivo, os quais um software interpreta e gera, a partir deles, um objeto virtual específico. Alguns aplicativos também usam reconhecimento de imagem em que a entrada para a câmera é com parada com uma biblioteca de imagens para encontrar um objeto virtual correspondente.",
    "Conclusão": "Houve uma diferença significativa, em termos motivacionais, entre os dois cenários de ensino-aprendizagem analisados, com vantagem para o cenário de ensino-aprendizagem baseado no uso do livro aumentado. O p-value de 0,03, menor que o coeficiente de confiabilidade, confirma a hipótese alternativa. Enquanto, a média IMMS geral do grupo controle foi de 3,13, a média IMMS geral do grupo experimental foi de 3,61. No presente estudo, a inserção da RA demonstrou ser eficaz quanto à capacidade de melhorar o apelo motivacional do material instrucional, especialmente nas categorias atenção e satisfação do modelo ARCS. Foram utilizados métodos estatísticos apropriados para analisar os resultados. Ambos os cenários seguiram a mesma estrutura pedagógica e os alunos receberam conteúdos semelhantes de aprendizagem, porém em formatos de mídias diferentes. Foram verificados, junto ao estudo de caso realizado, uma maior motivação e um maior engajamento dos alunos durante o processo de ensino-aprendizagem no cenário baseado no uso do livro aumentado. De fato, dados quantitativos e qualitativos mostraram que as características especiais da tecnologia de Realidade Aumentada tiveram, no presente estudo, um impacto positivo na motivação dos alunos. Uma visível diferença nos fatores de atenção e satisfação, quantificados pelo IMMS nos dois casos, mostra que o cenário de ensino-aprendizagem com base no uso da tecnologia de realidade aumentada obteve um melhor desempenho, em termos motivacionais, em comparação com o cenário de ensino-aprendizagem baseado no uso do livro em formato digital. Entre as disciplinas que poderiam se beneficiar do uso da RA, há uma variedade de citações, como cálculo, programação, arquitetura de computadores e outras disciplinas sobre hardware, disciplinas em que se desenvolvam atividades de laboratório, como física e química. Elaborar uma atividade mediada por meio de uma tecnologia ainda pouco usual, mas com elevado potencial enquanto ferramenta de mediação, requer capacitação para saber usá-la, paciência, tempo e pesquisa para desenvolver o design instrucional mais adequado ao objetivo pedagógico proposto. Embora, às vezes, não seja uma tarefa fácil, faz-se necessário o uso das novas tecnologias em sala de aula diante da nova realidade. Seu uso traz resultados geralmente proveitosos e satisfatórios para o processo de ensino-aprendizagem."
}