{
    "Autor": "Thiago Hipólito de Amorim",
    "Título": "Desenvolvimento de um sistema web para controle de pedidos de balões personalizados de uma empresa de Sombrio, Santa Catarina",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Fabrício Herpich",
    "Coorientador(a)": "Prof.ª Marina Carradore Sérgio",
    "Resumo": "Considerando os amplos benefícios proporcionados pela integração de um sistema computacional na gestão de pedidos de uma empresa, tais como a redução de erros, a rastreabilidade, a melhoria na eficiência do processamento de pedidos e a capacidade de utilização de dados para embasar decisões empresariais, pesquisa-se sobre a utilização das Tecnologias da Informação e Comunicação (TICs) no controle de pedidos de balões personalizados. O objetivo é desenvolver um sistema web voltado para o gerenciamento de pedidos, direcionado a uma empresa varejista localizada na cidade de Sombrio, no estado de Santa Catarina. Para alcançar esse propósito, foi essencial analisar o atual modelo de registro de pedidos, identificar as necessidades e requisitos específicos da empresa, integrar o sistema web ao ambiente corporativo e torná-lo acessível aos colaboradores. Também foi necessário coletar informações dos colaboradores, obter o feedback e, por fim, apresentar os resultados por meio de uma análise qualitativa da pesquisa. Ademais, empregou-se a metodologia Kanban no processo de desenvolvimento do software, em conjunto com as tecnologias disponibilizadas pelo framework Django e a linguagem de programação Python. Como resultado, entregou-se uma aplicação web funcional e eficiente que atende os objetivos e requisitos estabelecidos pelos colaboradores do setor da empresa, o que impõe a constatação de que essa aplicação tenha gerado vantagens consideráveis, como a otimização da gestão de registros, a diminuição de erros, o aumento da satisfação dos usuários e a eficiência no controle dos processos de produção dos balões personalizados pela empresa.",
    "Palavras-chave": "Sistema Web; Tecnologia da Informação e Comunicação (TICs); Gerenciamento de pedidos.",
    "Introdução": "Atualmente, as Tecnologias de informação e Comunicação fazem parte do cotidiano da sociedade, principalmente no âmbito profissional. A utilização de sistemas computacionais se faz cada vez mais necessário nas empresas, independentemente do setor de atuação. Assim, essas ferramentas facilitadoras processam dados transformando-os em informações essenciais para a gestão empresarial (SANTANA; SILVA, 2022). Segundo Junkes (2014), as Tecnologias de Informação e Comunicação (TICs) oferecem uma série de benefícios evidentes, incluindo a redução de custos, a agilização da tomada de decisões, o controle de qualidade aprimorado e o aumento geral da produtividade. Estes benefícios em um contexto de alta competitividade, a redução de despesas ou a melhoria de procedimentos pode representar uma vantagem significativa da empresa em relação aos seus concorrentes e à sua posição no mercado. Com o crescimento contínuo de uma organização no mercado, surge uma maior demanda por atender às necessidades dos clientes. Nesse contexto, processos previamente eficazes precisam ser adaptados para aumentar a agilidade e a eficiência na gestão. Sendo assim, nota-se a necessidade da utilização de TICs para auxiliar os atendentes desde o momento da realização de um pedido de venda até que o produto seja entregue ao cliente, visto que seres humanos são submetidos a falhas quando sobrecarregados de funções cognitivas ao longo desse processo. Desse modo, de acordo com Silva et al. (2014), é possível reduzir a frequência dos erros humanos quando as situações de trabalho são planejadas para estar em sintonia com as necessidades e limitações humanas.",
    "Conclusão": "Quando iniciou-se o trabalho de pesquisa, constatou-se que as Tecnologias da Informação e Comunicação representam uma excelente ferramenta de trabalho para garantir agilidade e eficiência em vários processos empresariais, independentemente do setor da organização. Diante disso, a pesquisa teve como principal objetivo desenvolver um sistema web eficaz para o gerenciamento de pedidos para uma empresa de varejo localizada na cidade de Sombrio, no estado de Santa Catarina. Dessa forma, constata-se que o objetivo geral da pesquisa foi atendido, uma vez que o trabalho conseguiu evidenciar que os funcionários da empresa demonstraram satisfação com o processo de pedidos simplificado e com a experiência de navegação fluida e eficaz proporcionada pelo sistema desenvolvido. O objetivo específico inicial, que era analisar o modelo atual de registro de pedidos e identificar as necessidades e requisitos específicos da empresa, foi alcançado com êxito, a partir de uma reunião com os proprietários e colaboradores do setor, na qual foi examinado o processo das vendas e produções dos balões personalizados, identificando de que maneira o sistema poderia contribuir para aprimorar esse processo. O segundo objetivo específico, que consistia em realizar a integração do sistema web na empresa e disponibilizá-lo para uso dos colaboradores, foi atendido. Isso ocorreu após a conclusão do desenvolvimento do sistema e sua efetiva implementação na rede de computadores da empresa, tornando-o acessível e funcional para a rotina de trabalho dos colaboradores que atuam no setor. Já o terceiro objetivo específico consistia em coletar informações dos colaboradores e obter feedback. Isso foi realizado através da criação de um questionário direcionado aos funcionários que utilizaram o sistema durante o período de testes, com o intuito de capturar informações cruciais sobre a usabilidade do sistema. Concomitantemente, o último objetivo específico envolvia a apresentação dos resultados por meio de uma análise qualitativa da pesquisa. Essa meta foi plenamente concretizada após a análise dos resultados dos testes de usabilidade do sistema, os quais confirmaram que o sistema atendia às necessidades e expectativas dos usuários de acordo com os critérios estabelecidos."
}