{
    "Autor": "Luan Kyoshi da Cruz Haraki",
    "Título": "Anki: aplicativo de sistema de repetição espaçada na educação",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Patricia Jantsch Fiuza, Drª.",
    "Coorientador(a)": "Prof. Vilson Gruber, Dr.",
    "Resumo": "O aprendizado é recorrente na vida inteira das pessoas, começando quando crianças na educação básica e progredindo para níveis de ensino maiores com a idade e experiência. Dentre as muitas técnicas de estudo, o Sistema de Repetição Espaçada tem chamado atenção nos últimos anos como eficaz para revisão e retenção de memória. Porém, o modelo tradicional do Sistema de Repetição Espaçada não é tão simples de se utilizar por conta das etapas manuais e a necessidade do próprio aluno definir as metas e pontos de revisão, por isso este trabalho teve como objetivo avaliar inclusive o Anki, aplicativo que usa o método. Este Trabalho de Conclusão de Curso buscou trazer o Sistema de Repetição Espaçada na literatura científica, uma Revisão Sistemática de Literatura para o aplicativo Anki e o método, e apresentar as recomendações de uso do aplicativo. Este Trabalho de Conclusão de Curso é descritivo e bibliográfico, as informações apresentadas são para apontar as características do Sistema de Repetição Espaçada e do Anki em conjunto com argumentos de pesquisadores que já estudaram o tema. Uma Revisão Sistemática de Literatura foi feita para este trabalho, onde teve seu levantamento de dados realizado entre julho de 2022 a março de 2023 e identificou 147 documentos, na qual 85 passaram todos os critérios de seleção, e então categorizados em um score de 0 a 5, posteriormente listados em uma bibliometria contendo título, nome dos autores, score, país de origem, área de interesse e número de citações. Nos resultados da Revisão Sistemática de Literatura, foi notado que o método de Repetição Espaçada é mais utilizado no ensino superior, e recebe mais interesse das áreas da medicina e aprendizagem de idiomas. Pesquisas passadas detalharam que o Anki e o método de Repetição Espaçada tem potencial de aumentar os resultados nos estudos durante as revisões, porém para isso é indicado que a ferramenta seja utilizada de maneira adequada e contínua.",
    "Palavras-chave": "Revisão Sistemática de Literatura, Repetição espaçada, Anki, Impacto na Educação.",
    "Introdução": "As Tecnologias da Informação e Comunicação possuem presença em todos os setores econômicos e sociais, positivamente impactando a sociedade com o desenvolvimento, implementação e/ou aprimoramento de dispositivos, processos e outras tecnologias. Visto que a convergência digital é cada vez mais frequente no cotidiano, as TICs se tornaram essenciais para a sociedade. Entende-se como convergência digital que não há diferença entre mídias e formatos contanto que estejam digitalizados, e se tornando cada vez mais difícil distinguir o que é telefonia, televisão, sistema computacional, sistema de informação, etc. (UFSC, 2016). O profissional na área de TIC necessita não só dominar competências nos conhecimentos de hardware e software para lidar com as tecnologias, mas também na aplicação de ciências humanas e sociais. Com a inclusão da tecnologia em todos os setores, a combinação dessas competências se tornam essenciais para o trabalho do profissional. O curso de Bacharelado em Tecnologias da Informação e Comunicação da UFSC (2016) possui em sua grade curricular disciplinas que abrangem três áreas temáticas, que são: Tecnologias Digitais, Negócios Digitais e Educação e Cultura Digital. Este documento é um Trabalho de Conclusão de Curso feito para a obtenção de título de bacharel em Tecnologias da Informação e Comunicação. De acordo com regulamento vigente, o objetivo geral do TCC é propiciar aos alunos as condições necessárias para a elaboração de um estudo teórico-prático, dentro das normas técnicas que caracterizam a pesquisa científica. (UFSC, 2019). Na realização do TCC, o aluno pode demonstrar o conhecimento adquirido e pode vivenciar o contexto do trabalho na área de TIC e adquirir experiência no processo de iniciação científica (UFSC, 2019). É esperado que o TCC do Curso de TIC tenha embasamento teórico com disciplinas abordadas no Curso, seja aplicável como um projeto integrador ou contribua para a área, e possua caráter interdisciplinar no próprio curso e/ou outras áreas do conhecimento (UFSC, 2019). De acordo com o PPC do Curso de TIC, o TCC pode ser realizado dentro de uma das áreas temáticas do Curso. Este TCC foi desenvolvido seguindo o objetivo da Área de Educação e Cultura Digital que é desenvolver um Projeto de Conclusão do Curso visando promover inovação e modernização de modelos, processos e tecnologias educacionais em escolas e organizações (UFSC, 2016). Aprender é uma habilidade aplicável por toda a vida de uma pessoa, especialmente nas primeiras décadas onde ela passa boa parte de seu tempo na escola. O ato de aprender é a base de tudo que uma pessoa pode fazer, dos comportamentos mais simples como andar e falar ao conhecimento especializado nas áreas acadêmicas. Por isso, a aprendizagem é definida como o resultado de uma interação entre o indivíduo e o ambiente; essa interação resulta em mudanças cognitivas, morais, motivacionais e físicas, podendo ser duradoura ou, em certos casos, permanente (VELÁSQUEZ, 2001). Aprender significa se desenvolver em um sentido de direção ou influência na qual pode ser usado quando considerado apropriado e dependente da ocasião, ou seja, significa que aprender é um desenvolvimento de inteligência (BIGGE, 1997). Ou, segundo Gagné (1974), aprendizagem consiste em mudar a disposição ou habilidade humana, podendo ser retirada e que não pode ser simplesmente atribuída ao processo de crescimento. Em resumo, Velásquez (2001) define aprendizagem como resultado de uma mudança potencial no comportamento, seja no nível intelectual, psicológico ou físico, que se manifesta quando os estímulos externos incorporam novas informações, atiçam o desenvolvimento de habilidades e destrezas ou produzem mudanças de novas experiências. Todavia, as pessoas ao longo de suas vidas terão incontáveis assuntos que precisarão ser estudados e entendidos; os alunos na educação básica brasileira precisam aprender conteúdos de mais de dez disciplinas, por exemplo. Essa situação resulta nos estudantes dedicarem-se a “memorizar” a informação o mais rápido possível para conseguirem estudar o próximo tópico, gerando a comum tendência de futuramente esses mesmos estudantes não entenderem ou esquecerem o que já tinham “aprendido”. Isto significa que é preciso saber de novo aquela informação, eles precisam “reaprender” o que esqueceram. O esquecimento é separado em dois tipos: o esquecimento incidente, que acontece de maneira não intencional, e o esquecimento motivado, que é causado quando o indivíduo se envolve em um comportamento ou processo que diminui intencionalmente o acesso à memória com algum objetivo (BADDELEY et al., 2011). A ciência da aprendizagem não só e o estudo dos processos de memorização evoluíram com os estudos experimentais de Herman Ebbinghaus, nos quais o psicólogo estudava esses tópicos levando o problema à sua simplicidade. O objetivo de Ebbinghaus era investigar a aprendizagem de novas informações e, para diminuir os possíveis efeitos de conhecimento prévio, inventou um sistema de conjuntos de consoante-vogal-consoante para serem pronunciadas, porém que não tinham sentido ou lógica. O psicólogo estudou repetindo os conjuntos em voz alta e numerou as citações para aprender ou reaprender a lista. Nesse experimento, Ebbinghaus conseguiu concluir que, inicialmente, o esquecimento acontecia rapidamente, mas com o passar do tempo esse esquecimento reduzia de forma gradativa, formando a famosa curva de esquecimento (BADDELEY et al., 2011). As lembranças e as informações são armazenadas muito bem, porém em algum momento tem-se dificuldade de trazê-las ao consciente, de evocar. No processo de evocação sempre se procura algo específico, uma memória específica que, segundo Baddeley et al. (2011) denomina-se memória-alvo ou traço-alvo. Outro conceito são as dicas que, por sua vez, são informações fragmentadas que permitem acessar a memória. Os traços-alvos ou as memórias-alvos se ligam com outras memórias-alvos; essa ligação é chamada de associações ou links. Diante desses conceitos, pode se dizer que a evocação é uma progressão de uma ou mais dicas em direção a uma memória-alvo, com o objetivo de tornar aquele alvo disponível para influenciar o conhecimento permanente por meio de conexões associativas (BADDELEY et al., 2011). Já foram desenvolvidas muitas maneiras para manter a informação por mais tempo na memória ou acessá-las mais rápido, principalmente se tratando da educação, como a Técnica Feynman, Técnica Pomodoro, Método Cornell, criação de resumos e mapas mentais, e outros tipos. A Técnica Feynman é um método de estudo formado por um passo a passo para estimular o cérebro a compreender e aprofundar um assunto (PUCPR, 2022). A técnica funciona com o aluno escolhendo um tema e escrevendo, com palavras simples e objetivas, o que sabe a respeito. Após isso, o aluno apresenta esse aprendizado a alguém e revisa o tema, estudando sobre as dúvidas que surgiram. A ideia dessa técnica é que o estudante retorne ao estudo sempre que possível, lendo e anotando de forma simplificada até que seu cérebro compreenda de forma plena o assunto (PUCPR, 2022). A Técnica Pomodoro se resume em separar 25 minutos para fazer uma tarefa ou parte dela, caso leve mais tempo para realizá-la (UNIVALI, 2021). A cada 25 minutos é sugerido fazer uma pausa de 5 minutos o qual o aluno pode repousar. A combinação do tempo de trabalho e descanso é chamado de um Pomodoro que tem duração de 30 minutos. A cada 4 Pomodoros, o aluno pode ter um descanso maior de no mínimo 10 minutos. Caso haja mais tópicos a serem estudados no dia, repita o processo. A principal vantagem desta técnica é a produtividade e gestão de tempo que ela proporciona (UNIVALI, 2021). O método Cornell é um modelo de anotação esquematizada que facilita e ajuda a reter o conhecimento já no momento da escrita (ROCCELO, 2023). O método é dividido em 3 etapas que trabalham a escuta, o entendimento e a reflexão, na qual o método propõe um modelo de anotação dividido em 3 momentos. Primeiro, divide-se as páginas em 3 espaços, cada espaço para uma etapa. A divisão proposta é a seguinte: do lado superior esquerdo, separe uma parte para anotações. No superior direito, separe uma parte para os resumos. Na parte de baixo, separe um espaço para as perguntas (ROCCELO, 2023). No espaço para anotações, é registrado as informações captadas rapidamente ao ouvir, ver e ler. No espaço para resumos, busca-se a certeza que o aluno entendeu as anotações, descrevendo o conteúdo com as próprias palavras. No espaço para perguntas, é preenchido com possíveis dúvidas ou pensamentos para reflexão e desenvolvimento do conteúdo. Dentre as técnicas de estudo, está o Sistema de Repetição Espaçada (SRE), uma maneira de revisar o conteúdo, logo tem como objetivo rever algo com atenção e foco, e não para se aprender; é um recurso para incorporar o que já foi aprendido. Este sistema em específico é o foco deste TCC. O SRE é um método baseado na curva de esquecimento de Ebbinghaus e no fato de que existe um momento ideal para revisar o que aprendemos (ANKI, 2023). Nessa técnica, o estudante, 24 horas depois de aprender um novo assunto que será retido e evocado, deve fazer revisões de 10 minutos para cada hora/aula e, ao passar o tempo, diminuir os minutos de revisão por cada hora/aula para que o conteúdo seja fixado na memória e seja fácil de evocá-la. As 24 horas que sucedem após a exposição à nova informação é o momento que ocorre a maior parte do esquecimento. Assim, a primeira revisão de 10 minutos por hora/aula é suficiente para que essa nova informação seja retida na memória para que seja facilmente evocada. Após uma semana, serão necessários apenas 5 minutos por hora/aula para “reativar” aquela informação, levando a curva de aprendizagem para cem por cento. Vale ressaltar que a técnica de Repetição Espaçada, segundo sua teoria, não leva em conta questões individuais de aprendizagem e nem as características de estudo de cada indivíduo, mas serve para lembrar e revisar um conteúdo que o estudante está prestes a esquecê-lo (SILVA et al., 2014). Em resumo, a revisão feita no espaço de um dia evita a perda de setenta por cento da retenção da informação. Entretanto, devido à continuidade da queda exponencial evidente na Curva do Esquecimento, uma única revisão não manterá o conhecimento na memória a longo prazo, assim sendo necessário uma revisão regular dos estudos. O Sistema de Repetição Espaçada é aplicada com a utilização de flashcards, que são pedaços de papéis nos quais em um lado se escreve o conteúdo, pergunta ou algo que se quer revisar e, no verso, escreve-se a resposta (SILVA et al., 2014). Atualmente, com o avanço da tecnologia, os flashcards de papéis foram substituídos por cartões em aplicativos utilizados em computadores pessoais ou smartphones, como por exemplo, o Anki (ANKI, 2023). Esse avanço reduziu severamente as duas principais dificuldades da técnica, a primeira a necessidade de criar papéis, preenchê-los e armazená-los; e a segunda definir os intervalos de revisão que precisam se tornar cada vez mais longos a cada revisão, e otimizar o tempo de estudo para não tornar o tempo investido em detrimento. Um esforço que anteriormente poderia desmotivar as pessoas, porém que pode ser resolvido com o uso de aplicativos como o Anki. O Anki se tornou o aplicativo de Repetição Espaçada mais famoso e popular entre as opções, e com a intenção de ser possível revisar conteúdo de múltiplas disciplinas (ANKI, 2023), principalmente em cursos de idiomas. Para conhecer melhor a temática da Repetição espaçada, bem como identificar os estudos já publicados sobre as técnicas disponíveis para estudar, bem como conhecer como o aplicativo Anki incorpora em suas ferramentas essas características que se desenvolveu esta pesquisa como Trabalho de Conclusão de Curso no Bacharelado em Tecnologias de Informação e Comunicação.",
    "Conclusão": "O Curso de Tecnologias da Informação e Comunicação tem como objetivo integrar as tecnologias com as mais diversas áreas sociais e econômicas. O Curso leciona a respeito de educação, empreendedorismo e negócios para que os profissionais formados em TIC possam atuar com conhecimento dessas áreas em conjunto com o manuseio de ferramentas tecnológicas para melhores resultados. Este documento é a solidificação do aprendizado que o pesquisador desenvolveu ao longo do Curso e uma consolidação da experiência adquirida na Universidade Federal de Santa Catarina. A área de Tecnologias da Informação e Comunicação é abrangente e com diversas possibilidades de setores para pesquisar e o autor deste Trabalho se dedicou para a temática de Educação e Cultura Digital por experiência e viés pessoal. As pessoas estão em constante processo de aprendizado que perdura toda a vida. Na juventude, estudam em escolas. Mesmo após se diplomar pela educação básica obrigatória, elas podem ingressar no ensino superior. Mesmo que não entrem em faculdades, elas precisarão aprender novas funções nos empregos que encontraram, ou em novas atividades que não conheciam. O ato de aprender é intrínseco ao ser humano, mas assim como as pessoas aprendem, elas também esquecem, desaprendem. Este Trabalho de Conclusão de Curso possibilitou entender como o ato de esquecimento e revisão influenciam no aprendizado. Não somente a interação desses dois fatores na educação, mas também foi apresentado o método de Repetição Espaçada como possível solução para combater o declínio do nível de aprendizado do aluno e o aplicativo Anki para utilizar-se do método de maneira mais simples graças aos recursos que a tecnologia oferece aos usuários. A proposta inicial do trabalho era realizar uma pesquisa de campo em uma escola para testar os efeitos do aplicativo Anki diretamente e averiguar os resultados, entretanto, por conta das limitações de horário e localização do pesquisador, a proposta foi alterada para uma investigação teórica sobre o Sistema de Repetição Espaçada e o aplicativo Anki. Durante a realização deste trabalho acadêmico, o pesquisador trouxe pontos sobre a ideia e metodologia do Sistema da Repetição Espaçada e o aplicativo Anki. Para isso, uma Revisão Sistemática de Literatura e uma pesquisa bibliográfica foram realizadas e apresentadas. Na revisão, foi notado o interesse crescente na SRE através dos novos trabalhos emergentes ano após ano, principalmente depois da pandemia pelo COVID-19. A pandemia teve um grandes efeitos na educação. Efeitos negativos, pelos prejuízos que alunos e professores enfrentaram e que trouxeram consequências nos processos de aprendizagem e efeitos positivos, pois foi um período onde diversas ferramentas, especialmente digitais, foram desenvolvidas e utilizadas para atender os estudantes que acompanharam aulas e atividades a distância. Dentre os 85 documentos aceitos e verificados para a revisão, notou-se um grande interesse por parte dos norte-americanos neste tópico. O Brasil tem forte presença com artigos e trabalhos acadêmicos sobre repetição espaçada nos últimos anos também. As áreas da medicina e idiomas mostram serem aquelas que recebem maior atenção para os estudos de repetição espaçada, e as análises desse estudo indicam que esse interesse se deve ao fato dessas duas áreas exigirem que seus alunos memorizem muita informação tais como termos da anatomia e nomes de remédios para medicina, enquanto que na aprendizagem de idiomas é preciso saber traduções, aumentar vocabulário e conhecer novas regras gramaticais. Na fundamentação teórica, foram apresentadas mais informações referentes ao aprendizado, ao tempo de estudo, seja este individual ou realizado nas escolas, o processo de revisão, os efeitos de espaçamento, e o uso de ferramentas para verificar o aprendizado com o Anki em destaque. Durante o trabalho acadêmico, evidências reforçaram a necessidade de revisar o que foi aprendido e manter frequência nas revisões para garantir a retenção da informação. Na seção onde são apresentadas pesquisas passadas sobre o tema de repetição espaçada e do Anki, a disciplina de manter uma rotina de revisão e variar o conteúdo de estudo são questões recorrentes na maior parte dos trabalhos. O Anki foi desenvolvido como uma opção mais simples e eficaz do aplicativo comercial SuperMemo. O novo aplicativo tem uma proposta de ser mais fácil de ser utilizado e ele corresponde a essa expectativa, sendo intuitivo e permitindo aos usuários serem capazes de navegar e usufruir da ferramenta mesmo sem lerem o manual. A versatilidade do Anki permite que os flashcards possuam texto, imagens, áudios, vídeos e outras formas de representação da informação, ajudando o estudante a personalizar o aplicativo da maneira que preferir. O algoritmo do Anki calcula e separa quando o estudante irá revisar o flashcard de acordo com o feedback, removendo um dos maiores empecilhos da SRE, a dificuldade de saber o tamanho dos períodos de espaçamento entre as revisões. Entretanto, apesar da facilidade que o Anki proporciona, não significa que usar o Anki corresponde diretamente e automaticamente em uma melhoria nos estudos. O aplicativo opera na expectativa dos usuários serem honestos e disciplinados, respondendo corretamente se entenderam o conteúdo ou não, e mantendo frequência nos períodos, sem pular algum dia de revisão. Esse foi um ponto que apareceu ocasionalmente nos artigos sobre o Anki, o fato de alguns grupos de sujeitos das pesquisas não usarem a ferramenta corretamente. Conclui-se então que a pesquisa apontou que o uso do método de estudo SRE aliado ao uso de um aplicativo digital tipo o Anki possibilita maiores chances de obter uma resposta positiva na questão da eficiência nos estudos, se realizados de maneira adequada."
}