{
    "Autor": "Lucian D’avila Pedro",
    "Título": "IMPLEMENTAÇÃO DA GAMIFICAÇÃO EM AMBIENTE VIRTUAL DE APRENDIZAGEM NÃO FORMAL",
    "Ano de publicação": "2019",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Cristian Cechinel",
    "Coorientador(a)": "Prof. Me. Emanuel Marques Queiroga",
    "Resumo": "Visto que a educação a distância é uma modalidade de ensino que vem crescendo em uso e que entre seus problemas estão as taxas de evasão e baixo engajamento de alunos, pesquisa-se sobre o uso da gamiﬁcação no aumento do engajamento em um ambiente virtual de aprendizagem não formal, a ﬁm de desenvolver uma ferramenta que utilize conceitos de gamiﬁcação dentro do EasyEdu, um ambiente virtual de aprendizagem não formal. Para tanto, é necessário entender a relação entre conceitos como engajamento, gamiﬁcação, ambientes virtuais de aprendizagem, bem como deﬁnir quais conceitos de games utilizar na plataforma, projetar, desenvolver e disponibilizar o software. Diante disso, foram implementados na plataforma barras de progresso, indicadores visuais de conclusão de aulas, bem como uma coleção de conquistas a serem desbloqueadas pelo aluno no decorrer de um curso. Os resultados impõem a constatação de que é de crescente importância o estudo e aplicação de técnicas para aumento do engajamento em ambientes virtuais de aprendizagem, assim como a constatação de que é de suma importância que se estudem e criem maneiras de medir o engajamento em tais ambientes.",
    "Palavras-chave": [
        "Educação a distância",
        "Ambiente Virtual de Aprendizagem",
        "Evasão",
        "Engajamento",
        "Gamiﬁcação"
    ],
    "Introdução": "A educação a distância, ou simplesmente EAD, é uma modalidade de ensino que apresenta como característica a separação espacial e temporal entre professor e aluno, vem crescendo exponencialmente em uso no Brasil nos últimos anos. Neste cenário, os ambientes virtuais de aprendizagem, ou simplesmente AVAs, surgem como plataformas robustas desenvolvidas especificamente para mediar o processo de ensino e aprendizagem online (FREIRE; ROLIM; BESSA, 2015).\nSegundo Oliveira, Claro e Correa (2016), a procura por ensino a distância tem aumentado nos últimos anos, porém se observava baixa interação entre os alunos e os colegas, a plataforma e os tutores, como motivos são identificados desmotivação, trabalho e falta de prioridade nos estudos. No artigo, os autores propõe como estratégia de intervenção no ensino um plano de ação baseado em gamiﬁcação.\nA aplicação da gamiﬁcação na educação vem sendo feita naturalmente nos últimos anos e é justificada pela crescente popularidade dos games (FARDO, 2013).\nA gamiﬁcação é a ideia de se aplicar conceitos de games em outros contextos. São encontrados inúmeros estudos que atestam a eﬁcácia do uso da gamiﬁcação como ferramenta para o aumento do envolvimento dos alunos, porém em sua maioria ligados ao ensino presencial, nesse sentido, Boaventura e Oliveira (2018) sugerem que trabalhos futuros implementem sistemas gamiﬁcados também no ensino a distância.\nEm outras palavras, a gamiﬁcação é o uso de elementos de jogos, em contextos que não os jogos. Há diferentes elementos de jogos que podem desempenhar diferentes ações, e a gamiﬁcação é a integração sistemática desses elementos ao desenho de uma funcionalidade em outro contexto, no intuito de atingir um objetivo predeﬁnido diferente do normal, ou seja, que esteja para além do contexto dos jogos, não sendo o entretenimento.\nEm suma, a gamiﬁcação é o uso intencional de elementos de jogos em contextos fora dos jogos com objetivos que vão além de diversão e entretenimento (TENÓRIO et al., 2017).\nEste trabalho buscará desenvolver uma funcionalidade envolvendo alguns conceitos de gamiﬁcação dentro de um aplicativo web e android chamado EasyEdu, que é uma plataforma de ensino e aprendizagem voltada ao ensino não formal.\nA educação na literatura se classiﬁca em três categorias: a educação formal, que é hierarquicamente estruturada, cronologicamente gradual e que está presente no ensino escolar institucionalizado, a educação informal, que se caracteriza como aquela em que qualquer pessoa adquire e acumula conhecimentos, através de experiência diária, se associando mais ao conhecimento tácito, e por último, a educação não formal, categoria na qual o EasyEdu se encontra, que se caracteriza pelo ensino organizado e sistemático, porém fora dos quadros do sistema formal de ensino (BIANCONI; CARUSO, 2005).\nDe acordo com Fredricks, Blumenfeld e Paris (2004), existem três tipos de engajamento: comportamental, emocional e cognitivo. Segundo Henrie, Halverson e Graham (2015), alguns pesquisadores deﬁniram engajamento estudantil como \"energia em ação\".\nNo que se refere a metodologia, em um primeiro momento, em pesquisa biblio-gráfica, buscar-se-á bases teóricas que deﬁnam conceitos como gamiﬁcação, engajamento, ambientes virtuais de ensino e aprendizagem, bem como estratégias de gamiﬁcação e medição do engajamento, para que então, em um segundo momento, se possa estabelecer como será desenhada a nova funcionalidade.",
    "Conclusão": "O contínuo desenvolvimento tecnológico vem ao longo dos anos reﬂetindo na maneira com que a sociedade se molda, alterando constantemente o modo e a velocidade com que o conhecimento é compartilhado entre as pessoas.\nTais mudanças acontecem em uma velocidade muito alta, gerando constantemente novas possibilidades, problemas e questionamentos. A educação vem passando por mudanças nos últimos anos em relação a maneira como é feita e recebida, gerando novos desafios.\nO ensino a distância tem sido cada vez mais usado nos últimos anos, e tal uso tende a continuar crescendo. Esta modalidade de ensino tem como um dos grandes problemas as taxas de evasão, que podem ser diminuídas através do aumento do engajamento entre aluno, colegas, plataformas e tutores.\nVisto o cenário supracitado, conclui-se que é de crescente importância o estudo e aplicação de técnicas para aumento do engajamento em ambientes virtuais de ensino e aprendizagem.\nOutro fato inerente ao alcance dos objetivos estabelecidos para este trabalho é o de que é de suma importância que se estudem e criem maneiras de medir o engajamento em tais ambientes, para que se possa a partir disso medir a eﬁciência de diferentes técnicas a serem desenvolvidas para o aumento do engajamento.\nNeste trabalho, por exemplo, o engajamento poderia ser medido observando-se as medidas observacionais quantitativas, o que é uma boa abordagem quando deﬁne-se engajamento como energia em ação, pois mede o engajamento do estudante a nível de atividades.\nEntre outros fatores que tornam o uso de medidas observacionais quantitativas ideal, estão o fato de que tal técnica, nos moldes da plataforma, não oferece disrupção do processo de aprendizagem, bem como o de que pode-se criar uma grande base de dados através de logs de uso da interface e o de que tal solução oferece grande escalabilidade.\nAs medidas observacionais quantitativas poderiam ser observadas através da análise de log, que é uma técnica de análise de dados na qual se analisam dados de registros de ações dos usuários. Os registros são gerados durante a utilização do sistema por parte do usuário. Essa técnica ajuda no entendimento do comportamento dos usuários dentro do sistema, gerando dados estatisticamente confiáveis para avaliar diversas questões (WINCKLER, 2001). Outra características da técnica de análise de log que merece destaque é o fato de que os dados são coletados de maneira transparente, não atrapalhando a experiencia do usuário (SHARP; ROGERS; PREECE, 2005).\nA medição do engajamento, no entanto, não pôde ser desenvolvida devido ao caráter inicial de desenvolvimento da plataforma EasyEdu no mercado em que atua, levando a uma pequena base de usuários. Outro limitante em relação ao desenvolvimento de software para a medição do engajamento foi o tempo disponível para que este trabalho pudesse ter sido realizado.\nFica, portanto, como sugestão para trabalhos futuros, o desenvolvimento de técnicas e ferramentas neste sentido."
}