{
    "Autor": "Débora Tomazini",
    "Título": "INCLUSÃO DIGITAL E OS AGENTES COMUNITÁRIOS DA SAÚDE - PSF",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani M. Lunardi",
    "Coorientador(a)": null,
    "Resumo": "O objetivo deste Trabalho de Conclusão de Curso é investigar como as tecnologias da informação e comunicação afetam os Agentes Comunitários de Saúde, assim como entender mais sobre o tecnoestresse e quais suas consequências. Para o estudo de caso, foi feito um questionário para os sete Agentes Comunitários de Saúde (ACS) da Unidade Básica de Saúde (UBS) Marinho Miguel de Souza, no município de Balneário Arroio do Silva - SC, com o objetivo de investigar as principais dificuldades presentes na adaptação à tecnologia no trabalho e possíveis soluções para as mesmas. As TICs proporcionam vários benefícios, para isso a inclusão digital precisa ser para todos, caso contrário, é possível adquirir o tecnoestresse, que muitas vezes ignorado, pode agravar consideravelmente a saúde mental. Dessa forma, as TICs podem ser vistas como algo para facilitar as atividades, porém com o suporte e treinamento adequado, tornando os profissionais qualificados psicologicamente para realizar suas tarefas diárias de forma eficaz e benéfica.",
    "Palavras-chave": [
        "Agentes Comunitários de Saúde",
        "Tecnologias da Informação e Comunicação",
        "Tecnoestresse"
    ],
    "Introdução": "1. INTRODUÇÃO\n\n1.1. Contextualização e problematização\n\nConsiderando que as tecnologias da informação e comunicação (TICS) são meios de facilitar a vida da sociedade, onde a inclusão digital está cada vez mais presente com suas inúmeras vantagens, auxiliando como uma fonte de conhecimento e pesquisa de fácil acesso, o avanço rápido da tecnologia não é visto como benéfico por todas as pessoas, algumas dificuldades de adaptação são vistas como obstáculos. Na presente pesquisa, investiga-se as dificuldades de inclusão digital dos agentes comunitários de saúde. O Programa de Agentes Comunitários da Saúde (PACS) existe desde os anos 1991, hoje seu sucessor é conhecido como Estratégia da Saúde da Família. Os agentes comunitários de saúde (ACS) trabalham com bases geográficas definidas, onde cada agente é responsável por uma micro área, cada agente será responsável pelo cadastramento de todos os integrantes da família e também por manter os dados atualizados (MINISTÉRIO DA SAÚDE, 2012). Após o exposto, surge o problema de pesquisa descrito neste trabalho: Quais as dificuldades encontradas para inclusão digital dos ACS?\n\n1.2. Justificativa e motivação\n\nO interesse por esse tema surgiu ao decorrer do período em que trabalhei na UBS Marinho Miguel de Souza no município de Balneário Arroio do Silva – SC. Com a proximidade com a equipe local, foi possível acompanhar as dificuldades dos ACS nas suas atividades cotidianas relacionadas à tecnologia. A observação resultou na elaboração do Trabalho de Conclusão de Curso, para analisar as dificuldades presentes na adaptação dos agentes comunitários de saúde em relação à tecnologia e possíveis soluções de forma teórica. Trabalhar em um ambiente onde é necessário usar tecnologia diariamente, sem um suporte ou treinamento adequado se torna frustrante. Com o avanço da tecnologia, muitas empresas e órgãos públicos tiveram que mudar rotinas e estratégias para se adequar ao sistema. Em 2018, nas UBS de Balneário Arroio do Silva - SC, eram utilizados prontuários de papéis, onde todos os cadastros eram feitos pelos ACS e cada integrante da família tinha sua ficha, com todos os seus dados pessoais e descrições das consultas e procedimentos. Após a implementação do sistema na área da saúde no município, a equipe foi orientada a usar somente o sistema. Os funcionários tiveram um treinamento básico sobre o sistema e suas funcionalidades, porém muitos ACS tinham dificuldades em tarefas diárias e não tinham um suporte, resultando em cadastros incompletos, com erros e até mesmo pacientes sem cadastros. Os funcionários contratados após o treinamento inicial eram orientados pelos funcionários mais antigos da UBS, onde sobrecarregava a equipe.\n\n1.3. Objetivos\n\n1.3.1. Objetivo Geral\n\nInvestigar as dificuldades presentes na adaptação dos agentes comunitários de saúde em relação a tecnologia.\n1.3.2. Objetivos Específicos\n\n- Realizar uma pesquisa bibliográfica sobre o Sistema Único de Saúde, o Programa Saúde na Família e os agentes comunitários de saúde;\n- Identificar através de estudo de caso e entrevistas os obstáculos que acompanham a inclusão digital, para entender melhor as dificuldades que os agentes comunitários da saúde estão passando com o rápido avanço tecnológico, que está cada vez mais presente nas rotinas diárias;\n- Contribuir com possíveis alternativas que possam ajudar a solucionar esses obstáculos e fazer com que a inclusão digital seja facilitada.\n\n1.4. Aderência ao curso de TIC\n\nComo graduanda do curso de Tecnologia da Informação e Comunicação, ajudar os ACS em suas dificuldades diárias e pensar em formas de ajudá-los a longo prazo se tornou algo bem frequente, pois conseguia entender as dificuldades de forma clara. O curso de TIC é bem abrangente e consegue mostrar como a constante evolução da tecnologia afeta a vida dos cidadãos e como podemos minimizar esse impacto. A preocupação com o impacto que as mudanças tecnológicas podem causar no processo ensino-aprendizagem impõe à área da educação a tomada de posição entre tentar compreender as transformações do mundo, produzir conhecimento pedagógico sobre ele e auxiliar o homem a ser sujeito da tecnologia, ou simplesmente dar as costas para a atual realidade da nossa sociedade baseada na informação (SAMPAIO; LEITE, 2000 apud SANTOS, 2012, p.18).\n\n1.5. Metodologia\n\nA pesquisa foi de natureza aplicada e com propósito exploratório, a abordagem utilizada foi qualitativa e como instrumento de coleta de dados foi utilizada a pesquisa bibliográfica com estudo de caso e entrevista com aplicação de um questionário. A elaboração das questões teve como objetivo analisar as dificuldades e algumas sugestões para solucioná-las. Foram aplicadas duas questões aos sete Agentes Comunitários da Saúde, onde respondem o questionário em seu local de trabalho, na UBS Marinho Miguel de Souza.\n\n1.6. Estrutura do TCC\n\nPara melhorar a compreensão sobre o tema proposto, o trabalho se dividiu em cinco seções. Na primeira seção o leitor consegue entender de forma introdutória o objetivo do estudo, assim como a justificativa e importância do mesmo. Na segunda seção intitulada Agente Comunitário de Saúde, é descrito o início do Programa de Agentes Comunitários de Saúde (PACS) em 1991, que hoje seu sucessor é conhecido como Estratégia da Saúde da Família (ESF), assim como a história, trajetória, deveres e importância dos ACS. Na terceira seção, é aprofundado o tema da Dificuldade da Inclusão Digital, com o objetivo de entender as dificuldades, o que significa tecnoestresse e o que pode ocasioná-lo caso não seja tratado com a devida importância. Na quarta e quinta seções são apresentados o estudo de caso e as considerações finais do estudo, onde foi realizado um estudo de caso e entrevista com aplicação de um questionário para os ACS na UBS Marinho Miguel de Souza. Para entender melhor as dificuldades de forma realista e juntamente com eles, elaborar possíveis soluções para esse problema.",
    "Conclusão": "5. CONCLUSÃO\n\nAo longo do Trabalho de Conclusão de Curso, foi possível acompanhar as atividades do Agentes Comunitários de Saúde, que muitas vezes passam despercebidos pela população, sendo um trabalho fundamental na saúde brasileira. Além de acompanhar as atividades, também foi possível entender as dificuldades que os ACS passam diariamente em relação à inclusão digital. O tecnoestresse, apesar de ser um assunto bem pouco discutido, é mais comum do que imaginamos, nem sempre é possível notar que é a tecnologia afeta uma pessoa de forma negativa sem ter um convívio, pois a mesma pode não saber do que se trata. É importante prestar atenção nos sinais e tornar cada vez mais esse assunto mais comum. A parte mais difícil foi o estudo de caso, pois vivenciar a frustração dos ACS ao ter contato com a tecnologia e sensação de impotência no momento, não é fácil, principalmente para graduandos do curso de tecnologia, pois espera-se que todos sejam incluídos e tenham o suporte necessário para isso, sabendo as consequências caso não tenham. Investigando as dificuldades dos ACS, em relação à tecnologia, foi realizada a pesquisa bibliográfica sobre os Agentes Comunitários de Saúde, Sistema único de Saúde e o Programa Saúde na Família, identificando através do estudo de caso e as entrevistas com aplicação de um questionário, as dificuldades e os obstáculos que acompanham a inclusão digital. Podendo no final contribuir com possíveis soluções para que a inclusão digital seja menos difícil. Então o problema de pesquisa descrito neste TCC: \"Quais as dificuldades encontradas para inclusão digital dos ACS?\", obteve uma resposta, com a ajuda dos agentes comunitários de saúde da UBS Marinho Miguel de Souza, do município de Balneário Arroio do Silva."
}