{
    "Autor": "Jonatan Santos Bereta",
    "Título": "Competências digitais para a educação: Mapeamento e aplicação web com base em um estudo de caso",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.ª Patricia Jantsch Fiuza, Dra.",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho apresenta um estudo sobre o emprego das tecnologias digitais na educação e as competências digitais necessárias para um melhor aproveitamento destas tecnologias no contexto escolar. Para o alcance dos objetivos, um estudo sobre a temática foi realizado descrevendo o cenário educacional quanto ao emprego das tecnologias digitais, bem como apresenta um estudo realizado a partir de um curso de extensão realizado a distância com 153 professores de uma rede pública de educação durante a pandemia do Coronavírus no ano de 2020 que buscou desenvolver competências para o uso de tecnologias digitais especificamente para atividades pedagógicas não-presenciais, popularmente chamado de ensino remoto, modalidade de ensino que teve maior relevância durante a pandemia como alternativa e adaptação ao ensino presencial devido às restrições de isolamento social. A partir dos resultados obtidos, o trabalho apresenta em seu desfecho um modelo de mapeamento de competências digitais para educação bem como apresenta um protótipo de uma aplicação web com a finalidade de desenvolver competências digitais para profissionais da educação.",
    "Palavras-chave": [
        "Tecnologias Digitais",
        "Educação",
        "Competências"
    ],
    "Introdução": "O ano de 2020 certamente marcou a história mundial no presente século com a pandemia causada pelo novo coronavírus, vírus causador da doença chamada Covid-19. Este evento causou prejuízos, conflitos políticos e econômicos além de milhares de mortes pela doença.(SENHORAS,2020) Por causa deste colapso mundial, em meados de março de 2020, diversos países passaram a adotar medidas restritivas, determinando o fechamento de instituições de ensino, comércio em geral, cinemas, bares e demais locais considerados não essenciais para a população, causando um transtorno generalizado em diversos setores econômicos e sociais. Um dos setores fortemente impactado pelas medidas restritivas foi o setor da educação, visto que milhares de professores e estudantes ao redor do mundo tiveram que permanecer distantes das instituições de ensino e adotar novas formas de ensino-aprendizagem para contornar o problema da perda do ano letivo, sendo o ensino remoto a alternativa mais viável diante do cenário. Em decorrência disso, a utilização das tecnologias digitais voltadas ou não para a educação passou a ter mais evidência a fim de servir como meio de realizar ações emergenciais de retomada da educação, e junto com esta solução, uma série de problemas passou a ser mais fortemente evidenciado, dos quais destaca-se: a falta de infraestrutura dos atores envolvidos no processo educativo, o despreparo e desconhecimento para utilização das tecnologias digitais na educação e aplicabilidade das tecnologias digitais no contexto educacional. Diversas secretarias de educação pelo país de todas as esferas públicas tiveram em caráter emergencial e por vias de decretos nacionais, estaduais e municipais, construir junto com lideranças escolares e docentes, maneiras de acatar a estas determinações, elaborando e executando ações que mantivessem o ano letivo sem maiores prejuízos para os estudantes. A exemplo disso, atendendo a estes decretos, em Araranguá/SC, a secretaria municipal de educação em parceria com a Universidade Federal de Santa Catarina do campus de Araranguá realizou durante os meses de abril e maio de 2020, período de maior pico da doença no Brasil (UNESCO, 2020), um treinamento emergencial para seus respectivos docentes do ensino fundamental para o uso de tecnologias digitais para o ensino remoto. Este treinamento, foi proposto e estruturado pelo Laboratório de Mídia e Conhecimento (Labmídia) e realizado de forma virtual a fim de suprir esta demanda emergencial inicial, oferecendo um preparo e ações práticas para que estes docentes tivessem um mínimo de condições e competências necessárias para atender a estas exigências. É com base neste contexto que este trabalho analisou este treinamento realizado, obtendo por meio deste estudo considerações relevantes sobre as competências necessárias para o uso de tecnologias digitais na educação, mapeando estas competências e propondo após este estudo, um protótipo de uma aplicação web para o desenvolvimento destas competências.",
    "Conclusão": "A pandemia causada pelo Coronavírus trouxe à tona alguns desafios relevantes do ponto de vista da práxis docente quanto ao uso de tecnologias na educação, e junto com estes desafios uma série de possibilidades em compreender melhor a aplicabilidade das tecnologias digitais na educação e sua efetividade nos processos educativos tiveram maior evidência, visto que seu uso foi fundamental e possivelmente indispensável durante a pandemia. Com isso, docentes que ainda mantinham algum grau de resistência quanto ao emprego de TIC nas aulas, tiveram que rever suas práticas pedagógicas e assumir uma postura de aprendizagem aos moldes de uma cultura digital que certamente permanecerá após o fim da pandemia. A finalidade deste trabalho se concentrou em estudar o uso de tecnologias digitais na educação e as competências que são necessárias para um melhor aproveitamento delas. Os resultados alcançados com o curso oferecido, somados aos estudos sobre TIC na educação e as competências essenciais para sua aplicabilidade, mostraram um panorama sobre a práxis docente atual, e serviram como meio de mapear competências a serem desenvolvidas em programas de formação docente, seja inicial ou continuada. Com base nos resultados, foi possível elaborar um projeto que envolve o desenvolvimento de uma aplicação web como uma alternativa para ajudar professores a desenvolver CHA para o emprego correto e eficiente de tecnologias em suas aulas, oferecendo a estes um sistema de referência que ofereça recursos e mostre o caminho para o desenvolvimento pleno de suas competências digitais. O estudo que fundamentou este trabalho bem como os resultados obtidos, abrem espaços para estudos acadêmicos posteriores concernentes à aplicabilidade das tecnologias digitais na educação e as competências envolvidas neste processo, bem como abre um debate acerca da efetividade dos programas formativos da práxis docente de forma inicial ou continuada sobre o uso de TIC e apresenta um caminho a ser explorado para determinar graus de competências digitais a serem desenvolvidas em profissionais da educação. Espera-se a partir deste trabalho, obter meios de desenvolver e melhorar a estrutura da aplicação proposta, a fim de que futuras pesquisas possam ser realizadas com base no funcionamento desta, mensurando potenciais resultados quanto ao desenvolvimento de competências digitais em seus utilizadores, suprindo assim uma demanda crescente no setor da educação."
}