{
    "Autor": "Diogo Weber Silveira",
    "Título": "Desenvolvimento de uma fechadura eletrônica: um sistema de controle de acesso com registro em banco de dados e site de gerenciamento.",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Mendonça Lunardi",
    "Coorientador(a)": "",
    "Resumo": "A busca por um sistema que permitisse o controle de acesso a um laboratório com vários alunos, professores e servidores, que permitisse o trancamento automático de acesso ao mesmo, sem a necessidade de utilização de uma chave mecânica e que se efetua o registro de entradas e saídas automaticamente, levou ao desenvolvimento de uma fechadura eletrônica que atende as necessidades do laboratório. Este feito só foi possível realizando a implementação de uma fechadura eletrônica utilizando a plataforma Arduíno, módulos RFID e relé, fechadura elétrica, scripts em Python3, banco de dados e ferramentas para desenvolvimento WEB. Concluiu-se que é possível o desenvolvimento de uma fechadura eletrônica atendendo os requisitos e foi implementado conforme demonstrado no decorrer deste trabalho.",
    "Palavras-chave": "Fechadura eletrônica. Controle de acesso. Registro de acesso. Desenvolvimento.",
    "Introdução": "As salas de aula e os laboratórios da Universidade Federal de Santa Catarina, Campus Araranguá, unidade do bairro Mato Alto, possuem sistema mecânico de abertura das salas, sendo necessário um professor ou funcionário da instituição para sua abertura ou fechamento. Foi observado que os laboratórios poderiam ficar abertos por um grande período de tempo sem nenhum tipo de controle de acesso aos ambientes, ficando os laboratórios, e seus equipamentos de elevado valor econômico e técnico expostos a possíveis avarias e furtos. Alguns desses equipamentos sendo únicos, desenvolvidos nos laboratórios para suas atividades. A partir das problemáticas observadas nesses ambientes da universidade, ficou claro aos coordenadores do laboratório LARAL, a necessidade de desenvolver um sistema que fizesse o controle de acesso a estes espaços físicos, permitindo a entrada de somente pessoas autorizadas e também a necessidade de um histórico de acessos a estes locais. Após, foi realizada uma pesquisa de fechaduras eletrônicas existentes no mercado, sendo constatado que não havia uma fechadura que atendesse as necessidades específicas do laboratório em questão. Ademais a UFSC possui cartões de identificação dos alunos, professores e servidores, que já contam com uma etiqueta RFID integrada, que neste caso poderiam servir de chave de acesso a estes espaços da universidade. Este trabalho divide-se em três capítulos. No primeiro, será apresentado considerações sobre fechaduras eletrônicas. No segundo capítulo, expõe-se os componentes, hardware, software e protocolos. Por fim, no terceiro capítulo, serão apresentadas as etapas do desenvolvimento da fechadura eletrônica proposta.",
    "Conclusão": "Durante o desenvolvimento do projeto foi necessário um estudo sobre os componentes e tecnologias utilizadas. Ficou evidente as diversas aplicações dos hardwares e softwares, tanto para este projeto, quanto para uma variedade de outros projetos. O objetivo deste trabalho foi concluído com sucesso, objetivo esse que era a criação de uma fechadura eletrônica para manter a porta da sala trancada, realizar o controle de acesso ao laboratório e realizar automaticamente o registro do histórico de entradas e saídas. A fechadura é de fácil utilização, bastando que o usuário porte sua carteirinha de identificação da Universidade como chave de acesso, de baixo custo (custou aproximadamente R$300,00), e que os dados de acesso possam ser visualizados através da página WEB desenvolvida. Com um script em Python3 foi possível fazer o cadastro de novos usuários. Com a utilização da fechadura elétrica AGLinha, que possui um sistema de abertura mecânica (por chave física), ficando possível a abertura, por ocasião, em caso de falta de energia. Ficou evidente também que este projeto possui um grande potencial de refinamento, ao se fazer as conexões utilizando uma placa de solda em vez de uma protoboard, mas mantendo terminais para uma fácil substituição dos componentes. Também foi observado a possibilidade de inclusão de um segundo LED para que, enquanto um LED indique para quem está do lado de dentro a operação que está ocorrendo no Arduíno (entrada, saída ou negação de acesso), quem está do lado de fora também possa o visualizar. Uma evolução em potencial se dá no site desenvolvido, podendo ser adicionados: pesquisa por nome, relatórios de acesso, acesso remoto (podendo ser adicionado ao site do laboratório, para que os professores supervisores possam verificar remotamente o acesso), exclusão de usuários cadastrados, entre outras. Em anexo se encontram os códigos do Arduíno e scripts Python3."
}