{
    "Autor": "Taliha Hoffmann Rahim",
    "Título": "DESENVOLVIMENTO DE UM PROTÓTIPO PARA AUXÍLIO NO DESLOCAMENTO DE DEFICIENTES VISUAIS",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profª. Drª Luciana Bolan Frigo",
    "Coorientador(a)": "",
    "Resumo": "O uso da tecnologia nas últimas décadas vem revolucionando nossa forma de vida, tornando a comunicação cada vez mais rápida e eficiente, fazendo com que processos industriais sejam automatizados, celulares se tornaram computadores portáteis, o ser humano está cada vez mais dependente das facilidades que as tecnologias da informação vem proporcionando no seu cotidiano. Os deficientes visuais enfrentam inúmeras dificuldades diariamente para transitar de um local ao outro, são muitos obstáculos de difícil percepção, como os encontrados acima da linha de sua cintura. Atualmente ainda utilizam uma tecnologia pouco aprimorada, que é a bengala. Visto que essas pessoas precisam estar inclusas nas inovações e melhorias tecnológicas, este estudo busca por meio de uma tecnologia assistiva auxiliar um deficiente visual no seu deslocamento. Dessa forma, o presente trabalho traz o desenvolvimento de um sensor de obstáculos de baixo custo para deficientes visuais, com alertas vibratórios, sendo utilizado como um bracelete. Palavras-chave: Deficiente visual. Tecnologia Assistiva. Sensor de obstáculo. Arduino.",
    "Palavras-chave": [
        "Deficiente visual",
        "Tecnologia Assistiva",
        "Sensor de obstáculo",
        "Arduino"
    ],
    "Introdução": "A inclusão social é um tema que vem sendo cada vez mais abordado e obtendo destaque nas discussões de toda a sociedade. As pessoas que possuem algum grau de deficiência seja ela física ou visual, geralmente podem possuir maior dificuldade de integração nas atividades comuns realizadas no cotidiano. Os deficientes visuais ao se locomoverem no dia a dia se deparam com obstáculos como desníveis na rua, orelhões, placas, galhos de árvore, objetos mobiliários, o que pode impedir sua independência na atividade de locomoção ou até causar riscos de morte. É comum que as pessoas portadoras de deficiência visual precisem de ajuda de terceiros para realizar algumas atividades do cotidiano, como localizar objetos e ler instruções. Porém, autonomia e independência de locomoção dos deficientes visuais são percebidas como de extrema importância tanto para o físico, bem como para o psicológico e social, tendo em vista que essas pessoas possuem o direito de ir e vir livremente. Tendo como base as necessidades das pessoas que apresentam algum grau de deficiência visual, as tecnologias assistivas podem ser definidas como \"uma ampla gama de equipamentos, serviços, estratégias e práticas concebidas e aplicadas para minorar os problemas encontrados pelos indivíduos com deficiência\" [Cook e Hussey 1995]. Dessa forma, é proposto o desenvolvimento de um sensor de obstáculos que visa facilitar a locomoção dos deficientes visuais, bem como tornar seu trajeto mais confortável e seguro.",
    "Conclusão": "O presente trabalho apresentou inúmeros desafios, desde entender as necessidades de um deficiente visual até o funcionamento de um microcontrolador, e de que forma a tecnologia pode ser uma aliada na resolução de problemas diários dessas pessoas. O projeto teve boa aceitação por parte dos deficientes visuais entrevistados, com uma proposta de utensílio novo e de baixo custo. Foi visto que o dispositivo pode ter algumas melhorias, como vibrar um pouco mais forte, e ter maior alcance. Em contraste com os demais projetos existentes, o bracelete foi confeccionado com itens de baixo custo, levando em conta que a realidade de muitos deficientes visuais, que participam destas associações, apresentam uma renda familiar bastante baixa, sendo que alguns não trabalham e dependem de auxílio do governo ou aposentadorias. Estudar sobre os deficientes visuais e aprender um pouco mais sobre hardware, ampliou consideravelmente os conhecimentos que foram aprendidos ao longo do curso, poder desenvolver um dispositivo para uma parcela da sociedade que muitas vezes sofre preconceito por sua diferença física e ter um resultado positivo sobre o projeto, foi de grande valia. A tecnologia vem sendo cada vez mais aprimorada para facilitar a vida das pessoas, bem como melhorar processos que antes levavam muito tempo para serem realizados. Porém, deve-se ser avaliado, se essas melhorias são elaboradas levando em conta a inclusão de todas as pessoas, bem como o impacto que uma inovação tecnológica pode ter na vida de um deficiente."
}