{
    "Autor": "Laura Giuliani De Pellegrin De Souza",
    "Título": "Modelo preditivo para identificação de estudantes com risco de evasão: Análise de Dados Acadêmicos no Moodle",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Marina Carradore Sérgio, Dr.(a)",
    "Coorientador(a)": "",
    "Resumo": "Este estudo apresenta o desenvolvimento de um modelo preditivo para identificar estudantes em risco de evasão escolar em cursos de graduação, utilizando dados educacionais extraídos da plataforma Moodle. O objetivo foi analisar indicadores de desempenho e comportamento dos estudantes para prever a probabilidade de evasão e auxiliar instituições de ensino na implementação de estratégias preventivas. A evasão escolar é um fenômeno complexo, influenciado por fatores como reprovação e desengajamento ao longo do semestre. Assim, o modelo desenvolvido pode ser aplicado de forma contínua durante o período letivo, utilizando dados parciais de notas e presença, além das métricas finais. Foram utilizados três algoritmos de aprendizado de máquina: Floresta Aleatória (Random Forest), XGBoost e Redes Neurais Feedforward (FNN). A avaliação dos modelos empregou métricas com o acurácia, ROC AUC, precisão, recall e f1-score. Entre os algoritmos, o Random Forest apresentou o melhor desempenho, com uma acuracidade de 95,65%, destacando-se pela precisão e estabilidade das previsões. Os resultados evidenciam a eficácia do modelo na identificação de padrões comportamentais que indicam risco de evasão, contribuindo para a gestão educacional e a retenção de estudantes.",
    "Palavras-chave": [
        "Evasão Escolar",
        "Aprendizado de Máquina",
        "Predição de Evasão"
    ],
    "Introdução": "A evasão escolar é um fenômeno complexo que afeta instituições de ensino em todo o mundo, sendo objeto de estudo tanto em países desenvolvidos quanto em nações em desenvolvimento. Veloso e Almeida (2013) destacam que esse fenômeno não é exclusivo de determinadas regiões ou áreas do saber, mas sim um desafio global que afeta diversas instituições de ensino, independentemente de suas características socioeconômicas ou culturais. No Brasil, a preocupação com a evasão ganhou destaque na década de 1990, com a realização do Seminário sobre evasão nas universidades brasileiras, que visava identificar as causas desse fenômeno nas universidades públicas do país e sugerir medidas para reduzir sua incidência (Kipnis, 2000). Ao longo dos anos, diversos programas e planos educacionais, como o Programa de Apoio à Reestruturação e Expansão das Universidades Federais (Reuni) e o Plano Nacional de Educação (PNE), têm buscado implementar estratégias para combater a evasão, promovendo a permanência dos estudantes e a conclusão dos cursos (Fialho; Prestes, 2018). A evasão, de maneira geral, refere-se à interrupção definitiva dos estudos antes da conclusão de uma etapa educacional, como um curso ou uma especialização (Fialho, 2014). Segundo Tinto (1975, 1997), a evasão escolar resulta de uma interação entre fatores pessoais, externos e o nível de integração do aluno na instituição de ensino superior (IES). Outros estudiosos, como Silva Filho et al. (2007), destacam os impactos econômicos e sociais da evasão, afetando tanto o setor público quanto o privado. Nesse sentido, a atuação da gestão universitária é fundamental para controlar a evasão e entender as expectativas dos alunos (Osborne; Jones, 2011). Com o avanço da tecnologia, a análise dos dados educacionais tem se mostrado uma importante aliada na compreensão e combate à evasão. A Mineração de Dados Educacionais, por exemplo, permite que os registros dos alunos sejam transformados em informações úteis, auxiliando na criação de estratégias para reduzir a evasão (Colpani, 2018). Diante desse cenário, o presente estudo visa explorar a aplicação de técnicas de machine learning para prever a evasão escolar, utilizando como base os dados coletados do Moodle em um dos cursos oferecidos por uma instituição federal.",
    "Conclusão": "Este estudo apresentou uma análise dos modelos de predição de evasão escolar aplicados aos dados educacionais de estudantes de graduação, com o objetivo de identificar padrões comportamentais que possam informar estratégias eficazes de retenção acadêmica. A pesquisa percorreu um caminho metodológico, envolvendo a coleta e pré-processamento dos dados e a aplicação de técnicas de aprendizado de máquina, incluindo Random Forest, XGBoost e Feedforward Neural Network (FNN), para a construção e avaliação dos modelos preditivos. Foram utilizadas métricas de desempenho como acurácia, precisão, recall, F1-score e área sob a curva ROC, para mensurar a eficácia dos modelos. O modelo Random Forest apresentou uma acurácia de 96%, o XGBoost obteve uma acurácia de 91%, e o FNN apresentou uma acurácia de 89%. O modelo Random Forest destacou-se com o melhor desempenho, especialmente em termos de equilíbrio entre precisão e sensibilidade, consolidando-se como a abordagem mais eficaz para a predição da evasão escolar. Embora o modelo XGBoost tenha apresentado resultados satisfatórios, observou-se uma tendência a gerar mais falsos positivos, o que pode ocasionar ações preventivas desnecessárias. O modelo FNN, por sua vez, revelou limitações significativas na identificação dos estudantes em risco de evasão, mostrando-se menos robusto em comparação aos demais. A pesquisa desenvolveu e aplicou modelos preditivos para a evasão escolar no ensino superior, fornecendo informações quantitativas para o monitoramento dos estudantes e a identificação dos padrões de evasão. Através da construção e avaliação de três modelos distintos, uma análise detalhada de suas performances foi realizada, identificando o modelo mais adequado ao contexto investigado. Este estudo contribuiu para o campo da análise de dados educacionais, ao demonstrar a aplicabilidade de técnicas de aprendizado de máquina na previsão da evasão escolar e no apoio à tomada de decisões estratégicas por parte das instituições de ensino."
}