{
    "Autor": "Francielli Freitas Moro",
    "Título": "GÊNERO EM REDES SOCIAIS: UM INCENTIVO A CONSTRUÇÃO DE COMPUTAÇÃO INCLUSIVA",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.ª Dr.ª Luciana Bolan Frigo",
    "Coorientador(a)": null,
    "Resumo": "Pensando em incluir diversidades no uso da interface de sistemas, é necessário repensar as metodologias clássicas empregadas no desenvolvimento destes sistemas, para melhor atender as necessidades dos usuários. A interação humano-computador (IHC) é uma disciplina que aborda a interação humana com sistemas computacionais em um contexto social. Neste contexto, pode-se integrar teorias feministas, incluendo a HCI clássica um tratamento mais pessoal e visando a inclusão social, principalmente no que tange as questões de gênero. Este trabalho tem como finalidade apresentar os conceitos e benefícios desta integração para a vida em sociedade, sem aplicar padrões incoerentes, de uma rede social, amplamente difundida como o caso do Facebook de acordo com os princípios e métodos adotados na IHC feminista. Desta forma, foi possível, identificar e sugerir melhorias na interface da rede social, e validar as teorias apresentadas.",
    "Palavras-chave": [
        "IHC feminista",
        "gênero",
        "mulheres na tecnologia",
        "metodologias de interação",
        "redes sociais"
    ],
    "Introdução": "Em alguns cursos da área de computação há um crescimento no número de mulheres, como no caso do curso de Tecnologias da Informação e Comunicação (TIC) da Universidade Federal de Santa Catarina, que segundo DAROLT (2015, p. 34) ”a média feminina de inscritas em 2015 no curso de TIC, foi de 29,57%, onde houve um crescimento, comparando com 2010 onde essa taxa foi de 26,81%”. Tradicionalmente, mulheres buscam cursos voltados às áreas mais de humanas e de saúde, como psicologia, pedagogia, odontologia, entre outros. Tal realidade é encontrada no Campus da UFSC Araranguá, onde a maior parte dos estudantes de Engenharia de Computação, são do sexo masculino, enquanto a maior parte dos estudantes de Fisioterapia, são do sexo Feminino.\n\nEssa diferença acaba sendo refletida dos sistemas digitais que são desenvolvidos de forma extremamente técnica e acabam esquecendo do usuário, tornando-se complexos e com pouca utilidade e divergindo ideias entre autores. Segundo BIM (2011) alguns motivos que levam a esse tipo de realidade é que homens, tendem a querer agir individualmente, sem muito contato com pessoas, preferindo trabalhar com máquinas enquanto, “mulheres são mais sensíveis e pensam mais no lado humano, e sentimental, querendo agregar seus conhecimentos em problemas onde haja uma troca”.\n\nPensando em aumentar o interesse das mulheres na área computacional, há algum tempo vem sendo desenvolvidos projetos, voltados ao público feminino como por exemplo, o Meninas Digitais – Regional Sul - UFSC do Laboratório de Tecnologias Computacionais (LabTeC), que realizam várias atividades com meninas usando recursos ligados à área de computação em forma de oficinas, e a fim de motivar e atrair mais mulheres para a área tecnológica.\n\nAs metodologias tradicionais de interação humano computador (IHC) trazem uma visão prática do usuário para o sistema, mas são limitadas quanto a visão real que explora sensações, usabilidade e inclusão. Nesse contexto estas metodologias vêm sendo discutidas e reformuladas atribuindo conceitos do estudo da psicologia, e como apresentaremos ao longo do trabalho, alguns estudos sociológicos, em relação a gênero, opiniões, e diversidade, neste texto representadas pela teoria feminista.\n\nEm 2011, ocorreu na cidade de Vancouver, no Canadá, o ACM CHI Conference sobre fatores humanos, onde foram apresentados diversos artigos e workshops de temas ligados à área de interface e interação, e entre os temas que mais chamaram atenção estava o IHC feminista, que integra teorias feministas em metodologias tradicionais de IHC e traz à tona diversas percepções e desafios de inclusão se tratando de tecnologia e design.\n\nCom a ampla disseminação das redes sociais, se faz necessário o desenvolvimento de interfaces que se preocupam com as pessoas de forma mais individualizada. Existe uma diversidade de usuários nas redes sociais, e a padronização ao mesmo tempo que facilita o trabalho dos desenvolvedores de sistema, limita e prejudica o acesso a tais sistemas de maneira a reduzir a inclusão digital. Este trabalho busca analisar uma rede social com relação a forma de interação e comunicação desta com seus usuários, no que tange a representação e expressão da vida real na vida virtual.",
    "Conclusão": "O objetivo deste estudo analisar e adaptar uma metodologia de IHC feminista para aplicar no projeto e desenvolvimento de interfaces interativas, afim de aproximar e incluir nas redes sociais, apresentando conceitos e benefícios desta, que foi estudada como base a repensar as metodologias clássicas empregadas no desenvolvimento de sistemas web, para melhor atender as necessidades dos usuários, respeitando as diferenças e sentimentos de cada um em suas particularidades.\n\nEm um contexto histórico as abordagens de IHC tradicional vem evoluindo e se integrando cada vez mais desde os anos 90, e por isso a necessidade de apresentar seus conceitos neste trabalho, para que se pudesse apresentar as mudanças para a abordagem feminista. O propósito não é mudar a abordagem tradicional ao todo e sim integrar aspectos das teorias feministas para transformar e incluir uma parcela da sociedade que não está representada nas redes sociais. As redes sociais vêm crescendo cada vez mais e estão cada vez mais presentes no dia a dia das pessoas. O Facebook hoje é a rede social com mais usuários no mundo e por este motivo, escolhida para analise neste trabalho. (CHILANA et al., 2012)\n\nCom o referencial teórico abordado, foi feito uma análise da metodologia que seria utilizada neste trabalho, aqui representado por uma pesquisa de caráter exploratório, utilizando estudo de caso, pois houve uma avaliação da interface do Facebook, e dados quantitativos e qualitativos, nos questionários aplicados.\n\nA análise do Facebook foi feita visando encontrar fatores congruentes com a teoria de IHC Feminista, que a interface possui ou que lhe falta. Foi citada a importância dos botões de reação que expressão o sentimento do usuário em relação a determinado assunto abordado nas postagens, e sua melhoria em possibilitar uma interação melhor com outros usuários do sistema, no Facebook caracterizados por “amigos”. Também foi mostrado a falta de considerar uma postagem de foto como algo importante ao usuário em questão, que lhe permite recordar de um momento especial ou algo que lhe interesse e não a quem vai ver.\n\nForam feitos dois questionários que possibilitaram aprofundar as analises, e mostrar o quanto ainda falta ao Facebook respeitar as diversidades como conscientizar sobre como o sistema opera e pode afetar um usuário e não oprimir o usuário. Estes foram baseados nas 10 heurísticas de Nielsen na IHC tradicional e nos focos propostos por Bardzell sobre IHC feminista, propondo uma integração entre as duas teorias, buscando uma melhor liberdade de expressão do usuário em relação ao sistema, mas respeitando a capacidade de sintetizar dados. A IHC feminista é um campo bastante novo, e vem sido abordado em países como Canada, Estados Unidos, e até no Brasil, ainda que muito pouco. É difícil encontrar pesquisas com respostas concretas sobre as melhorias em sistemas utilizando esta abordagem, inclusive este é uma das sugestões para trabalhos futuros, já que este tinha como objetivo analisar a IHC feminista no Facebook. Outra proposta é analisar essa abordagem nova em outros sistemas ou redes sociais, e sua eventual aplicabilidade. O que podemos comprovar com esse estudo, é que as práticas mencionadas pela teoria feminista são sim importantes, já que cada ser humano é diferente e pensa de forma diferente, e não adianta os sistemas se preocuparem com o usuário, quando na verdade se preocupam com um tipo especifico de usuário, e não o usuário e suas diversidades. A psicologia e a sociologia é uma aliada extremamente importante na computação, porque afinal de contas, um computador não serve para nada, sem um usuário final direto ou indireto."
}