{
    "Autor": "Natana Lopes Pereira",
    "Título": "Ambiente Virtual de Aprendizagem na Mediação da Estruturação de Monografias",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Fernando José Spanhol",
    "Coorientador(a)": null,
    "Resumo": "Este estudo apresenta como tema o uso do AVA na estruturação de TCC no ensino superior. Para realização deste trabalho elaborou-se um roteiro de atividades no AVA – Moodle da disciplina de metodologia da pesquisa científica, para mediar o processo de estruturação de monografias. O objetivo da pesquisa é utilizar o Ambiente Virtual de Aprendizagem para mediar o processo de estruturação das Monografias dos alunos do curso Pós TIC SENASP turma 2015-2017, utilizando como estratégia Técnicas de Ead. Assim o presente estudo pretende responder a seguinte questão de pesquisa: O Ambiente Virtual de Aprendizagem pode auxiliar o processo de estruturação de monografias por meio de técnicas de Ead? Para responder a tal questão utilizou-se o método comparativo e qualitativo para analisar respostas obtidas por meio de um instrumento de coleta de dados eletrônico aplicadas às duas turmas do curso (turma 2013-2015 e 2015-2017). O trabalho fundamentou-se na análise do AVA por Pereira (2007), Silva (2011) e Lacerda (2013), na utilização das TIC na Educação por Kenski (2014), Sousa, Moita e Carvalho (2011), Areu e Fofonca (2014), em conceitos e evolução da Ead por Moore e Kearsley (2010), a utilização do AVA para elaboração de TCC em Ead investigada por Machado et al. (2014), Poppe (2015), Medeiros et al. (2015), Silva, Sihrlei e Silva (2012) entre outros. Fundamentou-se a busca por estudo sobre método científico nos autores Marconi e Lakatos (2010), Freire (2013), Gerhardt e Silveira (2009) e Gil (2010). A análise dos dados coletados demonstrou a importância da utilização do AVA no processo de mediação para estruturação de monografias. A pesquisa também identificou algumas dificuldades apresentadas pelos professores e alunos, sendo a principal referente ao tempo disponível para elaboração do TCC. Cabe uma discussão sobre o uso do AVA em dispositivos móveis e exploração de suas diversas ferramentas para melhor atender as necessidades dos acadêmicos que encontram como barreira no processo de ensino-aprendizagem a variável tempo.",
    "Palavras-chave": "TCC, AVA, Técnicas de educação a distância, Metodologia Científica",
    "Introdução": "A educação superior abrange cursos de graduação e pós-graduação (mestrado, doutorado, especialização e aperfeiçoamento). Uma das finalidades do curso superior, de acordo como a lei de Diretrizes e Bases da Educação Nacional - LDB1 de 1996 é incentivar o trabalho acadêmico e investigação científica, visando o desenvolvimento da ciência, da tecnologia e da criação e difusão da cultura. Com base nessa afirmação e considerando o advento das Tecnologias da Informação e Comunicação - TIC na educação e a interferência da nova cultura digital informada por Areu e Fofonca (2014), o Ambiente Virtual de Aprendizagem - AVA torna-se cada vez mais presente no ensino superior presencial como uma ferramenta de apoio ao ensino-aprendizagem. Suas ferramentas de TIC possibilitam a mediação desse processo ocasionando (em) uma maior interação entre o aluno e professor auxiliando no processo de elaboração de Trabalhos de Conclusão de Curso - TCC. Ressalta-se que a sigla ou o termo AVA é utilizado neste trabalho como sinônimo de Ambiente Virtual de Ensino Aprendizagem – AVEA abrangendo em seu entendimento o ensino-aprendizagem. De acordo com a concepção de Pereira (2007) o termo AVA é mais difundido no Brasil e objetiva proporcionar meios para que ocorra aprendizado ressaltando a importância de ensino nesse processo. A Educação a Distância - Ead utiliza o AVA como ferramenta principal para o ensino-aprendizagem. O aprimoramento das ferramentas de TIC disponibilizadas, e o aperfeiçoamento de técnicas (roteiro, atividades, suporte virtual e (ou) presencial) aplicadas ao processo de elaboração de TCC é cada vez mais eficaz na Ead (MACHADO et al., 2014a). O avanço tecnológico modificou a forma de absorção do conhecimento, acarretando mudanças no processo de ensino-aprendizagem e influenciando em uma nova análise no cenário da educação superior. Sousa, Moita e Carvalho (2011) enfatizam que devido ao avanço tecnológico os cursos superiores estão aderindo ao uso das tecnologias educacionais, auxiliando no processo de ensino-aprendizagem. A Ead vem ao longo dos anos aperfeiçoando, por meio das tecnologias digitais, o processo de ensino-aprendizagem. Kenski (2014) relata que esse avanço possibilitou novas formas de uso das tecnologias, proporcionando maior flexibilização na construção de conhecimento, por meio da utilização de recursos tecnológicos para a produção, a propagação e a interação de comunicação entre alunos, professores e tutores. Os Ambientes Virtuais de Aprendizagens – AVAs surgem nesse contexto visando uma nova forma de aprendizagem, possibilitando novas formas de conhecimento e auxiliando na limitação imposta pela distância. Segundo Simão Neto (2010) os AVAs são utilizados para educação a distância, e-learning2 e aprendizagem on-line, sendo também cada vez mais utilizados na educação presencial. Uma nova geração de estudantes passa a ser reconhecida com a característica principal de estar em busca constante por conhecimento. Os dispositivos da informação e comunicação são os principais responsáveis por essa nova forma de aprendizagem, estando cada vez mais presentes em sala de aula (SIMÃO NETO, 2010). O curso de Especialização em Tecnologias da Informação e Comunicação aplicadas à Segurança Pública e Direitos Humanos – Pós TIC SENASP, oferecido na Universidade Federal de Santa Catarina – UFSC campus Araranguá, utiliza a plataforma Moodle (utilizada pela Universidade Federal de Santa Catarina) como suporte ao ensino presencial. Essa plataforma de acordo com Silva (2011) possui diversas ferramentas de TIC que contribuem no processo de ensino-aprendizagem. Ele é realizado no âmbito da Rede Nacional de Altos Estudos em Segurança Pública (RENAESP), através do termo de cooperação com a Secretaria Nacional de Segurança Pública (SENASP) do Ministério da Justiça (MJ). De acordo com Pereira, Spanhol e Almeida (2016, p.199 apud BRASIL, 2015): A Renaesp é um projeto de educação permanente, voltado aos profissionais de segurança pública, e também aos interessados e atuantes nesta área. A rede constitui-se a partir da parceria com Instituições de Ensino Superior (IES), que promovem cursos de pós-graduação lato sensu, na modalidade presencial, sobre diferentes temas relacionados à Segurança Pública. O curso foi elaborado de acordo com a necessidade e oportunidade de qualificar os profissionais de segurança pública, fundamentando-se na Matriz Curricular Nacional para ações formativas dos profissionais da área de segurança pública do MJ / SENASP, e Cadernos Temáticos de Tecnologias da Informação e Comunicação - TIC (sistemas aplicados a Segurança Pública) desenvolvido pela ABDI3. A Secretaria Nacional de Segurança Pública – SENASP, e as instituições que são responsáveis pelo planejamento, execução e avaliação das Ações Formativas para profissionais de Segurança Pública enfatizam que de acordo com Brasil (2009, p.6): [...] o investimento e desenvolvimento de ações formativas são necessários e fundamentais para a qualificação e o aprimoramento dos resultados das instituições que compõem o Sistema de Segurança Pública frente aos desafios e às demandas da sociedade. De acordo com o Caderno Temático em TIC aplicadas a Segurança Pública da Agência Brasileira de Desenvolvimento Industrial – ABDI (2010), os investimentos estratégicos em TIC na segurança pública podem aperfeiçoar diversos processos referente a segurança da população, proporcionando maior agilidade e menores custos. O projeto visa contribuir com ações prioritárias da RENAESP. Tem como objetivo capacitar profissionais de Segurança Pública na utilização de Tecnologias da Informação e Comunicação para prevenção, combate e diminuição da violência e criminalidade, bem como, da defesa e promoção dos direitos humanos no extremo sul catarinense (PEREIRA; SPANHOL; ALMEIDA, 2016 apud PEREIRA, 2015). Além da capacitação de profissionais de segurança pública o projeto apresenta como objetivo, segundo Pereira, Spanhol e Almeida (2016, p.198 apud PEREIRA, 2015) “[...] a consolidação de interinstitucionais e de movimentos sociais com projetos de ensino, pesquisa, extensão e inovação na área de TIC aplicada à Segurança Pública e Direitos Humanos [...]”. O curso é de modalidade presencial de periodicidade quinzenal. Para sua conclusão é obrigatório o desenvolvimento e apresentação da monografia como trabalho de conclusão de curso, sendo essa definição requisito do edital de chamada pública nº 01, de 21 de julho de 2014. Apresenta como referência a matriz Curricular Nacional, contendo-se nas temáticas de Gestão do Conhecimento, Informações sobre Violência, Criminalidade, Segurança Pública e Direitos Humanos (PEREIRA; SPANHOL; ALMEIDA, 2016). Atualmente o curso está em sua segunda edição. A primeira turma do curso iniciou suas atividades acadêmicas em 2013, com 33 alunos compondo o corpo discente, e encerramento em 2015 com 17 formandos. A reedição do curso iniciou suas atividades acadêmicas em novembro de 2015, com a participação de 32 discentes. Seu encerramento está previsto para maio de 2017. Diante da aderência às TIC no ensino e da utilização do AVA na elaboração de TCC em Ead constituiu-se o estudo de caso utilizando o AVA na mediação para estruturação das monografias dos alunos Pós TIC SENASP turma 2015-2017.",
    "Conclusão": "Tendo como parâmetros os objetivos apresentados no início dessa monografia: Realizar um levantamento bibliográfico referente às áreas de pesquisa envolvidas no trabalho proposto; Analisar como ocorre o processo de orientação de Trabalho de Conclusão de Curso - TCC em Educação a Distância - Ead; Elaborar roteiro de atividades aplicadas no Ambiente Virtual de Aprendizagem - AVA da disciplina de metodologia da pesquisa científica; Desenvolver quadro comparativo entre os dados coletados das turmas envolvidas na pesquisa, considera-se que os mesmos contribuíram para o desenvolvimento do estudo apresentado. Os objetivos estabelecidos e alcançados nortearam a execução do trabalho para atendimento ao objetivo geral da pesquisa. A pesquisa bibliográfica proporcionou maior conhecimento dos temas da Educação a distância, AVA e Metodologia Científica. Segundo Machado et al. (2014b) a comunicação é a principal “ferramenta” para a orientação de TCC, em Ead, sendo necessário utilizar as TIC para auxiliar nesse processo. A análise do AVA no processo de orientação em Ead auxiliou na elaboração de um roteiro de atividades adequado ao perfil do aluno Pós TIC SENASP, utilizando os mesmo conceitos de interação por meio das TIC e apoio permanente, virtual e presencial. Após a execução do estudo de caso e realização de análise comparativa entre os dados coletados de ambas as turmas, pode-se confirmar a hipótese criada nesse trabalho, sobre a contribuição do AVA e técnicas de Ead no processo de estruturação de TCC no ensino superior presencial. Por meio dessa abordagem pode-se perceber a relevância do AVA no processo de interação entre atores envolvidos para estruturação de TCC. Segundo Silva, Sihrlei e Silva (2012) esse trabalho final é causador de desistências em cursos de graduação e pós-graduação, sendo um dos motivos a necessidade de comunicação constante entre orientando e orientador e um bom planejamento (prévio) de pesquisa. Além da contribuição do AVA por meio do método elaborado, a pesquisa também demonstrou algumas dificuldades encontradas pelos atores envolvidos em ambas as turmas, sendo a principal a adversidade a variável tempo. Devido a atuação profissional dos alunos e ao acúmulo de processos criados advindos da cultura digital, a indisponibilidade de tempo para dedicação às atividades do roteiro proposto foi um agravante no desenvolvimento da pesquisa. Em consonância com essa questão, um item importante demonstrado no estudo apresentado foi o aumento do uso de dispositivos móveis no curso, mas em contrapartida os mesmos não são utilizados no processo de comunicação (interação) com o orientador. Por fim, enfatiza-se a importância do roteiro elaborado que por meio da disciplina de metodologia de pesquisa científica que proporcionou ensino-aprendizagem em metodologia científica, planejou antecipadamente as etapas para elaboração dos itens de pesquisa (estruturação) da monografia e incentivou a comunicação para orientação, sendo esses primordiais para a elaboração e desenvolvimento de TCC."
}