{
    "Autor": [
        "Mayara Sousa Stein",
        "Raissa Boeng da Silva"
    ],
    "Título": "UM ESTUDO SOBRE A UTILIZAÇÃO DO NFC: TECNOLOGIA QUE TENDE A APROXIMAR A INTERNET DAS COISAS DA VIDA DOS BRASILEIROS",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Eliane Pozzebon",
    "Coorientador(a)": null,
    "Resumo": "Internet das coisas (IoT) e NFC ( Near Field Communication ) são assuntos que estão em alta em diversos países. O objetivo deste trabalho é identificar a concepção de entrevistado sobre a tecnologia NFC e propor algumas aplicações para aumentar a sua utilização no Brasil. Para identificar a concepção destes indivíduos foi aplicado um questionário para traçar o perfil do entrevistado, seu conhecimento sobre as tecnologias citadas e seu grau de aceitação sobre elas. Como resultado obteve-se que 43,3% dos entrevistados conhecem IoT e o NFC, sendo que 29,2% atua na área de tecnologias. Outra informação relevante é que a maioria dos entrevistados visualizam a utilização do NFC em inúmeras soluções futuras. Quanto a proposta de aplicações, foram elaborados três experimentos para auxiliar no cotidiano desses usuários. O resultado dos experimentos foram satisfatórios.",
    "Palavras-chave": [
        "Internet das coisas",
        "IoT",
        "NFC",
        "Internet of Things",
        "Near Field Communication",
        "Etiquetas de Identificação",
        "Comunicação entre objetos"
    ],
    "Introdução": "A internet é um meio de comunicação que encontra-se em constante evolução, apresentando novos paradigmas. Ela revolucionou os modelos de interações na sociedade e ambiente, pela maneira simples e eficiente de trocas de informações. Além de computadores também pode conectar objetos e itens do dia a dia entre si, trazendo melhor feedback para solucionar problemas e buscar oportunidades de aplicações. A conectividade colabora para obter a melhor tomada de decisão com base em dados e informações, em tempo real, provido da interação e da conexão. O mundo físico está se tornando um grande ecossistema de informação, fato que adquire proporções inimagináveis com o surgimento da Internet das Coisas. Os objetos tanto podem sentir o ambiente como se comunicar independentemente de intervenções humanas. Tornam-se, portanto, participantes ativos nos processos de negócio, e passam a ser reconhecidos e identificados em ambientes inteligentes, que recuperam dinamicamente informações na Internet, promovendo sua funcionalidade adaptativa e responsiva (CHUI et al., 2010; WEBER, 2013 apud LACERDA; LIMA-MARQUES, 2017). De acordo com o ABINC (2017), a internet passou por três grandes gerações, sendo a primeira a geração da digitalização da informação. A segunda geração ficou conhecida como web 2.0, pela quantidade de pessoas conectadas a aparelhos e a internet. A terceira geração é a capacidade de conectar pessoas e objetos a internet e comunicarem entre si, formando a internet das coisas. A IoT (2017) explica que com a conectividade generalizada, com a alta produção de dados e os objetos se tornando inteligentes, onde os computadores cada vez mais desaparecem, enquanto desenvolve novas tecnologias de comunicação entre objetos, tornando-as quase imperceptíveis e centrados em dados. A conectividade tem um enorme potencial para fornecer valor, tornando tarefas simples automáticas. Os estudos sobre essas tecnologias emergentes que proporcionam a comunicação entre objetos ainda são muito escassos, principalmente no Brasil. Poucos são os que a conhecem e menor ainda sua utilização. E dentre as tecnologias existentes que tratam de comunicar objetos trazendo a realidade da internet das coisas, está o Near Field Communication, ou comunicação por campo de proximidade, comumente chamado de NFC. Esta já está presente em muitos aparelhos móveis, e utilizada em tarefas como pagamentos com smartphone, porém, as pessoas não conhecem a tecnologia que está por trás destas tarefas. O NFC permite a comunicação próxima, ou seja, entre dispositivos, dispositivos e etiquetas e outros, e pode ser feita de diversas maneiras como será explicado neste trabalho. Assim, julga-se importante neste trabalho de conclusão de curso identificar a percepção dos brasileiros sobre a tecnologia NFC, se estes a conhecem, se a utilizam, e se não, poder apresentar-lhes e demonstrar o uso com exemplos simples do dia a dia, buscando introduzir estas tecnologias na vida do brasileiro, aproximando o futuro da internet das coisas do país.",
    "Conclusão": "O objetivo deste trabalho foi identificar a concepção dos entrevistados sobre a tecnologia NFC e propor sua utilização em alguns experimentos a fim de aproximar a Internet das Coisas. Quanto a concepção dos indivíduos, foi elaborado um questionário para obter a opinião sobre a tecnologia NFC. Como resultado obteve-se maioria possuindo conhecimento de ambos os temas representando um percentual de 43,3% de pessoas, contra 35,4% desconhecendo dos assuntos abordados. Os demais obtinham conhecimento de apenas um tema em individual. Maior parte da amostra dos indivíduos entrevistados atuam na área das tecnologias, demonstrando que este resultado já era esperado. Quando questionados sobre o contato com o NFC obteve-se 64,6% respondendo negativamente contra apenas 35,4% respondendo positivamente. Confirmando o fato de que o país ainda se encontra distante da realidade da comunicação entre objetos. Quanto a proposta de utilização da IoT com as etiquetas de NFC, realizaram-se três experimentos: o download do aplicativo Minha UFSC através de uma etiqueta NFC colocada em cartazes no campus universitário disponibilizada à comunidade acadêmica; a configuração do smartphone através de uma etiqueta colocada em cartazes para um ambiente que requer silêncio aplicados em uma biblioteca e sala de estudos; e a disponibilização de informações em etiquetas colocadas em coleiras sobre os donos de animais domésticos com intuito de ajudar a solucionar o problema de animais perdidos. Aplicados estes experimentos, foi possível visualizar que a maior parte dos indivíduos apreciaram as soluções e se interessaram em utilizar no cotidiano, demonstrando interesse em conhecê-la mais profundamente aplicando a solução em diferentes tarefas e recomendando a amigos e familiares. Logo, baseado nas diversas opiniões dos usuários, é possível projetar uma escala gradativa do uso da tecnologia NFC no Brasil fazendo com que a realidade da internet das coisas apresente-se mais próxima. Constata-se então o êxito na contribuição de novos conhecimentos levando informações para um grande público antes desconhecedor de tais conceitos e na proposição de uso da tecnologia utilizando-se da tag NFC e seus smartphones, concluindo o objetivo geral do trabalho."
}