{
    "Autor": "Arthur Paulino Malgarisi Aguiar",
    "Título": "Desenvolvimento de um Sistema Web para a Gestão da Assistência Social em Forquilhinha /SC",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.(a) Giovani Mendonca Lunardi, Dr.(a)",
    "Coorientador(a)": null,
    "Resumo": "Este estudo investiga o impacto da implementação de um aplicativo de gestão da assistência social no município de Forquilhinha. Com foco na efetividade dos serviços do Sistema Único de Assistência Social (SUAS), busca-se analisar como essa ferramenta influencia no acesso e na garantia de direitos dos usuários. O objetivo principal é propor o desenvolvimento de um sistema web que otimize a gestão e o acesso aos serviços de assistência social. A metodologia adotada inclui abordagens qualitativas e quantitativas, como revisão bibliográfica, análise documental, estudo de caso e desenvolvimento de um sistema web. Espera-se contribuir para o aprimoramento das políticas sociais em Forquilhinha e gerar conhecimento sobre o uso de tecnologias na gestão da assistência social.",
    "Palavras-chave": "Assistência social, Tecnologia, Inclusão, SUAS.",
    "Introdução": "A assistência social no Brasil assume um papel crucial na construção de uma sociedade justa e equitativa, garantindo a proteção dos mais vulneráveis e promovendo a inclusão social. Em um país marcado por profundas desigualdades sociais, a assistência social emerge como uma ferramenta indispensável para assegurar direitos básicos e reduzir as disparidades entre diferentes grupos da população. A desigualdade no Brasil é evidenciada por índices de pobreza, falta de acesso a serviços básicos e disparidades de renda, que afetam significativamente as oportunidades e a qualidade de vida de milhões de cidadãos. A importância da assistência social no Brasil se traduz na necessidade de prover suporte a essas camadas mais vulneráveis da sociedade, assegurando que tenham acesso a benefícios e serviços que promovam a dignidade e o bem-estar. Programas como o Bolsa Família, o Benefício de Prestação Continuada (BPC) e outros serviços assistenciais visam não apenas a redução da pobreza, mas também o fortalecimento da inclusão social e a promoção de uma maior equidade no acesso a oportunidades e direitos.",
    "Conclusão": "Em conclusão, o desenvolvimento deste sistema de gerenciamento de programas e serviços de assistência social foi um projeto desafiador e enriquecedor. Ele demonstrou a importância de uma abordagem estruturada e colaborativa no desenvolvimento de soluções tecnológicas para o setor público. As dificuldades enfrentadas foram superadas com dedicação, criatividade e apoio, resultando em um sistema funcional e útil para a Secretaria de Assistência Social. O sistema desenvolvido não apenas atende às necessidades imediatas da Secretaria, mas também estabelece uma base sólida para futuras melhorias e expansões. As sugestões de melhorias futuras oferecem um caminho claro para a evolução contínua do sistema, garantindo que ele continue a atender às demandas dos seus usuários de forma eficiente, segura e adaptável às mudanças. Este projeto reafirma a importância da inovação tecnológica na melhoria dos serviços públicos e destaca o potencial das ferramentas modernas para transformar a administração pública. Acreditamos que este sistema será uma ferramenta valiosa para a Secretaria de Assistência Social e contribuirá significativamente para a eficiência e transparência na gestão dos programas e serviços oferecidos à população."
}