{
    "Autor": "Elias Renato da Silva Diniz",
    "Título": "GOVERNANÇA ELETRÔNICA NO BRASIL E O PAPEL DAS TECNOLOGIAS DA INFORMAÇÃO E COMUNICAÇÃO",
    "Ano de publicação": "2014",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Esteves",
    "Coorientador(a)": null,
    "Resumo": "A governança eletrônica surge do ponto comum para que todas as áreas da administração pública convergem: o desenvolvimento e o bem estar da sociedade. Na governança eletrônica, as tecnologias da informação e comunicação são utilizadas e otimizadas pelos órgãos públicos para que haja uma administração mais transparente e justa, para que exista a inclusão digital e a participação do cidadão nas tomadas de decisões públicas. A boa governança, em conjunto com as tecnologias da informação e comunicação, mais precisamente as voltadas ao uso da internet, geram oportunidades e um estreitamento na relação entre os governos e a sua sociedade. Contudo, o avanço tecnológico na administração pública possui algumas barreiras que devem ser contornadas pelos órgãos públicos. Este trabalho apresenta os principais conceitos e diferenças da governança eletrônica e do governo eletrônico, da boa governança e seus benefícios para a sociedade, das dificuldades enfrentadas na inclusão digital, e da e-participação. Este trabalho apresenta ainda como surgiu o conceito da governança eletrônica no mundo, o surgimento no Brasil através de uma linha do tempo, e as contribuições das tecnologias da informação e comunicação.",
    "Palavras-chave": "Governança Eletrônica. Governo Eletrônico. Boa Governança. Inclusão Digital.",
    "Introdução": "A ideia de governo eletrônico, embora muitas vezes associada ao uso de tecnologias da informação e comunicação no setor público, ultrapassa essa dimensão. Para (AGUNE; CARLOS, 2005), em alguns casos, esta ideia está vinculada à modernização da administração pública por meio do uso de tecnologias de informação e comunicação e na melhoria da eficiência dos processos operacionais e administrativos dos governos. O governo eletrônico, também conhecido por e-gov ou por e-governo, representa em seu contexto, o acesso dos cidadãos aos serviços disponibilizados pelos governos via internet. A prestação eletrônica destes serviços pelo governo engloba outro aspecto: a governança eletrônica, que é o resultado do uso do e-gov pelos governos, os quais desenvolvem suas políticas com a participação direta da sociedade utilizando-se das tecnologias de informação e comunicação (GUIMARÃES; MEDEIROS, 2005). Segundo (BARRETO JUNIOR, 2007), nossa sociedade está diante de uma grande revolução digital, que está ligada ao avanço das novas tecnologias e dos meios de comunicação em massa, sendo convencionado o termo Sociedade da Informação para definir o atual momento histórico e social no mundo. Graças à rede de comunicação global, a própria natureza da cidadania democrática passa por uma profunda evolução que, uma vez mais, se encaminha no sentido de um aprofundamento da liberdade: desenvolvimento do ciberativismo à escala mundial (claramente ilustrado pelos movimentos antiglobalização), organização das cidades e regiões digitais em comunidades inteligentes, em ágoras virtuais, governos eletrônicos cada vez mais transparentes ao serviço dos cidadãos e voto eletrônico (LÉVY, 2002). O termo governança pode ser descrito como um processo pelo qual os órgãos públicos dirigem-se à sociedade. Neste processo, as interações entre o Estado, empresas privadas e a Sociedade Civil estão sendo cada vez mais condicionados e modificados pela influência das tecnologias da informação e comunicação. Isto converge no fenômeno da governança eletrônica. (PATIL, 2010) Exemplos destas mudanças no comportamento são exemplificados através de: O uso da Internet pela sociedade civil, ONGs e associações de profissionais, para mobilizar a opinião e influenciar a tomada de decisões públicas dos processos que os afetam; A divulgação pública eletrônica de informações e serviços cada vez maior; A publicação eletrônica de projetos de leis e declarações de direção para comentários do público; Ao lado da infraestrutura, a liberalização dos mercados de telecomunicações e as tendências à telefonia móvel digital e Smart TVs estão facilitando essa evolução.",
    "Conclusão": "Os modelos de governança mais tradicionais são voltados ao desenvolvimento eficiente das políticas públicas e do melhor aproveitamento e aplicação dos recursos. As tecnologias da informação e comunicação são uma ponte que ligam a necessidade de uma boa governança a uma governança eletrônica eficiente. A utilização das TIC, sobretudo as tecnologias voltadas para a internet, pelos órgãos governamentais gera mais transparência e agilidade na prestação dos serviços públicos. Aliado a isso, com cidadãos, de qualquer classe social, cada vez mais incluídos digitalmente e motivados a participar eletronicamente da fiscalização e das tomadas de decisão, a sociedade se desenvolve mais economicamente. O Brasil é um dos pioneiros na utilização de recursos eletrônicos por órgãos públicos. A legislação federal é uma das melhores do mundo em termos de transparência, e a Lei de Responsabilidade Fiscal é um excelente recurso no combate à corrupção. As TIC foram essenciais neste processo de modernização da administração pública. Em termos de inclusão digital, o país possui bons programas públicos, mas a falta de ferramentas, principalmente da internet, tem afetado às classes de menor renda. A participação eletrônica do cidadão é essencial para o processo democrático, transparente e de planejamento dos órgãos públicos; neste quesito, o Brasil fica abaixo de alguns países da América Latina. Este trabalho levantou o estado da arte da Governança Eletrônica no Brasil, como ela se iniciou e, diante dos principais eventos históricos ocorridos no país, foi traçada uma linha do tempo da governança eletrônica no Brasil. Através dos eventos listados nesta linha do tempo, podemos listar os seus principais benefícios para a sociedade, visíveis no quadro 4. Desta forma, pode-se avaliar positivamente a contribuição das tecnologias da informação e da comunicação no processo de criação de uma governança eletrônica. Neste trabalho também foram abordados os principais conceitos existentes da governança e da governança eletrônica, seus pilares e diferenças do governo eletrônico, a história do surgimento do termo no mundo e como se iniciou o processo no Brasil. No final, foram efetuados testes em softwares disponibilizados pelo Governo Federal do Brasil, onde se concluiu que os softwares atendem ao seu propósito final, contudo, devem melhorar, principalmente, as suas opções de acessibilidade. Um governo para todos precisa que os seus softwares sejam também para todos."
}