{
    "Autor": "Clayson Medeiros da Silva e Matheus Duarte Dias",
    "Título": "TÉCNICAS DE ELICITAÇÃO DE REQUISITOS: UM ESTUDO DE CASO PARA UM SISTEMA DE GESTÃO FINANCEIRA",
    "Ano de publicação": 2018,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Helio Aisenberg Ferenhof",
    "Coorientador(a)": null,
    "Resumo": "A tarefa de elicitação de requisitos é demasiada complexa para o engenheiro de software, pois nem sempre os stakeholders possuem um total entendimento do domínio do problema que deve ser resolvido, ou até mesmo possuem dificuldades para demonstrar os problemas ao mesmo. Este trabalho visa elencar por meio de uma pesquisa exploratória bibliográfica nos principais autores do ramo de engenharia de software, as principais técnicas para elicitação de requisitos. Após o levantamento das técnicas, um estudo de caso é desenvolvido, onde as técnicas encontradas são aplicadas em diferentes etapas do processo de elicitação de requisitos de software. Por fim, uma análise de cada técnica de elicitação de requisitos é executada por meio do método dedutivo e indutivo, demonstrando os pontos positivos e pontos negativos bem como em qual etapa da elicitação de requisitos essas técnicas podem ser melhores empregadas. Como resultado percebeu-se que para garantir a qualidade do software, é de suma importância que a elicitação de requisitos seja tratada com atenção pela equipe de software ao início do projeto, pois deve-se evitar que novos requisitos apareçam em meio ao desenvolvimento do sistema, de forma gradual, para assim evitar custos com retrabalho e não desenvolver rotinas que não estão de acordo com a necessidade dos stakeholders.",
    "Palavras-chave": "Elicitação. Requisitos. Engenharia. Sistemas. TIC.",
    "Introdução": "Produzir um software com qualidade não significa apenas atingir os objetivos esperados pelos usuários, é uma tarefa muito mais complexa que envolve todo o ciclo de vida do sistema (BALTAZHAR, 2007). A subjetividade de qualidade é imensa. Durante anos diversos autores definem 'qualidade' de software de maneiras diferentes, Bueno e Campelo (1999) relacionam diretamente a qualidade de software às atividades de homologação presentes em todo o processo de desenvolvimento, já para Pressman (1995) a qualidade está atrelada a conformidade com os requisitos elicitados e as características implícitas de um sistema. Tavares (2006) por sua vez, afirmam que qualidade de software não significa perfeição e a classifica como um conceito multidimensional que engloba diversos atributos relacionados ao desenvolvimento, manutenção e uso. Atributos estes que devem ser pensados antes mesmo da geração do primeiro código fonte, evitando assim custos que poderiam ser reduzidos com um processo de elicitação bem estruturado. Na visão de Bueno e Campelo (1999), os custos de qualidade podem ser divididos em 3 grandes grupos: 1) os custos de prevenção, que representam o menor custo do processo de qualidade, custos estes que vão desde o planejamento da qualidade ao treinamento; 2) os custos de avaliação que podem ser aplicados já no desenvolvimento, incluindo processos de homologação e testes, e 3) os custos de falhas, os quais são os mais críticos e com maior valor de correção, podendo ainda ter causas internas como o retrabalho ou causas externas como a resolução de queixas, suporte dentre outros. Neste aspecto, a elicitação de requisitos tem papel fundamental no processo de desenvolvimento pois além de ser extremamente importante para guiar e auxiliar na comunicação durante a elaboração do projeto ela serve de referência para os processos de manutenção (AMBLER, 2001). Requisitos são definidos por Engholm Júnior (2010) como uma condição ou funcionalidade que deve estar presente em um software para atender determinada necessidade. A etapa de elaboração de requisitos é uma tarefa complexa para o engenheiro de software, pois os stakeholders, ou seja, as partes interessadas, não possuem total conhecimento do domínio do problema a ser resolvido ou possuem dificuldades para expressar seus problemas ao engenheiro (PRESSMAN, 2011). Desta forma ainda segundo Pressman (2011), um dos problemas da engenharia de requisitos é a dificuldade de entendimento da real necessidade do cliente tornando moroso e custoso o processo de elicitação de requisitos.",
    "Conclusão": "O reconhecimento e a compreensão da real necessidade do cliente é uma das tarefas mais complexas desempenhadas pela engenharia de requisitos na criação de um sistema, portanto, pode-se chegar à conclusão que para garantir a qualidade de um sistema e a produção de uma documentação eficaz é extremamente necessário que o processo de elicitação de requisitos aconteça no início do projeto evitando que a descoberta dos requisitos seja efetuada de forma gradual o que pode gerar um retrabalho tanto no desenvolvimento quanto na documentação dos requisitos ou ainda criar rotinas que não estejam de acordo com as reais necessidades dos interessados. Levando este fato em consideração este trabalho objetivou elencar as principais técnicas de elicitação de requisitos e efetuar uma análise de sua aplicação no processo de elicitação de requisitos de um sistema de gerenciamento financeiro pessoal. A etapa de aplicação das técnicas elencadas gerou, de forma prática, uma documentação dos requisitos que é o guia do que deve ser implementado pela equipe de desenvolvimento, contudo ao aplicar as práticas obteve-se resultados práticos de como as diferentes técnicas de elucidação de requisitos se comportam perante uma aplicação prática dos conceitos estudados. Desta forma, das técnicas estudadas conclui-se que todas são aptas para o processo de levantamento de requisitos, contudo para se obter um grau de cobertura confiável é necessário que se apliquem mais de uma técnica no levantamento de requisitos respeitando desta forma as limitações de cada uma das técnicas, com isso, foi atingido o objetivo do trabalho de analisar as técnicas de elicitação de requisitos."
}