{
    "Autor": "Ruan Pierre Idalino da Rosa",
    "Título": "Desenvolvimento de Aplicação Web Voltada à Visualização de Dados Solares do Brasil",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Fabrício Herpich, Dr.",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho trata do desenvolvimento de uma aplicação web que tem como objetivo permitir o acesso de dados de irradiação solar e potência fotovoltaica no Brasil para auxiliar na tomada de decisões na área. Foi notada uma lacuna na área pelo fato de que as aplicações atuais referentes ao tema possuem uma complexidade elevada, necessitam de conhecimento técnico ou são de locais geográficos específicos. A energia solar é uma fonte renovável importante, especialmente no Brasil, devido à grande incidência de raios solares no território brasileiro. No entanto, apesar do alto potencial, a sua adoção em larga escala ainda enfrenta desafios relacionados à falta de conhecimento, acesso claro às informações e a possibilidade de uma visualização clara dos dados solares. A disponibilização de dados de irradiação solar e potência fotovoltaica é essencial para facilitar a tomada de decisões tanto para pessoas comuns quanto para empresas. O objetivo deste projeto foi a criação de uma interface de usuário acessível, criação da autenticação de usuários, disponibilização de um mapa do Brasil com um gradiente de cores representativo dos dados, desenvolvimento de funcionalidades que permitem os usuários escolherem regiões e disponibilização do acesso futuro aos dados salvos. É utilizada a metodologia DSRM para a construção do projeto para garantir uma forma estruturada e sistematizada, tendo como base a identificação do problema, definição dos objetivos para a solução, design e desenvolvimento, demonstração, avaliação e comunicação dos resultados. A demonstração da aplicação e resultado da cobertura de código retornaram resultados positivos, tendo demonstrado eficiência ao funcionar como proposto e sem erros. Por fim, concluiu-se que o projeto funcionou como esperado e recomenda-se a adição de funcionalidades extras como a função de pesquisa de local e maior acessibilidade integrada na aplicação.",
    "Palavras-chave": [
        "aplicação web",
        "mapa interativo",
        "irradiação solar",
        "energia solar"
    ],
    "Introdução": "A matriz energética brasileira tem mostrado uma evolução ao longo dos anos. Com um destaque para o aumento de fontes renováveis na sua composição. A Lei 9.478/97 foi um marco nesse contexto já que estabeleceu diretrizes para o planejamento energético através do Conselho Nacional de Política Energética (CNPE), adicionando a revisão periódica da matriz energética. Essa legislação e seus resultados, como a criação da Empresa de Pesquisa Energética (EPE) em 2004, têm ajudado com estudos e políticas com foco na diversificação da oferta de energia, integrando fontes renováveis como a energia solar (Ministério de Minas e Energia, 2007). A transição para fontes de energia renovável como a energia solar é prioridade no mundo todo na busca por soluções sustentáveis para amenizar as mudanças climáticas. Entre as diversas fontes de energia renovável, a energia solar tem um potencial inesgotável e a capacidade de ser utilizada em diversas escalas, segundo Galdino et al. (2024) o aproveitamento da energia solar, é uma das alternativas energéticas mais promissoras para os seres humanos. No entanto, a implementação eficaz da energia solar depende da compreensão dos padrões de consumo e produção de energia, e também da acessibilidade dos dados solares para tomada de decisão. Em relação à área de energia renovável, há uma necessidade de ferramentas eficazes para a análise e visualização de dados. Projetos dessa natureza têm sido desenvolvidos, porém são poucos. De acordo com Franco (2021): Visando a propagação de novos empreendimentos PV, algumas instituições vêm desenvolvendo ferramentas de consultas para que a sociedade possa ter o entendimento da capacidade produtiva fotovoltaica de determinados recortes espaciais (Franco, 2021, p. 19). Nesta perspectiva, este projeto apresenta o desenvolvimento de uma aplicação web para a visualização de dados de energia solar, utilizando a linguagem de programação Python e a ferramenta Bootstrap Studio para criação de uma interface. A aplicação foi projetada para facilitar a tomada de decisões relacionadas à energia solar, tendo uma interface intuitiva e acessível para a visualização de dados de consumo e produção de energia solar no Brasil. O projeto teve como foco o desenvolvimento de uma plataforma que integra dados de energia solar, permitindo a visualização por regiões e estados do Brasil. O objetivo é a criação de uma ferramenta prática e eficiente que ajude a identificar padrões e tendências no consumo e na produção de energia solar, auxiliando governos, empresas e até mesmo pessoas comuns a tomarem decisões informadas.",
    "Conclusão": "Este trabalho abordou o desenvolvimento de uma aplicação web que facilita a visualização de dados de energia solar no Brasil. A ferramenta permite aos usuários acessar essas informações de forma clara e intuitiva, auxiliando na tomada de decisões sobre o uso da energia solar e estimulando a adoção dessa fonte de energia no Brasil. Os objetivos propostos neste trabalho foram alcançados tendo em vista que foi possível: A criação de uma interface acessível e com boa usabilidade para o usuário comum, através da utilização de ferramentas como Bootstrap Studio foi realizada. Visto que foi desenvolvida uma interface composta de um mapa interativo representando o Brasil, com o acesso aos dados na própria interface principal, além da criação de uma tela de acesso aos dados salvos como favoritos. No entanto, o escopo do desenvolvimento se limitou a uma funcionalidade inicial, o que restringiu a abrangência da aplicação. A visualização dos dados, embora funcional, poderia ser aprimorada com a integração de mais opções interativas e a personalização da exibição conforme as preferências do usuário. Para futuras melhorias, seria interessante expandir o alcance da interface, adicionando mais camadas de interação, além de otimizar o processo de autenticação e permitir maior flexibilidade na gestão do perfil do usuário e dos dados salvos. Já a autenticação de usuários e possibilidade de login na aplicação também foi realizada, através do framework Django que facilitou no gerenciamento de usuários, também foi criada uma tela para essa autenticação de usuário que se provou eficiente na demonstração da aplicação. Quanto ao mapa do Brasil sendo representado através de um gradiente de cores baseado nos dados fornecidos também foi concluído, através do uso de ferramentas com LeafLet que permitiram a integração do mapa, e também dos dados vindos do Global Solar Atlas que foram integrados ao mapa, o que possibilitou à inclusão de um gradiente baseado nos dados solares. A criação da funcionalidade para escolha de qualquer local brasileiro e acesso aos dados solares referentes foi eficaz, tendo em vista que na sua demonstração se mostrou eficiente ao captar o clique no local escolhido e relacionar o local aos dados armazenados, exibindo-os na tela do usuário. O modelo de dados para conexão do usuário aos dados de locais escolhidos foi realizado, auxiliado pela estrutura do framework Django que facilitou a sua criação. O modelo foi capaz de salvar os dados e associá-los ao usuário de teste na demonstração da aplicação, além de ser capaz de exibi-los na tela de Favoritos para o uso futuro em análises. Dessa forma, o objetivo principal de proporcionar uma ferramenta acessível para a visualização de dados sobre energia solar foi alcançado. A aplicação se mostrou eficaz na busca e apresentação dos dados de acordo com a escolha do usuário, permitindo que ele realize análises posteriores com os dados salvos. Com isso, a aplicação desenvolvida preenche uma lacuna ao oferecer uma ferramenta simples e acessível para que usuários comuns possam acessar dados sobre energia solar, sem a complexidade e a necessidade de conhecimento técnico presentes nas ferramentas atuais. Facilitando o acesso à informação e também a conscientização do público em geral sobre a energia solar e seu potencial como fonte renovável. Além disso, a aplicação contribui para a promoção do uso da energia solar no território brasileiro, apoiando a transição para uma matriz energética mais sustentável e eficiente. Na criação da aplicação as principais dificuldades encontradas foram a falta de material disponível sobre ferramentas similares que acessam dados de irradiação solar e também a pouca quantidade de estudos sobre aplicações que agem de maneira similar à aplicação. Espera-se que este projeto ajude no estudo de mais ferramentas que auxiliem no assunto tratado neste trabalho, e permita a ampliação de tecnologias similares. Como perspectivas para desenvolvimento futuro deste trabalho, observou-se necessário realizar uma validação com usuários, a fim de identificar possíveis melhorias na interface da ferramenta. Além disso, observou-se também a necessidade de implementação de novos recursos, como por exemplo o uso de elementos de pesquisa para permitir a busca instantânea através da escrita, e não somente da escolha pelo mapa, assim melhorando a acessibilidade da aplicação. Outro aspecto que almeja-se implementar em uma nova versão, trata-se do mapa interativo, visando representar os dados com elementos auxiliares comuns em mapas, como legenda, e o uso de cores acessíveis para pessoas daltônicas ou com baixa visão."
}