{
    "Autor": "Lorenzo Mendes Rodrigues",
    "Título": "O impacto da prática de elétrica, eletrônica e robótica para alunos do Ensino Médio da rede pública",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Juarez Bento da Silva, Dr.",
    "Coorientador(a)": null,
    "Resumo": "O uso de diferentes tecnologias digitais em salas de aula veio tornando-se cada vez mais necessárias na atualidade, seja pelo modelo do novo Ensino Médio ou mesmo pela disseminação cada vez maior de aparelhos eletrônicos a adolescentes pelo país. Sendo assim, o Laboratório de Experimentação Remota (RExLab) propôs em 2021 um curso, aplicando oficinas maker para alunos da Educação Básica em uma escola de Criciúma, buscando motivar e promover habilidades nas áreas de STEM (acrônimo em inglês para as disciplinas de Ciência, Tecnologia, Engenharia e Matemática), de forma a auxiliar a construção do conhecimento e apresentar oportunidades acadêmicas e profissionais no setor tecnológico e das engenharias. O projeto das oficinas constituiu-se por diversas etapas, com encontros remotos e presenciais, ao fim requerendo um relato de experiência aberto dos alunos no formato de vídeo. Deste modo surgiu a oportunidade de uma exposição e de análises mais aprofundadas, juntamente com a aplicação de um questionário online para os alunos participantes. O presente trabalho visa apresentar detalhadamente as fases do projeto desenvolvido, assim como exibir e explorar os resultados da coleta de dados realizada, demonstrando a percepção dos alunos em relação às atividades desenvolvidas ao longo do curso, assim como conhecimentos adquiridos, conteúdos abordados e a visão sobre a importância e o impacto destes conteúdos para alunos de todo o país.",
    "Palavras-chave": "Cultura maker; eletrônica; Educação Básica.",
    "Introdução": "Com o modelo do Novo Ensino Médio - que entrou em vigor em 2022 e até 2024 deverá estar em todas as turmas do país - as escolas de todo o Brasil vêm se adaptando gradualmente e enfrentam o desafio de implementar as novas diretrizes curriculares nacionais de forma regular. O novo currículo é composto por 4 áreas de conhecimento e 1 área de formação Técnica e Profissional, sendo que esta contemplará 1.200 horas flexíveis de ensino e atividades. Esta lei (Lei nº 13.415/2017) é basicamente um modelo focado no desenvolvimento de competências e habilidades, com disciplinas integradas, que possibilita que os alunos escolham itinerários formativos de acordo com áreas de seu interesse, empenhando-se para projetos de vida e carreira. Ademais, segundo dados divulgados no Anuário Brasileiro da Educação Básica (2020), apenas 65,1% dos brasileiros concluíram o Ensino Médio (EM) na idade esperada, até os 19 anos, percentual que chega a 51,2% entre os mais carentes, demonstrando a necessidade de se aperfeiçoar a educação, criando-se novas e interessantes oportunidades de ensino e de aprendizagem. Consoante com tais informações, surgiu então uma oportunidade para integrar tecnologias digitais e atividades práticas no contexto educacional, criando um ambiente compatível com a realidade dos alunos e do professor. Para tal, o Laboratório de Experimentação Remota (RExLab) da Universidade Federal de Santa Catarina (UFSC) desenvolveu nos anos de 2020 a 2022 o Projeto de Pesquisa \"Proposta de framework para integração tecnologias digitais na Educação Básica, inspirado na cultura maker\", com apoio financeiro do MCTI (Ministério da Ciência, Tecnologias e Inovações), CNPQ (Conselho Nacional de Desenvolvimento Científico e Tecnológico) e CAPES (Coordenação de Aperfeiçoamento de Pessoal de Nível Superior). O projeto foi constituído por 6 etapas, iniciando com a gestão e levantamento de recursos disponíveis, seguindo com a capacitação docente e então proposta de aplicação de oficinas maker (práticas) para estudantes, que buscou motivar e promover habilidades nas áreas de STEM (acrônimo em inglês para as disciplinas de Ciência, Tecnologia, Engenharia e Matemática) à estes adolescentes cursando o EM na rede pública, de forma a auxiliar a construção do conhecimento e apresentá-los às oportunidades tanto acadêmicas quanto profissionais no setor tecnológico e das engenharias. Por fim, objetivou-se criar um framework para validação e replicação do projeto e então exposição dos resultados. Para as práticas em sala de aula do curso aplicado, disponibilizou-se kits Arduino (com componentes eletrônicos para aplicação) para os alunos e professora tutora, além de todos os guias, vídeos, diagramas e materiais instrucionais necessários para uma eficiente execução. Todo este material didático foi disponibilizado na plataforma de Integração de Tecnologia na Educação (InTecEdu), e as aulas síncronas ocorreram através do sistema BigBlueButton. Fundamentando-se neste contexto e no curso realizado - e para fins de escrita deste trabalho - foi aplicado em sequência, com os 7 alunos que finalizaram o curso, uma pesquisa semi estruturada, qualitativa, no formato de questionário online. Em seguida foi feita a análise e discussão dos resultados alcançados, que certamente garantirão a continuidade da realização de projetos semelhantes em outros estados do país.",
    "Conclusão": "O presente trabalho teve como finalidade apresentar um dos projetos que foi realizado no RExLab, juntamente com a exposição de uma pesquisa, a fim de se analisar e expor os resultados no âmbito dos conhecimentos adquiridos e aprendizagem criativa por parte dos alunos participantes. Por meio deste, pôde-se notar a importância cada vez maior da inserção de atividades práticas na vida escolar, buscando focar também em disciplinas STEM e em áreas de relevância acadêmica e profissional. Inicialmente manifestou-se a questão do tempo, sendo necessária maior duração para as práticas, visto que cada aluno possuía um ritmo de trabalho que deveria ser respeitado para um aprendizado eficaz e duradouro. Com a aplicação das aulas ao longo do tempo, notou-se, juntamente com o feedback dos alunos e as respostas à pesquisa, alguns pontos que deveriam ser mais trabalhados, como a programação e explicação de partes teóricas relevantes para o efetivo desenvolvimento das atividades. Com as respostas dos alunos ao questionário pôde-se notar que os conteúdos abordados foram relevantes e de grande importância, trazendo a estes mais conhecimento e habilidades e competências em diversas áreas (manuais, lógica, prototipação…). Outrossim, houve aceitação ao curso e convicção que este é significativo e pertinente também para adolescentes do resto do país. Ao final de 2022 iniciou-se uma nova turma, no mesmo colégio participante do curso, com mudanças nos materiais didáticos e alterando-se algumas práticas, a fim de se criar um maior repositório de atividades e conteúdos abertos para os professores e alunos e seguir na aplicação de práticas em sala de aula. Para 2023 e futuro, o RExLab pretende aplicar dois diferentes cursos, um de robótica e outro abordando os 17 Objetivos de Desenvolvimento Sustentável da ONU, além dos demais cursos que busquem sempre a capacitação de professores da Educação Básica para aplicação de práticas inovadoras com os estudantes. Com isso espera-se que centenas de professores participem e apliquem as práticas em salas de aula por escolas de todo o Brasil, contando com recursos do governo federal e todo o trabalho e apoio do RExLab e seus bolsistas."
}