{
    "Autor": "Filipi Bilésimo Daros",
    "Título": "Percepção dos supervisores de estágio em relação às habilidades e competências do aluno do curso de TIC/UFSC",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Paulo Cesar Leite Esteves",
    "Coorientador(a)": "",
    "Resumo": "Próximo de completar onze anos de existência em agosto de 2021, o curso de Tecnologias da Informação e Comunicação da Universidade Federal de Santa Catarina faz a primeira pesquisa para entender a aceitação do mercado de trabalho que emprega seus alunos. Para tanto, é necessário entender quais são as habilidades e competências do estagiário do curso de Tecnologias da Informação e Comunicação e a importância da realização de um estágio na formação acadêmica. A busca pela compreensão destes tópicos se dá pela análise da percepção dos supervisores de estágios. Sendo assim, foi elaborado um questionário como objeto de coleta de dados e enviado aos supervisores de estágios do curso, com perguntas sobre habilidades pessoais (soft skills) e competências técnicas (hard skills) dos alunos. Os resultados obtidos foram bastante consistentes, sendo possível analisar comportamentos pessoais em situações individuais e coletivas.",
    "Palavras-chave": [
        "Competências técnicas (hard skills)",
        "Estágios",
        "Habilidades pessoais (soft skills)",
        "Tecnologias da Informação e Comunicação",
        "Universidade Federal de Santa Catarina"
    ],
    "Introdução": "Muitas vezes o estágio é o primeiro contato profissional de um aluno ou quem sabe, o seu primeiro contato profissional com a área de estudo escolhida. Segundo Lobo (2018, p. 43) o estágio, em algum momento, vai fazer parte da vida acadêmica do discente. Atualmente, de acordo com a Lei º 11.788 de 25 de setembro de 2008, estágios podem ser classificados como obrigatórios e não obrigatórios. Visto que em determinado momento do curso de graduação, o aluno deverá estagiar, é possível considerar que em parte, o desempenho do aluno durante a execução das suas atividades no estágio será reflexo da sua dedicação e também dos aprendizados adquiridos durante a vida acadêmica. No ano de 2021, o campus de Araranguá da Universidade Federal de Santa Catarina completará onze anos de existência. Como a história do campus Araranguá é relativamente nova se comparada aos cinquenta anos de existência da sede em Florianópolis, buscamos entender se o curso mais antigo de Araranguá, Tecnologias da Informação e Comunicação - TIC está capacitando seus alunos de forma convergente com a visão das organizações concedentes de seus estágios.",
    "Conclusão": "Nesta seção serão apresentadas as conclusões feitas nesta pesquisa, avaliando individualmente habilidades pessoais (soft skills) e competências técnicas (hard skills) e após, uma análise geral das conclusões. Ao analisar os resultados, é possível perceber que as habilidades pessoais (soft skills) apresentadas nesta pesquisa não são isoladas. Habilidades específicas também dependem de outras habilidades. As habilidades que têm impacto individual nos estagiários, no geral, foram boas. Mas habilidades que impactam nos grupos sociais em que os estagiários podem estar inseridos tiveram resultados inferiores. Isso se dá pelo fato de que antes da iniciação profissional, na maioria das vezes se pensa mais em termos pessoais, ou seja, não se pensa de forma coletiva. A universidade, de fato, prepara o aluno para o convívio em comunidade, incentivando a exposição e o debate de opiniões. Assim podemos colocar nossas ideias e também ouvir pensamentos diferentes."
}