{
    "Autor": "Luiz Felipe Sartor Góes",
    "Título": "A influência da tecnologia no ensino durante a pandemia de COVID -19: Uma Revisão Sistemática",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.(a) Patricia Jantsch Fiuza",
    "Coorientador(a)": null,
    "Resumo": "Esse trabalho apresenta uma revisão sistemática de literatura sobre a influência das tecnologias utilizadas durante a pandemia da COVID -19 no contexto de ensino. A revisão revelou uma ampla gama de tecnologias como gamificação, crowdsensing, IA, Ambientes virtuais de aprendizagem (AVAs), também discute questões importantes como cyberbullying, os desafios com PCD, e aborda o uso de ferramentas, o estudo da programação e atividades extracurriculares. Essas tecnologias desempenharam um papel crucial no enfrentamento dos desafios impostos pela pandemia, possibilitando a continuidade das atividades diárias e a promoção da saúde e segurança dos estudantes. A pesquisa destaca a importância e a eficácia dessas tecnologias, ressaltando seu potencial para futuras situações de crise, mas também ressalta o efeito que elas tiveram na educação e mostra que é possível continuar integrando essas áreas em prol da evolução delas.",
    "Palavras-chave": "tecnologias; software; hardware; aulas remotas; pandemia; covid -19; educação.",
    "Introdução": "A pandemia de COVID -19 teve um impacto significativo nas formas tradicionais de educação, forçando instituições educacionais em todo o mundo a se adaptarem rapidamente a novas modalidades de ensino, como o ensino remoto. Nesse contexto, a tecnologia desempenhou um papel fundamental na facilitação do aprendizado, tornando -se uma ferramenta indispensável para educadores, alunos e pais. A justificativa para a realização de uma revisão sistemática sobre a influência da tecnologia no aprendizado durante a pandemia se baseia na necessidade de compreender em profundidade como as diferentes ferramentas tecnológicas foram utilizadas, como impactaram o processo de aprendizagem e quais foram os resultados observados. Durante a pandemia da COVID -19, várias tecnologias surgiram ou foram amplamente adotadas para lidar com os desafios apresentados pela crise global no aprendizado. Além de ajudar a mitigar os impactos da pandemia, essas tecnologias mostraram seu potencial para continuar sendo utilizadas no futuro. Uma das tecnologias mais utilizadas é o ambiente virtual de aprendizagem (AVA) que utiliza recursos digitais, como vídeos, textos, fóruns de discussão, quizzes e outras ferramentas interativas para fornecer uma experiência de aprendizagem diversificada e acessível. Esses ambientes são projetados para promover a colaboração, a flexibilidade no acesso ao material e o acompanhamento do progresso do aluno. Segundo Fiuza, Martini e Sartori (2021) esses ambientes são cada vez mais usados por crianças e adolescentes, que comunicam entre si e participam das demais tarefas. Também diz que um melhor acesso as atividades e a participação efetiva na internet se deve ao fato de um domínio maior de habilidades digitais, muito pelo motivo de que essas crianças já nascem introduzidas no mundo tecnológico. A educação online foi uma resposta rápida ao fechamento das instituições de ensino durante a pandemia. Plataformas de ensino a distância, videoaulas e recursos interativos permitiram que os alunos continuassem seu aprendizado de forma remota. A educação online pode continuar sendo uma ferramenta complementar no futuro, oferecendo acesso a uma variedade de cursos, materiais educacionais de qualidade e oportunidades de aprendizado personalizadas. Se destaca também a diferença entre ensino e aprendizagem onde o ensino refere-se à ação de fornecer instruções, enquanto a aprendizagem é o processo interno de assimilação e aplicação dessas instruções pelo aluno. Onde no ensino pode se dividir em ensino formal e ensino aberto. O ensino formal está mais associado a sistemas educacionais tradicionais, enquanto o ensino aberto busca proporcionar acesso mais amplo e flexível à educação, muitas vezes utilizando recursos online e métodos não convencionais. Abordando questões como as principais ferramentas tecnológicas adotadas, impactos observados no aprendizado dos alunos, os desafios enfrentados pelos educadores, estratégias adotadas para superar essas desafios e as implicações para o futuro da educação. A revisão sistemática pretende contribuir para a compreensão aprofundada dos aspectos tecnológicos do ensino durante a pandemia, fornecendo insights valiosos para aprimorar as práticas educacionais em contextos de mudança e incerteza. Essas tecnologias têm potencial para aumentar a eficiência, reduzir riscos e melhorar o aprendizado em diversas áreas da educação no futuro. Em resumo as tecnologias utilizadas durante a pandemia da COVID -19 mostraram seu valor e potencial para continuarem as serem usadas após o fim do período de distanciamento social.",
    "Conclusão": "Esta revisão sistemática da literatura sobre as tecnologias utilizadas durante a pandemia da COVID -19 revelou uma ampla gama de ferramentas e soluções que desempenharam um papel importante no enfrentamento dos desafios impostos pela crise global. As tecnologias como gamificação, crowdsensing, IA, Ambientes virtuais de aprendizagem (AVAs) mostraram-se essenciais para garantir a continuidade das atividades diárias, promover a saúde e a segurança, e possibilitar a adaptação às restrições impostas pelo distanciamento social. Após a análise, percebeu-se que um terço dos artigos fala sobre o Ensino Remoto Emergencial usando AVAs que desempenharam um papel transformador na educação durante e pós-pandemia de COVID -19. Essas plataformas facilitaram a transição para o ensino remoto, ampliaram o acesso à educação, proporcionaram flexibilidade no aprendizado e fomentaram a colaboração online. No entanto, acentuaram desafios de conectividade e destacaram disparidades no acesso à tecnologia. Além disso, influenciaram mudanças na abordagem pedagógica, promovendo métodos mais interativos e adaptáveis. Mesmo com o retorno às aulas presenciais, muitas instituições mantiveram elementos do ensino online, consolidando modelos híbridos. Os AVAs continuam a ser instrumentos essenciais, moldando a educação contemporânea com oportunidades e desafios únicos. Outro ponto que se destacou foi a questão de acessibilidade para o aprendizado, tanto para idosos quanto para PcD. Para os idosos, a adaptação ao aprendizado online pode ter sido mais desafiadora devido à familiaridade limitada com a tecnologia. Garantir que as plataformas de ensino remoto fossem intuitivas e oferecessem suporte técnico adequado foi essencial para facilitar a participação dos idosos. Já para as pessoas com deficiência, a acessibilidade digital tornou-se uma preocupação central. Fornecer conteúdos em formatos acessíveis, como legendas para vídeos, descrições de imagens para pessoas com deficiência visual e interfaces de usuário adaptáveis, foi crucial para garantir a inclusão no ambiente virtual de aprendizagem. Apesar dos desafios, a transição para o ensino online também proporcionou oportunidades para melhorar a acessibilidade. A disponibilidade de recursos digitais pode ser adaptada para atender às necessidades específicas de idosos e PcD, oferecendo opções de personalização, como ajustes de fonte, contraste e suporte para leitores de tela. O uso de aplicações e ferramentas aumenta cada vez mais todos os dias, e com o ensino remoto não foi diferente. Elas foram cruciais para o andamento do ensino remoto. Após a pandemia, espera-se que o uso dessas tecnologias continue a ser uma parte integral da educação, mesmo com o retorno às aulas presenciais. A abordagem híbrida, que combina elementos presenciais e online, pode se tornar mais comum, proporcionando maior flexibilidade aos alunos e promovendo práticas educacionais inovadoras. Contando com a experiência dos educadores e a aptidão de adaptar as novas tecnologias, é possível integrá-las no ensino e aprendizado, já que essas tecnologias demonstraram seu valor e potencial em diversas áreas da educação, seja no ensino infantil, fundamental, médio, técnico ou em alguma atividade extracurricular. Além de enfrentar os desafios da pandemia, elas apresentam oportunidades contínuas para futuras situações de crise e além. No entanto, é importante considerar as implicações éticas e sociais dessas tecnologias, bem como abordar as desigualdades no acesso e uso, garantindo que todos possam se beneficiar igualmente. Os resultados desta revisão sugerem que a tecnologia desempenhou um papel crucial na continuidade do ensino, permitindo a adaptação rápida das instituições educacionais a novos modelos de aprendizado remoto. No contexto das conclusões tiradas desta revisão sistemática, destaca-se a importância de considerar as lições aprendidas para informar futuras práticas educacionais. O desenvolvimento de políticas que promovam a inclusão digital, a formação de professores em competências digitais e a pesquisa contínua sobre métodos eficazes de ensino remoto são aspectos cruciais para moldar o futuro da educação pós-pandemia."
}