{
    "Autor": "Felipe Johny Teixeira",
    "Título": "IMPLEMENTAÇÃO DE UM SISTEMA DE CONTROLE DE INJEÇÃO PROGRAMÁVEL EM UM VEÍCULO SUBARU IMPREZA",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Anderson Luiz Fernandes Perez",
    "Coorientador(a)": null,
    "Resumo": "A invenção do motor a combustão interna teve como objetivo melhorar e facilitar o meio de transporte voltado para o trabalho, consequentemente os veículos com combustão interna ingressaram na vida cotidiana da população, afinal sua funcionalidade de transporte do ponto A ao ponto B era feita de forma eficiente. Com o passar dos anos os veículos passaram por melhorias, sempre visando aumentar a experiencia do usuário ao introduzir o que havia de mais moderno na área da tecnologia automotiva até chegar aos primórdios da injeção eletrônica, que surgiu para substituir o carburador. A injeção eletrônica consiste em melhorar a mistura estequiométrica entre ar/combustível e regularizar a emissão de poluentes alcançando uma máxima eficiência do motor. A modificação veicular se tornou mais popular entre os entusiastas automotivos, por vários fatores, como a competividade, substituição de peças antigas ou adaptação de um determinado veículo para um cenário proposto. Neste trabalho é descrito o processo de substituição de uma injeção de fábrica de um veículo Subaru Impreza por uma versão programável. São descritos os passos necessários para configuração do mapa de injeção, bem como dos ajustes de parâmetros visando melhor rendimento do motor e economia de combustível.",
    "Palavras-chave": "Motor a Combustão Interna. Injeção Eletrônica. Injeção Programável. Subaru Impreza. Sensores e Atuadores.",
    "Introdução": "Contextualização e problematização O sistema de alimentação de combustível de um veículo tende a limitar o máximo que um motor pode desempenhar por questões de segurança, com a substituição por uma injeção programável e com os ajustes certos pode-se ter um desempenho completo do motor e com um controle total do usuário para ter livre acesso e fazer as modificações desejadas (QUATRORODAS (2021). Além disso, o sistema de injeção faz o controle de emissões de poluentes, que é uma questão de extrema importância para o meio ambiente. No Brasil, as emissões de poluentes é uma questão bem importante, já que possui uma grande frota de carros e por isso em 1993 foi criado a lei Nº 8.723, onde os veículos fabricados a partir de 1997 deveriam atender parâmetros para emissão de poluentes, dentre eles 2,0 g/km de monóxido de carbono (CO), 0,3 g/km de hidrocarbonetos (HC) e 0,6 g/km de óxidos de nitrogênio (NOx) (BRASIL, 1993). O uso de uma injeção de combustível programável proporciona a manutenção e controle desejado sobre todos os atuadores do motor. A substituição do módulo de injeção do veículo e sensores que são necessários para a ECU fazer sua leitura e cálculos para ter um controle sobre o mapa de calibração. Esta substituição não interfere em outros aspectos do mesmo, ou seja, as funções elétricas, como vidro elétrico, faróis e sistema de alarme são mantidos originais. Com isso em mente, um veículo de 1993 como é o que será utilizado neste Trabalho de Conclusão de Curso, pode se adequar a frota atual brasileira sem problema algum, atendendo as exigências legais e fazendo a implementação do sistema de injeção programável em um veículo de forma correta.",
    "Conclusão": "Ao longo do Trabalho de Conclusão de Curso foi possível realizar a substituição da injeção eletrônica original por uma programável, mesmo sem experiência ao seguir as instruções recomendadas pelo manual da injeção, foi possível obter sucesso na instalação, tanto da injeção quanto dos sensores trocados. As funções básicas, como partida a frio, aviso de erros no painel de instrumento e o aumento da carga do motor depois de ligar o ar condicionado para não perder potência, foram mantidas. O controle de emissões de gases obteve mais precisão pois o sensor de sonda lambda foi substituído por uma versão mais atualizada de 5 fios de banda larga, utilizado nos carros modernos, detectando níveis de emissões de gases diferentes do que é aceito pela calibração da injeção ao realizar a mistura estequiométrica, assim contribuindo com o meio ambiente e se adequando a frota atual dos veículos nacionais, pois os gases poluentes são gerados através de uma mistura incorreta. A potência original do veículo não foi alterada pela troca de injeção eletrônica, já que para isso seria necessário a substituição de peças mecânicas como pistões com um diâmetro maior ou bicos injetores. Sendo assim a cavalaria do Subaru Impreza se manteve em 135 cavalos com torque de 19,4 kgf.m. O consumo de combustível se manteve o mesmo da injeção original, não sendo possível alterar para ter uma economia maior sem ter a perda de carga como consequência. Assim o consumo urbano para este veículo é de 9,5 quilômetros por litro e 11 quilômetros por litro no consumo rodoviário, que é de grande importância já que a qualidade da gasolina mudou com os anos, com a importação de veículos as fábricas tinham que fazer alterações nos motores dos carros que viriam para o Brasil para não serem danificados pela gasolina de baixíssima octanagem e em 1993 com a implementação do álcool na mistura de combustível sendo de 12% a gasolina perderia ainda mais sua qualidade. Atualmente a mistura de álcool e encontra nos 27,5% na gasolina comum e 25% na podium. Os que mais sofreram com isso são os veículos com importação direta pois o mesmo não é passado por nenhuma preparação para usar a gasolina brasileira (FELDAMAN, 2023). Após a instalação da injeção programável, foi possível realizar manutenções e revisões de forma prática e rápida através da interface de usuário. Com isso a atualização do veículo Subaru Impreza do ano de 1993 em relação a frota veicular atual foi realizada com sucesso."
}