{
    "Autor": "Charles da Cunha Marcolim Júnior e Fábio Cezar Bizon",
    "Título": "Criação de uma Desenvolvedora de Jogos: da ideia ao mercado",
    "Ano de publicação": 2016,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Giovani Mendonça Lunardi",
    "Coorientador(a)": "",
    "Resumo": "Com a expansão do mercado de jogos digitais e sua expressividade aumentando a cada dia, é necessária a explanação sucinta deste setor e sua história bem como a análise da estrutura e dos padrões de desenvolvimento técnico e artístico atuais da indústria independente, bem como os desafios propostos ao empreendedor que busca desenvolver jogos como meio de obtenção de receita. Este trabalho busca através de um estudo de caso a explanação histórica da indústria de jogos digitais para a melhor análise do desenvolvimento de um jogo digital, conhecido como Blade & Bones, desenvolvido pela Coffee Addict Studio que possui pretensão de lançamento no ano de 2016.",
    "Palavras-chave": "Vídeo Games, Jogos Digitais, Indústria de jogos, História dos Jogos.",
    "Introdução": "Em um curso de Tecnologias da Informação e Comunicação, tem-se como área de interesse para muitos alunos a criação, produção e comercialização de games. A partir deste interesse, o presente TCC (Trabalho de Conclusão de Curso) propõe-se, a seguir, descrever através da experiência dos próprios autores, como estudo de caso, o surgimento da ideia de uma game, desde sua criação e produção digital, as dificuldades e desafios da implantação de uma empresa desenvolvedora independente até as tentativas de colocação do game como produto comercial. Justificativa Atualmente a indústria de jogos tem se destacado cada vez mais no cenário mundial. Sendo uma das principais fontes de renda e geração de empregos no setor de entretenimento, também possui muita inovação do mercado, fazendo com que as desenvolvedoras busquem, cada vez mais, melhorar os seus produtos e serviços. A ascensão do setor se deve principalmente ao fato do fácil acesso à internet nos dias atuais. Outro motivo de destaque é que não são somente os jovens que fazem parte do mercado consumidor deste setor, idosos, adultos e crianças também participam de forma expressiva. Segundo a GamesIndustry, as vendas aumentaram 9,4% ao ano. Com um faturamento de US$ 91,5 bilhões em 2015 e com projeção para US$ 107 bilhões em 2017, este mercado vem despontando como o maior da indústria do entretenimento mundial. Vê-se necessário para a evolução cultural e econômica o empreendedorismo em jogos digitais bem como a inovação de mercado nos mesmos. Para Dolabella (1999, p. 12), para se aprender a empreender, faz-se necessário um comportamento pró-ativo do indivíduo, o qual deve desejar “aprender a pensar e agir por conta própria, com criatividade, liderança e visão de futuro, para inovar e ocupar o seu espaço no mercado, transformando esse ato também em prazer e emoção”. Atualmente existe um estado de estagnação nos gêneros e padrões presentes nos jogos digitais. O design base demonstrado por Rogers (2014) não é tão bem recebido como uma vez foi. A inovação move o mercado muito mais do que em qualquer outra época de sua curta história fazendo deste mercado ótimo para o empreendedorismo. Empreendedores necessitam entender as novas oportunidades e perigos de um nicho tão novo como o mercado de jogos digitais. Este trabalho busca explanar como e porque uma empresa pode atuar de maneira efetiva na indústria de desenvolvimento de jogos digitais devido ao caminho aberto por desenvolvedores independentes anteriormente, bem como demonstra como foi percorrido pelo jogo Blade & Bones. Problemática Com base na perspectiva da indústria brasileira de desenvolvimento de jogos digitais vários desafios são estabelecidos já que a mesma não ocupa lugar de destaque no mercado mundial. O custo de desenvolvimento aumenta todos os anos bem como a necessidade de atualização tecnológica se vê necessário em frente a um mercado muito competitivo. Tendo em vista este ponto esse trabalho busca explanar as dúvidas em relação ao ingresso de uma empresa no mercado. Objetivos Os objetivos deste trabalho encontram-se divididos em objetivo geral e objetivos específicos para um melhor entendimento. Objetivo Geral Descrever o processo de criação de um jogo digital por uma desenvolvedora independente até a sua colocação no mercado como produto comercial. Objetivos Específicos Visando alcançar o objetivo principal, alguns objetivos específicos são requeridos, entre eles: Apresentação da história da indústria de jogos digitais. Demonstrar os desafios do empreendedor brasileiro da indústria de jogos digitais; Descrever os procedimentos para a abertura de uma empresa; Descrever os processos de criação e certificação de um jogo digital; Metodologia O presente trabalho pode ser classificado como uma pesquisa bibliográfica e descritiva sobre os processos do mercado de jogos digitais e também um estudo de caso sobre o jogo Blade & Bones. Uma pesquisa bibliográfica implica em um conjunto ordenado de procedimentos de busca por soluções, atento ao objeto de estudo. Na intenção de apresentar uma pesquisa bibliográfica sob essa perspectiva, o presente artigo busca abordar desta maneira delimitados critérios e dos procedimentos metodológicos que permitem definir um estudo como sendo bibliográfico (LIMA, 2007). Uma pesquisa descritiva tem como objetivo primordial à descrição das características de determinado fenômeno e o estabelecimento de relações entre variáveis. Uma de suas características mais significativas está na utilização de técnicas padronizadas de coleta de dados, tais como a observação utilizada nessa pesquisa (GIL, 2002). O estudo de caso conta com a análise de modo detalhado de um caso individual que explica a dinâmica de um evento específico. Com este procedimento se supõe que se pode adquirir conhecimento do fenômeno estudado a partir da exploração intensa de um único e isolado caso (VENTURA, 2007). Para desenvolvimento deste projeto fez-se necessário à realização do levantamento do referencial teórico, possibilitando um maior embasamento sobre os temas abordados, abrangendo a criação de uma empresa no Brasil e os passos de criação de um jogo digital atualmente. Organização do Documento Este documento está organizado da seguinte forma: No segundo capítulo, é apresentado a Indústria de Jogos Digitais e como o ciclo de gerações vem evoluindo até o momento atual que permite o desenvolvimento independente de baixo orçamento ter espaço no mercado. No terceiro capítulo, o Empreendedorismo como conceito é explicado bem como é caracterizado o perfil empreendedor brasileiro. No quarto capítulo, o desenvolvimento do jogo digital é explanado de maneira sucinta da perspectiva artística e técnica. No quinto capítulo, os órgãos que certificam jogos digitais em âmbito mundial são apresentados, bem como preparações de âmbito de marketing são estabelecidas para o lançamento do produto. Para finalizar, no sexto capítulo, são apresentadas as conclusões do desenvolvimento do projeto e propostas para trabalhos futuros.",
    "Conclusão": "Neste trabalho foi feito um estudo sobre a desenvolvedora de jogos digitais Coffee Addict Studio que está sediada em Araranguá, Santa Catarina. Nele foi descrita a fundação da empresa e o desenvolvimento do seu primeiro projeto, Blade & Bones. A Coffee Addict Studio, assim como qualquer outra organização que busque a melhoria de seus processos, enfrentou diversos desafios. Alguns desses desafios foram determinantes para a identificação das lições aprendidas a seguir. É preciso planejamento adequado dos prazos previstos da iniciativa de melhoria nos processos de forma a atendê-los com segurança. Um dos maiores desafios na implantação do Blade & Bones foi relacionado aos prazos. Tratava-se de um grupo heterogêneo que tinha de lidar com diversas responsabilidades de focos distintos. Por se tratarem de alunos da universidade, todos necessitavam dedicar tempo para suas obrigações acadêmicas. Sob a perspectiva técnica devemos realçar que grande do conjunto de problemas derivados de uma iniciativa sem experiência como essa deve ser realçado. O balanceamento entre todas as mecânicas do jogo era de necessidade crucial para o bom aproveitamento do mesmo pelo usuário e problemas indiretos como exemplo, a modificação de um componente pequeno no jogo, poderia ter um grande impacto no desempenho geral do mesmo. Além disso, sendo iniciantes na indústria, os colaboradores necessitavam alcançar por meio de iterações a qualidade do componente no nível desejado, tornando necessário realizar repetitivamente a produção de componentes para alcançar a qualidade desejada. Este trabalho aborda de maneira geral o desenvolvimento de jogos digitais, mas tópicos abordados no mesmo podem ser aprofundados em forma de um trabalho único, focado somente na área empreendedora, por exemplo, citada no terceiro capítulo. São propostos um conjunto de trabalhos futuros para o aprofundamento: Um estudo da receptividade no mercado do projeto Blade & Bones; Explicar o uso específico das ferramentas para o desenvolvimento do jogo digital."
}