{
    "Autor": "Igor Liberato Fernandes Borghezan",
    "Título": "DESENVOLVIMENTO DO APLICATIVO EDUCACIONAL MEU TEXTO PARA PLATAFORMA ANDROID",
    "Ano de publicação": "2018",
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Patricia Jantsch Fiuza",
    "Coorientador(a)": null,
    "Resumo": "A educação vem mudando em passos muito lentos desde os primórdios, mas quando se trata das duas últimas décadas, vimos um grande avanço tecnológico e com ele uma preocupação com a maneira de ensino datada que ainda se tem. Com a popularização da internet e a disseminação de informação de forma rápida e ao alcance de uma maioria, cria-se uma modalidade de ensino usando a tecnologia e internet como bens primordiais para uma educação de grande qualidade e de forma completa, assim como a possibilidade de compartilhamento mundial. Este projeto é composto como uma continuação de trabalhos anteriores do curso de Tecnologia da Informação e Comunicação da Universidade Federal de Santa Catarina (UFSC), em parceria com um projeto de mestrado realizado no Instituto Federal de Santa Catarina (IFSC), no intuito de melhorar a interface e usabilidade da ferramenta de educação chamada de Meu Texto, assim como expandir seus horizontes em questão de disseminação e abrangência de ensino. Com o projeto devidamente detalhado foi desenvolvido uma aplicação para Android com a intensão de ser uma ferramenta de auxílio aos estudos de redação. Foi aplicado um questionário para a obtenção da análise de satisfação dos usuários, sendo que como resultados uma margem positiva e satisfatória ao uso de ferramentas tecnológicas no ensino, além de uma visão de onde se pode melhorar a aplicação de maneira geral.",
    "Palavras-chave": "Android, Smartphone, Educação, Aplicativo, Redação, Educação a Distância, Tecnologia",
    "Introdução": "A geração mais recente nasceu em um ambiente muito diferente do que se está habituado, pois atualmente se têm grandes facilitadores na nossa vida, um grande exemplo é o smartphone. Bebês são grandes curiosos, eles e as crianças de hoje sabem utilizar uma tela touchscreen de uma forma tão natural que pessoas da década de 90 demoraram para se acostumar com esse tipo de tecnologia por um período muito maior de tempo. Isso acontece, pois o meio que eles estão inseridos é rodeado de tecnologia. Isso torna um empecilho quando se chega à escola e depara-se com caderno, lápis e quadro negro. Não se sabe quando a humanidade vai parar com o uso de papéis, mas é notável que cada vez mais confiamos naquilo que está na nossa tela de computador. ROSENBERG (2001, p.08, tradução nossa). Além disso tem-se o fator que com o avanço da tecnologia ferramentas de multimídia têm grande papel nessas questões, ROSENBERG (2001, p.56, tradução nossa) diz que quando se usa com cuidado e propriedade, é possível incorporar a riqueza da multimídia na experiência de ensino sem degradar acesso, qualidade, ou velocidade. O uso de ferramentas tecnológicas trará uma diversidade maior ao ensino, assim como foi os computadores para as crianças da década de noventa. Como ensinar depende muito de um professor e suas ferramentas disponíveis, muitos professores já tentam utilizar tecnologia nas escolas por conta própria, mas ainda é preciso apoio fundamental de organizações e iniciativas para isso tornar-se cada vez mais uma realidade concreta. Como diz KIRCI; KAHRAMAN (2015, p.1, tradução nossa): hoje, a tecnologia avança muito rapidamente com o uso de computadores e dispositivos móveis, várias aplicações são desenvolvidas para usuários de todas as áreas. Educação é uma dessas áreas, mas a importância dessas aplicações na educação é percebida de forma tardia. Existem diversos tipos de uso da tecnologia na educação, seja por jogos, aplicativos específicos, vídeos, fóruns, e muitos outros por meio de computadores, smartphones, tablets, periféricos genéricos, etc. Todos estão rodeados de instrumentos, mas percebe-se isso de forma boçal, ou até mesmo não se masteriza o uso deles.",
    "Conclusão": "Quando se fala de como a tecnologia vem avançado em grandes escalas, deve-se parar e analisar os dados que com ela se obtém, o uso da tecnologia é uma das grandes conquistas que foram proporcionadas pelos humanos, usam-na desde coisas simplórias como um LED até supercomputadores capazes de calcular trajetórias de cometas para os próximos milhares de anos. Dentro deste contexto pensa-se em utilizar essas ferramentas na educação de forma mais profunda, já se utiliza tecnologia dentro de centros científicos há muitos anos, muito dessas tecnologias foram proporcionadas nesses mesmos ambientes de compartilhamento de conhecimentos, como universidades, órgãos governamentais, empresas privadas, e entre outros aos seus devidos contextos. Com o advento da internet, a disseminação de informação cresceu em níveis inimagináveis, fóruns, vídeos, wikis, entre outros. Viu-se o surgimento da EAD com uma força muito grande como ROTANOVA et al. (2018, p.49, tradução nossa) diz: desde a metade da década de noventa do século XX a educação a distância tornou-se uma das prioridades em treinamento pedagógico próprio na teoria e prática. Usar a educação a distância (como uma forma de e-learning) ajudou a resolver um problema essencial da educação nacional - provendo cidadãos oportunidades igualitárias em ter uma educação de alta qualidade em qualquer lugar, para qualquer atividade profissional e limitações físicas. A proposta do Meu texto obteve valores importantes nesse trabalho, demonstrando que se tem um interesse grande em ferramentas tecnológicas no ambiente de ensino pelos próprios alunos, e que esses instrumentos garantem uma extensão entre orientador e orientandos além de novas maneiras de estudar-se e preparar-se para eventuais conquistas. Melhoras precisam ainda ser feitas no âmbito de como organizar essas ferramentas no ambiente escolar, onde usá-las e quando não, pois apesar de a grande maioria ser positiva em relação ao ensino por meio da tecnologia, não são todos os alunos que são favoráveis ao uso destes tipos de utensílios na educação. Num contexto geral, conclui-se que a tecnologia é um artifício de grande valia no ensino, um público em crescimento a cada dia que passa, e uma grande janela de oportunidades para o futuro próximo em relação às melhorias na educação a qualquer lugar do mundo sem limitações. E que com o uso correto dessas ferramentas tem apenas a ganhar com um ensino de alta qualidade com a ajuda tanto de professores qualificados e oportunistas, quanto do desenvolvimento tecnológico educacional com o passar dos anos."
}