{
    "Autor": "Fábio da Silva",
    "Título": "Gestão Documental : Os benefícios do controle documental em prol da redução de pendências em uma instituição financeira",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Vilson Gruber , Dr.",
    "Coorientador(a)": "",
    "Resumo": "O presente trabalho tem como objetivo estudar de que maneira o controle da organização documental pode contribuir para eliminar as pendências em contratos de financiamentos de veículos. A gestão documental é o ramo do conhecimento que visa identificar as falhas nos processo e apontar soluções para que se alcance um resultado mais organizado e efetivo. Procedeu-se de uma entrevista com 23 parceiros do Banco X, visando compreender quais são os principais motivos de pendências documentais por eles apontados e possíveis soluções aplicáveis com bons resultados, em sua percepção. Os resultados apontaram que 43,48% dos parceiros fazem negócios com o Banco X há mais 7 anos e 17,39% há mais de 5 anos. Quanto à frequência de realização de negócios, verificou-se que 47,83% apresentam média frequência, 43,48% alta frequência e 8,7% baixa frequência. Além disso, 26,09% dos entrevistados realizam processos com o Banco X há mais de 7 anos, 21,74% há mais de 7 anos, 21,74% há mais de 2 anos, 17,39% há mais de 3 anos, 8,7% há menos de 1 ano e 4,35% há mais de 1 anos. As respostas apontam que 43,48% realizam processos com outros bancos com alta frequência, 43,48% com média frequência e 13,04% com baixa frequência. A confusão com processos de outros bancos é muito frequente para 17,39% dos entrevistados, média para 21,74% e baixa para 60,87%. Pendências para resolução do operador do Banco X são indicadas por 56,52% dos entrevistados como baixa frequência, 13,04% média frequência e 30,43% alta frequência. A percepção dos entrevistados sobre o nível de dificuldade documental do Banco X foi de 17,39% indicando a dificuldade como média, 21,74% acham que é alta, enquanto 60,87% consideram a dificuldade baixa. Os principais motivos para a ocorrência de erros e pendências foram elencados como: falta de atenção; assinaturas faltando; falta de folhas no contrato; deixar de entregar toda a documentação correta; dificuldade para achar o lugar da assinatura; comprovantes de renda; demora do cliente para apresentar a documentação necessária; assinatura em local inadequado; excesso de páginas para a assinatura; erros no cadastro. O Banco X foi informado a respeito dos motivos citados pelos parceiros para as pendências, bem como suas sugestões de medidas que poderiam facilitar os processos. Como algumas medidas sugeridas foram identificadas como inviáveis, o Banco X não buscou incluí-las em seu esforço de mudança. Por outro lado, a instituição por parte do operador, irá providenciar adesivos a serem colados nos contratos para indicar os locais corretos das assinaturas e, assim, evitar que os clientes deixem de assinar páginas necessárias ou assinem em locais inadequados. Além disso, o Banco criará uma agenda para que os parceiros possam ser recebidos na instituição, como um curso rápido de procedimentos e, assim, conforme as suas dúvidas forem esclarecidas, tornando sua s atividades mais eficientes. A procura por esse atendimento irá ocorrer de forma bastante ativa e, assim, pelo menos um parceiro será atendido a cada dia na instituição, mas em alguns períodos haverá um fluxo maior de atendimento.",
    "Palavras-chave": [
        "Gestão Documental",
        "Financiamentos",
        "Pendências"
    ],
    "Introdução": "Este trabalho tem como abordagem a gestão documental e os benefícios do controle organizacional. A gestão teve inicio nos Estados Unidos da América na crise dos anos 1930 e tido notória importância na II Guerra Mundial. Com o crescimento altíssimo das civilizações e das atividades do Estado, a organização documental se tornou indispensável. No Brasil, a Lei Nº 8.159 de 1991 trouxe políticas para difundir a gestão documental no país. Sendo criado o CONARQ (Conselho Nacional de Arquivos), junto com o Sistema de Gestão de Documentos de Arquivo (SIGA), para garantir a gestão documental pública, e assegurar diretrizes. Nas instituições bancárias, quem os regulariza é o Conselho Monetário Nacional (CMN), junto com o Banco Central do Brasil (BACEN), os quais exigem que os bancos cumpram as regras regulamentadas pela Lei Nº 4.595/64. Com a vasta demanda de documentos que uma instituição financeira produz, as grandes perdas de tempo de um operador bancário para regularizar pendências documentais deixadas pelos lojistas, devidamente cadastrados no banco, ao qual são parceiros comerciais nos financiamentos de veículos, é preocupante, pois, acarretam em perda de tempo e acumulo de retrabalho. De acordo com o cenário exposto acima, esse estudo tem como objetivo geral avaliar um método para reduzir e evitar pendências no processo administrativo dentro de uma instituição bancária, para dar menos trabalho ao lojista e mais agilidade ao operador na formalização documental, na qual posteriormente é enviada para matriz do banco. Para Moreno (2008, p.86) é detectado na atualidade das instituições, a burocracia excessiva em seus funcionamentos, fluxo de trabalho mal desenhado, muitos documentos desnecessários, e até duplicados, o que acarreta a uma pilha exagerada de documentos no fundo das instituições. Através dessa premissa, tem-se como objetivo específico: a) classificar os tipos de pendências; b) apontar os motivos das pendências; c) estudar um método de melhoria organizacional, para evitar pendências; d) experimentar um novo método em uma loja de Araranguá; e) exibir o resultado do experimento. Devido à necessidade de resolver pendências documentais na instituição financeira X, esse estudo se justifica através das pendências que as lojas de veículos parceiras acumulam no dia a dia, deixando os processos bancários mais demorados e trabalhosos, então, um melhor controle da gestão documental, vem com os benefícios, reduzir pendências documentais, melhorar e/ou até substituir o método existente de organização. Delimitando-se em colher informações sobre, de que maneira acontecem às pendências e como o aumento do controle documental, (desde o início), pode refletir ou contribuir para resolver as pendências documentais. Tendo como referência uma loja de automóveis da cidade de Araranguá, citada neste trabalho como loja Y. Buscou-se reunir dados/informações com o propósito de responder ao seguinte problema de estudo: de que maneira a melhoria da gestão e aumento do controle organizacional, pode refletir ou contribuir para resolver pendências documentais? A teoria é que a necessidade de resolver pendências está evidenciada nos retrabalhos que o operador de financiamentos tem com as regularizações documentais, porém, isso pode ser resolvido passando novas regras às lojas parceiras, ou até mesmo com um quadro ou painel informativo, informando o procedimento correto, ou também com um aumento de treinamento focado na documentação. Outra teoria são as instituições bancárias concorrentes, pois, cada instituição tem seu procedimento, no qual, cada lojista deve aplicar um procedimento diferente em cada documento de cada financeira. Que pode acarretar em confusão, e gerar pendências.",
    "Conclusão": "Todas as empresas, qualquer que seja seu ramo de atuação ou o porte do negócio, devem lidar com documentações, existem documentos que precisam ser mantidos por determinados períodos de tempo, inclusive em caso de solicitação dos órgãos fiscais do país. Quanto mais organizados estão esses documentos, mais rapidamente podem ser encontrados e, assim, geram agilidade nas atividades da empresa. A gestão de documento é a área do conhecimento que dedica-se aos estudos do arquivamento de documentos, seja de forma física ou virtual, buscando sua maior efetividade, organização, precisão na aplicação de métodos, conservação dos documentos e agilidade nos processos da empresa. Ocorre que muitas empresas ainda acreditam que a gestão é uma atividade de valor secundário e, assim, não é preciso seguir um método, essa atividade pode ser conduzida quando e se algum colaborador tiver um tempo. No entanto, empresas bem sucedidas vêm percebendo tão claramente o papel dos documentos que já contam com um colaborador ou uma equipe atuando exclusivamente na atenção aos arquivos. Em empresas de grande porte já existe a compreensão de que um arquivo bem organizado, sem erros e pendências representa um diferencial de organização e competitividade e, assim, muitas vêm desenvolvendo um setor ou, pelo menos, destinando um funcionário a ser capacitado e dar atenção exclusivamente a esse setor. Certamente que com o passar do tempo essa percepção se tornará maior, porém, até que isso ocorra, muitas empresas seguirão tendo problemas em seus processos por não conduzirem uma gestão documental eficiente e, assim, muitas terão de desembolsar valores para o pagamento de multas ou deixarão de receber valores decorrentes de negociações perdidas por não terem investido mais tempo e dinheiro em seus processos de organização e manutenção da documentação de forma precisa. Para o desenvolvimento deste estudo, foram entrevistados 23 parceiros, sendo que 43,48% deles fazem negócios com o Banco X há mais 7 anos e 17,39% há mais de 5 anos. Quanto à frequência de realização de negócios, verificou-se que 47,83% apresentam média frequência, 43,48% alta frequência e 8,7% baixa frequência. Ainda, identificou-se que 26,09% dos entrevistados realizam processos com o Banco X há mais de 7 anos, 21,74% há mais de 7 anos, 21,74% há mais de 2 anos, 17,39% há mais de 3 anos, 8,7% há menos de 1 ano e 4,35% há mais de 1 anos. As respostas apontam que 43,48% realizam processos com outros bancos com alta frequência, 43,48% com média frequência e 13,04% com baixa frequência. A confusão com processos de outros bancos ocorre com alta frequência para 17,39% dos entrevistados, média frequência para 21,74% dos entrevistados e baixa frequência para 60,87% dos entrevistados. A ocorrência de pendências para resolução do operador do Banco X, foi destacada por 56,52% dos entrevistados como baixa frequência, 13,04% média frequência e 30,43% alta frequência. A percepção dos entrevistados sobre o nível de dificuldade documental do Banco X foi de 17,39% indicando a dificuldade como média, 21,74% acham que é alta, enquanto 60,87% consideram a dificuldade baixa. A clareza que o controle da gestão documental da, como citado neste trabalho, concretiza o objetivo principal do mesmo e enfatiza as melhores maneiras práticas para não só ter uma melhor organização de tempo, mas de dinheiro também, pois, sem pendências, ninguém terá gastos com retrabalhos. Já os principais motivos para a ocorrência de erros e pendências foram elencados como: falta de atenção; assinaturas faltando; falta de folhas no contrato; deixar de entregar toda a documentação correta; dificuldade para achar o lugar da assinatura; comprovantes de renda; demora do cliente para apresentar a documentação necessária; assinatura em local inadequado; excesso de páginas para a assinatura; erros no cadastro. As possíveis soluções foram citadas como: contratos com menos folhas; todo processo digital por meio do APP; treinamentos anuais para a melhor preparação dos parceiros para essas atividades; eliminar a exigência de comprovante de renda; check-list para minimizar pendências. Certamente são sugestões que poderiam facilitar as atividades dos parceiros do Banco X, porém, gerariam uma dificuldade dentro da própria instituição, em função da inadequação com as exigências atuais da central quanto aos documentos necessários para a concretização do negócio."
}