{
    "Autor": "Roberta Ribas Mocelin",
    "Título": "MOBILE LEARNING NO BRASIL: UM ESTUDO EXPLORATÓRIO SOBRE AS INICIATIVAS RELATADAS NA LITERATURA",
    "Ano de publicação": 2017,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dra. Patricia Jantsch Fiuza",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho de conclusão de curso foi elaborado sob o tema \"Mobile Learning\", e teve o intuito de investigar como a aprendizagem móvel tem sido estudada e aplicada no Brasil. Foi utilizado a metodologia de pesquisa chamada Revisão Sistemática de Literatura, onde foi possível realizar uma investigação direcionada a este assunto em bases de dados online. Com os resultados desta pesquisa, foi criado um panorama geral sobre este tema a nível nacional, e foram identificadas várias iniciativas de aprendizagem móvel no país. Concluiu-se que este tema é recente, mas já apresenta forte interesse por parte de pesquisadores brasileiros. Ainda há um grande caminho a ser percorrido para a popularização deste método de ensino, mas as experiências publicadas já demonstram bons resultados na utilização desta técnica no processo de ensino-aprendizagem.",
    "Palavras-chave": "aprendizagem móvel, revisão sistemática de literatura, tecnologias digitais",
    "Introdução": "Desde a pré-história a vida do homem é constantemente alterada por novas tecnologias que ele mesmo descobre ou cria. Começando pela invenção da escrita, passando pela descoberta do fogo e da criação de ferramentas com pedra, chegando ao nascimento de tecnologias digitais, cada fato deste foi uma tecnologia que revolucionou o comportamento humano. Desde o advento da internet, e a popularização de computadores pessoais vive-se uma era digital, onde as tecnologias surgem em ritmo quase frenético, e verdadeiramente estão transformando as relações que os indivíduos têm, seja com os dispositivos eletrônicos, seja entre eles mesmos. (KENSKI, 2012; VEEN; VRAKKING, 2009) Na última década, uma nova categoria de dispositivos digitais inundou o mercado, e ganhou um espaço importante na vida da pessoas: os dispositivos móveis. Com a capacidade de serem transportados para qualquer lugar, sem a necessidade de estarem constantemente plugados à energia, os dispositivos móveis se tornaram uma ferramenta quase que indispensável ao homem, permitindo que ele possa estar conectado à internet e fazer praticamente tudo que um computador de mesa faz. Os desenvolvedores criaram os mais variados programas pra este dispositivo, e cada vez mais serviços foram disponibilizados para serem realizados através destes equipamentos. Hoje, é possível encontrar uma infinidade de marcas e modelos de tablets e celulares, que agradam as diferentes classes sociais, estando presente tanto em países subdesenvolvidos, quanto nos desenvolvidos. Junto com a popularização dos dispositivos wireless (sem fio), nasce uma geração de crianças que desde os primórdios de sua criação estão expostas a este tipo de tecnologia. Dentro de suas casas os pais possuem smartphones, tablets e notebooks e não hesitam em incentivar seus filhos a utilizar tais aparelhos. (PRENSKY, 2001; VEEN; VRAKKING, 2009) Como já dito, os dispositivos móveis proporcionam uma liberdade de tempo e espaço, e quando conectados à internet ampliam os canais de informação que o usuário tem acesso. Tal característica proporciona um viés pedagógico até então desconsiderado por muitas pessoas, que encaram tais dispositivos apenas como opção de entretenimento ou comunicação. A popularização dos dispositivos móveis deu origem a uma nova modalidade de aprendizagem que se baseia no uso deste tipo de equipamento. O mobile learning, ou aprendizagem móvel, têm surgido como uma alternativa para aproveitar os benefícios que estes dispositivos apresentam. No entanto, a aplicação deste conceito não é nada fácil, e muitos pais e professores ainda têm dificuldades para enxergar o potencial pedagógico presente nos dispositivos digitais. Ainda que este tema seja relativamente novo, é possível encontrar muitos exemplos de sucesso em diferentes países do mundo (SHULER, 2009). E no Brasil, o que tem se falado sobre este tema? Quais são as iniciativas de aprendizagem móvel presentes no país? Alguma delas está apresentando resultados favoráveis à utilização de mobile learning? Estes questionamentos inspiraram o tema escolhido para este trabalho, e deram origem aos objetivos do mesmo.",
    "Conclusão": "Por meio da realização da revisão sistemática de literatura atingiu-se o objetivo geral deste trabalho, que consistia na investigação do tema \"mobile learning\" e buscar casos brasileiros de aplicação desta modalidade de ensino no país. A busca por publicações com este tema foi bem sucedida, visto que muitas delas traziam de fato uma discussão sobre o tema, e foi possível encontrar uma boa quantidade de estudos de caso sobre iniciativas em aprendizagem móvel no Brasil. Observou-se que este tema tem sido escolhido por muitos mestrandos e doutorandos para serem desenvolvidos em suas dissertações e teses, pois o número destes tipos de trabalhos retornados na pesquisa foi grande. As publicações apresentadas neste trabalho são recentes, tendo a mais antiga destas apenas 6 anos. Considerando que o acesso à internet através de dispositivos móveis vem crescendo, e que segundo dados da 11ª pesquisa TIC Domicílios teve um aumento de 9% no caso do acesso através do celular entre 2014 e 2016, é esperado que o interesse pelo tema deste trabalho também aumente (Portal Brasil, 2016). Cada ano que passa surgem mais possibilidades de inclusão da tecnologia digital no ensino e à medida que a necessidade desta inclusão também aumenta, espera-se que mais pesquisas e experiências sejam efetivadas pelos pesquisadores brasileiros na busca por soluções de tecnologia da informação na educação do país. No entanto, é importante ressaltar um detalhe em comum a todos os estudos analisados nesta revisão: nenhum caso apresenta continuidade. As experiências são muitas, nos diversos assuntos e disciplinas desde o ensino fundamental ao superior. Porém foram todas tentativas isoladas, que perduraram pelo tempo determinado da pesquisa, mas em nenhuma publicação declarou-se que o esforço para implantação de aprendizagem móvel era uma constante nos respectivos ambientes de estudo. Ainda que todos os casos apresentem sucesso e tenham validado pontos importantes de mobile learning, o esforço terminou com o estudo e as aulas voltaram a ser como tradicionalmente eram feitas. Muitas são as justificativas para esta falta de continuidade de iniciativas de aprendizagem móvel nas escolas brasileiras. Na maioria dos casos, por exemplo, as escolas não dispunham de dispositivos para uso dos alunos. Os próprios pesquisadores emprestaram equipamentos para que o estudo fosse possível. Sabe-se da realidade precária que as escolas públicas do Brasil vivem no que diz respeito à infraestrutura geral, ainda mais quando se fala em infraestrutura tecnológica. Frente a este problema, e somando ao aumento no uso de smartphones, muitos estudos usaram essa ferramenta, visto que por ser de uso pessoal espera-se que os próprios alunos possam contribuir utilizando seus próprios pertences. Esta possibilidade funciona, à medida que todos da turma tenham um aparelho com as qualificações mínimas para realização das tarefas exigidas. Porém esbarra-se em mais uma dificuldade: a legislação. Em muitos municípios ou estados existem leis que proíbem o uso de aparelho celular dentro da escola, servindo de barreira à aprendizagem móvel e tornando-a de certa forma ilegal em algumas iniciativas. Foi preciso que alguns pesquisadores encontrassem brechas na lei, ou limitassem o uso dos smartphones aos ambientes fora do contexto escolar. Além desta questão de disponibilidade de dispositivos, também deve-se citar a dificuldade dos professores em utilizar efetivamente a aprendizagem móvel como técnica de ensino sem o apoio dos pesquisadores após os experimentos. Realmente, a aprendizagem móvel requer muito estudo, investigação e planejamento para ser desenvolvida, e alguns profissionais não estão dispostos a pisar neste terreno ainda pouco desbravado para dar um caráter mais atual aos seus métodos de ensino. Outro ponto em comum é a satisfação dos alunos em usar a tecnologia como parte das tarefas de aula. Os alunos se sentiam motivados e se engajavam melhor nas atividades quando estas estavam relacionadas com o uso de dispositivos móveis. Este fato reforça o quanto a geração de estudantes que está nas escolas atualmente está carente de mudanças nos métodos de ensino, uma vez que já estão habituados a utilizar tecnologia nos demais afazeres fora da escola. Como discutido anteriormente, os alunos atuais estão expostos a muitos estímulos vindos de todos os tipos de tecnologias presentes nos ambientes em que vivem, e estes estímulos fazem com que o raciocínio desta geração seja completamente diferente de gerações passadas. Desta forma, os métodos de ensino centenários que se encontram nas escolas ainda hoje, se tornam ineficientes para esta nova geração. Mesmo que a mobilidade permeie as ações cotidianas nos mais diferenciados contextos, no que se refere à educação ainda é preciso subir muitos degraus para atingir o patamar em que o avanço tecnológico se encontra no geral. Os métodos de ensino e aprendizagem do Brasil ainda estão espelhados nos métodos utilizados no século passado, visto que ainda tem-se a mesma configuração de sala de aula e a mesma concepção de aula daquele tempo. A educação precisa acelerar seu processo de atualização, e incorporar de vez o uso da tecnologia como apoio no ensino. O professor precisa enxergar os dispositivos digitais como um aliado, e não como um inimigo. Ele precisa deixar de ser o centro da aula, e se tornar o mediador do conhecimento, dando espaço para novas técnicas e possibilidades no ensino apoiados na tecnologia. A realização da RSL deixou claro que existe o interesse em tornar a aprendizagem móvel uma realidade, e muitos esforços para isso têm sido despendidos pelos pesquisadores brasileiros. Os benefícios do uso consciente, planejado e mediado de dispositivos móveis na educação ficou evidente com a revisão, e serve de incentivo para o surgimento de mais iniciativas neste campo. Mesmo que muitas dificuldades sejam encontradas neste caminho, é possível perceber um movimento crescente de apoio a esta causa, e espera-se que nos próximos anos seja possível encontrar iniciativas de mobile learning no Brasil que estejam aplicadas de forma constante e eficiente, servindo de modelo para a ampliação da aprendizagem móvel a nível nacional e internacional."
}