{
    "Autor": "Mateus Martinelli Paegle",
    "Título": "GameAnalyticsApp: Projeto de uma aplicativo para estudo de anatomia humana utilizando analítica de aprendizagem para jogos",
    "Ano de publicação": 2020,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Dr. Robson Rodrigues Lemos",
    "Coorientador(a)": null,
    "Resumo": "O uso de tecnologias modernas para aplicações Web em conjunto com boas práticas no desenvolvimento de software permite criar uma base de código com qualidade e com potencial de escalabilidade para adição de funcionalidades durante o ciclo de desenvolvimento de software. Este trabalho de conclusão de curso tem como objetivo o desenvolvimento de uma base de código utilizando tecnologias Web baseadas em aplicações do tipo single-page e melhores práticas no desenvolvimento de software, tais como padrões de projeto (design patterns). Utilizando como base o projeto do EducaAnatomia3D (2020), desenvolveu-se uma estrutura para uma aplicação móvel onde o jogo sério poderá expandir em termos de possíveis funcionalidades futuras de forma rápida e escalável. Além disso a coleta de informações a respeito da sessão de estudo foi incorporada no projeto possibilitando explorar técnicas de analítica de aprendizagem e visualização dos dados através de painéis de controlo (dashboards). Dentro deste contexto, os resultados preliminares do projeto e desenvolvimento de um aplicativo intitulado GameAnalyticsApp são apresentados neste trabalho e disponíveis em uma url para acesso via web browser para testes durante o ciclo de desenvolvimento do software.",
    "Palavras-chave": "Jogos Sérios, Ambiente de Ensino Virtual, Escalabilidade, Analítica de Aprendizagem.",
    "Introdução": "Ao iniciar o desenvolvimento de uma nova aplicação, se faz necessária a definição de estruturas de apoio que auxiliarão o crescimento e manutenção dela. Pensando neste cenário, a utilização de Padrões de Projetos (Design Patterns) aliada às boas práticas no desenvolvimento de software manterão o crescimento da aplicação de forma saudável. Este crescimento saudável também está aliado à utilização de tecnologias atuais, onde é possível o manejo das melhores ferramentas, a fim de proporcionar uma experiência de uso agradável para os usuários. Ao utilizar a tecnologia como aliada para o ensino, cria-se novas formas de imersão aos conteúdos, que se tornam complexos caso a abordagem tradicional seja empregada. Para o estudo da anatomia humana, o custo de se manter um laboratório de anatomia é alto. Os procedimentos que precisam ser realizados em um cadáver para mantê-lo em um estado de conservação para utilização como ferramenta de estudos, são elevados. Neste aspecto, é possível a utilização de modelos geométricos 3D para que assim os alunos possam interagir, diminuindo o custo de manutenção de um laboratório. Aliando o uso de tecnologia com o ensino, se torna viável a coleta dos dados de uso do aluno dentro de um software, para que através da analítica de aprendizagem, seja possível desenvolver informações para identificação da evolução do aprendizado em paralelo com as dificuldades encontradas nos estudos.",
    "Conclusão": "O projeto e desenvolvimento do GameAnalyticsApp utilizando tecnologias do tipo single-page application como o React (2020) e melhores práticas de desenvolvimento de software irão possibilitar que a aplicação, a partir deste estágio, possa crescer de forma organizada. A modularização do Backend voltada a domínio, ajudou a manter cada módulo da aplicação em seu lugar e outros desenvolvedores poderão seguir o mesmo padrão, pois existe uma estrutura lógica ao se criar e expandir o sistema para novas funcionalidades (features). Ainda no Backend a utilização do Object Relational Mapping (ORM) Sequelize ajudou a manter organizado os acessos a registros necessários no banco de dados. Ao se utilizar um framework para o desenvolvimento Frontend, aproveitamos todo o potencial de performance que podemos ter em um browser. Através do React (2020) utilizamos o conceito de componentização onde após criar nossos componentes podemos, como um quebra-cabeça, juntar os componentes (peças) e montar as visualizações de forma prática e rápida. Como trabalhos futuros pretende-se adicionar novos módulos, tais como o Sistema Esquelético, o Sistema Muscular e o Sistema Nervoso. Também, pretende-se criar uma nova etapa de aprendizagem utilizando um jogo do tipo questionário (Quiz do tipo pergunta/resposta). Além disso, pretende-se disponibilizar painéis de controle para acompanhamento do usuário do tipo estudante e professor para acompanhar o processo de ensino e compreensão das etapas de ensino a fim de tomar possíveis decisões para que o processo melhore a partir de modificações ou recomendações futuras. Vale ressaltar que para adicionar os objetos 3d utilizando a biblioteca Babylon e a biblioteca de gráficos D3.js, eles devem ser integrados ao React para manter a compatibilidade. E ainda para disponibilizar os arquivos contendo os objetos 3d que o Babylon precisa para funcionar, pode-se utilizar o ambiente AWS utilizando o serviço S3, que é um serviço de armazenamento de documentos."
}