{
    "Autor": "Mateus de Freitas dos Santos",
    "Título": "IMPLEMENTAÇÃO FRONT-END DE UM BLOCO MOODLE PARA PREDIÇÃO DE ACADÊMICOS EM RISCO",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Cristian Cechinel",
    "Coorientador(a)": null,
    "Resumo": "A fim de auxiliar o professor na identificação de alunos em risco de reprovação, foram planejadas e implementadas novas funcionalidades utilizando conceitos de Learning Analytics para um plugin do tipo bloco para a plataforma Moodle. Em geral, as funcionalidades implementadas foram o desenvolvimento de novas visualizações de dados, além da adição de opções para execução do algoritmo de predição. Foram utilizadas ferramentas como HTML, CSS, PHP, Mustache, AJAX e jQuery aliadas aos padrões de desenvolvimento da comunidade. Desta forma, com as novas funcionalidades foi possível perceber um melhor acompanhamento dos alunos e do curso, auxiliando o professor na tomada de decisões mitigando a reprovação de acadêmicos.",
    "Palavras-chave": "Analítica de aprendizagem. Reprovação. Predição. Moodle. Plugin.",
    "Introdução": "Segundo Couto e Santana (2017), os problemas gerados pela evasão e retenção ocasionada pelos altos índices de reprovação, produzem diversas causas e consequências negativas para os acadêmicos, instituições de ensino e comunidades em que esses estudantes estão inseridos. Sendo assim, várias pesquisas vêm sendo implementadas, visando a criação de ferramentas para professores que auxiliem na identificação desses alunos. Sendo assim, a Learning Analytics (LA) ou Analítica de aprendizagem é a área determinada para medição, coleta, análise e desenvolvimento de relatórios de dados de alunos e seus contextos, para que se possa entender e otimizar o processo de ensino-aprendizagem (LAK, 2011). Portanto, o foco principal deste trabalho, é o desenvolvimento front-end de uma ferramenta para predição de acadêmicos em risco de reprovação e/ou evasão denominada Moodle Analytics Dashboard 2, que é um plugin do tipo bloco para a plataforma Moodle. A plataforma de aprendizagem Moodle foi desenvolvida para proporcionar a administradores, professores e alunos um sistema único para a criação de ambientes de aprendizagem de forma personalizada (MOODLE, 2021). Segundo o site de estatísticas do Moodle, atualmente a plataforma está em 240 países com aproximadamente 292 milhões de usuários, 38 milhões de cursos e 184 mil sites registrados (STATISTICS... 2021). Os autores Soares, Valentini e Rech (2011), definem ambientes virtuais de aprendizagem como lugares para aprendizagem na web, onde é possível que os usuários gerem intenções, cooperando e desenvolvendo ideias, ultrapassando fronteiras geográficas, culturais de tempo e de idades para geração de aprendizagem. Dessa forma, o desenvolvimento de uma ferramenta utilizando os principais conceitos de analítica de aprendizagem e modelos preditivos dentro de uma plataforma de aprendizagem pode atuar na identificação de acadêmicos em risco pelos professores. O monitoramento e identificação desses acadêmicos com antecedência podem auxiliar na tomada de decisões, e assim mitigar a reprovação acadêmica. De forma geral, um modelo preditivo é capaz de identificar padrões dentro de uma base de dados por meio de funções matemáticas, contudo nem sempre é possível encontrar essas funções, e então é comum o desenvolvimento de algoritmos para obter essas predições (ALICE BECKER, 2021). Sendo assim, a ferramenta oferecerá recursos para auxiliar o professor no acompanhamento de seu processo de ensino-aprendizagem por meio de visualizações de dados, possibilitando a identificação visual de possíveis estudantes em riscos, baseadas nas informações geradas pela plataforma.",
    "Conclusão": "Com o passar dos anos a tecnologia vem auxiliando o avanço de nossa sociedade, isso se dá pela comodidade que a tecnologia nos entrega, principalmente no compartilhamento da informação. Dessa forma, novas modalidades de ensino vêm sendo criadas e discutidas. O ensino a distância, por exemplo, tem sido muito utilizado atualmente e está em uma crescente a cada ano. Contudo, um dos grandes problemas enfrentados nessa nova modalidade de ensino é a reprovação de acadêmicos. Sendo assim, o estudo, discussão e desenvolvimento de soluções que utilizem os conceitos de analítica de aprendizagem são de grande importância. A visualização de dados é uma das principais áreas do LA e pode auxiliar na análise de dados gerados pelos ambientes virtuais de aprendizagem, que em muitas vezes são de difícil acesso e entendimento por parte do profissional da educação. Diante disso, neste trabalho utilizamos o ambiente virtual Moodle, para desenvolver uma ferramenta de analítica de aprendizagem com o objetivo de auxiliar os docentes na identificação de alunos em risco de reprovação por uma série de relatórios e visualizações de fácil compreensão. Com o produto final desenvolvido, foi possível desenvolver testes em ambientes reais, que por sua vez trouxeram conclusões fundamentais para a pesquisa. Com o uso do Moodle Analytics Dashboard 2 por professores que utilizam a plataforma diariamente, foi possível notar uma grande evolução no mapeamento de dados referentes ao curso e aos acadêmicos matriculados. Além da facilidade de comunicação entre o professor e os acadêmicos que estão em risco. Durante o desenvolvimento do trabalho, algumas dificuldades foram encontradas. Apesar da plataforma Moodle ser uma ferramenta Open Source, ou seja, livre e com um conjunto de ferramentas prontas e com uma ampla comunidade para auxiliar na construção do bloco, para que o plugin possa ser disponibilizado para essa comunidade não é possível utilizar pacotes de ferramentas terceiras. Com isso, os tipos de visualizações são limitados. Porém para contornar essa limitação, novas visualizações de dados foram criadas dentro da ferramenta, utilizando ferramentas permitidas pela plataforma. Para trabalhos futuros, visando melhorar a experiência do professor na identificação dos acadêmicos em risco e o processo de desenvolvimento de novas funcionalidades dentro do bloco, considera-se a implementação de novos gráficos e visualizações de dados, como por exemplo gráfico de dispersão, suporte ao monitoramento de plugins de recursos instalados, suporte para download de dados das visualizações, adição de testes automatizados durante o processo de implementação, aliado a um maior estudo nas áreas de analítica de aprendizagem."
}