{
    "Autor": "Natalia Bortoli Vieira",
    "Título": "Desenvolvimento de um Sistema de Backend Genérico para Aplicações de Software Comerciais",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Fabrício Herpich",
    "Coorientador(a)": "",
    "Resumo": "No dinâmico cenário empresarial contemporâneo, marcado pela necessidade de agilidade e flexibilidade para atender às demandas de um mercado em constante transformação, a Transformação Digital (TD) e o uso intensivo de Tecnologias da Informação e Comunicação (TICs) desempenham um papel crucial na competitividade das empresas, impulsionando tanto a inovação quanto a eficiência operacional. Nesse contexto, o desenvolvimento ágil de aplicações surge como um desafio devido à sua complexidade, altos custos e demanda por profissionais altamente qualificados. Com o objetivo de contribuir para a redução de custos e esforços associados à construção da camada backend, este trabalho propõe o desenvolvimento de um sistemade backendgenéricocapacitadoparafornecer,via APIREST ,recursosefuncionalidades paraaplicaçõescomerciais,comfocoinicialnosetordeserviçosdeentregadeprodutos( delivery). A metodologia utilizada neste projeto foi a Design Science Research Methodology (DSRM), recomendada para o desenvolvimento de artefatos voltados à solução de problemas específicos. Osistemafoidesenvolvidocom TypeScript eNest.js,eadotouumaarquitetura multi-tenancy , visandopossibilitarocompartilhamentodainfraestruturatecnológicaentrediferentesaplicações, sem riscos de interferência. A solução implementa princípios do padrão REST, proporcionando umainterface decomunicaçãouniforme epadronizada,tornando-a maisintuitivae fácildeser compreendida. Osresultadosobtidosdestacamopotencialdosistemaemsimplificarepadronizar processosnodesenvolvimentodesoftware,oferecendofuncionalidadesreutilizáveiseadaptáveis a outros domínios comerciais, com possibilidades promissoras para expansão. Sugere-se a ampliação das funcionalidades para abranger novos contextos comerciais, a integração com um sistemade frontendparaproporcionarumasoluçãocompletaeodesenvolvimentoderecursos queaumentemausabilidadeepersonalização.Adicionalmente,ainclusãodemecanismosque aprimorem o suporte a configurações específicas de negócios e a otimização do desempenho em ambientes de alta demanda são aspectos relevantes a serem explorados em futuras iterações.",
    "Palavras-chave": [
        "BackendGenérico",
        "API REST",
        "Transformação Digital",
        "Desenvolvimento Ágil de Software",
        "Multi-tenancy"
    ],
    "Introdução": "Atualmente as empresas estão introduzidas em um ambiente global constantemente volátil,porcontadisso,setornainquestionávelofatodequeasorganizaçõesprecisamresponder de forma ágil e flexível às exigências do mercado para que consigam atender aos requisitos variados do ambiente ao qual estão inseridas (SANCHIS et al., 2019). Para Sommerville (2011), esse cenário não só exige respostas ágeis em relação às oportunidades de mercado, mas também requer que as empresas se adaptem de forma eficiente em relação à concorrência, de forma a estarem sempre preparadas para ajustar suas estratégias diante do surgimento de novos produtos que geram uma vantagem competitiva aos seus concorrentes. A transformação digital (TD), que diz respeito ao processo individual de cada organização utilizar tecnologias digitais a fim de se redefinir como um negócio digital, reflete o esforço das empresas em alcançarem uma posição competitiva vantajosa perante às mudanças do mercado. Como destaca Fabio Correa Xavier, mestre em Ciência da Computação, professor e colunista da MIT Technology Review Brasil, A transformação digital tem grande importância para as organizações, pois está diretamente relacionada à capacidade de competir em um mercado cada vez mais revolucionário. As empresas que adotam a TD podem obter vantagens competitivas em relação às suas concorrentes, seja por meio de redução de custos, aumento da eficiência, melhoria na qualidade do produto ou serviço ou mesmo por meio da criação de novos modelos de negócios (XAVIER, 2023, n.p). Assim, as organizações que conseguem responder às demandas do mercado que estão inseridas com agilidade e eficiência têm maior chance de se destacar frente aos concorrentes. Tal perspectiva se aproxima da significação do termo agilidade por Barane Woznyj (2020), como sendo um pré-requisito essencial para as organizações gerenciarem eficientemente a volatilidade do mercado. Segundo Junkes (2014) apud Cassiolato e Silva (1995) o uso intensivo das Tecnologias da Informação e Comunicação (TICs) é um dos fatores que impacta diretamente na competitividade das organizações. As TICs também são consideradas fundamentais nos processos de transformação digital, pois além de proporcionarem uma vantagem competitiva, impulsionam a inovação e permitem que as empresas se adaptem de forma ágil diante das mudanças que podem ocorrer na esfera à qual estão inseridas. De acordo com Sommerville (2011), os produtos de software, por estarem inseridos na ampla maioria dos processos de negócio das organizações, precisam que o seu desenvolvimento e entrega sejam rápidos para que seja possível aproveitar novas oportunidades e atender às pressões competitivas do mercado. Dessa forma, a agilidade no desenvolvimento de produtos de software se torna um fator crucial e que requer novas soluções, dado que a abordagem tradicional de codificação manual é considerada um processo lento, bastante complexo e que gera muitos custos em termos de tempo, dinheiro e esforço (ALSAADI et al., 2021). Nesse contexto, ferramentas que viabilizam o desenvolvimento rápido e eficaz de softwares tornam-se relevantes, pois além de contribuírem com fatores de redução de tempo, custos e complexidade relativos ao desenvolvimento, também favorecem as estratégias relacionadas à transformação digital das corporações ao agilizar a introdução de novos produtos no mercado, proporcionando uma vantagem competitiva para o negócio em questão.",
    "Conclusão": "Tendo em vista o objetivo geral do presente trabalho, que consiste em \" desenvolver o protótipo de um sistema de backend genérico, capaz de fornecer, via API REST, recursos e funcionalidades aplicáveis ao desenvolvimento de aplicações de software comerciais, com foco inicial em plataformas de delivery \", pode-se afirmar, fundamentando-se no exposto no capítulo 5 Demonstração e no capítulo 6 Resultados e Discussões, que este objetivo foi atingido. A seguir, ao que se refere aos objetivos específicos que orientaram o desenvolvimento do sistema: •Explorar os fundamentos do padrão arquitetural REST, com ênfase em seus princípios mais relevantes para o desenvolvimento de webservices - O objetivo proposto foi alcançado, com suas evidências demonstradas no capítulo 2 Referencial Teórico , demonstradas no capítulo 5 Demonstração e corroboradas pela documentação da API, que se encontra publicamente disponível no SwaggerHub. •Realizar o levantamento dos requisitos para o desenvolvimento do sistema, os diagramas de caso de uso e o modelo de dados - Conforme a descrição dos requisitos apresentada no capítulo 4, Projeto e Desenvolvimento , entende-se que este objetivo foi alcançado; •Descrever os principais fluxos de requisições previstos na utilização da ferramenta - Verifica-se que o objetivo foi atingido com a apresentação e o detalhamento dos fluxos propostos no capítulo 5 Demonstração; •Verificar a aplicabilidade dos recursos implementados no sistema para outros domínios de aplicações de software comerciais - O objetivo foi alcançado e suas evidências podem ser conferidas com o exposto na seção 6.2 Funcionalidades Implementadas , bem como na seção subsequente reservada para o tema. O sistema de backend genérico para aplicações de software comerciais desenvolvido neste trabalho representa uma contribuição significativa para o desenvolvimento ágil de softwares voltados ao mercado comercial. A implantação do sistema em um ambiente de produção, aliada à disponibilização pública da documentação da API do sistema, possibilita a reutilização dos recursos e funcionalidades implementadas. Dessa forma, o sistema pode servir como uma base sólida para o funcionamento de interfaces de usuários desenvolvidas especificamente para o domínio comercial de delivery, reduzindo fatores como o tempo e os custos associados ao desenvolvimento completo de soluções comerciais integradas. O sistema também apresenta grande potencial para continuidade e expansão, permitindo a implementação de novas funcionalidades que atendam a outros domínios comerciais de aplicações de software. Esse potencial de evolução é viabilizado pela arquitetura modular e escalável do sistema, aliada à documentação detalhada da API, que fornece uma base clara e acessível para desenvolvedores interessados em contribuir para o projeto. A implantação do sistema em um ambiente de produção garante que essas futuras implementações possam ser testadas e integradas em um contexto realista, assegurando sua eficácia e funcionalidade. Dessa forma, o sistema se posiciona como uma solução não apenas para o domínio inicial de delivery, mas também como uma ferramenta adaptável e expansível para diferentes segmentos comerciais. Embora o sistema tenha demonstrado eficácia em cumprir seu propósito como uma solução de backend genérica e expansível, entende-se que a ausência de uma integração com um sistema de frontend restringiu a possibilidade de avaliação em cenários mais realistas. Essa limitação impediu uma análise aprofundada da interação usuário-sistema, que seria fundamental para avaliar a usabilidade e a eficiência do sistema em condições práticas de utilização. A integração com um frontend permitiria explorar de forma mais abrangente o comportamento do sistema quando utilizado por usuários finais, identificando potenciais melhorias tanto na experiência do usuário quanto na comunicação entre as camadas de software. Essa é uma sugestão relevante para trabalhos futuros que possibilita uma avaliação mais completa e detalhada da solução proposta. Entende-se, ainda, que há oportunidades para aprimorar a eficácia do sistema no contexto de aplicações de delivery em trabalhos futuros, por meio da implementação de funcionalidades adicionais que agregariam ainda mais valor. Entre elas, destaca-se o gerenciamento de estoque e vendas, juntamente com a inclusão de dashboards gerenciais, que poderiam apresentar informações financeiras, dados de vendas e indicadores-chave de desempenho (KPI’s), como receita total, volume médio de pedidos, produtos mais vendidos e comparativos de vendas. Esses recursos ofereceriam insights estratégicos valiosos, facilitando a tomada de decisões baseadas em dados e otimizando as operações comerciais. Adicionalmente, algumas sugestões de melhorias futuras para abranger novos domínios comerciais incluem a integração com sistemas de logística em tempo real, permitindo o rastreamento detalhado de entregas, e a implementação de mecanismos avançados de personalização, como recomendações baseadas no histórico de pedidos dos clientes. Essas implementações posicionariam o sistema como uma solução ainda mais versátil e competitiva para diferentes mercados de aplicações comerciais."
}