{
    "Autor": "Luiza Carolina Miranda Garcia",
    "Título": "Divulgação científica da pesquisa brasileira em Engenharia de Software no Linkedin : caracterização, perfil dos divulgadores e interações recebidas",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profa. Andréa Sabedra Bordin, Dra.",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho investiga como a pesquisa brasileira em Engenharia de Software é divulgada no Linkedin, uma rede social profissional, por meio da análise de características dos posts, do perfil dos divulgadores e das interações recebidas. Foram extraídos e analisados 223 posts que fazem referência aos seguintes eventos científicos da área, SBES, SBQS, CIBSE e ICSE, sendo 114 identificados como de divulgação científica. A pesquisa utilizou técnicas de web scraping e classificação manual para extrair atributos relacionados aos conteúdos das postagens, autores e interações. Os resultados destacam que a divulgação científica é predominantemente realizada por perfis individuais, com maior frequência de autores que atuam no mercado profissional, sendo a autopromoção o principal objetivo dos posts analisados. Foi identificada uma baixa participação de instituições na divulgação, com estas frequentemente limitando-se a promover eventos. Foi observado o amplo uso de recursos visuais e o uso limitado de elementos que facilitam a compreensão de pesquisas, como metodologias e resultados. Esta pesquisa concluiu que, embora o Linkedin tenha potencial para amplificar o alcance da divulgação científica, há oportunidades de melhoria na forma como a pesquisa é apresentada para ampliar o engajamento entre a comunidade científica e profissional.",
    "Palavras-chave": "Divulgação Científica. Engenharia de Software. Linkedin.",
    "Introdução": "Na área de Engenharia de Software (ES), descobertas científicas introduzem novos processos, métodos e metodologias que simplificam o desenvolvimento de software, facilitando o acesso a conhecimentos práticos e úteis que geram impactos positivos tanto para o cotidiano dos profissionais quanto para o mercado (BEECHAM et al., 2014). Embora a pesquisa seja uma possibilidade para melhorar a atividade profissional, esses benefícios só são plenamente percebidos quando os resultados de pesquisas científicas são comunicados de forma eficiente ao público a que eles se destinam.\nA divulgação científica é reconhecida como um meio para aproximar a pesquisa científica da sociedade. Segundo Wyrich e Bogner (2024), a divulgação das descobertas de pesquisa permite que profissionais da indústria ganhem acesso a um conhecimento útil para integrar ao seu trabalho diário e que pesquisadores de Engenharia de Software alcancem o público pretendido, recebam feedback sobre seu trabalho e encontrem potenciais parceiros de colaboração. Assim, o Linkedin mostra-se como um espaço para a disseminação do conhecimento científico, criando uma ponte entre o ambiente acadêmico e o setor industrial.\nA metáfora da Espiral da Cultura Científica proposta por Vogt (2003) oferece um modelo para entender como o conhecimento científico se difunde na sociedade e como a divulgação científica pode alcançar diferentes públicos. Nesse modelo, o conhecimento circula num movimento de espiral, incentivando o diálogo entre a ciência e o público de modo que os resultados sejam compreendidos e atendam as necessidades de grupos diversos. Para que isso ocorra, é necessário que pesquisadores tornem seus resultados acessíveis por meio de alguma forma de divulgação científica.\nDivulgação Científica (DC) é toda ação que tem como objetivo disseminar o conhecimento científico e popularizar a ciência. A DC realiza-se por meio de formas diversas, como artigos e revistas científicas, livros didáticos, museus e eventos abertos ao público (MELO MARICATO; MENDES et al., 2015). Em mídias digitais, ocorre em páginas especializadas, jogos eletrônicos, podcasts, redes sociais, que utilizam postagens informativas, vídeos curtos ou até memes para tornar o conteúdo científico mais atrativo e numa linguagem que o simplifique (JESUS OLIVEIRA, 2020). Através da DC os resultados alcançados pelos pesquisadores são compartilhados com a comunidade científica, tomadores de decisão, profissionais, instituições etc.\nRedes sociais facilitam o acesso a informações anteriormente restritas a canais específicos, ampliando a visibilidade da pesquisa científica e potencializando a interação entre indivíduos, criando um espaço propício para a comunicação do conhecimento (FRANÇA, 2015). Entre as redes sociais mais populares, o Linkedin se destaca por ser uma rede de cunho profissional.\nComo afirmam Wyrich e Bogner (2024), o Linkedin tem sido um meio para a divulgação científica de trabalhos acadêmicos da área de ES, permitindo que tanto profissionais quanto pesquisadores tomem conhecimento dos resultados alcançados visto que ambos estão presentes nessa plataforma. Assim, ao utilizar canais de comunicação mais amplos como o Linkedin, pesquisadores e profissionais de ES podem aproveitar as funcionalidades dessa rede social profissional para alcançar e interagir com outros profissionais, responder perguntas e discutir sobre seus resultados e artefatos de pesquisa.\nNa Engenharia de Software, a pesquisa tem um papel importante ao fornecer descobertas baseadas em evidências que contribuem e aprimoram a colaboração entre profissionais da indústria e pesquisadores. Muitos desafios encontrados na prática de ES podem ser solucionados com o acesso a resultados de pesquisas validadas entre os pares, permitindo que as melhores práticas e inovações possam chegar ao setor (BEECHAM et al., 2014).\nAo adotar uma estratégia de divulgação científica numa rede como o Linkedin, os pesquisadores de ES não só aumentam a visibilidade e o impacto de suas pesquisas, mas também facilitam a adoção e implementação de novas ideias, ferramentas e técnicas que podem beneficiar o desenvolvimento de software.",
    "Conclusão": "Este trabalho investigou como a pesquisa em Engenharia de Software é divulgada por meio de posts no Linkedin, concentrando-se na produção científica brasileira associada aos eventos SBES, SBQS, CIBSE e ICSE. Foram analisados 114 posts de divulgação científica como objetivo de entender como e quais pesquisadores, profissionais e instituições divulgam e quais são as interações recebidas pelo conteúdo científico nessa plataforma. Entende-se que a presença e a divulgação de eventos nacionais no Linkedin tem potencial de fortalecer laços locais e contribuir para a construção de uma rede nacional de conhecimento científico entre pesquisadores, profissionais e instituições. Um movimento que se alinha à Espiral da Cultura Científica que descreve como a ciência se expande de comunidades especializadas, começando pela disseminação de conhecimento em contextos locais e progredindo para alcançar públicos mais amplos.\nDiante de um cenário em que artigos científicos podem ter acesso limitado, compreender como o Linkedin funciona como ferramenta de divulgação científica permite entender como essa plataforma está sendo utilizada para popularizar a ciência. Num contexto onde o acesso às pesquisas ainda é restrito, a divulgação científica em redes sociais como o Linkedin pode ser uma estratégia para a democratização do conhecimento, ao promover um diálogo entre a academia e a sociedade e fortalecer a visibilidade das pesquisas e de seus autores.\nAo considerar os principais resultados anteriormente apresentados e discutidos, conclui-se que, apesar do potencial do Linkedin como veículo de divulgação científica, ele ainda é subutilizado para essa finalidade. Embora o caráter mais pessoal e direto da comunicação feita por indivíduos pareça fomentar maior proximidade e interesse por parte dos leitores, a apresentação de conteúdos aprofundados sobre as pesquisas ainda é rara, limitando o impacto das postagens em relação à divulgação científica.\nEnquanto recursos visuais são muito utilizados, a dependência de narrativas de autopromoção e a subutilização de elementos científicos limitam o alcance e a profundidade da comunicação no Linkedin. Para superar essas limitações, os pesquisadores devem adotar práticas de divulgação científica mais inclusivas, como a decodificação de linguagem técnica e o detalhamento do conteúdo científico, promovendo um diálogo mais acessível e produtivo entre diferentes públicos.\nEm relação à baixa presença das instituições, as estratégias de comunicação também poderiam ser repensadas, explorando um tom mais acessível, tornando-as mais personalizadas e voltadas a atrair o engajamento do público. Isso não apenas aumentaria o alcance das pesquisas científicas, mas também fortaleceria o papel das instituições como agentes ativos na disseminação do conhecimento complementando os esforços individuais dos pesquisadores e profissionais."
}