{
    "Autor": "Tassio Hipólito de Amorim",
    "Título": "Desenvolvimento de um Sistema Web para Gestão de Locações em uma Loja de Artigos para Festas",
    "Ano de publicação": 2023,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Fabrício Herpich",
    "Coorientador(a)": null,
    "Resumo": "No contexto da crescente digitalização dos processos empresariais, este trabalho aborda a necessidade de otimização na gestão dos aluguéis no setor de locação de produtos decorativos de uma loja de artigos para festas, visando mitigar falhas ocasionadas pelos métodos manuais de anotar em um bloco físico as informações do contrato de locação, estando sujeito a esquecimento de registro de dados importantes dos contratos, dificuldades em acompanhar os produtos não devolvidos na data prevista e verificar os produtos disponíveis para as próximas locações. A pesquisa concentra-se no desenvolvimento de um sistema web projetado para gerenciar aluguéis e produtos de locação, otimizando os longos processos realizados pelos funcionários do departamento. Para tanto, é necessário analisar o funcionamento dos procedimentos do setor, a fim de criar um sistema web personalizado que atenda às necessidades específicas, e a integração efetiva do software no ambiente empresarial. Dessa forma, adotou-se o modelo ágil de desenvolvimento incremental, permitindo obter feedbacks dos usuários a cada versão incrementada, empregando o framework Django e a linguagem de programação Python, juntamente com as principais tecnologias para aplicações web. Como resultado, verifica-se a inserção bem-sucedida do sistema funcional no ambiente do setor, que de acordo com o feedback positivo dos usuários, foi destacado as funcionalidades do software que contribuíram para otimizar o controle dos aluguéis, superando desafios associados aos processos manuais utilizados anteriormente. Este estudo evidencia a relevância da implementação de soluções tecnológicas para a eficiência operacional em um setor específico da empresa, proporcionando uma alternativa eficiente para a geração de locações e a gestão segura dos contratos de aluguéis da loja de artigos festivos.",
    "Palavras-chave": "Sistema web; Gestão de Locações; Framework Django.",
    "Introdução": "Com o avanço da tecnologia e o atual ambiente dos negócios, as Tecnologias de Informação e Comunicação (TICs) estão sendo utilizadas pelas empresas como uma forma de adquirirem diferencial competitivo em seus mercados. Com isso, uma das maneiras de se diferenciar em seus ramos é a implementação de sistemas de informação, que se usado de maneira estratégica em uma organização, além de obter vantagens competitivas tem como resultado acelerar os processos de negócios (AMORIM, 2015). Uma pesquisa conduzida pela Confederação Nacional da Indústria (CNI) revela que 69% das indústrias brasileiras fazem uso de tecnologia digital em suas operações. Sendo assim, de acordo com os empresários entrevistados na pesquisa, mostra que o aumento da produtividade nos processos é identificado como o principal benefício esperado pelos investidores em recursos tecnológicos. Além disso, outro fator esperado pelos empresários é a melhoria na qualidade do serviço/produto, por conta da redução dos custos operacionais (GARCIA, 2022). De acordo com Jannuzzi et al. (2014), um Sistema de Informação (SI) é caracterizado como a compilação de todos os registros e documentos originados das operações de uma organização, possibilitando o armazenamento, recuperação e disseminação de informações para fins específicos. Com isso, a crescente valorização da informação no contexto empresarial e os avanços contínuos nas TICs têm desempenhado um papel significativo na proliferação de variados sistemas de informação com base em computador. Para Cunha et al. (2020) um sistema de informação tornou-se uma ferramenta crucial na gestão empresarial, proporcionando melhorias significativas no desempenho organizacional. Isso se deve à sua capacidade de facilitar o acesso a informações atualizadas e a execução de operações rotineiras da empresa. Diante disso, percebe-se a necessidade da implementação de tecnologias em diferentes setores da indústria e suas vantagens. O caso que será exposto neste trabalho de conclusão de curso diz respeito a uma loja de decorações de festas, que oferta serviços de aluguel de produtos. Para tanto, o projeto de sistema proposto visa otimizar os processos de geração dos contratos de locação, obtendo um controle eficiente em seus aluguéis. Assim, os responsáveis pelo setor podem armazenar as informações inerentes ao processo de maneira simples e com acesso facilitado, com o intuito de prevenir falhas em futuras locações.",
    "Conclusão": "No presente trabalho de conclusão de curso, enfatizou-se a necessidade de investir em tecnologias da informação e comunicação para a digitalização dos processos empresariais de empresas de pequeno porte. Tal investimento visa alcançar maior agilidade e segurança na execução de tarefas organizacionais antes realizadas manualmente. O objetivo principal é o desenvolvimento de um sistema web para gerenciar locações no setor de aluguel de um comércio de artigos para festas denominado Papa Doce Festas, situado no centro de Sombrio, Santa Catarina. No entanto, ao analisar os resultados obtidos por meio dos testes realizados pelos usuários, constatou-se que o objetivo geral foi alcançado com sucesso. Desse modo, o primeiro objetivo específico, que consistia em analisar o funcionamento dos processos no setor referido, foi alcançado. Assim, durante uma reunião presencial com os colaboradores do departamento de locação, foram obtidas, por meio de perguntas e discussões informais, todas as informações relevantes para compreender detalhadamente cada etapa dos procedimentos. Além disso, durante essa mesma reunião, alcançamos o segundo objetivo específico, o qual diz respeito à coleta das funcionalidades requisitadas pelos usuários para o desenvolvimento do sistema web. O terceiro objetivo específico do projeto inclui o desenvolvimento de uma aplicação web capaz de atender às expectativas do setor. Para alcançar esse propósito, utilizamos duas principais tecnologias, o framework Django para a estrutura do sistema web e o banco de dados SQLite para armazenar todos os dados essenciais para as locações. O último objetivo específico visa a integração do sistema no ambiente do departamento em questão, possibilitando o acesso dos responsáveis ao projeto web. Por ausência de investimentos financeiros em serviços de hospedagem de software, o objetivo foi alcançado ao hospedar o sistema diretamente no computador do departamento (localhost). Isso permitiu que os funcionários testassem todas as funcionalidades do sistema por meio de simulações de aluguéis, gerando contratos manualmente e transferindo cópias ao sistema para manter o controle das locações, evitando o risco de perder as informações originais."
}