{
    "Autor": "Vanessa Veiga Lucas",
    "Título": "Habitats de Inovação: o Caso da Incubadora de Empresas de Base Tecnológica do Vale do Araranguá - ARATEC",
    "Ano de publicação": 2021,
    "Local de publicação": "Araranguá - SC",
    "Orientador(a)": "Prof. Paulo Cesar Leite Esteves. Dr.",
    "Coorientador(a)": "",
    "Resumo": "O objetivo do trabalho é realizar um histórico referente a Incubadora de Empresas de Araranguá, descrevendo seu processo de incubação, assim como sua atual e futura situação no ambiente instalado. O estudo busca qualificar os diferentes tipos de habitats de inovação para identificar o estímulo à inovação, a integração entre universidade e empresas, a cultura empreendedora e o conceito de compartilhamento do conhecimento. A promoção do compartilhamento de conhecimento pode vir a ser divulgada através de práticas de políticas públicas, das quais foram analisadas através das Leis Federal, Estadual e Municipal da Inovação. Pode-se concluir que com o auxílio de leis específicas e cooperação entre os envolvidos resulta em um aumento das oportunidades, a valorização da inovação e o desenvolvimento econômico regional.",
    "Palavras-chave": "Inovação. Incubadora. Habitats de Inovação.",
    "Introdução": "Em uma era tida como digital, em que o habitual passou a ser ultrapassado, a preocupação em se adequar-se às vertiginosas mudanças tecnológicas passou a ser uma prioridade. Com o aumento da competitividade no ramo empresarial, as empresas buscam inovar seus serviços e produtos como forma de se destacar no mercado, investindo nas áreas de pesquisas e tecnologias. Nesse cenário, é natural que as organizações estejam à procura de um diferencial, sejam através de mecanismos de geração de empreendimentos inovadores que compreendem as organizações; programas ou iniciativas de geração de empreendimentos inovadores; ou de apoio ao desenvolvimento. Esses mecanismos são chamados de habitats de inovação (ANPROTEC, 2016). A fim de promover um ambiente sustentável de competitividade e desenvolvimento, houve uma difusão dos conceitos e abordagens sociais e econômicas, na qual há a interação entre empresas, o governo e as universidades. As incubadoras são instituições de auxílio a micro e pequenas empresas que possuem base tecnológica em seus produtos e/ou serviços, oferecendo apoio técnico e gerencial ao empreendedor, facilitando o processo inovador e acesso a novas tecnologias do mercado. Elas fornecem ainda estrutura e consultoria às empresas incubadas, na qual a ideia é acompanhar desde seu estágio inicial e ajudar no desenvolvimento até sua abertura para atuação no mercado. (ANPROTEC, 2016). Além de oferecer um programa qualificado de incubação, os resultados de uma incubadora hoje, dependem de sua sintonia com os demais ambientes e estratégias de inovação da região que está inserida, de modo que esses mecanismos precisam ser parte do ecossistema de inovação local. (ANPROTEC, 2016). Ficando evidente a importância e contribuição de forma efetiva no desenvolvimento local, servindo de grande importância para a geração de renda e empregos, uma vez que empregam e geram receitas no mercado onde foram incubadas, com alta taxa de retenção. Segundo estudo realizado pela ANPROTEC (2016), um bom programa de incubação de empresa cabe em diferentes realidades econômicas, sendo mais importante a estruturação do que a localização física da incubadora, indicando que melhores localizações, mão de obra qualificada e nível educacional, são fatores que ajudam no fortalecimento do empreendimento, mas não são fatores determinantes para o sucesso. Constata-se que os habitats de inovação possuem características que se referem ao estímulo à inovação, integração entre universidade e empresas, cultura empreendedora e o conceito de compartilhamento do conhecimento. Esse compartilhamento pode ser promovido através de políticas, práticas e mecanismos gerenciais de apoio (BUORO, 2005). Atualmente a construção de políticas públicas de incentivo a implantação de inovação nas empresas vem sofrendo um grande avanço, com isso pode-se afirmar que o poder público possui grande interesse em apoiar a implantação da inovação nas empresas, um exemplo de como isso vem sendo tratado são as Leis de apoio à inovação. Essa pesquisa tem por objetivo contextualizar os habitats de inovação com o foco voltado a Incubadora de Empresas de Base Tecnológica do Vale do Araranguá, de forma que seja desenvolvido um histórico de maturação da mesma, assim como sua aceitabilidade e engajamento com as empresas incubadas.",
    "Conclusão": "Este trabalho foi desenvolvido com intuito de desenvolver um histórico referente à Incubadora de base Tecnológica do Vale de Araranguá - ARATEC, e para isso foi necessário definir inovação e habitats de inovação de forma que caracterize o ambiente no qual a incubadora está instalada, descrevendo sua relação com a sociedade, além de demonstrar a importância das leis de fomento à inovação. Tendo em vista que essa importância foi o que possibilitou a criação da incubadora na Cidade de Araranguá, utilizando-se de recursos advindos da Lei Complementar 197. A implantação de uma incubadora traz capacitação para novas empresas, através da propagação de conhecimento e cooperação entre os envolvidos. A consequência é a visibilidade para a cidade, além do desenvolvimento regional. A hélice tripla como um modelo universal de inovação, traz o conceito de desenvolvimento contínuo, no qual cria ecossistemas inovadores e empreendedores através da interação universidade-empresa-governo. A ARATEC está passando por um processo de inserção no mercado. A pandemia causada pelo Coronavírus a afetou de forma grandiosa, impedindo de progredir em vários setores. A falta de incentivos advindos por parte da Tríplice Hélice causa um desconforto na relação com a empresa incubada, que pede por maior responsabilidade e estímulo para com a empresa e sociedade, tendo em vista que uma maior divulgação seria importante para ambos. Os desafios devem ser sanados com o decorrer da sua existência. Novas ideias vêm sendo geradas e discutidas, o que tem apenas a agregar no seu crescimento. A implantação do Centro de Inovação deve ser de suma importância para seu desenvolvimento junto à Cidade, o que deverá atrair novos negócios, projetos e investimentos. Esse trabalho poderá servir ainda como fonte para trabalho futuros, no qual poderá ser avaliado o crescimento da incubadora junto a cidade de Araranguá, através de índices de desenvolvimento e aderência ao espaço. Devendo mensurar as causas e como elas devem ser tratadas a fim de superar tal desafio. Foi relatado no decorrer da pesquisa que a falta de mão de obra é um obstáculo, e através disso podemos discutir a motivação que leva um profissional buscar por oportunidades na cidade de Araranguá, já que a cidade forma constantemente profissionais qualificados para atuar no mercado de trabalho, através de cursos superiores e técnicos. Outro tema importante a ser abordado é o ambiente inovador gerado pela ARATEC, percebe-se que no primeiro semestre de 2019 a Incubadora contava com 6 (seis) projetos instalados, já no ano de 2021 havia apenas 1 (um) projeto. Levando em consideração os dados anteriores o que pode ter causado esse egresso. Houve uma desistência desses empreendedores de fato, mas é importante salientar a motivação que gerou essa evasão, e como poderia ser evitada principalmente, em um futuro, no qual novos projetos serão acolhidos."
}