{
    "Autor": "Mateus Medeiros Matos",
    "Título": "Análise Comparativa dos Impactos dos Jogos de Celular no Desenvolvimento Cognitivo e Social de Crianças de 0 a 12 Anos em Contextos Escolar e Doméstico",
    "Ano de publicação": 2024,
    "Local de publicação": "Ararangua",
    "Orientador(a)": "Prof. Juarez Bento da Silva, Dr.",
    "Coorientador(a)": null,
    "Resumo": "O presente trabalho investiga os impactos dos jogos de celular no desenvolvimento infantil, com foco em crianças de 0 a 12 anos, comparando esses impactos em contextos formais (escolar) e informais (doméstico). Estudos recentes mostram que os jogos digitais podem oferecer benefícios, como o estímulo a habilidades cognitivas e sociais. No entanto, o uso desregulado pode gerar riscos, como dependência digital e isolamento social. Este estudo segue uma abordagem qualitativa, baseada em revisão bibliográfica de artigos e teses publicados majoritariamente entre 2019 e 2024, incluindo também trabalhos anteriores, de 2008 e 2011, que contribuíram significativamente para a fundamentação teórica e a contextualização histórica do tema. Foram selecionados estudos que analisam fatores como supervisão parental e diferenças culturais. Os dados foram organizados em categorias principais: impactos cognitivos, sociais e emocionais, além do papel da supervisão. Os resultados indicam que jogos educativos podem desenvolver habilidades como raciocínio lógico, memória e trabalho em equipe. Por outro lado, o uso excessivo está associado a problemas emocionais e sociais. O estudo conclui que a mediação parental e educacional é essencial, apresentando diretrizes práticas para o uso equilibrado dos jogos, com implicações relevantes para pais, educadores e desenvolvedores.",
    "Palavras-chave": "Jogos de celular, Desenvolvimento cognitivo, Habilidades sociais, Aprendizado formal, Aprendizado informal.",
    "Introdução": "O avanço da tecnologia e a crescente acessibilidade a dispositivos móveis transformaram os jogos de celular em uma parte essencial da vida de muitas crianças. Desde cedo, as crianças são expostas a uma grande variedade de jogos, que vão desde opções educativas até jogos voltados para o entretenimento puro. Pesquisas como as de Blumberg et al. (2019) e Li et al. (2022) destacam que o uso precoce de ambientes digitais interativos levanta discussões sobre os potenciais impactos no desenvolvimento cognitivo e socioemocional das crianças, principalmente em estágios formativos críticos. Diversos estudos sugerem que, quando utilizados de forma controlada e com objetivos claros, os jogos digitais podem ser ferramentas poderosas para promover o aprendizado e a socialização. Gonçalves (2020) destaca que jogos como Minecraft têm sido amplamente usados em contextos educacionais formais, promovendo o desenvolvimento de capacidades cognitivas, como a resolução de problemas, o raciocínio lógico e a criatividade. Além disso, o uso desses jogos em ambientes supervisionados pode estimular a colaboração e a interação entre os pares, aspectos fundamentais para o desenvolvimento social. Por outro lado, o uso excessivo ou desregulado de jogos digitais, especialmente em contextos informais, como o ambiente doméstico, pode acarretar uma série de problemas. Silva (2021) aponta que o uso descontrolado de mídias digitais entre crianças pode levar a efeitos negativos, como isolamento social, problemas de atenção e até dificuldades emocionais, como ansiedade e estresse. Esse cenário é particularmente preocupante quando se considera que, em muitos lares, a supervisão sobre o uso dos jogos é limitada, o que potencializa os riscos associados a esse tipo de entretenimento. A análise dos impactos dos jogos de celular em diferentes contextos – formal, como escolas, e informal, como em casa – torna-se, assim, essencial para entender como esses jogos afetam o desenvolvimento infantil (Blumberg et al., 2019; Gonçalves, 2020). O crescente uso de dispositivos móveis por crianças de diferentes faixas etárias e realidades socioeconômicas exige uma investigação aprofundada, que leve em consideração as nuances e variações desses impactos conforme o contexto.",
    "Conclusão": "Os achados desta pesquisa revelam que os jogos de celular têm impactos complexos e ambíguos no desenvolvimento cognitivo, social e emocional das crianças, com os resultados variando de acordo com o tipo de jogo, o contexto de uso e o nível de supervisão oferecido. Em contextos educacionais formais, como o ambiente escolar, os jogos digitais mostram-se promissores como ferramentas pedagógicas, especialmente quando aplicados de forma intencional para o ensino de habilidades complexas e para o aumento do engajamento dos alunos. Jogos como Minecraft, SimCity e Kahoot! têm demonstrado ser eficazes no ensino de disciplinas que requerem raciocínio lógico, colaboração e resolução de problemas. Por outro lado, em contextos informais, como o ambiente doméstico, o uso de jogos de celular é predominantemente voltado ao entretenimento. Nesses cenários, os benefícios dos jogos no desenvolvimento das crianças são mais limitados e dependem fortemente da supervisão parental. Quando há mediação ativa por parte dos pais, os jogos podem complementar o aprendizado e até fortalecer laços familiares. No entanto, o uso excessivo ou desregulado dos jogos está associado a riscos emocionais e sociais, incluindo a dependência digital, o isolamento social e o aumento de comportamentos ansiosos e agressivos, especialmente em jogos com ênfase em competitividade ou violência. Além disso, os resultados enfatizam a importância de balancear as atividades online com experiências offline. Jogos digitais, quando utilizados de forma equilibrada e moderada, podem oferecer uma série de benefícios, desde o estímulo ao raciocínio lógico até a promoção de habilidades sociais em contextos de cooperação virtual. No entanto, para que esses benefícios se concretizem, é fundamental que as crianças também participem de atividades físicas, interações sociais presenciais e brincadeiras fora do ambiente digital, promovendo um desenvolvimento integral que atenda às necessidades tanto do mundo digital quanto do físico. Esses achados apontam para a necessidade de uma supervisão ativa e intencional tanto por parte dos pais quanto dos educadores, que têm o papel de garantir que os jogos de celular sejam utilizados de forma construtiva e equilibrada."
}