{
    "Autor": "Joel João Medeiros Filho",
    "Título": "Análise e Visualização de Metadados de Trabalhos de Conclusão de Curso: Uma Análise das Produções Acadêmicas",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Profa. Dra. Marina Carradore Sergio",
    "Coorientador(a)": "",
    "Resumo": "Este trabalho analisa e visualiza metadados de Trabalhos de Conclusão de Curso (TCC) da área de Tecnologias da Informação e Comunicação (TIC) da Universidade Federal de Santa Catarina. Utilizando a metodologia Design Science Research (DSR M), foram coletados e tratados dados do repositório institucional para gerar insights sobre a produção acadêmica. Técnicas de processamento de linguagem natural, clusterização e visualização de dados foram aplicadas para identificar padrões, tendências e interseções entre áreas de estudo. Os resultados revelam uma predominância de temas relacionados a dados, inovação tecnológica e educação, com forte contribuição de orientadores específicos e agrupamentos temáticos distintos. A análise evidenciou desafios como a inconsistência de metadados e a necessidade de padronização. As visualizações criadas destacam tendências temporais e áreas de foco acadêmico, contribuindo para a compreensão das direções de pesquisa e para o planejamento estratégico no ensino superior.",
    "Palavras-chave": "Metadados; Trabalhos de Conclusão de Curso; Visualização de Dados; Tecnologias da Informação e Comunicação; Clusterização.",
    "Introdução": "Nos últimos anos, a análise e visualização de dados têm se consolidado como ferramentas essenciais para a compreensão de grandes volumes de informações em diversas áreas do conhecimento  (Silva, 2019). No contexto acadêmico, os Trabalhos de Conclusão de Curso (TCC) representam uma fonte valiosa de dados sobre a produção científica, refletindo a evolução das áreas de estudo e as principais tendências de pesquisa ao longo do tempo. Essa evolução é particularmente significativa no campo das Tecnologias da Informação e Comunicação (TIC), um setor dinâmico e em constante transformação, onde novas demandas e desafios surgem frequentemente. A análise dos metadados dos TCCs, como títulos, palavras-chave, orientadores e áreas de estudo, pode fornecer insights importantes sobre as direções do conhecimento científico e as interseções entre disciplinas. A visualização de dados destaca-se nesse cenário por facilitar a compreensão de padrões complexos, apresentando-os de maneira acessível e interativa. Conforme  Silva (2019), técnicas de visualização de dados não apenas auxiliam na interpretação de informações, mas também potencializam o processo de tomada de decisões ao transformar dados brutos em representações visuais que evidenciam tendências e relações. No entanto, apesar de sua relevância, o uso sistemático de técnicas de visualização aplicadas a metadados acadêmicos ainda é um campo pouco explorado, especialmente no âmbito dos TCCs do curso  TIC. Diante desse contexto, a seguinte pergunta se propõe: “Como técnicas baseadas em análise de agrupamento e busca semântica podem ser aplicadas para analisar documentos textuais em contextos acadêmicos?” para responder essa questão  este trabalho propõe investigar como as técnicas de visualização de dados podem ser aplicadas aos metadados dos TCCs do curso TIC da Universidade Federal de Santa Catarina (UFSC), com o objetivo de identificar tendências, padrões e interseções que contribuam para uma melhor compreensão do cenário acadêmico e científico. A delimitação do estudo abrange todos os trabalhos produzidos , permitindo uma análise que capture mudanças significativas nas áreas de pesquisa e temas de interesse. A relevância desta pesquisa está diretamente relacionada ao potencial de contribuir para a gestão do conhecimento nas instituições de ensino superior, permitindo uma visão mais ampla sobre os focos de estudo e os principais desafios enfrentados por estudantes e orientadores. Conforme destacado por   Holanda e Gontijo (2024), o mapeamento de tendências acadêmicas pode subsidiar decisões estratégicas na definição de linhas de pesquisa, priorização de recursos e alinhamento curricular. Entre os principais desafios identificados neste trabalho, destaca-se a diversidade e heterogeneidade dos dados disponíveis nos TCCs, que podem variar em formato, profundidade e detalhamento. Além disso, a construção de visualizações significativas exige o uso de ferramentas e técnicas avançadas de análise, bem como uma compreensão clara dos objetivos pretendidos. Estudos recentes, como os de  Rodrigues e Dias (2017), ressaltam a importância de técnicas como análise de redes e diagramas de dispersão para a identificação de clusters  de pesquisa e relações entre áreas de estudo. Por fim, espera-se que os resultados deste trabalho contribuam não apenas para a área de TIC, mas também sirvam como modelo para análises similares em outros campos do conhecimento. Ao integrar técnicas de visualização de dados com a análise de metadados acadêmicos, o estudo oferece uma abordagem inovadora e promissora para o entendimento da produção científica e suas implicações.",
    "Conclusão": "Este trabalho explorou a produção acadêmica do curso de Tecnologias da Informação e Comunicação (TIC) da Universidade Federal de Santa Catarina por meio de uma análise detalhada dos metadados dos Trabalhos de Conclusão de Curso (TCCs). A aplicação de técnicas avançadas de visualização de dados, como gráficos de rede, clusters temáticos e nuvens de palavras, permitiu identificar padrões, tendências e interseções relevantes, contribuindo para uma compreensão mais ampla das linhas de pesquisa, dos temas predominantes e das interações entre orientadores e estudantes. Os resultados demonstraram que a produção acadêmica do curso é caracterizada por uma significativa interdisciplinaridade, com forte presença de temas ligados a educação, análise de dados e desenvolvimento de sistemas. A predominância de termos como 'dados', 'sistema' e 'educação' em diversas visualizações reforça a conexão entre os trabalhos acadêmicos e as demandas do mercado e da sociedade. A análise também destacou a especialização de certos orientadores em áreas específicas, como visualização de dados e tecnologias aplicadas à educação, o que sugere a importância do papel dos docentes na definição de direções de pesquisa. A análise temporal evidenciou os efeitos da pandemia de COVID-19 sobre a produção acadêmica, marcando uma queda em 2020, seguida por uma recuperação gradual. Essa dinâmica reflete a resiliência do curso e sua capacidade de adaptação a contextos desafiadores. Além disso, a distribuição dos trabalhos por semestre aponta para uma organização acadêmica que maximiza a utilização de recursos e incentiva a conclusão das pesquisas ao final do ano letivo. Embora as visualizações e os insights obtidos tenham oferecido uma visão abrangente, o estudo enfrentou limitações relacionadas à qualidade e à consistência dos dados. Informações inseridas manualmente, como nomes de orientadores e palavras-chave, apresentaram variações que exigiram técnicas avançadas de padronização e processamento. Ainda assim, as técnicas empregadas, incluindo clusterização e análise semântica, demonstraram sua eficácia em lidar com dados complexos e extrair informações úteis. Por fim, este trabalho não apenas mapeou a produção científica do curso de TIC, mas também forneceu ferramentas e abordagens que podem ser replicadas em outros contextos acadêmicos. Os insights obtidos podem orientar futuras pesquisas, aprimorar as políticas institucionais e estimular novos projetos, contribuindo para o fortalecimento das áreas de pesquisa e inovação no campo das Tecnologias da Informação e Comunicação."
}