{
    "Autor": "THOMAS CONSTANTI AZOLINI",
    "Título": "FINTECHS E A ECONOMIA DIGITAL: DESAFIOS E PERSPECTIVAS",
    "Ano de publicação": 2019,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Dr. Giovani Lunardi",
    "Coorientador(a)": "",
    "Resumo": "Com a vinda da globalização e o desenvolvimento de uma sociedade cada vez mais conectada, criou-se uma disputa acirrada das grandes corporações pelos clientes, de forma que armas como tecnologia e inovação vieram a se tornar altamente valiosas para a sobrevivência das empresas no mercado. Com instituições financeiras e bancos também não é diferente, isso se prova pela rápida evolução das chamadas Fintechs baseadas inteiramente em tecnologia, prometendo menos burocracia e acesso facilitado à realização de serviços financeiros de forma majoritariamente ou, na maioria das vezes, totalmente digital. Desta forma, neste trabalho se examina os desafios e perspectivas destas novas instituições financeiras baseadas na tecnologia, possibilitando as transformações para uma economia digital.\n\nPalavras chaves: Fintechs, Tecnologia, Inovação, Serviços Financeiros, Economia Digital.",
    "Palavras-chave": "Fintechs, Tecnologia, Inovação, Serviços Financeiros, Economia Digital.",
    "Introdução": "A tecnologia revolucionou a forma de se trabalhar, de se locomover e de se comunicar, e agora, vem revolucionando o mercado financeiro e mostrando como pode ser descomplicado e seguro se relacionar com uma instituição financeira de forma, totalmente, digital. Na deficiência deixada pelos grandes bancos, quando se trata de desburocratização dos processos, startups totalmente baseadas em tecnologia, chamadas de Fintechs, enxergaram um grande negócio. Quem já teve que passar um bom tempo na fila de uma agência de banco e, várias vezes, não ter o seu problema solucionado, sabe como é dificultoso e burocrático tratar de assuntos financeiros. Segundo Hepburn (2016), o termo fintech é uma abreviação da frase financial technology, em tradução livre “tecnologia financeira” e o seu primeiro uso foi feito por Peter Knight nos anos 80 ao descrever um robô que teria alterado sua caixa de entrada de e-mails. As fintechs surgiram com a proposta de oferecer os mesmos serviços financeiros dos bancos de forma descomplicada, segura e totalmente digital. Através de aplicativos e sites, são oferecidas contas bancárias, cartões de créditos, empréstimos, investimentos, entre outros serviços que, anteriormente, apenas os grandes bancos dominavam. Porém, junto com os benefícios, vem a insegurança. Até que ponto é considerado seguro abrir mão das antigas e “seguras” agências bancárias? Ter um local físico para onde recorrer quando há algum dado incorreto na fatura do cartão de crédito ou no extrato bancário da conta é a principal vantagem dos bancos como conhecemos hoje, já que se trata do dinheiro suado dos trabalhadores e ninguém gosta de assumir um problema quando se trata de erros de terceiros. Estas startups financeiras enfrentarão um mercado bem disputado atualmente, encontrando em seu caminho muitos desafios, porém com grandes perspectivas.",
    "Conclusão": "Ao fim deste trabalho, é possível verificar que as fintechs têm um longo caminho e muito mais dificuldade que as instituições financeiras tradicionais. Desafios sociais como o analfabetismo digital, inclusão digital e inclusão financeira são problemas que podem não depender apenas dessas startups e devem ser tratados em conjunto com os governos locais e pode-se demorar décadas para estes desafios serem superados. Há outros desafios mais palpáveis para as fintechs como a geração de lucro, segurança digital e as dificuldades impostas pelas instituições financeiras tradicionais, pois estes problemas podem ser resolvidos nos próximos anos com acordos, boas relações entre as instituições financeiras, sendo elas digitais ou tradicionais, e esforços dentro das fintechs em si para a correção dos mesmos. Além disso, perspectivas como o fim do papel-moeda e o crescimento das criptomoedas podem facilitar muito a popularização destas fintechs, uma vez que, sendo possível controlar totalmente o próprio dinheiro num smartphone e outros dispositivos móveis, instituições financeiras digitais serão muito mais lembradas em comparação aos bancos tradicionais. Somado às outras perspectivas, o investimento cada vez maior deverá ser recorrente, visto que as fintechs devem tornar-se mais popularizadas, e, com isso, terem cifras muito maiores. Com todas as facilidades que essas startups financeiras provêm, a desbancarização deverá se tornar cada vez menos recorrente, já que qualquer um pode, com um simples smartphone, abrir uma conta corrente ou pedir um cartão de crédito em poucos minutos e com muito menos burocracia que as instituições financeiras tradicionais."
}