{
    "Autor": "Vicenzo Belettini Donadel",
    "Título": "IMPACTOS DO TELETRABALHO PARA OS COLABORADORES DE UMA EMPRESA DE SEGURANÇA DIGITAL",
    "Ano de publicação": 2022,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof. Solange Maria da Silva, Drª.",
    "Coorientador(a)": "",
    "Resumo": "Este estudo buscou conhecer e identificar os impactos positivos e negativos do teletrabalho para os colaboradores de uma empresa de segurança digital, em meio à adoção do teletrabalho devido à pandemia vigente do COVID-19. Para tanto, fez-se uso de dados secundários com o levantamento da literatura em busca de definições, classificações e temas correlatos ao teletrabalho, bem como consulta aos seus colaboradores, por meio de um instrumento de coleta de dados já validado, com questões fechadas e escala likert de 5 pontos. Para isso, foi adotado uma pesquisa qualitativa para identificar a percepção dos colaboradores sobre os impactos do teletrabalho. Como resultados identificou-se que o teletrabalho foi positivo para os colaboradores, seja por meio da redução dos custos de deslocamento, maior convívio familiar, ou redução dos níveis de estresse. Todavia, existiram dificuldades por parte dos teletrabalhadores, dentre elas: distração com família ou atividades domésticas; e dificuldade em estabelecer relacionamentos com novas pessoas do trabalho. Como oportunidades para trabalhos futuros, sugere-se efetuar uma análise comparativa dos resultados em uma empresa do mesmo setor, que já atuava essencialmente na modalidade teletrabalho para identificar as facilidades e lições aprendidas com o formato remoto, no período da pandemia.",
    "Palavras-chave": "Teletrabalho. COVID-19. Pandemia. Pesquisa qualitativa. Empresa de segurança digital.",
    "Introdução": "A nova pandemia do novo COVID-19, popularmente chamado de coronavírus, acarretou uma série de mudanças nos modos comportamentais e no cotidiano do mundo todo. Desde meados de março de 2020, diversas empresas tiveram que fechar suas portas em virtude do medo de contágio e, por conseguinte, das medidas sanitárias para conter a disseminação do vírus e contaminação da população, conforme decretos aprovados pelo governo, de todas as instâncias. Consoante à “Pesquisa Pulso Empresa: Impacto da COVID-19 nas empresas”, realizada pelo IBGE (Instituto Brasileiro de Geografia e Estatística) e publicada em 2020, entre os anos de 2019 e 2020, aproximadamente 2,7 milhões de pessoas foram afastadas do trabalho devido ao distanciamento social. Conforme esses dados, diversas empresas precisaram lutar para se manter de portas abertas, necessitando se reinventar, seja alterando seu método de serviço como vendas online, seja alterando a maneira de gestão e adotando o teletrabalho como modo de trabalho. O atual cenário de instabilidade resultante da pandemia do COVID-19 implantou uma certa instabilidade nos processos organizacionais, necessitando por parte delas novos processos para manter o bem-estar dos funcionários e o equilíbrio da empresa. Novas ferramentas para o trabalho remoto foram implantadas e a tecnologia se tornou grande aliada nesse momento. Conforme Queiroga (2020), a evolução dos recursos tecnológicos, associado às TICs fez com que os trabalhadores passassem a atuar com maior frequência no formato remoto. Segundo pesquisa quantitativa realizada pelo Instituto Brasileiro de Geografia e Estatística (IBGE), em 2018, na Pesquisa Nacional de Amostras por Domicílio, cerca de 3,8 milhões de brasileiros já trabalhavam de maneira remota (IBGE, 2018). Por sua vez, durante os anos de 2019 a 2020, aproximadamente 7,9 milhões de brasileiros estavam trabalhando remotamente (PESQUISA PULSO EMPRESA, 2020). Diante desses dados, as empresas necessitam se adaptar à modalidade de teletrabalho. Mas quais os impactos dessa modalidade para os colaboradores?",
    "Conclusão": "O conteúdo abordado ao longo do presente trabalho demonstra os impactos positivos e as fragilidades do teletrabalho para os colaboradores que adotaram essa modalidade em uma empresa de segurança digital, que atua no mercado há mais de 16 anos, fornecendo soluções e prestando suporte a empresas no ramo de segurança digital. O estudo investigou o perfil do teletrabalhador, a partir de um estudo de caso foi gerado um modelo de análise dos impactos do teletrabalho para o colaborador. Desta forma foi possível identificar, por meio de uma abordagem qualitativa, e uso de questionário com questões fechadas e escala Likert de 5 pontos, os impactos positivos do teletrabalho para os colaboradores de uma empresa de segurança digital. Tendo em vista os resultados obtidos, é perceptível que os colaboradores do ramo de segurança digital em teletrabalho são compostos predominantemente de homens, 86,4%, tendo faixa etária dos 18 a 25 anos. Também é válido ressaltar que os teletrabalhadores possuem 5 anos de contribuição na mesma empresa. Os principais impactos positivos do teletrabalho para os colaboradores são a redução dos custos de deslocamento, maior convívio familiar, aumento na satisfação do trabalho, aumento no sentimento de profissional responsável, redução dos níveis de estresse durante a realização das atividades, maior rendimento e produtividade nas atividades, organização do tempo livre, melhoria na vida social. Também é possível destacar que dentre os principais desafios encontrados pelos colaboradores em meio ao teletrabalho, têm-se: Espaço de trabalho reduzido; Distração com família ou atividades domésticas; Interações sociais reduzidas; Dificuldade em estabelecer relacionamentos com novas pessoas do trabalho e equilíbrio entre trabalho e família. O Quadro 5 traz uma síntese das análises dos impactos positivos e negativos do teletrabalho, na percepção dos respondentes. De modo geral, foi possível perceber que, por mais que tenha sido uma modalidade de trabalho nova, o colaborador soube se adaptar e enfrentar as adversidades trazidas pela pandemia do COVID-19. E, de maneira geral, os colaboradores que responderam à pesquisa obtiveram mais impactos positivos do que negativos. A limitação do estudo é a percepção do colaborador referente ao teletrabalho, afinal, cada teletrabalhador se deparou com suas dificuldades, assim como benefícios. Para trabalhos futuros sugere-se efetuar uma análise comparativa dos resultados em uma empresa do mesmo setor, que já atuava essencialmente na modalidade teletrabalho para identificar as facilidades e lições aprendidas com o formato remoto, no período da pandemia. Também pode-se realizar pesquisas em diferentes ramos do mercado, bem como explorar diferentes públicos e gêneros, para identificar os impactos do teletrabalho."
}