{
    "Autor": "Felipe Machado",
    "Título": "Visualização de Dados Aplicada a Análise de Dados Contábeis",
    "Ano de publicação": 2024,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Prof.(a) Marina Carradore Sérgio, Dr.(a)",
    "Coorientador(a)": "",
    "Resumo": "A crescente importância de temas como o grande volume de dados gerados tem atraído a atenção para o significativo potencial desses conjuntos de dados, caracterizados por seu volume, variedade e velocidade. No contexto das empresas brasileiras, a geração de dados provenientes de fontes como notas fiscais, declarações e relatórios exigidos por legislação e sistemas ERP emerge como uma rica fonte de informações para análise e visualização. A visualização de dados surge como uma ferramenta crucial, permitindo a construção de representações visuais que simplificam a compreensão e interpretação das informações, auxiliando tanto auditores quanto gestores na tomada de decisões. Este trabalho buscou explorar e aplicar conceitos de visualização de dados no contexto de dados financeiros e contábeis eletrônicos, visando melhorar a tomada de decisões de pequenos empresários e democratizar o acesso à análise visual da informação. Para isso, foi desenvolvida uma ferramenta que transforma informações contábeis em dashboards interativos, destacando dados relevantes e simplificando sua interpretação. A pesquisa incluiu a criação de três dashboards principais focados em custos, receitas e comparações gerenciais, utilizando bases de dados acessíveis como notas fiscais eletrônicas e relatórios contábeis. Esses dashboards permitem monitorar clientes e produtos mais rentáveis, identificar padrões de venda e compra, controlar valores a serem pagos, analisar custos e despesas, e avaliar o resultado da empresa. Para validar a eficácia dos dashboards, foi realizada uma entrevista informal com uma contadora e empresária, que confirmou o potencial dos dashboards para agregar valor ao serviço contábil, melhorar a apresentação das informações aos clientes e auxiliar no processo de tomada de decisão. Os resultados demonstraram que a visualização de dados pode ser uma ferramenta valiosa mesmo para pequenas empresas, proporcionando análises relevantes para o planejamento estratégico financeiro com baixo investimento e grande potencial de retorno. Este estudo reforça a importância da visualização de dados como uma ferramenta eficaz para contadores e empresários, destacando seu papel na transformação de dados brutos em insights acionáveis que podem orientar decisões estratégicas e melhorar o desempenho financeiro das empresas.",
    "Palavras-chave": [
        "Visualização de dados",
        "Contabilidade",
        "Dashboards",
        "Pequenas empresas",
        "Tomada de decisão"
    ],
    "Introdução": "A crescente relevância de temas como o grande volume de dados gerados, destacada por autores como Hampton e Stratopoulos (2016), tem atraído a atenção para o significativo potencial desses conjuntos de dados, caracterizados por seu volume, abrangente variedade e velocidade (Perkhofer et al., 2019). No contexto das empresas brasileiras, a geração de dados provenientes de fontes como notas fiscais, declarações e relatórios exigidos por legislação e sistemas ERP, emerge como uma oportunidade para uma fonte de informações para análise e visualização dados. A visualização de dados surge como uma ferramenta nesse cenário, permitindo e proporcionando a construção de representações visuais que destacam características específicas dos dados, simplificando a compreensão e interpretação das informações (Perkhofer et al., 2019). No âmbito contábil, a visualização de dados não apenas auxilia auditores na detecção de anomalias, tendências e padrões (Buchheit et al., 2020), mas também desempenha um papel fundamental no gerenciamento contábil, capacitando e auxiliando na tomada de decisão as partes interessadas, com informações sobre o passado, presente e futuro da empresa (Perkhofer et al., 2019). Embora métodos tradicionais de visualização, como gráficos de pizza, linha ou barras, sejam amplamente adotados em relatórios contábeis (Perkhofer et al., 2019), essa realidade varia entre empresas de diferentes tamanhos, demonstrando dificuldades particulares no cenário das pequenas empresas (Buchheit et al., 2020). No entanto, independente do cenário da empresa, a visualização de dados continua sendo valiosa para auditores, proporcionando melhorias na tomada de decisões, com potencial para auxiliar qualquer empresa em seu processo de tomada de decisão (Hamdam et al., 2021). Este trabalho busca explorar os conceitos de visualização de dados e aplicá-los no contexto de dados financeiros e contábeis eletrônicos, contribuindo assim para o processo de tomada de decisão dos pequenos empresários e democratização do acesso a análise visual da informação.",
    "Conclusão": "O presente trabalho teve como objetivo o desenvolvimento de dashboards para visualização de dados contábeis, proporcionando uma análise mais eficaz e embasando decisões assertivas em pequenas empresas e escritórios de contabilidade. Para alcançar esse objetivo, foram utilizadas bases de dados acessíveis, como notas fiscais eletrônicas (NF-e) e relatórios contábeis, que já fazem parte das obrigações legais das empresas no Brasil. Isso permitiu que as visualizações desenvolvidas estivessem ao alcance da maioria das empresas regulares no país. O desenvolvimento dos dashboards incluiu desde o tratamento dos dados das NF-e e relatórios contábeis, a seleção dos dados e colunas necessários para as visualizações modelo, até o desenvolvimento efetivo dos dashboards. O objetivo não foi abranger todas as visualizações possíveis, mas sim apresentar um modelo que aborde de maneira geral os dados mais relevantes, exemplificando como os dados gerados podem ser demonstrados de forma visual e interativa para auxiliar na tomada de decisões empresariais. Os dashboards abordaram três temas principais: custos, receitas e gerencial (comparação entre custo e receita), possibilitando monitorar clientes e produtos mais rentáveis, identificar padrões de venda e compra, controlar valores a serem pagos, analisar custos e despesas, avaliar o resultado da empresa, identificar geograficamente os mercados mais fortes, entre outros aspectos. É importante destacar que, embora essas visualizações forneçam insights valiosos, problemas como evasão fiscal em pequenos negócios podem comprometer a qualidade dos dados apresentados e, consequentemente, a utilidade dos insights gerados. A qualidade dos relatórios contábeis gerados pela contabilidade também pode variar, o que pode afetar o potencial das visualizações para auxiliar na tomada de decisão. O \"dashboard receitas\" foi desenvolvido exclusivamente com dados das NF-e, o que o torna menos dependente da qualidade dos relatórios contábeis. No entanto, ainda há o risco de evasão fiscal, embora os dados utilizados ainda representem, pelo menos parcialmente, a realidade da empresa. Para verificar a eficácia dos dashboards, foi realizada uma conversa informal com uma contadora e empresária. A especialista viu grande potencial nos dashboards para agregar valor ao serviço contábil, melhorar a apresentação das informações aos clientes e auxiliar no processo de tomada de decisão. Ela destacou a importância da análise visual, a capacidade dos dashboards em proporcionar diferentes reflexões para o planejamento financeiro e a abrangência adequada das informações contábeis apresentadas. Em suma, os objetivos do trabalho foram alcançados, resultando em três dashboards que apresentam dados relevantes para pequenas empresas. Os resultados obtidos demonstraram os benefícios das visualizações de dados na democratização da informação e na melhoria da tomada de decisão, características estas que foram confirmadas pela avaliação de um profissional da área. Dessa forma, fica evidente que a visualização de dados pode ser aplicada mesmo em negócios pequenos com pouca estrutura, proporcionando análises relevantes para o planejamento estratégico financeiro da empresa, com baixo investimento em ferramentas e grande potencial de retorno. Este estudo reforça a importância da visualização de dados como uma ferramenta eficaz para contadores e empresários, destacando seu papel na transformação de dados brutos em insights acionáveis que podem orientar decisões estratégicas e melhorar o desempenho financeiro das empresas."
}