{
    "Autor": "William Moreira Borges",
    "Título": "O uso das TICS para a Inclusão Social",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Giovani Mendonça Lunardi",
    "Coorientador(a)": "Prof. Dr.a Eliane Pozzebon, Prof.a Dr.a Katia Cilene Rodrigues Madruga",
    "Resumo": "Este trabalho apresenta que o desenvolvimento tecnológico deva contribuir não somente para o aumento da produtividade no sistema econômico, mas também para a inclusão social. O conceito de tecnologia atrelado à ideia de desenvolvimento econômico, após um exame crítico, recebe uma clivagem entre tecnologias convencionais e tecnologias sociais. Estas últimas podem se subdividir, por sua vez, em tecnologias sustentáveis, educacionais e assistivas. Todas elas recebem as contribuições das tecnologias da informação e comunicação para a inclusão social. Tais contribuições são o objeto do observatório de tecnologias inclusivas, desenvolvido neste trabalho, no sentido de reunir informações e possibilitar projetos de ensino, pesquisa, extensão e inovação, sistematizados em um site e conectados em redes sociais, para que cada vez mais toda a sociedade tenha acesso ao desenvolvimento tecnológico.",
    "Palavras-chave": "tecnologias sociais, tecnologias inclusivas, inclusão social.",
    "Introdução": "A pesquisa apresentada neste Trabalho de Conclusão de Curso possui como premissa norteadora a visão de que o avanço e o desenvolvimento de novas tecnologias devam contribuir, também, para a inclusão social; ou seja, toda a população, principalmente aquela excluída do processo econômico e social, deve receber também os benefícios gerados pela Ciência, Tecnologia e Inovação (CT&I). Nesse contexto, tornam-se necessárias pesquisas sobre todas as formas de novas tecnologias que permitam a inclusão social nas suas mais variadas dimensões e, consequentemente, a execução de projetos de ensino e extensão que possibilitem o conhecimento, a educação e o acesso às mesmas. Diante do exposto, o presente trabalho consistiu em pesquisar informações sobre o uso das tecnologias da informação e comunicação para a inclusão social, tanto no âmbito mundial, no Brasil, na UFSC e no próprio Campus Araranguá. Este trabalho além da pesquisa teórica realizou como atividade prática a participação em projetos de ensino e extensão. Tais atividades tiveram como resultado a implementação do Observatório de Tecnologias Inclusivas no Campus Araranguá da UFSC, que além da pesquisa sobre novas tecnologias aplicadas a inclusão social, pretende contribuir com ações de ensino e extensão direcionadas para a educação básica e comunidades em geral. As ações do observatório desenvolvidas neste TCC fazem partem das atividades do Grupo de Pesquisa Mídia e Conhecimento (UFSC/CNPq) do Campus Araranguá da UFSC e visa dar continuidade as ações de ensino, pesquisa e extensão já realizadas e em andamento, tais como, o projeto “Tecnologias Inclusivas e Educação em Direitos Humanos” (http://tecnologiadireitoshumanos.blogspot.com) financiado pelo CNPq através do EDITAL MCT/CNPq Nº49/2010 - Inclusão DIGITAL e SOCIAL.",
    "Conclusão": "Segundo nossa avaliação, consideramos que os objetivos do trabalho foram alcançados. Como reflexão crítica, após o trabalho realizado, podemos verificar o descompasso entre o exponencial avanço das tecnologias em todas as áreas do conhecimento e o lento acesso deste avanço tecnológico para todas as camadas sociais. Ou seja, existe um grande desafio no sentido não apenas de uma inclusão digital, mas de uma verdadeira inclusão tecnológica para toda a sociedade. Com este trabalho pode-se verificar, primeiramente, como que o conceito de tecnologia está diretamente ligado a ideia de sucesso econômico no sentido de lucro. Nas últimas décadas, percebe-se um esforço em se considerar como tecnologia também o desenvolvimento de conhecimentos para a inclusão social. No caso das TICs, o esforço deve-se ao mesmo tempo não apenas de contribuir para uma inclusão digital, mas de um acesso a todas as camadas sociais. O uso das TICs para a inclusão social espraia-se, como vimos, não somente como tecnologias digitais, mas também como tecnologias educacionais, tecnologias sustentáveis e tecnologias assistivas. Neste sentido, os conceitos de tecnologias convencionais e tecnologias sociais devem convergir para tecnologias inclusivas sejam digitais ou não. A proposta deste trabalho de contribuir com a estruturação do Observatório de Tecnologias Inclusivas segue com a iniciativa de reunir informações e possibilitar projetos de que cada vez toda a sociedade tenha acesso ao desenvolvimento tecnológico."
}