{
    "Autor": "Willian Rochadel",
    "Título": "RExMobile: Integrando Experimentação Remota na Educação Básica",
    "Ano de publicação": 2013,
    "Local de publicação": "Araranguá",
    "Orientador(a)": "Professor Juarez Bento da Silva",
    "Coorientador(a)": null,
    "Resumo": "Este trabalho apresenta a iniciativa de disponibilizar experimentos para acesso remoto utilizando os dispositivos móveis. Durante o período de estudo foram adaptadas e implementadas técnicas baseadas nas Novas Tecnologias da Informação e Comunicação (NTICs) aplicadas à ambientes educacionais, de acordo com a infraestrutura disponível e as características comuns às escolas de educação básica. Também foram integrados diversos recursos do Ambiente Virtual de Aprendizagem (AVA) para disponibilização do material didático, acesso aos experimentos remotos e utilização de dispositivos móveis. A realização das atividades práticas foi conduzida a partir da metodologia baseada no TPACK (Technological Pedagogical Content Knowledge), que é um modelo que permite entender e descrever os tipos de conhecimentos que um docente necessita para uma eficiente integração e planejamento de atividades didáticas com NTICs. O presente trabalho relata esta adaptação, integração e utilização realizada durante o ano letivo de 2013 para 6 turmas da disciplina de Física do 2º ano do Ensino Médio da Escola Estadual de Educação Básica Profa. Maria Garcia Pessi (EEEMGP), para cerca de 160 estudantes.",
    "Palavras-chave": [
        "Experimentação remota",
        "dispositivos móveis",
        "educação básica",
        "Ambiente Virtual de Aprendizagem"
    ],
    "Introdução": "O relatório NMC Horizon Report: Edição K-12 20131 desenvolvido pelo NMC (The New Media Consortium), entidade focada em discutir novas tendências de mídia, comunicação e educação, que reúne empresas e instituições como a Universidade de Harvard, por exemplo, traz as principais tendências do mundo educacional para os próximos anos. O documento aponta as tecnologias emergentes para a educação básica ao longo de três horizontes de adoção que indicam prazos possíveis para a sua entrada em uso geral no ensino, aprendizagem e investigação criativa. Na perspectiva de curto prazo, em torno de doze meses, são destacadas a computação em nuvem e a aprendizagem móvel. Para a segunda perspectiva de adoção, em torno de dois ou três anos, espera-se o amplo crescimento de análise de aprendizagem e conteúdos abertos. Na perspectiva de longo prazo, em torno de quatro ou cinco anos, estão as impressões em 3D e laboratórios virtuais e remotos (Johnson, 2013). A aprendizagem móvel tem potencial para se tornar uma parte integral dos processos de ensino e de aprendizagem na educação fundamental e média, pois é cada vez mais comum os alunos terem e usarem dispositivos portáteis. Com interfaces de toque e de fácil interação, os tablets e os smartphones se constituem em portas para o ensino, aprendizagem, colaboração e produtividade contínua estimuladas pela Internet. O uso de telefones móveis cresce rapidamente. Segundo o portal Teleco2, com base em dados publicados pelo IDC (International Data Corporation), no segundo trimestre de 2013 foram embarcados 237,9 milhões smartphones no mundo, superando em 42,3% o mesmo período em 2012. Ainda segundo dados da IDC o mercado de smartphones no Brasil alcançou a venda de 13,7 milhões de unidades nos dois primeiros trimestres de 2013, aproximando-se da quantidade total vendida em 2012 que alcançou 16 milhões de unidades. Com estes resultados, as vendas de smartphones superaram as de celulares tradicionais pela primeira vez no Brasil, representando 54% da base (Idc, 2013). Ainda de acordo com o estudo divulgado pela IDC Worldwide Quarterly Tablet Tracker em 28 de maio de 2013 as compras de tablet devem crescer 58,7% em 2013 alcançando 229,3 milhões de unidades em relação ao número de 144,5 milhões de unidades do ano de 2012. De acordo com o estudo do IDC as compras globais de tablets devem superar os números de notebooks e netbooks neste ano e dos PCs em geral em 2015. Em relação ao Brasil foram embarcados no segundo trimestre de 2013 1,9 milhões de unidades que somados aos 1,3 milhões do primeiro trimestre totalizam 3,2 milhões de unidades nos seis primeiros meses de 2013, igualando o número vendido em 2012 que também alcançou 3,2 milhões. Estes números comprovam o alto grau de difusão e penetração destas tecnologias e colocam-nas como fortes candidatas para programas de 'aprendizagem móvel'. Também as atitudes sociais tornam as tecnologias móveis facilitadoras e poderão se constituir em importante fator de sucesso no seu uso no processo de ensino-aprendizagem, pois, são dispositivos utilizados cotidianamente e, portanto mais fáceis de serem incorporados, uma vez que seu uso é familiar. Apesar dos facilitadores e das possibilidades nelas contidas o uso dos dispositivos móveis no ensino e na aprendizagem, no Brasil, ainda está restrito a iniciativas que se encontram em níveis iniciais de desenvolvimento. Estudo efetuado pela UNESCO publicado em 2012 (Unesco, 2012) identificou 21 iniciativas de 'aprendizagem móvel' na América Latina que estão relacionadas ao apoio prestado aos docentes e a pedagogia em sala de aulas ou fora dela, e segundo a publicação 'apesar de haver consultado especialistas brasileiros e haver realizado extensas buscas na Internet' os pesquisadores não encontraram projetos relevantes no Brasil. Em parte isto se explica devido ao fato que a maioria dos programas existentes são de projetos pilotos impulsionados por organizações sem fins lucrativos ou universidades e que são endereçados tipicamente a pequenos grupos e focalizadas em necessidades particulares ou locais e que carecem de visibilidade. Este projeto compreende a iniciativa de disponibilizar experimentos para acesso remoto como alternativa à falta de laboratórios das escolas de Educação Básica utilizando dispositivos móveis como tablets e smartphones. Durante o período de estudo foram adaptadas e implementadas técnicas baseadas nos recursos das NTICs aplicadas à ambientes educacionais. Também foram integrados diversos recursos do Ambiente Virtual de Aprendizagem (AVA) Moodle para disponibilização do material didático das disciplinas, acesso aos experimentos remotos e outros objetos de aprendizagem.",
    "Conclusão": "Neste tópico são apontadas as conclusões da pesquisa realizada até o presente momento. Busca-se mostrar respostas às questões em estudo a fim de atender as intenções propostas. A permanente evolução tecnológica alerta-nos para uma realidade que não deve ser encarada de uma forma passiva, mas sim de uma forma ativa e empreendedora, na qual deverá prevalecer a constante procura pela melhoria. A aplicação de novas tecnologias na área do ensino e da aprendizagem constituem um exemplo concreto que realça as necessidades anteriores (sensibilização, formação, atualização), em especial na procura de novas soluções educativas que satisfaçam alunos, professores, instituições de ensino e a sociedade em geral, num momento em que se assiste à massificação do acesso ao ensino, ao alargamento da escolaridade obrigatória e ao aparecimento de novos paradigmas da educação. A MRE (Mobile Remote Experimentation) resulta das características e conceitos associados da m-Learning e da Experimentação Remota, e visa a criação de aplicações informáticas que possibilitem a realização de experiências laboratoriais à distância, com instrumentação real e através de dispositivos móveis. A MRE tem potencial para complementar as funcionalidades já existentes dos ambientes de e-Learning, fornecendo aos alunos a possibilidade de realizarem experiências laboratoriais idênticas às existentes num laboratório convencional a partir de dispositivos móveis. Os dispositivos móveis cada vez mais baratos e simples de usar, possuem muitas das ferramentas encontradas num PC (acesso à Internet, processamento de texto, recursos de câmera e mídias, entre outras) e evidenciam novas possibilidades e oportunidades para alargar o âmbito do ensino visando incentivar e facilitar o acesso ao conhecimento. Estes recursos também podem incentivar a crescente mobilidade, facultando o acesso aos conteúdos pedagógicos, promovendo a colaboração a distância, a qualquer hora e sem qualquer restrição geográfica considerando a constante expansão e atualização das redes móveis (Wireless). É necessário haver um cuidado maior desde as séries iniciais, uma preocupação que visa o melhor preparo profissional, pois não basta apenas a alta tecnologia nas universidades se a base do ensino ainda é estabelecida fracamente. No entanto, além de toda a tecnologia, é difícil imaginar a substituição do professor, afinal ainda é crucial valorizar o papel do professor que, como intermediador, permanece numa função chave dentro do ensino e é neste que deve receber ainda mais investimento. Pois as tecnologias por si só não são capazes de avançar o ensino, mas a didática do professor sim tem poder de alcançar os estudantes, sendo estas num modelo adequado servem como ferramentas facilitadoras. E diante da análise dos dados das escolas que compõem o cenário da educação brasileira, assim como de outros países do MERCOSUL, o presente projeto demonstrou que é possível disponibilizar alternativas eficientes de experimentação através de laboratórios remotos e ainda atingir com facilidade os estudantes por meio dos dispositivos móveis, disponibilizando um ambiente virtual de aprendizagem voltado à construção do conhecimento de fácil implementação e difusão. É na própria vivência que o conteúdo toma a sua proporção de utilidade, apontando meramente para uma ampliação da visão sistêmica, o depósito de informações passa a obter sentido, mas o real propósito é que o estudante tenha a oportunidade de escolha proporcionada. Um projeto semelhante, baseado nestas experiências da implantação na EEEMGP, será realizado para a Escola Básica Jardim das Avenidas (CAIC) para alunos de ciência na 8ª série do Ensino Fundamental. Os primeiros treinamentos foram realizados e a perspectiva é que a partir do 1º semestre de 2014 sejam realizadas aulas com experimentos de acesso remoto. As primeiras dificuldades encontradas foram a inexperiência dos professores e certo receio na adaptação, apesar do auxílio de um bolsista dedicado ao projeto e de um técnico da própria escola."
}